{
    "aggregateRating": {
        "reviewCount": 46,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-16",
            "description": "NOTE:  My review is specifically for the little store \"Golden Design\".  According to my receipt, the store number (booth number) is #573 574.\n\nNice little place to visit, Pakistani woman who owns/runs the place is very nice and friendly to talk to.\n\nStore has all kinds of little ins and outs for your everyday use - from lotto tickets to even little snacks and home supplies.\n\nFor helpfulness and friendliness alone, I have to give this little store 5 stars!",
            "author": "Johnny A."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2019-01-30",
            "description": "A great place to visit if you like to save money.  Most of the vendors here will negotiate with you on price but not all of them will, keep that in mind. \n\nIt's super important that you bring cash because not all vendors accept cards. Make sure you bring enough cash because you will definitely find some gems here. \n\nThey do have an ATM but it's not always dependable, sometimes it's broken down or out of cash. \n\n\nThis place is a lot like a gigantic garage sale, except you have to pay an admission fee to enter. \n\n\nIn general the fee is $2 for adults on weekends but fees varies depending on date and age. \n\nFree parking is also available. I definitely recommend checking this place out at least once when you have some free time on your hands. \n\nAddress:\nSwap O Rama\n4350 West 129th Street\nAlsip, Illinois 60803\n708-344-7300",
            "author": "Stacy K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-08-18",
            "description": "The sign states they close at 4pm. Doors close at 330p.\nHowever, most of the outside vendors were already gone.  There were still lots of vendors inside though.\n\nI didnt find anything to purchase, just wondered around. Seems like people may have come earlier in the day. I did find a booth that was filled with items fo your pets. Tons of things to clean, deodorize and dress them up! Niceeee!!!\n\nIt was a decent trip.",
            "author": "Anaya H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-28",
            "description": "Anything you want can be found in this place. It's a one stop shop for just about everything. New, used, vintage and everything in between.",
            "author": "Patrick J."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-11-26",
            "description": "Sellers beware. Horrible place to sell. 27.00 for a spot no customer traffic. Then to add insult to injury they want additional 3.00 for plugging in a extension cord into an outlet. Better off selling at a garage sale in warm seasons.",
            "author": "Sean M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-02-03",
            "description": "This place is ghetto and gross.  People with their pants hanging down and their ass hanging out; too tarded to know they look stupid.  We didn't make it past the parking lot.  If you like gross, ghetto people, this is your place.",
            "author": "Kendra S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-01-29",
            "description": "Well, If you need a 1000 power tools and a 1000 tube socks! You are in heaven. Truly the inside is shady and the outside vendors have ...well..STUFF! Most have have been thrown on a table just because they have too much crap.You really need to dig and find what the hell you want. IT'S HERE.",
            "author": "John U."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-12-23",
            "description": "As a vendor this place is definitely not vendor friendly. Management has different rules and policies depending on the mood of the day. The swap opens at 7am to customers but most vendors aren't admitting to after 7:15am on a good day. The Manager Albert is a total but who tries to bully people with threatening overtures. Most of the employees are nice except for one named Louie who will say one thing and do another. Although they have multiple instances of theft they try to pressure you into leaving your items for them to protect. I wouldn't recommend this market if you have other opportunities. Wolff's Flea Market although only open from April-October on Sundays only omission much larger and definitely vendor friendly.",
            "author": "Kike T."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-01-05",
            "description": "I mean really what can I say? Its an outdoor flea market and over the years I think its become quite ghetto and not at all in a good way. I mean you will get bargains of course, but you also have the rif raf that comes in to buy \"cheap\" and this sometimes is not a good thing. Especially in one of the corridors where you have the ghetto wear, and cheap knock off brands of things they insist are \"real\" but those of us who \"know\" will understand that this is a lie. \n\nA few years ago it was fun to come in and check out, but over the years I think that people are now selling whatever they find in alleys. If you want to find things for your car like say a sterio, then go to the outside area and you will find it. If you want to find real (Macy's style) colognes, of course you will find them here too, but at a little bit of a savings. But of course be aware that many of the items are cheap knock offs so don't be fooled. \n\nWhat I do like about the Swap is that if you have things that are harder to find, you can find it here. Such as: you need a remote control for your car key chain because you accidently stepped on yours while running away from the cops, well for less then $30, you can get an instant replacement here. Seriously. \n\nIf you need a cheap haircut from a man who barely understands your language, you can get that here too. I like that fact that he knows his craft, so speaking the language is no big deal. (Insert funny face here winking).....\n\nSo for $2 for the entrance fee, you can find a lot of things here, but hey at times you just have to be daring and try something new out, seriously.",
            "author": "Damian P."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-08-27",
            "description": "EXTREMELY PISSED as a Foreign male was RUDE AS HELL to me today here stating that they close at 330 when website says 4pm!! I said I need to get one thing, he said, \" I don't give a shit what you need!! We are closed and you are not going in!\" I stated that website says 4pm and again he was RUDE tone of voice \"I don't care what website says\". He was not rude to men who came behind me. I frequent this Swap-O-Rama and have developed friendships with vendors here. This is the first time I have encountered this ASSHOLE!!",
            "author": "Danielle P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-02-07",
            "description": "Always enjoy going to Swap-O-Rama there are so many cool things there and most of the time the prices are really good. I bought two really cute purses and was very pleased with them. I am sure everyone can find something they would be interested in there. I'm reading the comments from some of these people and really can't understand why they went, in the first place, what did the except it to be like. It's not a store, it's a \"flea market\" and that's why they call it a flea market and not a store. Get over yourself people, and go to Kohl's and buy what you want, don't go to a flea market if you are expecting to get store type stuff. I enjoyed it, and will return.",
            "author": "Debbi C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-06-25",
            "description": "I almost feel like they should be paying us to get in the doors. However, 2 bucks is not bad for people watching and some mental memories down memory lane. I saw a pair of lime green LA Gears. \n\nA nice couple at a gas station offered to show us the way, so we followed them to the Swap O Rama. \n\nThis place is quite large. Indoor and outdoor vendors. \n\nJust about everything imaginable. Some things a bit scary, but still fun to walk through and look at what people are selling.\n\nA lot of the vendors are very sweet and friendly and look to be enjoying themselves selling their treasures from yester years.\n\nNothing I wanted. J found a few old school toys.\n\n\nI recommend going to the bathroom before hand. I didn't dare. Eek!",
            "author": "Amy R."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2013-04-07",
            "description": "Ghetto, and not fabulous.   I hadn't been here in several years and went with a friend on Saturday.  She wanted to check it out, because she was considering getting a booth here to sell some goods.   Ummmm.....hell to the no!\n\nThe place is scary.   A lot of the inside stuff was hoochie - from lingerie, bras, panties, club clothes, sunglasses.....and several booths selling mattresses.  I really don't think I want my new mattress from the flea market.\n\nThe outside part is more of a garage sale - with people selling stuff from their car.  There were more mattresses outside, bikes, tools, socks, and lots of produce.   \n\nI did manage to score some D&G light blue for $20, from a guy in his car.  Probably stolen, but it was unopened and looked legit.  \n\nProbably won't be back.  $2 to get in and parking is free.",
            "author": "Jeannie A."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-08-08",
            "description": "I figured we would go here for a cheap saturday morning activity. It costs $2 for adults, $1 for seniors and kids under 12 are free. Once we got in, we were disgusted! The amount of stolen merchendise is crazy!!! Bikes, power tools, hand tools, lawn mowers etc. It seems impossible for one man to have a trunk full of the same tools. Then you have your 3 or 4 sock tables, fake purses, fake otterbox cases and a shady eye doctor! That is right, you can trust your sight to a man giving eye exams for 15 bucks at a flea market. We did like the people selling garage sale items and the delicious fruit and veggie stands. You can get the fruits and veggies for pennies on the dollar. Make sure to go here if you enjoy people watching and hand washing :)",
            "author": "Vicky K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-04-13",
            "description": "I enjoy walking the outside of the swap meet.  I find very good deals compared to what I see at Walmart & other retail stores. \n\nI can buy gifts for everyone in my family.  I like to plan ahead & get gr8 deals in advance.  I simply store them in the closet with a named sticky note.  \n\nI bought some deodorant 2 for 5 & some clear packing tape (4 when I mail x-mas pkgs in winter)  2 bucks (3.99 at Menards).   Oh - superglue .50 cents I kid you not. \n\nWe bought some grapes and blueberries for 1.50 ea much cheaper than even food-4-less or Aldis.  My honey got a bundle of socks lol a very good deal on 10 pair for 10 bucks and another 6 pair for 6 bucks.\n\nThe kids got a few necklaces from a vendor that sells lockets for 2 bucks & they come with kickin charms that the kids can switch out. I got  a (brand new) cute purse & a mickey mouse tote for 5 dollars ea, then the girls picked out some cool bracelets for 1 dollar  each - I'm not kidding, even if it lasts for the summer it was worth 1 dollar to make them so happy.  I bought 2 sarongs (bikini covers) the girls need for poolside this summer - they were 5 each, found them  sunglasses for 2 dollars ea came with soft draw string case & cleaning cloths lol - wow- it was crazy this lady has great deals but she's not there every weekend so if you don't go regularly you may not catch her.  She also gave my girls a free necklace each from the movie FROZEN, that was nice but that happened earlier I didn't know it was the same lady until later.  (The kids were running around on their own when that happened.) She was so very nice and appreciative when I bought from her it really stuck with me, in my heart & when the kids told me that was the same lady it made sense.\n\nI bought a few gifts for the younger boys from a lady that sells ninja like toy sets and cool custom jeweled baseball caps and from a guy that sells video games & comic books & comic video books.  I don't really know the name I think it maybe Anime lol lol.  I'm a bit outdated in that area.\n\nI saw a few peeps selling some junker kind of stuff, but very few and separate from the main sellers way in the back.  \n\nA lot of  tools & bikes & tables w chairs & comforters & kitchen appliances - very good new and used stuff.  99% of the outside sellers only take cash so be prepared in case you see something you really like.  \n\nAs for bargaining I didn't have to do much of that when most prices were already rock bottom lol.  However, I did haggle on a big stove pot but I didn't get it for my price - that's ok tho, it was a little bigger than the one I was originally going to buy and I thought if I got it for the same price well ok then lol.  But I couldn't so I bought the smaller one and that one will do the trick.\n\nOverall It was a great experience.  Good time, good exercise, fun for the girls and super gr8 deals.  We would all go back in a heartbeat!  I have been to other flea markets and this one is THE BEST.",
            "author": "Jeanette H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-06-18",
            "description": "If you're looking for cheap sunglasses, random odds and ends or crates of fruit on the cheap, this place has it.  You may have to wade through some stalls selling just junk, but it's a fun weekend morning walk.  They charge $2 entrance fee, but you can find some good deals on random things like bike chains or sunglasses or a crate of mangos.  It's a flea market, so keep that in mind when you set expectations.  Also, they don't accept credit cards, so bring your cash.",
            "author": "Monique B."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2011-11-06",
            "description": "I used to love this place... I would take my kids here and let them pick out toys or something of the sort. I went there today with my husband in search of a couple things. I left there disgusted to say the least.\n\nWe walked around after we found what we were looking for to see if we missed any booths. As we were walking, I noticed quite a few people standing at this booth. They sold DVD's, hats, CD's etc. I look to see what has got their attention and to my disbelief they are watching a dog fighting DVD. I immediately gt sick to my stomach and tell my husband that I want to leave. \n\nI am very disappointed that Sawp-O-Rama has these types of people in thier establishment. I'm pretty sure that the people that run it know whats going on. They have \"security\" walking around all the time. Needless to say I WILL NOT be back.",
            "author": "Janelle M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-11-02",
            "description": "What happened to the flea markets of old, when you could buy decent stuff at prices that didn't have you digging through the lint at the bottom of your pocket?\n\nCame down here thinking just MAYBE this was better than that scrap heap up in Rosemont.  NOT.  Pretty much exactly the same except smaller and half indoors.  Junk dealers trying to get retail + for used garbage they trash pick or buy bottom shelf at garage sales, trinket dealers peddling their wares from China and Taiwan, and guys selling things that MUST be stolen (where else does one get vans full of power tools?).  Where are the cops?\n\nWe went for hand tools, and pretty much everything is much cheaper online even on eBay.  Even new, vs their used, in many cases.   We got a few OK deals on a few tools from ONE GUY but 98% was overpriced and/or complete crap. \n\nI don't get it.  I guess these people just like to pack their jalopies at 3AM and shlep down here, unpack, set up, twiddle their thumbs all day waiting for suckers dumb enough to bite (and they are FEW), pack up and drive home.  Guess they have nothing else to do.  \n\nI give it 1 extra star since we did find one guy who was willing to sell us something under retail.",
            "author": "Jay W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-07",
            "description": "What do you say about a place that's named for a parasitic wingless insect that feeds off the blood of animals?  Well, for one thing, I'm sure there are no fleas in the Alsip Swap-O-Rama.  I know for a fact that there are some ripe smelling people here too, but if you can get past the name and the smelly people, there are great deals to be had in here!  And as with all flea markets, bartering is key.  Lie if you need to.\n\n\"How much for this(holding up item in question)?\"\n\n\"$30\"\n\n\"What?!  I got this for $15 here last week.  Psshh, #swerve\"\n\n\"ok ok ok.(throws item onto table)  $15.\"\n\n\"$15? sweet.\"\n\nThey have a ton of stuff at the Swap-O-Rama.  Some things are legit, others not so legit.  One tip.  Don't buy anything here on impulse.  Walk around and check out all the vendors that have what you're seeking and see who can give you the best price, because that price will fluctuate widely from vendor to vendor.  And still, even when you get to that lowest priced vendor, get them to lower the price.  \n\nIf you walk in, you absolutely have to walk out with something.  It costs $2 to get in here on the weekend and a mere 50 cents on Wednesdays, the caveat on Wednesdays being that there are only outdoor vendors so the selection is mucho lowered.  \n\nYou came to the swap meet.  What could you possible buy here?  Let's see....weed whackers, foamy toilet seats, toilets(barf), all kinds of knives batons pepper sprays and various other self defense items, stepping and line dance DVDs.  Yeah buddy, I'm talking R. Kelly \"Step in the Name of Love\" and The Casper Slide in the form of a mix tape movie for your anti-boredom defense.  If you need accessories for your electronic devices such as cords batteries, Otterboxes or Lifeproof Cases you can probably find it here.  Sports memorabilia, slogan T shirts, snapbacks, quinceanera dresses, shea butter and cocoa butter as well as all manner of skin products, really old video games, those all-in-one consoles loaded with 250 terrible Nintendo games, leather galore.  If you ride a motorcycle, they probably have something for you.  Chaps(assless of course), jackets, helmets, tassles whatever.  Need to stock up on surgical and dental instruments?  They got that too.  I'm really just showing you the tip of the iceberg, this place is ginormous and filled wall to wall with EVERYTHING.  They even have food, \nit's called Snak-O-Rama.  You think I'm kidding?  I'm not.  Snak-O-Rama what.\n\nSo come out to the Swap-O-Rama and bargain your way to some awesome deals.  I got my Lifeproof case here for $15.  Or you can buy it at Best Buy for $80.  Your choice.",
            "author": "Keith R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-10-31",
            "description": "My first time here, on a specific mission to buy a dirt-cheap used children's bike for parts. The trip was a success, i found one for $10! Admission is $2, so I guess in total I spent $12, but the cost of entry was worth the experience.\n\nThis place is enormous and crazy. I didn't sample any of the food, but I did manage to walk past EVERY stall in the place while on my quest. You could probably find just about anything there. There's a lot of clothing, hats, stereo equipment, belts, wallets, cheap toys, socks, cleaning supplies, used tools, and \"natural\" remedies. One vendor had a bunch of cheap and terrible paintings in good old ornate frames. I will be back with those in mind on another trip.",
            "author": "Ben H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-03-22",
            "description": "This place was awesome. So many different vendors and things being sold. The place gets very packed and crowded, so definately try to remember how you got in and out, easy to get lost in there.  I definately went there and spent more than what i wanted to, bought things i had no plans of buying, but it was all worth it.",
            "author": "K R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-08-30",
            "description": "This location is really good ,  I don't have time to explore frequently but definitely stop by  if I am around",
            "author": "Marcus G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-04-20",
            "description": "Does anyone sell real New Era hats there?  I have to buy bulk for all the kids at a charity event and they are liking the Superheros, Gamers, etc.\nThe last guy tried to sell me some not so real hats, but that's to be expected it is the SwapORama!  It's the same stuff over and over so don't stress if you missed those socks the first time around, you can make up your mind half way through or at the end because you'll see socks everywhere. Well it's worth a trip if you like that down under dirty dealing stuff.  But in the meantime I'll be checking elsewhere to continue to supply the New ERA Hats.",
            "author": "Natalie M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-07-30",
            "description": "I used to always come to come to Swap-o-Rama when I was younger and I would say I hadn't been there in at least 5 years or so.  It's changed a lot since the good old days.  You can still find some decent stuff, and some of the same old vendors are there, but it's a lot of weird clothing and ghetto accessories now.  I can't believe how many vendors there are for women's underwear....I mean really?!? If there was one thing I would never want to buy from a flea market it'd be undies.  Anyway, it's still a pretty huge flea market, and they have outdoor vendors in the summer. It only costs $2 to get in and you can kill a couple hours on a boring Sat or Sun morning browsing around.",
            "author": "Chris L."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-10-01",
            "description": "Over the years this place has gone downhill.  It still smells like people that haven't bathed in weeks wearing laundry in the same condition, mixed with a melted plastic/fried food smell, but it still smells better than most Marshall's stores.\nYou can still find a great selection of stolen car stereos, knockoff S&W pocket knives that sell for the same price as the real thing, and \"fresh\" fruit.\n\nWhat was disappointing was number of people selling the exact same damn stuff!  There must have been at least 8 Shea Butter salespeople there.  Just someone standing in a stall with buckets of shea butter.   The exact same bucket, same brand, just different people selling it all throughout.  If you've been to Tijuana, you'll know what I'm talking about.\n\nLuckily, the entertainment is free!  I got to see security break up a fight, and someone walk up to an \"incense salesman\" ask for devil's lettuce, and receive something in a bag that was under the counter.  There were also signs everywhere with the phone number for flea market security saying to call them instead of the police!\n\nThe inside is mainly people selling brand new stuff at not so great prices.  The outside is people selling stuff they probably found in someone's garbage, at prices that reflect it.  Overall, I'd come back on a day when I have nothing better to do, but those days don't come up all that often anymore.",
            "author": "Jason A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-07",
            "description": "It's the weekend, and you want to get out of the house...what's a good thing to do that only costs $2? Going to the Alsip Swap-O-Rama of course! And today was my first encounter of this flea market.  Man, I had no idea how big this place is! I've gone to other flea markets that cost more than this, and were a fraction of this size.  They had pretty much everything you can think of.  Tons of clothing, jewelry, bras/panties, incense, CD's/DVD's, socks, socks, and more socks, perfume, rims, speakers....new stuff, used stuff, old stuff.  You can get an airbrushed t-shirt, get your eyes checked, and get a haircut all under the same roof! \n\nAll n'all, I would recommend this is a place worth checking out...! Make sure though that you go on a pretty nice day, because then all the vendors are there!!",
            "author": "Alanna K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-04-16",
            "description": "Bootleg compilation CD's, sweat socks, perfume, incense, beautiful 14K gold jewelry, shea butter, luggage, cleaning and personal hygiene products, ghetto photo \"studios\", rims, speakers, chicks with attitudes, dudes with NO game (some with), black market babies, kidneys and more for unbeatable prices. \n\nA great way to spend a few bucks AND a Saturday afternoon.",
            "author": "Kara K."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-11-16",
            "description": "Don't go on a Wednesday, you will be lonely.  Their bootleg movies are crap, too.",
            "author": "Megan D."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2008-09-23",
            "description": "This place is hilarious. It smells like old socks, plastic and fried meat. \n\nYou can buy anything from the elusive old sock, to car stereos, to fake Louis Vuitton bags. (The vendors would never admit to you that they are fake tho.) \n\nPeople run amuck for the savings!! Its like a circus...just go and check it out for a good laugh.",
            "author": "Becki S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2011-09-08",
            "description": "Supporting Swap-O-Rama is supporting crime - this place is infested with stolen goods and the sleazebags that sell them.  Looking for your stolen bike?  Check this place out.  Make sure you have your police report and receipt, then call 911 immediately.  Keep an eye on your bike until the officer arrives, and take back whats yours.  This place needs to be shut down.",
            "author": "Laura C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-04-10",
            "description": "I have a secret love for this place. You can easily make this an all day outing here. If you can tolerate a massive crowd then come on by. This place is massive and there really is a good deal of ground to cover if you want to check out all the vendors.\n\nFor the most part you can get pretty good deals here but I would still suggest that you shop around inside this place before you make your purchase as some of these vendors here really are NOT selling things for that great of a price. Feel free to haggle also. \n\nI would NOT suggest going here in the middle of summer. The heat inside this building can get deathly hot. They do charge a small cover to enter but it is only a couple of bucks. This is the granddaddy of all flea markets.",
            "author": "Dave S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2013-05-21",
            "description": "I found my stolen bike here!! never shop here! this place supports thieifs. if you have anything stolen, check this place out. the f****r was selling my bike for $35 when I bought it new for $2000!!! bring your police report, and make sure you have an officer with you!! lets make this flea market shut down!!! oh,, did I mention... FAKE ITEMS ALSO BEING SOLD!!! I read online and it specifically states that the vendors can't sell fake items.... what are the vendors doing???..... SELLING FAKE ITEMS!!!! the management staff is so fucking lazy they don't know what the vendors even sell..... such a pathetic place.",
            "author": "James K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-10-01",
            "description": "There is so much stuff here, I mean seriously so much. Way more than the Maxwell Street Market that I would hit up every so often. If you want a fantasy knife or sword they have them. I would be wary of engaging in battle with one, but hey you never know when you will need that dragon dagger.\n\nHonestly though, I got brand name cleaning supplies, a hammer, some scented oils and various other things for my house for under 25 bucks. I mean this wouldn't happen at a regular store. \n\nIt cost $1.00 and is every Wednesday, Saturday, and Sunday. This place is pretty big and is definitely an all day event. I was getting hungry and was ready to leave as my friend continued to debate whether or not to buy a knife and/or sword that will never be used. Ok fine..I bought a knife as well. So yea they do have different concession stands with corn, pizza, polish sausage, etc.. but I didn't try any of it.\n\nThere were a ton of people here and we even got there pretty earlier. All I know is I swear I saw like 20 million pairs of socks here, so if you are looking to stock up on socks for the winter you better hit this place up.",
            "author": "Nico M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-05-28",
            "description": "Why beat around the bush, when you can buy illegal goods BEHIND the bush. Yea, I'm not sure what that means, but Swap-O-Rama has long been the super flea market for me! \n\nHave you ever needed a butane lighter realistically fashioned like a gun? SWAP-O-RAMA'S GOTCHA COVERED!\n\nYou want to paint the baby's room, but this new fangled eggshell just doesn't cover as well as that vintage lead of your youth?\nSWAP-O-RAMA'S GOTCHA COVERED!\n\nShe wants you to propose? Of course you can't afford a diamond, but you CAN afford to use this \"ring\" as a trust test, a real engagement maker or breaker? \nYES! SWAP-O-RAMA'S GOTCHA COVERED!\n\nLove cheap fashion knockoffs? But this whole illegal sweatshop worker thing gettin' in the way of your deals!?\nSWAP-O-RAMA'S GOTCHA COVERED!\n\nSeriously...a cash only circus of anyone who wants to set up a table and sell. There are so many people here, there is no way they can govern trades. \n\nOpen, Wednesday, Saturday and Sunday 7am-4pm.",
            "author": "Robin W."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-06-20",
            "description": "You'll want to take two showers after you leave here.This place draws a very funky crowd in which the majority of shoppers have left their manners at home as they nearly bump into you as you walk through this maze of vendors selling things you think you need. It smells there too. A combination of grease, body odor, incense and who knows what else. It's a lot of walking. The weekends are always jam packed with people.I wouldn't recommend going there in the heat of summer. They sell everything you can think of....socks...cowboy boots....fruit...tools....plants....toys....t-shirts that read 'black girls rock'....klackers (those toys in the 70's with the big marbles on strings)....old vinyl albums...cheap \"high fashion\" sunglasses...car stereo speakers....dvd's...and a whole array of tacky things to furnish your home with. If you're looking for true antiques, you'll be disappointed. Collectibles?...maybe. Most of the stuff (at least on the inside) is new items, not second hand. Did I mention the funky crowd there?",
            "author": "J J."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-04-11",
            "description": "When I met my fiance and he told me he lived in Alsip, I was like huh? Where's Alsip. He replied with \"Swap-O-Rama.\" I was immediately intrigued, remembering the old commercials but having never been. \n\nGoing there was an experience. Good? Bad? Hard to say. Definitely unique. The sheer variety of products/stolen goods under one roof is baffling. Most stuff is fake/old/almost broken or very cheaply made. Also, there are a lot of socks. I didn't buy anything, not even the \"Skarpie\" markers. But it was fun for a couple hours of cheap entertainment and is one of the best places to people watch.",
            "author": "Allison L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-09-08",
            "description": "As for flea markets, this is the freakin' bomb. There's a certain leverage I have to impart here on giving 5 stars. It's a flea market. If you don't know what a flea market is, then you've never been to one. Because if you've been to one, you know EXACTLY what a flea market is like. How it smells. How it sounds. How it looks. What is sold there. The people that go there, the people who sell there. It's an amazing phenomenon still thriving in today's society which is to say the least - awesome. This is the kind of place you go to waste time and money on things you don't need and things you never thought you'd need until you saw them in bulk or for dirt cheap. Bring some hand sanitizer and wear a good pair of shoes because this is the real deal, folks. Thanks.",
            "author": "Junie M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2013-05-01",
            "description": "Well, It's not what it use to be. I used to go their when I was young. I remember table and table of things I wish my mother would be. Lot of homemade treats. Well I went their today, with my daughter 30 years later. Wow it has change, and not in a good way. All I saw was trash, junk. Things I would not want, evenly if it was free.",
            "author": "Tracy R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-10-31",
            "description": "I like swap-o-rama because of Dr. Gaeta in space 308-309.  He is an eye doctor that offers affordable eye care.  He has everything there, the equipment and really nice frames to choose from.  I have gotten my glasses there for a couple of years now and I have not had any problems with them.  My glasses were really really affordable.",
            "author": "angie p."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-05-21",
            "description": "I got my computer fixed here for really cheap and they did an awesome job!! I had taken it to everyone I could think of and gotten quoted hundreds of dollars but these guys got the job done for far less. I think the spot number is 170-171. You guys rock!!",
            "author": "Nora R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-03-18",
            "description": "It's a great thing to do on a lazy sunday.  They do take credit cards, but I would urge you to pay cash...if you pay with cash they don't charge tax.  There are so many good deals here it's hard not to buy things.  There is a guy here that sells pretty raw looking shea butter straight from ghana.  There is a stand for everything.  Farmer's market type things, dvds, jewlery, weapons, sunglasses, record players, etc.  I'm pretty sure I even saw a kayak for sale.   It's a wonderfully shady endeavor.",
            "author": "NeeraJamie K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-08-07",
            "description": "Alsip flea market was a good place to shop before but not now,they charged$2 per person that is why me and my family do not go there any more. There are lot of empty spots no vendor.  I talked to the vendors they were telling me since they charged $2.00 not too many   customers coming to the market.  Another reason  wall mart opened close to the market,most of the alsip market go to the there for free plus airconditioned what a deal. It look this will fade away soon if management do not do something.",
            "author": "shalla R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-03-28",
            "description": "This is what I imagine when I think of flea markets. Compared to the Lake street Swap-o-Rama , this is the grand daddy of them all. The main sales floor is ok , not really that impressive. Where this place really shines is the rear corridor , that's where it gets really exciting/scary. I guess in the front , they pay a bit more attention to less than legal goods (pirated dvds and xbox games, found cell phones , fake designer clothes), in the rear it's a whole different story. You can find faux perfumes , fake designer sunglasses and computer modders. You can smell the lead paint on the cheap import knockoff toys. My favorite part of this place is the rear lot , that's where you find the retiree or weekend warrior sitting in his car or van and selling stuff out of his trunk. It's definitely funky here , but if you give it a chance , you might find something cool. Last time I bought a churro , a laser pen, a ninja star and an original 1977 star wars stormtrooper figure .",
            "author": "Renato P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-09-23",
            "description": "As far as flea markets go, it's pretty good. I found a unique bamboo plant here a couple of years ago  - so all in all it was cool to check out.",
            "author": "Laura S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2009-05-07",
            "description": "A lot of the products on the inside are priced at almost retail, the real deals are outside, where people are really trying to get rid of personal things from their garage, basement, etc.  As far as flea markets go, it's so-so.  Watch out because they have a lot of cars broken into.",
            "author": "Jeffery A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-06-01",
            "description": "Having been born and raised in Chicago, unfortunately this is only my third time going here!  This is what I imagine when I think of flea markets. This is a huge place with tons of items to choose from. We traveled down the aisles and to the front..  The outdoor area is so-so.  They basically have stuff that they brought from home that they are trying to sell.  But we decided to hit the very back of the place.  That is where I purchased MY FIRST Coach bag.  Luckily, I know what a REAL one entails.  I got it for $40 and purchased a Gucci for my daughter for $40 as well.  We even got the dust covers for the bags.  You can definitely spot the knock-off bags, etc., in the place.  But real items can be found...I would assume they've been \"found\"...some way, some how, if you get my meaning.  To top the day off, I got my eyebrows arched (much needed) for $8!  Talk about variety!  The place is crowded, hot, but fun!  It only costs a $1 to get in and free for kids under 7.  My grandson is 3, so that suited me just fine!  A nice way to spend a Sunday.",
            "author": "Regina S."
        }
    ],
    "priceRange": "$",
    "name": "Alsip Swap-O-Rama Flea Market",
    "address": {
        "addressLocality": "Alsip",
        "addressRegion": "IL",
        "streetAddress": "4350 W 129th St",
        "postalCode": "60803",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/VHZD-syTZl8BTe6-pBfYkQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17083447300"
}