{
    "aggregateRating": {
        "reviewCount": 61,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-11-10",
            "description": "I am Puerto Rican and I absolutely love to shop at this store. Their products are so authentic to our culture. When my mom, dad and I make sofrito or pasteles we always get out produce from here. It's such a nice place to shop at. The store is clean and well stocked and prices are good.",
            "author": "Vivian H."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-12-19",
            "description": "It's great to have a local produce store  that celebrates culture. I will say the produce store selections  gives a healthy competition to other stores around. \n\nBut the competition is lacking in the customer service department. The team at the register appeared to lack respect for the elders /customers. \n\nMy mother, is a sweet elderly lady that barely speaks or complains. She has come home in tears on how the staff at the grocery store has treated her. Going to the supermarket was one of my her favorite tasks to do all until she encountered Armitage Produce staff.  The \"girl\" at the register was snarky and rude when checking out my mother. It's happened in multiple occasions this past year with different staff that work the register.\n\n**Please note my mother has been going to this market for over 10 years.\n\nThe store is such a poor representation of the culture and what a good service should be. I ask the owner publicly to evaluate and measure his team's performance.  At the end of the day the team is a representation of the company/ Owner. A more comprehensive  hiring systems need to be in place in order to weed out unscrupulous employees. This will elevate the stores integrity. \n\nI will be following up with a formal complaint.",
            "author": "Dinah R."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-10-28",
            "description": "This is my second review of this  store. I previously stated how my last trip into  this store I was followed outside and asked to look into my purse because  they've had a lot of thief's. I felt embarrassed, singled out  because  I was the only African american person  in the store at the time mind you I walked in with at least  12 other people caucasian and Hispanic not 1 person leaving was asked to have their bags searched.  After a \"heart felt\" response from the store to my last Yelp review I decided to give them another shot true their selection of merchandise is amazing  so I figured instead of walking 25+ minutes to Tony's  I'd go to my local corner store less than 10 minutes away... big mistake  as most people in the city I now take reusable bags into stores for shopping I loaded up my granny cart I was approached mid aisles  in a crowded store after being in there less than 5 minutes  and  asked to look into my cart did the stuff in my cart come from their store yes I just  put it in I explained  what happened previously and said  I felt personally singled out  again only African American person in the store at the time  I purposefully didn't bring a purse this time  because I didn't want a \"problem \" I'm a 40 year old professional woman by no means do i look \"suspicious \" so again the only reason I can see I was followed again in this store is because of my race I will never go into this store again I will urge others  to do the same.  if you still patronize just open your eyes look around and see how others are being treated and tell me I'm mistaken. So off to Tony's  where I will continue to shop where I'm  treated respectfully like a human being.",
            "author": "Chaquita H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-11",
            "description": "All the ingredients in the pics I got from the market to make sofrito. I'm so hype and loved how the store also makes its own. The variety can't be beat it was just like being home in New York",
            "author": "Washieka T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-04",
            "description": "Absolutely amazingly stocked Puerto Rican supermarket. All the things you can't find and where else in Chicago, PACKED into a modestly sized grocery store that feels like it fell out of my very-PR hometown of NYC. If you're cooking out of Valldejuli's Cocina Criolla to rediscover your roots like I am, this probably the one place in the whole city where you'll find everything you need. Just perfect. \n\nThe non-Hispanic reviewers who give this place low stars because you can't buy generic American produce here--or who think this is a Mexican grocery--clearly have NO idea not only that this is a PR grocery, but that this is THE PR grocery. And it really is.",
            "author": "Michael Thaddeus D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-04-06",
            "description": "It's a very solid, small-scaled neighborhood grocery store, located on the northeast corner of Kimball and Armitage.  \n\nThis store specializes Puerto Rican essentials.  Do you like coffee?  Are you crazy about coffee?  Come and worship a wall full of Puerto Rican coffee brands.  Well, put God first...I didn't actually encourage you all to convert to a different religion.  \n\nHubby and I came over while waiting for our stuffed pizza to be cooked at the Art of Pizza in a nearby neighborhood.  It was our first time here.  We were pleasantly surprised by the quality of produce.  They were fresh, well-stocked, yet the prices were just fair in comparison to other local ethnic grocery stores.  \n\nTheir agricultural varieties weren't as eclectic as Cermak Produce, HarvesTime on Lawrence, and Caputo's on Harlem due to their much smaller real estate, but it certainly served the purpose in the Logan Square neighborhood.  \n\nWe purchased five (5) delicious apples, one (1) honeydew melon, two (2) giant pieces of grapefruit (not a bad price for $0.69/lb.), one (1) whole roll of red cabbage, two (2) grande-size avocados ($0.99 each...a seasonable price), and one (1) large bag of spinach.  Everything came to $11 and some change.  \n\nThe monitor at each register is large.  You can see your purchase itemized, with a matching price listed for each item on the right.  I thought it was a nice touch.  \n\nSometimes I pass by a random Jewel-Osco and watch an average American family load their van with lots of soda, chips, and boxed/processed food.  They cost more and create unnecessary burdens on your health.  After all, you are what you eat!  I'm preaching to the choir and asking you to switch your diet by switching to a different store to shop!  Embrace your local grocery stores, check out their produce sections, and be happy with the change you can make on your body.",
            "author": "Rosa J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-04-11",
            "description": "My family and i have been shopping here for years even after they had many changes of product, management, staff. The grocery store still the same, a bit over price for certain products but you can definitely find what you need in this store.",
            "author": "Natanais G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-11-02",
            "description": "I love the store for the Puerto Rican necessities for any day of the week. But don't buy their watermelon off-season because it's moldy and dry in the inside. They keep the same watermelon all winter long. Very disappointing to cut into one of these.",
            "author": "Jimmy F."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-11-30",
            "description": "This store doesn't have parsley THAT I COULD FIND. Apparently I'm blind.  \nI assumed that a store with the word \"produce\" in the title would definitely have a good selection of herbs. I am just horrible for finding fresh dill, parsley, mint, and basil without paying $$$ for them.\n\nIf you are one of those people who loves cilantro, then they got you covered!\n\nThanksgiving week, they were packed and the parking lot was a madhouse to maneuver around. Overall, it's kind of nice that parking is available, though not necessary.",
            "author": "Peggah G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-12-13",
            "description": "Perfect place to find all the Christmas Puerto Rico holiday food. It will be nice if the owner expands this location. Aisles are small but it has everything for a Boriqua.",
            "author": "Alexander M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-01-31",
            "description": "I live just down the block from here so I frequently pick up some produce and other basics. I'll say if you just forgot something at Jewel you and don't want to go all the way back this place is great but I don't advise trying to do all your shopping here. They have a great selection of produce and the types of things you need for cooking Mexican food and other things here and there but not everything.",
            "author": "Gail S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-12-17",
            "description": "This is the spot if you're Puerto Rican and you need any of the food you grew up with. They have all the ingredients, which is great, but then they also have pre-made things like sofrito (don't tell my mother) and pasteles (don't tell her either - she wanted to pack up hers and send them on dry ice from Florida). \n\nI've been to Cermak produce, but they don't have certain things. Here, I found it all: Discos para empanadas, jamon cocinado, giant pernils, fresh gandules. Todos. Get yourself over there next time you're going to whip up something that would make abuelita proud.",
            "author": "Heather M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-03-15",
            "description": "Right down the street from me! Huge perk. Great produce selection accompanied by fair prices. \nQuick check-out despite always being pretty busy. \nAll the employees are nice and helpful. \nYou can bring your own bags.",
            "author": "Kelly N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-10",
            "description": "I love this place! First impression when you walk in, it seems super small. It's not your typical grocery store. But when it comes to produce, they have it all. And cheap too! You can often find stuff marked off, such as strawberries for 99 cents and spinach bags for $2! Love it. I like their meat selection, straight forward. My wife and I make pozole every once in a while and we get meat here; keep the bone and and ask them to chop it up for you! While there are only a couple of registers, even when it is busy they move quick! Good alcohol selection, along with fresh bread. Oh yeah, I love the dancing Mexican music! This is my go to grocery store along with Tony's; I live smack dab in the middle of both. Armitage might not have your big brand staples, but maybe that is a good thing...?",
            "author": "Rahul G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-09-19",
            "description": "I come here from the far west suburbs to stock up on foods and brands I grew up with in Puerto Rico including salted bacalao, Lotus pineapple juice, Amapola corn flour, Sello Rojo rice, Ebro beans, Yaucono coffee, export soda crackers, aji dulce (sweet small peppers), and a variety of viandas (root vegetables.)  I'm like a kid in a candy store here! They even have pan sobao - don't know how to translate this but it tastes like a cross between French and sweet bread. The quesitos and guava pastelillos don't hold a candle to those in the Cuban/Spanish bakeries back in the Island but they are still a sweet treat.",
            "author": "M.C. V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-22",
            "description": "Love everything about this place. Frankly makes my day!!! Miguel and his butchers are always on point with fresh cuts of meat . Pocho and his guys alway make sure produce is  fresh . Naty is the head cashier , her crew is always pleasant and fast",
            "author": "Patty G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-08",
            "description": "I came in here last night to pick up some basics that I either can't get at the Co-op/Farmer's Market, or are too expensive there (ground beef for burritos, cooking spray, etc). I ended up getting so much stuff that I could barely get it all home on my bike - fortunately the trip is only about 4 blocks. \n\nPrices were spectacular, fruit clearly marked that it is from Mexico (for some reason I'd rather by Mexican fruit than American) and HUGE bags of beans/rice. \n\nThe gentleman attending the carts even offered to help me figure out how to get it all on my bike - and offered me a milk crate! Great store, I'll definitely be back. Though next time, I want to make a list of all the vegetables/fruits I don't recognize so I can look them up. \n\nOh! One more thing! They have frozen fruit pulp for smoothies! Yay!",
            "author": "Elisabeth C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-13",
            "description": "Just wanted to take a moment and say what a great little grocery this is. The produce is incredibly cheap and the employees are always so nice! Love having them down the street!",
            "author": "Greta S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-08-16",
            "description": "Good place to go for last minute pick ups. Reason being I can never find an ad to see the sales. So, business for me here is if I really need to get something I forgot else where! Sorry but the cart guy is awesome a lil wierd but awesome .",
            "author": "Lissette A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-15",
            "description": "decent prices! you do have to sift through to make sure you're getting something of quality, but other than that, i feel okay about the stuff i get here. it's a little cramped but not bad. i guess i like them because i've been looking for tomatillos and they had them for a good price here. also they are just down the street.\n\ni don't think the people liked me very much because i wasn't latino like everyone else shopping there. so they weren't so friendly, but not exactly rude either.\n\nanyway, the reason this place gets four star is because for the first time in my life, i found jarritos light - and in tamarind too! even though this will only fuel my soda addiction, i kind of still like that it's an option.",
            "author": "Kensey W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-03-04",
            "description": "Excellent.  The fruit is RIPE and ready to eat!  I love the music.  Staff is friendly and people seem to be in a good mood.  I'd go here just to hang out and munch on guava pastries, it's so much fun.  Filled my cart with fruits and goodies and spent less than $80.  You can't fill up a basket with anything at Whole Foods and spend less than $100.  The bananas here are RIPE.  The mangos are sweet and ripe.  They have quenepas.  Hello!  AWESOME, LOVE LOVE LOVE.",
            "author": "Bockri R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-09-24",
            "description": "Amazing prices, friendly staff that didn't give my hipster ass dirty looks for shopping there, clean store, FRESH produce that didn't have rot and gnats all over it, canned chocolate mole sauce, AND I bought an entire bag of groceries for only $25- including a dozen organic brown eggs.  I may never go to Whole Foods again (unless it's to buy fresh fish)...\n\nThe only negative was the mega narrow aisles but that's nothing to dock stars over!",
            "author": "A B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-02-09",
            "description": "This grocery showed some real class!  I went in near closing time to pick up some cravings for my pregnant wife.  Stupidly, I had forgotten my wallet at home.  With less than the bill in cash in my pocket, an employee paid with her own money to help out.  We will be paying her back and then some.  So thankful for young people like that in this world, and a very faithful customer from me.",
            "author": "Bo T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-27",
            "description": "Local grocery has a great selection of produce, not organic but fresh and beautiful. All the necessities, friendly helpful staff, and fresh hot tortillas 4 packs of 12 for a buck. Amazing!",
            "author": "Jennifer J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-04-19",
            "description": "Love this place. If you are from PR and miss the food this is where you want to get groceries. Compared to PR the prices are higher but since you're not there any more I think you should just get over it. They have pan sobao and everything! The produce is really good as well.",
            "author": "Janice F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-12",
            "description": "Thanks to this place and some PR  pals, I make amazing arroz con gandules, habichuelas largas, and pollo guisado. Love you, Armitage Produce!!",
            "author": "Charlotte J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-01-19",
            "description": "I just moved to a new place that's a 5 minute walk away from Armitage Produce and have gone there at least 5 times already.\n\nThey have a lot of interesting produce at good prices - I always find something a little different over there.  \n\nThere fresh bread and pastries are fantastic as well.\n\nOne drawback is a very limited frozen section.",
            "author": "Andrew L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-01-30",
            "description": "My only complaint, the ONLY thing keeping this review from having 5 stars, is that this place closes so early. \n\nThis place is right next to my boyfriend's place, so I come here a lot when he doesn't have anything to eat (which is often).\n\nThere are sections of this place where I feel at home, catered to as a latina; and then there are parts where I am flabbergasted and keenly aware that I am no borincana. Particularly in the fish area. It is interesting and fun, however; and I feel very comfortable here overall. \n\nPretty much everything I need for regular comfort food - tacos, stews, burgers, meatloafs, drinking binges. \n\nHighly recommended.",
            "author": "Britini R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-11-09",
            "description": "I love this little local grocer. Honestly, I really do. \n\nEvery time I need something quick for a party, I just walk about 3 blocks to Armitage Produce. This store is smaller than your average grocer, however it is very affordable, clean & everyone that works there is really friendly. If when I have a puzzled face, I get approached by a stock boy...\"You need to find something miss?\" Oh yes! I do! Thank you! \n\nThe prices are great for the produce. Way more affordable than Stanley's, plus the condition of the produce is much more fresh. I'll take one of those, and one of those please! \n\nOh yes, they also sell alcohol. Which is perfect! Well, for me anyway!",
            "author": "Jessie B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-05-27",
            "description": "Yesterday, I made my first trek to his bustling market at Armitage and Kimball, and was thankful I was with my Spanish-speaking friend, who helped me through the mysterious delights of Hispanic/Caribbean cuisine.  \n\nThe pluses of this store:  \n -Clean without swarming insects (it's the produce insects that keep me out of Stanley's).  \n\n - Prices that are overall reasonable, and choices that are fairly extensive for a market of this size.\n\n - Help that is responsive and seem eager to serve.\n\n - Responsiveness of management.  On reviewing other Yelp reviews, most of the valid concerns had been addressed, i.e. pizza rolls, Boca/Morningstar products. Produce appeared in fine shape on the day I visited, keeping in mind that neighborhood market shoppers are often frequent and even daily shoppers, and want their produce to be ready to eat when they buy it, rather than taking it home to ripen over the week. I would not hesitate to make a suggestion to management, knowing they would probably be concerned and consider changes.\n\nThe fact that it is located conveniently on a bus-stop street is in its favor as well.as the kept-up appearance of this obviously recently remodeled store.  I'll be back with a bigger bag and a harness for my sweet tooth ~ it is hard to resist those inviting sweets near the check-out.",
            "author": "maggie j."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-07-02",
            "description": "In my neighborhood there aren't any major grocery stores so Armitage Produce is my best bet. They have a little bit of everything in a small space which is pretty impressive. The staff is super conscientious of the store and keep it stocked and clean. You can do your general shopping here and they have a decent beer and wine selection! holy cow was I surprised by this. \n\nMy only complaints are: \n-i'd like to see some faux meat options like morningstar, boka, or even tofu\n-i'd like to see some nicer cheeses (besides basic mexican and american cheeses) \n-a lot of the brand name stuff (like cleaning supplies) are more expensive than regular grocery stores\n\nOverall I dig this place and feel fortunate to have this great business a block away.",
            "author": "Sonja B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-12-01",
            "description": "Puerto Rican's and Dominican's Rejoice!!!!!! \n\nGREEN Plantains \n\nGoya Products \n\nMerengue & Salsa over the P.A. system. \n\nJust about everything that I lack in KC is found in this place. We literally bought $60 in groceries before going back home. Malta India, sazon Goya, and fried plantains. Things you Chicago folks take for granted I stocked up on like i was hunkering down for 3 weeks of Katrina. \n\nPlantains were amazing. Yuca was also extremely fresh. The Churro's right before the cash registers were so dang good. If only I lived there I could have partaken in the meat market. \n\n\nIf you are a Caribe Latino, this is your spot. Period.",
            "author": "Kev L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-05-27",
            "description": "Say what?  There's a small but well stocked produce market 4 blocks from my house?  Thanks, Yelp.  I filled my little basket with a variety of fresh fruits and veggies for under $20.  10 limes for a buck?  F yeah.  Avocados much larger than my breasts?  Decidedly, yes.  Beautiful bunch of fresh asparagus?  Indeed.   An overabundance of green on my kitchen counter?  Check.  \n\nI will no longer venture all the way to Stanley's.  Although the smell near the meat department scares me a little bit, Armitage Produce is my new go-to neighborhood produce booty.",
            "author": "Robin H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-24",
            "description": "Excellent produce at low prices.\n\nArmitage Produce is my regular neighbourhood shop, as I'm only a few blocks away - it's the grocery I come to most often.  While it's small, they have all the essentials, always fresh, always at low prices.\n\nThe produce section takes up about two-fifths of the floor space.  They have a variety of fruits, vegetables and herbs, always fresh.  Against the north wall is a well-stocked meat counter, always busy, with beef, pork, chicken and shrimp.  For convenience, they sell chopped and spiced \"taco meat\", which can be taken home and fried in a matter of a minute or two to fill your tacos.\n\nIn addition to corn and flour tortillas, they also stock pita and (round) naan bread in several styles - very good for curry fans who don't want to go all the way to Devon for it.\n\nThe south half of the store has shelves full of packaged foods, mainly of Hispanic origin, with a wide range of beans, hot sauces, seasoning mixes, olive oil, flour, rice, drink mixes, fruit juices; and a dairy case with Mexican and American cheeses, milk, yoghurt.\n\nYou can walk out of Armitage Produce with as much food as you can carry for under $40.",
            "author": "Matt H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-15",
            "description": "Love it! They have culantro. Different from cilantro. Culantro is the authentic island ingredient to making sofrito. Very few stores carry this island staple. Love the whole Goya section,  green plantains and spices. Its very hard to find a Puerto Rican store. The little butcher shop in the back is sooo cute! I don't speak Spanish but everyone is friendly. The store is soo clean. I just hope this little store holds strong to its roots as the neighborhood slowly becomes yuppy. I wish I had the money to own this store!! If they ever want to give it away contact me!!! I would dance to the overhead salsa playing on the speakers all day. Celia Cruz!!!",
            "author": "Marie C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-07-17",
            "description": "Wow, I was pleasantly surprised!  \nUpon walking in the store, I was greeted with the delicious smell of vanilla, cinnamon and warm baked pastries and bread.\nThe fruit and vegetable selection was pretty great, though some produce (a few of the melons) was definitely too old for them to be attempting to sell.  They have some fresh meats -- But the fish looked a bit questionable.  \nA wall of assorted beans, coconut and papaya juices.\nAnd the craziest candies by the registers, all sorts.  Black and white coconut, mango, papaya, all pressed with sugars.  I was tempted, but nahh.  \nI will definitely stop in here for my produce as it's not far from my house at all, and they have a better selection than Danny's market on Western.",
            "author": "Julia H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-09-18",
            "description": "Great prices. Fantastic produce. Staff is friendly.",
            "author": "Stacey R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-03-21",
            "description": "Since I panned Stanley's in another review, I figured inquiring minds are asking \"Where DOES Liz get her produce?\" The answer - Armitage Produce. It's good quality, it's inexpensive and the fruit lasts beyond the drive home (which means it's already better than Stanleys!).\n\nThe chicken breasts are also very inexpensive, but you do have to go closer to the bacalao (stinky salted fish) than many people would be comfortable.\n\nAn added bonus - if you buy yourself all of your anti-oxidant filled fruits and veggies, you can totally spoil it by getting a delicious churro!! Several varieties are available by the check out.",
            "author": "Liz Q."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-04-01",
            "description": "GOYA GOYA GOYA!!!\nI speak very little Spanish.  I would liken myself to a mentally handicapped five year old with multiple speech impediments who happens to be high on glue.  All that having been said, I still have never had a problem shopping here.  \n\nGreat fresh produce!",
            "author": "Joe M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-21",
            "description": "+1 since the outside remodel.  They will be upgrading the inside soon, too.  Keep up the good work.\n\nA nice take out counter would be nice, you know.",
            "author": "Daniel R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-05-17",
            "description": "I used to be a Tanguis man, but their quality has been slipping. This store is much better, its only a few blocks away, and they have bacalao, epazote and sour oranges (it's a different type of orange). I would suggest shopping here for produce or hispanic canned goods if you live near Palmer Square (however the fruit tends to be kind of lackluster). Quick check out as well. Downside: Hard to get out the door (because the anti-cart theft devices) and the parking lot sucks for walkers/bikers.\n\nMore of a Caribbean focus than a Mexican one.",
            "author": "Andrew P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-12-03",
            "description": "They have a great selection of fruits, veggies, beer, and poultry. The staff is always willing to help. Everything is pretty reasonably cheap there, except maybe for the more well known brands, are up in price. They accept debit and credit cards. A parking lot and lottery machines!",
            "author": "Lynn L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-11-09",
            "description": "Although this place may not have all the fancy amenities that one is used to (spoiled Americans!).. their selection is bigger than you would think.. and their PRODUCE IS AMAZING! In a pinch or on a lazy Sunday morning when all i want is stuff to make a spinach omelet and coffee.... I'm blocks away from a great place. Although i wouldn't do ALL my grocery shopping here...I would be hard pressed and stupid not to come here at least for the basics....(did i say they were cheap too!)\n\noh.. and their selection of bulk spices are awesome!!",
            "author": "Christie A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-11-22",
            "description": "How can you beat a grocery store with fresh, local produce, cheap dry and canned goods,  and meringue blasting over the loudspeakers?  The space is a little tight and crowded but the staff and patrons are extremely friendly and helpful.  \n\nFor some reason I always get caught holding the awkwardly positioned front door open for an endless line of polite old ladies.  :)",
            "author": "Paul M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-03-19",
            "description": "Not much has changed since my last review, other than it seems as though the register ladies are upset with me when I go there. They're super happy and talking with the customers in line in front of me, then I come through and give a happy, \"Hello!,\" only to be greeted with silence and a stone-cold stare. WHAT HAVE I DONE TO DESERVE THISSSS?!?!?!?!\n\n:(((((((",
            "author": "Brian S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-05-20",
            "description": "GOOD THINGS ABOUT ARMITAGE PRODUCE:\n\n1. They have a lot of items that are \"hecho en Mexico\"\n\n2. They FINALLY sell beer there, which offers another level of convenience!! \n\n3. The meat is cheap and good. One friend in the neighborhood consistently complained about the smell looming in the meat section but I have no clue what he is talking about- it never smelled \"odd\" to me.  \n\n4. The selection of produce is good, the pantry items are good, and the dairy selection is good.  \n\n5. Prices are affordable. \n\nThis is a good place if you just want to pick up a few items for dinner, or some candy for later.  \n\n\n\nBAD THINGS ABOUT ARMITAGE PRODUCE:\n\n1.)  You'll have to spend at least $5 to use your debit card.\n\n2.) I don't like the Churros.  I've had better.\n\n3.) The layout of the store can be \"maze-like\" in some spots.\n\n4.)  I wouldn't try fitting a wheelchair thru the front door.",
            "author": "Fine Young Canibals Q."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-10",
            "description": "i can't possibly complain about armitage produce. it is the most convenient, cost-effective grocery shopping i have ever experienced in my life. the produce is fresh, the meat is high-quality, and the variety is excellent. the other night we fed five people (and two cats) on $20 - two chickens, a bunch of red potatoes, corn on the cob, asparagus, red and green onions. last night we did the same thing but also got burger makings and fixings and it only cost about another twenty dollars, and fed seven people and two cats. in this economy, i think i will have to rexamine my peapod addiction.\n\nedited after getting some new information, and also to add that i have a pot of braised pork bubbling on my stove, all ingredients from armitage produce, and it cost literally 1/3 of the price i've spent on making this meal in the past, from a variety of stores.",
            "author": "Andrea H."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2011-11-07",
            "description": "I will not return to this Fruteria again! I went in today with my Mom to get some items and one of the items was a can of soda for .75 cents. When I got to my car I rummaged thru bags looking for the soda and realized it was not there so my Mom went inside to ask if it stayed behind they said no and sent someone to my car to go thru bags then we went back into the store and they reviewed the security cameras, then they finally caved after 20 mins and gave us another soda but at this point I was so frustrated that I brought everything back into the store and asked for a full refund. I understand you have to be cautious but over a .75 soda it went a bit far especially when they reviewed the security cameras. The cashiers are also very rude and just last month I had to return some chicken because there was human hair in the bag it was in. I was told it wasn't their fault but the distributors, they did give me another chicken but after they had me wait 30 minutes. If I could have given them no stars I would have!",
            "author": "Happy A."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2009-06-01",
            "description": "Armitage produce and Cermak produce are about equal distance from my casa.  Who will win the key to my heart?  I think it will the award goes to Cermak.  Everything about this market is chaotic and bustling.  The layout is small and the aisles are very narrow.  The fruit and vegetables looked to be in quite the sad and rotting state.  Hey 20 limes for $1 is a great deal, but if they are all rotten what's the point?  I think the quality of produce is way better other places.  The only convenience is that you can buy your liquor here too.",
            "author": "Martha Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-09-09",
            "description": "Still the best coffee prices in town. Good selection of espresso. If you're not using sour oranges in your pork marinades you don't know what you're doing. This is the only place in town that has sour oranges. Good sale prices at the meat counter. Good fresh produce. Conch was 12.99lb last time I was there. Good price. Very cool place.",
            "author": "chris f."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2013-02-07",
            "description": "I don't shop at Armitage Produce often because the prices are kind of high and it's so small. But I decided to do some quick shopping on Superbowl Sunday to avoid busy stores. I parked across the street and before I crossed I was approached by two young girls who said they were hungry. I told her I didn't have any cash but she could come inside the store with me and I would buy her some food. I don't deny food to anyone who is hungry. So one girl went inside with me while the other waiting in front of the store with a small bag with a couple of  items in it. We proceded to do our shopping. She periodically stopped to ask if I could buy her juice and fruit and a package of meat. Of course I kept telling her to get whatever she needed. We get to the register and the owners son in law says to me \"is she with you\" I replied \"yes\" he says \"she did this with another customer\" (the small bag) and I said \"I don't care, shes with me\". Then the owner, his name is Louie came to the register and proceeded to yell at the girl and tell her he better never see her in the store again or he would call the police. And embarrassed her further by telling her she should go to the government for help. I was afraid he wasn't going to let me buy her the food. I felt so horrible that when we left from there I even gave the girls a ride home. I will NEVER in my life return to that store. And neither will any of my family. Louie is a rude disgusting person which anyone who knows him knows that he is mean and stingy. None of my family will ever go there and I will make sure all my friends hear this story. I will keep reposting on this page, my page, and on yelp. Being Greek doesn't make you a god and you should treat people with a little decency. God doesn't like ugly and one day you'll be judged on your evil ways.",
            "author": "Veronica I."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-16",
            "description": "I do really like this place.  I have rarely found a grocery store with ripe avocados (read: ready to eat that day... not rot on my counter because I'm waiting for them to ripen and then I forget about them). However,  I'd say I prefer to get my produce here when I am going to eat it that day.  Some of the things I've bought didn't have much of a shelf life. \n\nAll the prices are good, cheap.\n\nThey have a pretty decent selection.  I got shrimp here once, it was very fresh.  Made for good shrimp tacos.    The freshly made churros are delicious!  And there are always great vendors right outside or across the street.\n\nMy only complaint is that I wish they had more frozen food, but again, this is a fresh produce store.  Overall, very happy I live so close to Armitage Produce.",
            "author": "A L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-03-07",
            "description": "This is definitely one of the best markets around.  The produce is fresh and inexpensive, the have a great variety of canned goods, meats, dairy, etc. I also love the fact that the place is kind of like a discoteque, and everybody sort of dances with their shopping carts in the aisles to the salsa music which is constantly playing in the store.",
            "author": "Shazza B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-11-15",
            "description": "Tropical fruit so tasty you wonder why people eat candy.  The passion fruit is only for those who are ready for some serious sour tang!  And the fresh guayabas - like eating cheesecake! (Literally - but wait 'til they're soft, fool!)",
            "author": "Seth P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-02-07",
            "description": "I used to live 4 blocks from here. Now I will make the bus ride on occasion because it's worth it to get FRESH JUICY avocados, lemons and mangoes in the dead of winter. Lots of good Latin grocery staples. I highly recommend the Pastellilo guava pastries by the cash register- flaky, powdery and full of scrumptious guava jam.",
            "author": "Bianca J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-09-21",
            "description": "Armitage Produce is clean, organized and friendly.  The store is always well-stocked (find your Goya products as well as your blue box Kraft Mac-n-Cheese) and the produce is fresh and beautiful.  Prices are low and quality is high at this exceptional neighborhood grocery store.",
            "author": "Elizabeth B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-06-11",
            "description": "Killer produce, okay general selection, decent prices, but a weird layout with small aisles. I have heard questionable things about the meat dept.... And there is an odd smell of spoiled meat at times. Knowing some Spanish sure helps there. Not a bad place to grab a few things, but I can't shop full out there.",
            "author": "Paul S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2007-04-26",
            "description": "While Armitage Produce may have a decent produce selection at reasonable prices, many other products are well past their prime.  The first time I was there, I bought a frozen pizza and some pita bread in addition to some produce.  No complaints about the produce, but the pita bread tasted like grocery store instead of bread, and the *frozen* pizza was MOLDY! It looked as though it had been thawed and re-frozen, a HUGE no-no for frozen pizza (you can get very sick this way).  \n\nIn short, this place has okay produce, but my business is still going to Stanley's.",
            "author": "Amanda H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-09-07",
            "description": "i go here often like prices,good and fresh fruits,and vegetables. customer service is good,",
            "author": "Bertha S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-07-03",
            "description": "I live in Buck Town and have been shopping there  about 16 years now.   I tried Cermak foods, and Tony's because they had cheaper priced meats.  The saying is true, you get what you pay for.  I haven't been able to find better meats at reasonable prices anywhere else.  I like that I could find all the Hispanic products I need in one store from regular canned products to  fresh gandules and ajies dulces.    Most of all I like that even though the neighborhood around the store is changing, Armitage produce hasn't gone all organic and tofu on me.  I hope this doesn't change.",
            "author": "Yolanda C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-06-30",
            "description": "I love this small produce store as it has everything I need for produce only. I usually go in and pick up fruit or vegetables that's it as it's fresh and they always stocking when I come in. I also realized that I've saved a couple of dollars, see a mango is 89 cents here where at whole foods or dominick's its 2 for $3. If it's close to you or a quick stop it doesn't help to make the trip.",
            "author": "Iris F."
        }
    ],
    "priceRange": "$",
    "name": "Armitage Produce",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "3334 W Armitage Ave",
        "postalCode": "60647",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/rYwvJ53u4wmpUG-e35JsQA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17734868133"
}