{
    "aggregateRating": {
        "reviewCount": 8,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-16",
            "description": "I have went to this food market several times and I enjoyed the fresh produce.  There's free parking and you will see a lot of the same vendors when you go to this particular food market.  The food is fresh and the prices are good.  I usually go early in the morning as possible just because they can run out of food. However, I haven't had any problems with not getting what I wanted when I went to this food market except for once due to the vendor selling out of the bread. It's not super packed so you can still move around comfortably you will see families as well as people with their dogs walking around the food market as well. When I go I usually spend about $30 and I walk out with a decent amount of fresh produce.",
            "author": "Tasha R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-10",
            "description": "The Aurora's Farmers Market is opened on Saturdays (June through October) from 8:00 a.m. until 12 Noon.  This market takes place in the parking lot of the Aurora Metra train station.  There is plenty of free parking in the lot.  The market is not very big, but still fun to walk. There are local vendors selling donuts, coffee, cheese, soap, vegetables, fruit, seafood, etc.\n\nSample pricing:\nBroccoli - $3/lb\nBaby Eggplant - $5/lb\nSquash - $2/lb\nGarlic Scapes - $3/bunch\nBlueberries - $6/box\nBlackberries - $4/box\nGreen onions - $1/bunch\nMini donuts - $1/3 donuts\nEmpanada - $2\nSalmon burger - $5\n\n....| \\      _  , , , - - , ,  _  ,      \n.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    \n..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   \n'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )",
            "author": "Misty S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-04",
            "description": "Excellent produce..big selection of very fresh fruit and veggies. The people are all very nice and informative. They have a few stands with odds and ins such as dog collars or hair bows and hand made beaded jewelry that is really cute. Bought my daughters some hair bows(chicago bears and cubs themed..2 for $7) that they love and its very reasonable priced. The produce itself is kinda pricey but well worth it. We got some Michigan peaches that were to die for and the best broccoli ive ever had. Def would recommend.",
            "author": "Pam L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-07",
            "description": "Always a fun time from digging through tulip greens for bulbs to getting the most awesome apple cider and apple cider donuts, there are flowers and crafts and veggies and the most scrumptious empanadas you could ever eat. Don't forget your four legged friends, pick up some dog treats and listen to the wonderful live music as you stroll through the booths every Saturday morning...",
            "author": "Denise M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-18",
            "description": "I have been going to this market every week to every other week and have found some good deals. Some things are pricey, but pretty comparable with organic produce at the grocery store. I had some strawberries from the market and they almost didn't make it home. 100% worth the $5 for the box. My favorite stands are the Cheese People, Bread of Heaven and the central western most grocery stand. The one in the southwest corner is great as well. That woman is willing to make a deal which I appreciate. And her produce is from Sterling which is neat.",
            "author": "Caroline M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-09-16",
            "description": "The only reason I don't give it 5 stars is because its a bit pricey. The food stands are awesome, even though they are a bit pricey, its still worth going just to eat once or twice in a season. The bratwurst and Mexican food stands are great. They've got mini-donuts there as well if you're not carb and sugar watching like I am.",
            "author": "Marc F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-09-28",
            "description": "Dear AFM (as I've casually decided to dub you), \n\nThank you for your deliciousness this summer/fall. I am certainly going to miss you come October, when there's a lonely gap in the ATC parking lot on Saturday mornings. \n\nWhere oh where will I buy the most perfect grape tomatoes when I can't get them from Josie's booth?\n\nHow will I survive without the fresh pulled red onions of joy?\n\nWhat about Dad's Roadhouse salsas and sauces?\n\nThe sweet cakes and breads?\n\nThe hot sauce?!\n\nThe fresh tamales made at the Chinese food booth? (I'm serious, they rock!)\n\nMost importantly, where in the suburbs am I going to find the freshest and best cheese around, if I can't stop to see Rick at the cheese booth courtesy of The Cheese People of Beloit? Do I really gotta drive to Wisconsin? *Sad face* I can't choose the cheese that I'll miss the most, but I will list a few of my favorites:\n\nFresh Cheese Curds (Tuscan blend were phenom)\nSmoked String Cheese (tastes like camping!)\nGoat Gouda (Gouda is good-ah!)\nSweet Cream Pistachio Log (*drool*)\nAmish Baby Swiss (Oh, gawd I think I'm going to cry)\n\nI will impatiently await your return while biting my nails in anticipation. \n\nSeriously. \n\nNo, I really mean it.\n\nLove,\n\nMe.",
            "author": "Chrissy W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-08-08",
            "description": "This Farmers Market is located in the parking lot of the Aurora train station.  There are about a couple dozen tents with a variety of offerings including: produce, plants, baked goods, several food and product vendors, and a few crafters.  This is a pretty small farmers market, but worth dropping by for a break if you are in the area.  The overall visit should take 1/2 hour or less.\n\nFavorite Vendor = Dick's Donuts!  \nDick's Donuts sells mini donuts made fresh on the spot.  Top them off with sugar, cinnamon sugar, or powdered sugar.  They also offer smoothies.  The gentlemen are friendly and funny to interact with.\n\nTake a Closer Look = \"Veggie Fritter\" booth\nDon't let the sign fool you!  This vendor offers way more than fritters.  The homemade lemonade is what attracted us to the booth (refreshing in the hot weather!).  This sweet lady offers bbq on a stick and egg rolls. \n\nThere are a few picnic tables under tents for shade.  When we were there a lady was singing on a mic.  Washrooms available are in the nearby train station building.  Most people dropping by were families on bikes or couples with small dogs or people checking it out.",
            "author": "Ellen M."
        }
    ],
    "priceRange": "$$",
    "name": "Aurora Farmers Market Downtown",
    "address": {
        "addressLocality": "Aurora",
        "addressRegion": "IL",
        "streetAddress": "233 N Broadway\nAurora Transportation Ctr",
        "postalCode": "60505",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/cAR-2SRNDT_VX1SKab76pQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16302563400"
}