{
    "aggregateRating": {
        "reviewCount": 15,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-05-19",
            "description": "This is a curated Farmers Market. No Avon, no Tupperware, no crafts etc. There is intentionality in having an even variety of vendors selling local, sustainable, good food. There are also quirky events each week and live, low-key music. \n\nAlso has the best fresh roasted coffee anywhere.",
            "author": "Karl S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-23",
            "description": "Love the Saturday farmers market! We always find something delicious to eat, and love spending time listening to music while our son plays on the lawn. Lots of fresh fruits and veggies. Dog friendly! I just wish it would expand! It's one of the smallest farmers markets I've been to.",
            "author": "Brighid B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-06-27",
            "description": "I love the variety, but think we could still expand a little bit more. The live music is nice (but loud), the library gives away free books, the French nuns make some awesome organic baked goods, and that coffee is delicious! I wish there was more of the Open Sky Coffee Roasters around (saved the name on my phone so I would remember). The Colombian is their darkest blend, but like they said, it's still not very dark. Grinded and brewed right on the spot! Absolutely delicious! It's definitely work a walk or short drive over. I will definitely be back for more of the goodies, eggs, soaps and honey! The prices are decent. Take a look around at the different vendors and try to strike up a deal. :)",
            "author": "Katrina S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2015-08-15",
            "description": "Drove here today from Elmhurst because I've read all the good reviews.  Well I was very disappointed.  There were maaaaybe 10 tents and I would say half of those were not vegetables just other stuff.  I saw 4 tables with produce only.  I will not be returning to this farmers market.",
            "author": "Valerie D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-09-02",
            "description": "This Farmers Market is lively - the live band makes for good entertainment!  I didn't see the coffee vendor the Saturday I went, but maybe I missed it.  This one doesn't have as many flower bouquets as other Farmers Markets I've been to.\nI liked the pizza (gluten free) by the slice stand though.  They offer a good variety of produce and plenty of parking is always a plus.  A nice place to start your Saturday mornings.",
            "author": "Irene G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-29",
            "description": "We come here each Saturday so I guess you could say we're regulars. They've got a lot going on for a small town. \n\nWe normally purchase produce but they have a lot to choose from! Obvi it depends on what's in season but so far this year we've enjoyed...\n\nZucchini\nCherries\nBlueberries\nPeaches\nBaby potatoes\nBlackberries\nRaspberries\nStrawberries\nTomato\n\nPlus these things are awesome:\n\nFarm fresh eggs $4\nWhole chicken $20 (for beer can chicken on the grill, yes please)\nCheese curds\nPig ear for our puppy!\nBaked goods\nHomemade soaps\nFresh brewed coffee (brewed in front of you - plunger and all! YUM)\nCalzaffles (calzone waffles - what!)\nA garden club frequents once a month and gives out clippings",
            "author": "Jessica M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-14",
            "description": "This farmers market is great because it's not too pricey and it's low key.  They do have a band play usually which is great.  Also, during and right next to the farmers market on Saturday, September 26, 2015, Brookfield has it's Annual Fine Arts Festival from 9am-4pm in Kiwanis Park.  That's fantastic too...not too pricey and low key :)",
            "author": "Therese A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-12",
            "description": "I really enjoy the Brookfield Farmer's Market.\n\nNice variety of fruits and vegetables from local farms and farms from MI. You also have a variety of baked goods, deserts, sauces, and my favorite...toffee from Kory's Kandies...OMG it's so good. \n\nA fantastic addition this year has been the coffee vendor. A father/son team from Cicero comes by every Saturday with freshly roasted coffee. They even roast coffee on site, way cool. Buy a cup of freshly brewed coffee and peruse the vendor's offerings at the market.\n\nOnly thing missing this year is a vendor for meats and cheeses. Other than that it's a great way to spend a Saturday morning. Fun, fresh, and tasty.\n\nCheers!",
            "author": "Brett C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-09",
            "description": "Eggs, cheeses, honey, baked goods, hand made soaps, flowers, live music and of course wonderful fruits and vegetables, the Brookfield Farmers Market packs a ton into it's small and manageable space. It's walking distance from my home, and I can bring my dog, even though he is constantly trying to cozy up to the guy selling pig ears.",
            "author": "Wendy P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-22",
            "description": "Pretty small but great selection of local items! I usually go for the fresh produce and I was excited to see local farm fresh eggs! Love! You're paying more than if you went to your local store but supporting local famers and getting a more nutrient dense product is worth it to me. I'll be back for sure!",
            "author": "Erin L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-07",
            "description": "BEST Farmer's Market I've been to in the area.  Vendors are friendly, willing to tell you about their goods, ingredients, etc.  Wonderful coffee.  Eggs that words don't do justice to.  Best Kolackys!  Dreamed of them all winter long.  You can spend a few minutes picking up just what you need or spend longer with coffee and a lot of choices of things to eat there.  Picnic tables in the shade, dog friendly, engaging and educational.\n\nUpdated 5/13/15 as my previous review showed up in the \"not recommended\" area as the stars were missing...let me clarify...this is STILL my favorite Farmer's Market.  An addition has been from the library, giving away FREE books!  I love reading, free books along with all the other selections is just another reason this is the market I look forward to each year.",
            "author": "Jackie L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-25",
            "description": "Now this, this to me, is what a good farmers market should be.  Low key.  LOTS of produce.  Good prices.  I love the choices here.  I can always find some \"unsprayed\" produce and just love getting fresh picked red haven peaches every week!  My latest find here is Open Sky Coffee.  It is a small gig, run by a couple of guys ONLY at the farmer's market.  They roast the beans they bring the night before.  They make the coffee by pour over.  And they roast the beans oh so right.  Medium to light roasts means no bitter taste.  I love the selection.  I chose Nicaraguan, as I have a thing for Central American coffee.  I will be coming back for beans.  You can order what you want and he will roast fresh for you.  My other great find here was raw honey.  From hives right there in Brookfield.  Doesn't get more local than that for me!  I also found some good granola but was not able to find out more about it (nutritional info) as the woman was away from her booth and her step-son did not know.  To be discovered next week....",
            "author": "Kristin S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-16",
            "description": "With Riverside, LaGrange, etc. all in the area, I have to say that I'm surprised that Brookfield is the one offering a Farmer's Market on Saturday mornings, but having one within walking distance of my house has been awesome. Most weeks, as long as everyone shows up, all of the basic staples are covered (fruit, vegetables, breads, eggs, cheese, and meat) plus lots of extras and this year, consistently good entertainment. This is my third summer attending and I have gotten to know some of the vendors who are wonderful at explaining their products.  The Farmer's Market is seriously one of my favorite things about living in Brookfield!",
            "author": "bobbi n."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-08-12",
            "description": "I LOVE this Farmers Market! The best vegetables, fruits, baked goods, eggs, dog treats, flowers, etc.  It is smaller but I think it's a great selection and I have never been disappointed!",
            "author": "Cindy S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-09-10",
            "description": "It's nice to have a Saturday-morning farmers market right around the block from my house - this year, there are fruit and vegetable vendors from Illinois and Michigan farms, a few bakeries, and live music. (There's also regular representation by local community organizations like the Chamber of Commerce, library board, and garden club.)",
            "author": "Chris L."
        }
    ],
    "priceRange": "$$",
    "name": "Brookfield Farmers Market",
    "address": {
        "addressLocality": "Brookfield",
        "addressRegion": "IL",
        "streetAddress": "8820 Brookfield Ave",
        "postalCode": "60513",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/YWga1v2iNy3Ags59DZ-rXA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17082289530"
}