{
    "aggregateRating": {
        "reviewCount": 8,
        "@type": "AggregateRating",
        "ratingValue": 2.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-09-30",
            "description": "I have to write this review because there are so many unfair reviews for this market. I am a dog lover and have two of my own. I would never expect nor want to bring them to a farmers market, but that is just me. I am not leaving them in my hot car - I am leaving them at home for a little while I go shopping. This is a farmers market, not a dog park. There are also customers here who maybe don't like dogs or are allergic. \nYou may come across vendors who's produce doesn't look great or they charge too much. That review should be for that individual vendor not this market as a whole. Many of the same vendors also are at other farmers markets in the area. For those taking off stars because the prices are too expensive, these are the prices you will pay across Lake County. I agree. I have been at markets in Wisconsin that are much more reasonably priced, but this is what you get in Lake County, Illinois.\nOverall, this is a fine farmer's market with a good variety and selection of vendors. A couple of my favorites come here and having a Sunday market is convenient for me. Thank you Buffalo Grove.",
            "author": "Patoots S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-08-12",
            "description": "The most unfriendly farmers market I've ever been to. They dont allow dogs which is mind blowing since it is an outside market for crying out loud. We have a small dog about 7 pounds and we carry him in a doggie carrier most of the times. He was not allowed to enter the market. \nAs far as produce goes..the place looks good when you first get there but its actually quite small. I bought tomatoes, cucumbers and peaches. Tomatoes were overripped and peaches too sour. \nI will not be going back..do yourself a favor and go to Libertyville's Farmers Mark that's held on Thursday in downtown Libertyville. Way better selection of produce and friendlier atmosphere all together.",
            "author": "nati b."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-08-12",
            "description": "What the heck kind of farmer's market doesn't allow dogs? This kind. That should really tell you everything you need to know about it.",
            "author": "Aaron T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-22",
            "description": "The husband and I decided to venture out to the farmer's market yesterday their second week of being open for the season. They had all their usual vendors from fruit/veggie stands, meats, pet supplies, sweets, coffee, and other miscellaneous items from vendors. The moment we started pulling up to the farmer's market, I yelled out Toasty Cheese!! Yes, they were here for the first time I have seen at this event today. YAY!!!\n\nFirst stop was the pet supply vendor for some grain free treats for our pup. We purchase these treats on a frequent basis during farmer's market season. A very reasonable price of 5 dollars gives you three generous bags of different flavors and shapes of treats your fur baby will love!\n\nNext stop was Toasty Cheese food truck. How nice it was to not have to wait in a LONG line like at the food truck event in Schaumburg. I've been wanting to try their Hannah Banana dessert sandwich and although the item wasn't on the menu today the owner said he could make it for me. How nice was that?! The owner chatted with us and told us they may not do the food truck event again next month in Schaumburg due to the low turnout from the town of Schaumburg charging customers 5 dollars per person to just enter the event. We attend the Long Grove events for 5 dollars per person so it wouldn't be a problem for us to pay however it hits hard to the food truck business with lack of customers. My sandwich was served HOT and Fresh. This sandwich is deep fried filled with Nutella, banana, and marshmallow fluff. This sandwich was worth all the calories and other people at the event were coming up to me asking me what I was eating. A line was forming but nothing as crazy as the food truck event which was nice.\n\nWhile I was eating the Hannah Banana sandwich my husband went to purchase some veggies. He purchased red/green peppers for 3 for 2.00, green beans and broccoli were 2 for 5. A total of 7 dollars for all the veggies. Not a bad deal for the amount we got. \n\nWe'll be going back to the farmer's market soon especially with Toasty Cheese appearing here!",
            "author": "Melissa H."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2013-09-03",
            "description": "I want to like this farmer's market so much because it is close to me and easy to get to, but alas, I cannot. It's a fairly small market and it's lacking in produce stands. I get that Farmer's Markets are also a great place to sell other specialty items but the vegetables are the main thing I'm looking for. Some of the vegetables looked sad and wilted already and I couldn't believe the prices they were still charging for them.  \n\nI did buy some bratwurst from a meat vendor that was there and they had some good stuff available, but again it was pricey.  I understand that vendors need to charge more for their items but spending way more than I would at grocery store for the same items is a turn-off for me. Maybe I'm just spoiled because I used to visit farmers markets in Iowa (Iowa City and Dubuque) and both of those were quite spectacular with a wide array of options. \n\nThe best thing about this market was the fresh squeezed lemonade I bought.  Thankfully the vendor offers $2.50 lifetime refills so I can buy something when I visit again.",
            "author": "Alyssa K."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-07-22",
            "description": "I'm giving this 2 stars because apparently dogs aren't allowed into the market.\nHalf the reason I go to farmer's markets is because it's a place where my dog and I can socialize with other pet owners. Us pet-lovers are good people! \n\nIf you're not bothered by the dog thing, it's a nice-sized market with tons of parking.\n\nThis market had a good assortment of sellers, but you'd likely be able to catch them at a different farmer's market on another day. (I've actually seen many of the same sellers at the 2-3 markets I visit, so I'm really not making this up....)\n\nI probably won't be back, I have my dog in the car with me most weekends. I wouldn't want to leave her in a hot car.....",
            "author": "Marie S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-08-26",
            "description": "Wow!  I visited the BG Farmers' Market for the first time since the first season they were open this weekend, and boy was I impressed!\n\nThey have significantly grown in the number of vendors - and the produce!  All the produce!  We decided it would be best to do a lap to see what looked best and who had the best prices, and we ended up mixing/matching veggies from various locations (I will admit, the tomatoes looked better at some locations than others) and because my main squeeze came with me, I had more cash and more hands to buy more things!\n\nWe bought sweet corn, bell peppers and garlic from Geneva Lakes - 13 ears of sweet corn for $5.00 (or 50c a piece.  No brainer.)  This corn almost didn't even have to be cooked, it was so sweet and delicious.\n\nWe also got some great cheese from the Cheese People, and I can't wait to go back in two weeks (no market during BG days!) to pick up more.  A loaf of ciabatta from Katic breads that was devoured with the cheese within hours of getting home.  Beets from Horchers (picked the night before!) green beans and tomatoes from Madsen Farms.\n\nA few steaks for dinner from Farm Fresh Foodstuffs (they were out of skirt steaks, booooo) \n\nHUGE portabellos and delicious creminis, as well as pickled mushrooms from River Valley Ranch.\n\nI *think* that's everything.  I am a bit bummed that I waited so long to check this out, but you can bet I'll be a regular from now on - as long as we're living in the area!",
            "author": "Valerie D."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2013-07-15",
            "description": "I've been going to this market since its debut.  As much as I want to like this market, it's nothing more than mediocre produce and other products being sold in the middle of a parking lot.  I went yesterday (7/14/2013) and there was only one vendor selling vegetables, which I may add were over priced and wilted.  Green beans were about $2/lb. while one cucumber was close to a dollar.  There's a vendor who sells wonderful meats (chicken, beef and pork). While I love the quality of their meat, as I've purchased from them in past years, I can't convince myself to pay $25 for a whole fryer.  If you've been exposed to coastal farmers markets you're going to see a huge difference between the quality, selection and price versus what our local little midwestern market offers.  We have less quality for twice the price.",
            "author": "Princess D."
        }
    ],
    "priceRange": "$$",
    "name": "Buffalo Grove Farmers’ Market",
    "address": {
        "addressLocality": "Buffalo Grove",
        "addressRegion": "IL",
        "streetAddress": "951 McHenry Rd",
        "postalCode": "60090",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/6L7hJ8Sfrf6a7lNHccnAnA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18474592525"
}