{
    "aggregateRating": {
        "reviewCount": 23,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-17",
            "description": "This is a great little farmer's market. I have been meaning to come here for a while. \nEverything that we got here was superb. The cheese from the cheese vender was absolutely delicious. The fresh peaches from one of the the produce vendors were fresh and juicy. And the blueberry scones from one of the bakery vendors were some of the best scones I've ever had.\n\nWe only picked up a few things but I will definitely be stopping by here more often now. The prices are a bit high, but like someone else said on here, it is supply and demand. You are getting a lot of fresh and tasty goods in an area where a lot of people don't mind spending a little extra. They are fairly reasonable though.\n\nOverall, if you haven't been here, you should try it! Glad I finally found a nice farmer's market in Chicago.\n\nBy the way, the biggest produce vendor does accept credit cards which is nice.",
            "author": "Melinda C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-10-27",
            "description": "You need to make sure you go to this market early in the season. We went on the last day and the produce was not that great. A bit rotten honestly. But the pastries and cheeses were excellent. They have more to choose from early on in the season and I'm not going to give them a poor rating for something beyond their control. We'll definitely be back to check them out in the spring!",
            "author": "Brianna B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-02-01",
            "description": "Anticipated moving into Lakeview for some time, mainly for easy access to this Saturday market. However, I soon found out the difference between one of the city's farmers markets and this French market: choices. The number of vendors is disappointing as well as the variety of offerings. Possibly it's the space limitation? Big on charm but small on substance. \n\nI'll stick with the larger downtown and north side weekday markets.",
            "author": "steve k."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-09-28",
            "description": "This has gone on ever since I have been in Chicago, small but nicely \"curated\" with a well picked collection of desserts, vegetables, and other specialty items. However the most I have ever purchased is a scone or cookie, the prices on the produce always seemed a little higher than the better deals in The Corporations.  However I am in support of The Idea of these great little markets, they have so many good finds on average, and this one is an oasis in an otherwise bland concrete jungle of a neighborhood.",
            "author": "Brandon B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-08-17",
            "description": "We're there virtually weekly throughout the season. Produce is great; cheese is great; bakery is very good. We especially like the friendly folks from Klug Farms and the cheese vendor.",
            "author": "Bradley S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-05-28",
            "description": "This market is small and limited for Lakeview.\nThere only one flower vendor, no more than four vendors selling veggies,  four vendors selling baked goods and couple vendors selling jewelry.\n\nThe prices are a little higher than the other markets, however, the market is good if you need some fresh veggies or fruit if you don't have time to go to the Lincoln Park market on Armitage.\n\nThe aisle are narrow so not a good place to bring pets or strollers.",
            "author": "Ken O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-23",
            "description": "When I can't come here my house's produce severely suffers. Love the deals and people!!",
            "author": "Sara T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-27",
            "description": "This market, which is not actually a city-sponsored farmer's market is small but nice.\n\nThey have a bread guy that I really, really like.. He has some good stuff... Ciabatta, great pretzel rolls, etc.  Expect to pay, but it's good.\n\nThere's another guy who does bread only from whole wheat type stuff... \n\nThey usually have 3 or 4 produce vendors... one specializes more in fruit, another has Mirai corn and other stuff, another has a little bit of everything.  if you've never had mirai corn, go here and check it out!  \n\nThere's a lady selling baked goods, and an olive oil booth type guy. And a lady selling flowers...  And a cheese person (a bit lackluster though)\n\nUnlike city-sponsored markets, they also have a few people selling crafts. I never check those out, but maybe you'll find something you like.",
            "author": "Dane K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-05-14",
            "description": "Oh what a lovely place! Sadly I am not in Chicago that often to enjoy this market to it's fullest. As a matter of fact the first and only time I have gone most of the stores were not even open yet. BUT it was still a great expierence. \n\nIt is going on my list of places to stop each and everytime I find myself in Chicago!",
            "author": "Barbie M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-04-07",
            "description": "This market makes my Saturday mornings!  When I didn't have a job for a short time and was bored and just wanted to get out and enjoy this new city that I moved into, I stumbled across this market.  Now in Texas we have farmer's markets, but they're really just outdoor supermarkets (seriously, they're not so much fun).  \n\nI love the guys from the bakery in Geneva!  And YUM!!!  The pretzel bread there is a weakness of mine!  The last weekend of the market, I buy about 3 bags of that and freeze it for the winter to enjoy.  The produce I love b/c I find it to be more affordable and better quality than the stores.  It's not huge which I love b/c I see the same people all the time - just the neighborhood people.  And the I *have* to buy flowers every time I go which has never been me but now I have to have fresh flowers in the house every week.  \n\nThis is a great start to a Saturday morning, grab your reusable back, the dog and a coffee, and go out to shop with the locals!  There's nothing better and another one of the countless reasons I love Chicago!",
            "author": "Lindsay S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2006-06-22",
            "description": "Great baked goods, several farm stands, fresh flowers, and a changing assortment of other booths.  This is a small, neighborhood market, organized by a company that sets up farmers markets in Paris. I should be going here for the fresh fruits and vegetables -- you won't see strawberries like these at the supermarket! -- but it's really the pretzel bread and cheese loaf that get me out of bed on a Saturday morning. \n\nYou can find seasonal produce (we're in strawberry & rhubarb time right now), as well as a selection of staples (potatoes, onions, lettuces), and usually some specialty items.  Several stands sell their own jams and jellies, and a bee-keeper has been offering honey there lately, too.  \n\nThere are frequently stands with specialty food items, like barbecue sauce, olives, or cheeses.  In addition, you'll find a changing array of jewelry-sellers, local artists (got a real deal on a painting of the Illinois prairie last week, because it was raining and the artist wanted to make a sale -- that doesn't happen at Jewel!), and craftspeople.\n\nThe market is open from 8 a.m. to 2 p.m. and you can easily combine a trip here with breakfast at one of the many local brunch spots or coffee shops.",
            "author": "Maria S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-15",
            "description": "Great farmer's market with a unique selection of vendors. The big produce stand is great and accepts credit cards, but make sure to check out the bread folks (olive bread) and the cheese stand (string cheese and cheese curds), great stuff.",
            "author": "Bradford M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-06-17",
            "description": "I love this market too. Some of the original vendors are still there since it launched (3 yrs ago?) so it's really nice to see them year after year. The pretzel bread is amazing (seems to be lots of agreement on this). The produce is just picked, fresh and wonderful. I don't buy any vegies at grocery stores when the market is open. This  year, there's a yummy olive oil vendor and some jams and jellies. \n\nThe craft vendors don't take booths for the season but rotate, so you never know who will be there from week to week. The Nettelhorst School courtyard is definitely one of my \"go to\" Sat morning hangouts.",
            "author": "rickey g."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-06-17",
            "description": "OMG to cute to boot!  I love this little market and it completely made my Saturday morning!  All of the fresh breads, herbs, oils, veggies and fruits blend together to make some of the best smells in the city.  \n\nThis is my second market experience and I must say even though this one was smaller I fell in love with it right away!  Everyone is so friendly and helpful and the prices are define.  I know a lot of people say they've noticed a price increase in items because of the economy well not here!  \n\nI know I mentioned this is a smaller market.  Maybe 20-30 vendors as someone else mentioned but I spent nearly 45 minutes here wandering around and taking it all in.  I will definitely be back.  \n\nI'm from a smaller town and this little market reminds me of home!",
            "author": "Jackie P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-08",
            "description": "Love this local Farmer's Market and try to make a trip there every Saturday.  The produce is fresh and delish.\n\nLast summer, there was a vendor there selling beautiful Italian photographs.  Wish I would have gotten her card...any Yelpers have her info or website?",
            "author": "Kathy S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-05",
            "description": "Pros: Convenient location, fresh fruits and vegetables, competitive prices, satisfaction from buying fresh food at a local market.\nCons: Slightly small.\n\nI really like this small and sweet lil neighborhood market. Last Saturday was my first time here and I regret not going here earlier. The place is small so there are just 1-2 stalls per item. A bigger place would probably give more options. But nevertheless, the stalls that are present are pretty good. I bought my weekly quota of vegetables and fruits which were all very fresh. The prices are comparable to those at whole foods (which is where I usually shop), a couple of veggies seemed slightly higher but others were almost equally or even slightly lower priced. The peaches were wonderful, they were soft and juicy and worth every cent I spent on them(4$ for a box of abt 6-7 good sized peaches). I am surely going again for the remaining few weeks that are left before the onset of winter.",
            "author": "F M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-28",
            "description": "Fresh food, friendly vendors, and right by my apartment! Going to the Farmer's Market never ceases to amuse me. the flowers are lovely.",
            "author": "Shannon H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-26",
            "description": "What a cute lil farmers market! They had all I was looking for plus yummy looking pastries, pretty flowers and nice handcrafted jewlery and purses. I love that it's 2 blocks from my places and can't wait to enjoy it next summer, as sadly the season is drawing to a close.",
            "author": "Amie C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-03-30",
            "description": "Great find in East Lakeview!  Can't wait for them to start up again in a few weeks ... Last year they had Brussel Sprouts the size of your fist that were the best I've ever had!  And I can't say enough about those pretzel rolls  ... Ahhh, breakfast at Stella's, a little walk down to Melrose ... Great  way to spend a weekend morning!  Spring, hurry up and get here!",
            "author": "Kelly F."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-04-28",
            "description": "I went to this market today, hoping to find organic vegetables and be able to give my money to the local economy instead of big corporate conglomerates like Albertsons or Safeway. I asked one of the guys about some of the vegetables and how they are grown, and I was surprised to find out that they are grown conventionally (hot house and with pesticides). He didn't seem to know a lot about the vegetables and that the actual owners don't' come out to these farmers markets. So I asked if I could pay them a visit, and he told me they dont' take visitors. Is it because they don't want the public to see their own practices? Maybe their vegetables are no better than Jewel or Dominicks? I don't know. I also met a woman there who was dressed like she was amish, but after talking to the first guy, it made me wonder if it was a gimmick. If you're buying from farmers markets to support local farmers and get organic fresh produce, this is not the one to go to. They are slightly more expensive than the chain grocery stores, but it does not seem worth the cost.\n\nThey do have nice crafts there, that I would consider checking out though, I also personally dont' eat any dairy products, so I can't speak about the quality of those items, but I think your money would be better spent on another place's vegetables.",
            "author": "Brett C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-25",
            "description": "Cute and quaint.  They had some yummy fruits and veggies at affordable prices.  So glad to see this place is nearby.",
            "author": "Chris C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-09-03",
            "description": "This market is not that big but packs a lot of punch.",
            "author": "Jon C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-04",
            "description": "Best prices are at the end of the day when the farmers will negotiate on the prices. The fresh basil is priceless; it is so fragrant.",
            "author": "Sawyer L."
        }
    ],
    "priceRange": "$$",
    "name": "Chicago Nettelhorst French Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "3252 N Broadway St",
        "postalCode": "60657",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Sc9YGiq2gsxjLPgYkUQq8A/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13125750286"
}