{
    "aggregateRating": {
        "reviewCount": 21,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-15",
            "description": "I love arriving around 8-9am. They usually have a band and I like to sit down and watch them for a bit while enjoying some fresh juice from one of the vendors. The fruits and veggies are always nice and I grab a few tomatoes and grapes to last the week. I you can't beat the 10$ bouquet of flowers they are beautiful and last a good 1-2 weeks.",
            "author": "Stefanie C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-13",
            "description": "Check out the flowers at the VERY END (EAST SIDE) Also the italian bread pizza!!!! Mario has had a stand for years and sells out right away!!! DELICIOUS!!! The veggie stand across from the flowers....PERFECT. Don't buy at the very beginning walk all the way down!!! If you give this market less than 5 stars you haven't experienced it all.",
            "author": "Victoria O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-01",
            "description": "I like coming to this Farmer's Market first thing when it opens at 7 a.m. on Saturday mornings. There are some vendors with coffee and breakfast items to help get the day going but it is also not as crowded and then I get first pick of anything!\n\nThis isn't a huge market but it has enough vendors to choose from. I feel some prices are higher than Whole Foods can be sometimes which is hard for me to justify purchasing (A small box of Michigan cherries for $9, and no they're not organic). Other things are super cheap though like sweet corn 3 for $2. Fruits and veggies are obviously seasonal but I feel there is always a great selection.\n\nThey have a stand to get your knives sharpened and I always mean to head over there since a friend of mine gets her knives done once every summer. They also have stands with some crafts, flowers, etc. I like to look at these stands but try so very hard not to succumb to spur of the moment purchases.\n\nDefinitely a fan and I will continue to come back!",
            "author": "Ashley A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-08-04",
            "description": "If ever there was a place to be on a Saturday morning in Downers Grove, Illinois this is definitely it. Residents come out by the carload to check out the offerings a'plenty. Local farmers display their beautiful produce and there's all sorts of delicious pastries and food offerings as well. Plenty to choose from for a quick breakfast or a full meal as you fill your bags with produce for the week. It's a wonderful place to gather and sets the pace for your weekend with a slow stroll through the market. \n\nI'm still getting the hang of this community vibe as we're trying to spend more and more time in our newly adopted town. \n\nBut one thing that I think is worth noting is the prices. I understand the farmers are trying to make a living and it's great to support them, but you're going to pay 2-3 times what you would for produce at the supermarket. I nearly got farklempt when I saw a pint of blueberries for $6, sweet peppers for $3 each and tomatoes for $4. Ouch. \n\nIt's a lovely gathering, and if you've got the cash great. But those of us who try and manage a budget may need to look elsewhere to buy our goods.",
            "author": "Grant P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-19",
            "description": "Though I live in Naperville, I make the trek nearly every week-end to DG for their farmers market. Why? It's bigger, better and has a lot more variety when it comes to prepared stuff. You'll find great cheeses, olive oil and pickles, sausage, knife sharpening, nuns selling baked goods, beautiful flowers, as well as many vendors of produce, a lot of it from IL and MI. You really feel the seasons changing as the fruits change and corn moves along in favor of squashes. And my Saturday morning is not complete without my fresh lemonade and donuts ;) \n\nOverall, there's a great sense of community, and it's a good reason to get out on the week-end! Go support your local vendors and enjoy.",
            "author": "Shannon M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-05-26",
            "description": "This is probably where I will be every Saturday this summer. \n\nDowntown Downers Grove has so much to offer and this farmers market is a great addition. There are tons of stands with produce, arts and crafts, flowers, plants, on and on. There's definitely something for everyone. \n\nWe arrived around 10 and you could tell some stands had been picked over, especially the flowers. We plan to get there earlier next time in hopes of a better selection, and I can't wait to go back.",
            "author": "Amanda S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-29",
            "description": "We cannot wait until this farmers market opens every May (closes in mid-October)! With more than 70 vendors, it's full of fresh fresh fruits & vegetable from several farms, cheeses, pork, beef, chicken, sausages, eggs, breads, french pastries, olive oils, snacks, fresh flowers and folks selling crafts.\n\nWe love Jake's Country Meats. Get the smoked porked chops! I insist! You will thank me. I also recommend the bacon, the lake trout and the whitefish. Tell Nate I sent you!\n\nHankering for authentic French pastries, but can't afford a trip to France? You need only to stop by the St. Roger Abbey booth (of the sisters of Fraternité Notre-Dame) to quiet your craving. However, If your desire is for pain au chocolat you must arrive EARLY! These delights sell out quickly. I also highly recommend the almond galette. It's my personal favorite.\n\nOther products we buy: Yuppie Hill Poultry cage-free eggs and Hometown Sausage Kitchen French Country sausage. We LOVE the French Country sausage.\n\nMany vendors take credit.\n\nThe Downtown Downers Grove Market is jointly sponsored by the Indian Boundary YMCA and the Village of Downers Grove and is open every Saturday (mid-May to mid-Oct) from 7:00 a.m. to 12:30 p.m. It's l ocated at the Downers Grove Main Street train station, South Parking Lot off Burlington Ave. The Market moves to another downtown location during Grove Fest in late June. There's plenty of street, lot, and garage parking.",
            "author": "Deanna D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-09",
            "description": "This is a really good farmers market.\n\nLots of great vendors and offerings. My favorites are Staff of Life and Jake's Country Meats. Hormone free, anti biotic free, grass fed, all the good buzz words make for a great product. The kid slinging fresh squeezed lemonade rocks.\n\nProduce is abundant. They also have a cheese guy, a bread guy, spice mixes. Mostly all local stuff. Score!\n\nThe foodstuffs are on the outer aisles and the crafty stuff stands alone in the middle. \n\nLots of parking.",
            "author": "Julie O."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-09-15",
            "description": "Terrible \"farmer's market.\" I'm not sure how they get away calling it that. There was nothing more than a few stands selling boring art and photography of retirees.",
            "author": "Veronica D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-08-15",
            "description": "Definitely one of the best markets in the area! Knife sharpener, flowers, fruits, and veggies along with some craft items. There is a coffee place and a couple of places to buy breakfast if you care to eat and browse. The flowers I got here lasted over a week. The corn is delicious! Lots of the fruit and veggies are from around the Midwest so it's fresh, but it's not exactly cheap ($6 strawberries, $5 blueberries). Nevertheless, this is my \"go to\" farmers' market!",
            "author": "rachel w."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-08-31",
            "description": "I love farmer's Markets and this is one awesome farmer's Market! Much bigger than I thought it would be and I loved the breakfast sandwich stands and fresh lemonade stand. I was hoping there would be more flowers/plants but there were still a good variety. Great place to be on a Saturday morning!",
            "author": "Liz K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-06-15",
            "description": "I seriously love the DG Farmer's Market. It's by far one of my favorite places to go to pick up local art, organic fruits and veggies, grass-fed beef, and free range chicken.\n\nI absolutely adore the mini loaves of bread made at Staff of Life Bakery and Farms. Especially the Dilly Bread. So-freaking-good. That shit is like crack. Thinly sliced and toasted with a little butter....swooooon. \n\nJake's Country Meats is another must stop. Pasture raised, anti-biotic free pork is the name of their game. And flavor wise, it shows. They have some of the best bacon around. It's flat out amazing and comes in a variety of smoked flavors. Their honey ham or BBQ flavored pork sticks are to die for. They make a Slim Jim look like dog food. ((Yes, occasionally I think a SJ is fairly tasty)). And for you fish lovers they also sell frozen great lakes fish such as Whitefish, Lake Trout, Walleye, Perch, and Smoked Fish.\n\nThe DG Farmer's Market also has a great selection of fruits and veggies, products from local shops, homemade canned products ((BBQ sauce, salsa, apple sauce...)), local artists, fresh breads, fresh cheeses, and a plethora of other fantastic goods. \n\nA recommendation - get there early. The market is only open til 12:30 to 1:00ish, so for the best selection of goodies try not to arrive when they're shutting down. \n...and make sure to grab a dilly bread and pack of bacon on your way out!",
            "author": "Cristie F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-06-04",
            "description": "The Farmer's Market is as good as it gets. But, like most farmer's markets, many things are unnecessarily over-priced. \n\nHere are my favorites:\n\n1. Lemon Tree offers some really delicious breakfast. Bring an appetite\n2. The knife sharpening guy (who is not there every week) is very good but over-priced IMHO.\n3. The cheese guy has some really interesting and unique cheeses. But, they too are  a little pricey.\n\nI am not a cheapskate, but when I compare what I pay for knife sharpening, gourmet cheeses or fresh produce I know I am paying more. For me, it is sometimes worth it since it is convenient.",
            "author": "Dan R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-05",
            "description": "The DG Farmer's Market is one of the reasons I love living in DG so much. The prices may be higher than some grocery stores, but what you get is so much fresher and better for you. Some of my favorite items are Ari's flowers (12 gorgeous, supremely fresh long-stemmed roses for $18), the Cheese People (try the gouda with nettles--OMG so good!), and the fresh baked breads and pastries. Any of the produce vendors are good choices and their selections of fruits and veggies are incredible. Next, I want to try the meat vendor as I've heard great things.\n\nGo, enjoy some live music and buy some delicious goodies. It's a fantastic way to spend a Saturday morning!",
            "author": "M W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-08-31",
            "description": "What a beautiful farmer's market with a wide array of products!  The produce and flowers were beautiful.  There were food vendors and lots of interesting non-food spots.  I found plenty of easy parking available across the tracks.",
            "author": "Lori R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-09",
            "description": "I absolutely am in LOVE with this farmer's market.  Every Saturday I head here super early and gobble up plenty of fresh fruits and veggies to last me all week.\n\nI've gotten amazing strawberries, peaches, blueberries, raspberries, watermelon.... and everything is ripe, locally grown, and delicious.  The blueberries are some of the best I've ever had.  \n\nThere is every veggie imaginable, and it's been fun creating new meals out of all the local, fresh produce.  Plus, I can easily fill up a bag with about $7.00 worth of veggies.  Sweet, huh?\n\nAnd to those peeps who say \"it's overpriced blah blah blah\" .... Fine.  Leave the goodness for me.    Go to Wal-mart or Jewel and buy pesticide ridden, crappily imitated fruits and veggies that are shipped from three countries away.  Don't support farmers whose livelihood depends on their local neighbors.  Go ahead and keep on supporting factory farms that are ruining our environment... Ignorance is bliss.\n\nBut hey, I do understand some of the stuff is pricey.  But you DO get what you pay for.  I paid $5 for a carton of strawberries and they were the sweetest, ripest, yummiest berries... which we devoured in a day.  THAT GOOD.  Was it worth the money? Hell yes.  And next week I went back for more and they were already out of season.  (tear tear)  I moped for at least an hour.  And then bought ripe, wonderfully juicy peaches instead.  \n\nI love it.  It's in a wonderfully quaint area downtown, and there are coffee and tea shops all around- plus, the people watching is always a good time.  \n\nA fun way to start the weekend.  There are plenty of other stands to peruse- everything from  flowers, pies, and jewelry to meat and salsas and more. Definitely worth the stop at least once.",
            "author": "Stef F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-29",
            "description": "One of the better local farmer's markets. More crafts, arts, and food than most. If you like a farmer's market and live within 10 miles of this place, you should pick a weekend visit.",
            "author": "Pete R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-05-20",
            "description": "Nice selection but a bit pricey.ARRIVE EARLY,later in day its crowded.",
            "author": "Larry D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-05-13",
            "description": "Farmer's markets are fun and you do get to sample local vendor's product.  But seriously, do you really believe locally grown can provide produce in May?  The produce comes from the same wholesalers that deliver to Jewel, Mariano's and others.  Yes, they're fun and everything does taste better outside.  The only thing I believe is locally grown so early in summer are the berries.  Local fruit trees are still budding in May.  Really?!?",
            "author": "P F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-15",
            "description": "Farmers markets are my favorite place to shop for groceries.  Shopping feels less like a chore when I am outdoors enjoying the summer weather.  The DG market is my go-to market.  It is fairly large and has a good selection of items allowing me to get most of what I need for the week there.  The market has vendors selling vegetables, fruit, meat, eggs, cheese, bakery goods (from bread to pies to donuts), coffee, knife sharpening, flowers, crafts, and home items.   The vegetables are reasonably priced, especially if you shop what is in season.  The meat is more expensive than at the grocery store, but it is worth it to me to buy from local farms that raise happy cows, pigs, and chickens.  While I think the market is great, my wish list would include a farmer that sells a larger variety of chicken products, and also a veggie farmer that grows more unique vegetables.  I realize that this cannot be Green City Market and that I'm out in the 'burbs, but a girl can hope right?\n\nThe market can get crowded.  Make sure that you arrive with a positive attitude or the people bumping into you because they are looking at the booths and not paying attention to where they are going may become annoying.  \n\nMake plans to go next Saturday, and bring cash.  Leave your pup at home, dogs are not allowed in the market area.",
            "author": "Katie K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-02-28",
            "description": "I love the farmers market!  Really great selection and fair prices.  Plus we should all support our local growers whenever possible.  Check it out when you can!",
            "author": "Stacy S."
        }
    ],
    "priceRange": "$$",
    "name": "Downtown Downers Grove Market",
    "address": {
        "addressLocality": "Downers Grove",
        "addressRegion": "IL",
        "streetAddress": "711 59th St",
        "postalCode": "60516",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/bfHG3xps4qvc6G6KyidTtA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16309292435"
}