{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-29",
            "description": "First time I have ever purchased from him (Grayslake farmers market).  We grilled the cheddar bacon burger tonight and all I can say is \"Oh My Gosh!!!!\"  I'm done eating and still drooling. It was amazing. I'm going back for more next week!",
            "author": "Kathy D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-02-03",
            "description": "Local & organic meat.  Farmer Nicks offers beef, pork, chicken and farm fresh eggs.  Ask about availability in winter when there are no farmers markets.  Check him on Facebook too.",
            "author": "Stef M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-01-25",
            "description": "I'm very thankful to have local pastured meat available for my family.  We signed up for the winter CSA and every month we have been able to pick out what we wanted as long as it was in stock.  If I had any complaints it would be: difficult communication or customer service, ham slices are too fatty in my opinion and bacon was not tasty but I have not tried the flavored bacons.",
            "author": "Alisha M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-04-28",
            "description": "The meat we get from Farmer Nick's is insanely delicious.  We discovered him at our local farmer's market in Crystal Lake late in the season and we're anxiously waiting for the first weekend the market is open so we can stock up!  We took some of the brats we bought to a family cookout and everyone couldn't stop saying how good they were.",
            "author": "Dawn E."
        }
    ],
    "priceRange": "$$$",
    "name": "Farmer Nicks",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "",
        "postalCode": "60601",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Lh9Zz6td2ejeMKZAo4MCoA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18154515084"
}