{
    "aggregateRating": {
        "reviewCount": 13,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-06",
            "description": "Lisle is a fine little city. The French Market is fun. It features vendors hawking their wares ranging from fresh fruits, veggies, plants, flowers and other edibles such as donuts, gluten-free cookies and even hot dogs. \n\nAlso in the mix is a guy who sells very cool candles, memberships to various organizations, a blade sharpening service and other random purveyors of stuff and services. \n\nI like the atmosphere. Being outside on a sunny Saturday morning with my woman and my dog and having some random chats with strangers is fun. It's what we are supposed to do, right? Meet others, share a laugh and enjoy a moment in time together. \n\nI'm a fan. And if you give the French Market a go, you might enjoy yourself too. \n\nAs for the veggies, I can tell you that although they are higher priced than at the grocery store, the quality is exemplary. I've purchased sugar snap peas that were amazing, peaches and blueberries that were juicy and tasty, asparagus that rocked with crunchiness. So give it a go and see what you think.",
            "author": "Jim C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-07-13",
            "description": "I was excited to try out this market since it's so close to the park and splash pad and thought we could make an afternoon out of it. Not so much. The market was disappointingly small, with hardly any fresh produce stands. I think it took us a whopping two mins to stroll through the booths. Definitely better markets to head over to than this one!",
            "author": "Steph W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-08-24",
            "description": "Gosh this market was just so small! I was here all of five minutes before I had seen everything they had to offer.\n\nI like to go to farmer's markets because I like to give my money directly to the farmers. But the produce here was way more expensive than my normal grocery store. I just couldn't justify paying double here than I would at the store.\n\nMaybe a good spot to check out but not something to go to every weekend.",
            "author": "Ashley A."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-06-22",
            "description": "Nothing really special about Windy Acres Produce.  Very costly and I wasn't really impressed with anything I bought.  I do wish it stays open for double b meats though.  Very good pork and beef there and I keep going back for more.",
            "author": "Pamela G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-06-26",
            "description": "I went to the new farmers market over the weekend. I thought there would be a few more vendors but I was happy with the overall selection. There were baked goods, fresh produce, jewelry, flowers, etc. There was a small group playing music. I assume the music changes every weekend. \n\nI had the chance to purchase some fresh produce from a local farmer. As I was leaving I noticed John Dough Bakery selling hot/fresh donut holes with your choice of toppings. They were selling bags with 1/2 dozen and 1 dozen but we asked if we could buy just a few. He was happy to sell just a few. Make sure to ask! ;) \n\nDonuts, coffee, and fresh produce! This Farmers Market has a good selection but I would like to see a few more options.",
            "author": "Heidi B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-10-31",
            "description": "Today is the last day of the Lisle French Market for the year, and I'm going to miss it! We made a trip to the market most weekends when we weren't out of town this summer. There are a number of produce stands where we picked up a few delicious things each week. But our favorite part is the cold brew coffee from Cooperage Coffee and donut holes from John Dough Bakery. We'd make a morning of a little grocery shopping, and a breakfast of coffee and donuts while listening to the musicians they have each week. The Lisle French Market is always a good way to kick off a Saturday!",
            "author": "Kat W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-07-08",
            "description": "This was quite a disappointment. As far as farmers or french markets go in the area, this was the most lack luster I've been to. I think there were maybe 7-8 stands, although it was a holiday and some may have been off. \n\nMy friend was happy to see cold pressed coffee, but that was the only purchase made of the day. I will stick to Downers Grove or Wheaton in the future.",
            "author": "Amanda S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-05-27",
            "description": "Very little market and it seems to be getting more desolate each year... There are only a few vendors anyone comes for and only about 15 or less total time  which doesn't leave a visitor a whole lot to see. You will spend 10 minutes here and be completely bored and wondering why you didn't go to a more complete market.",
            "author": "Daron J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-01-13",
            "description": "I was in town for a wedding a while back and I found myself with time to spare Saturday morning. It's not the prettiest French market I've seen but it was definitely a genuine effort. There was an abundance of color throughout and there were a myriad of stands. The flowers were pretty nice! \n\nThe French baked goods made by the nuns were excellent! The delicious French pastries bumped this up to 4 stars. You can tell that the tarts and breads were authentic French. Definitely get the pain au chocolat and the apricot tart!",
            "author": "Phil C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-10-25",
            "description": "While this isn't a huge market, the selection is great, the variety is really nice, they always have live music and hot food for purchase. It's not as crowded as other markets which is nice, and people are friendly. Plus a few produce stands take debit card/credit card. Yaay for not having to always carry cash to make a produce purchase. :)",
            "author": "Nari H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-10-11",
            "description": "OK, so I've been a few times this year, and someone seemed to have read my review, or they realized they were selling short.  I just came back from a trip this morning, and the quality and selection were outstanding!  The prices seem to have come down quite a bit from last year.  This is still a fraction of the Naperville Farmers Market, but it is convenient if you live nearby.  I'm really happy they made some changes or got in new vendors...",
            "author": "Matt G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-05-15",
            "description": "It is a small market (approximately 2 rows of vendors) but the vendors have always been friendly and the produce I have purchased has always been of the best quality and extremely fresh. \n\nThe market usually has some form of entertainment (singing, guitar, etc) and a few random booths full or jewelry, candles, and/or flowers.",
            "author": "Kristen L."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-06-27",
            "description": "I give them 3 stars for effort in reviving the downtown Lisle area.  There are two rows of booths to shop from, including Flower, Herbs, Sterling Jewelry, Csometics, Purses, Breads from Great Harvest, Baked Goods from those Nuns that are everywhere you go at festivals, and usually a service type booth (Walk for Cancer, etc.)\n\nThey always have a special event.  Last month was the human model for the Punisher Comics, in September (the first) I will be offering three free yoga sessions.",
            "author": "Emily C."
        }
    ],
    "priceRange": "$$",
    "name": "French Market - Lisle",
    "address": {
        "addressLocality": "Lisle",
        "addressRegion": "IL",
        "streetAddress": "Burlington Ave",
        "postalCode": "60532",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/R0T5J8z6pUybR8BsjRfRow/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13125750286"
}