{
    "aggregateRating": {
        "reviewCount": 8,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-04-14",
            "description": "This is my third year signing up for a CSA (community supported agriculture) farm share, and my second year with Genesis Growers.  Following a less-than-satisfactory experience with a different farm, we switched to GG because we wanted something that was a little more local and had more of a community feel to it; we also wanted a place that offered pick-up locations on the South Side.  Last year's pickup at Hyde Park worked wonderfully, but to save trouble and to bring CSA produce to our own area, we decided to host our own pick-up point at our place in Bridgeport.  Last year were were amazed at the massive amount and variety of produce we received (greens, fruits, berries, veggies, herbs, eggs, etc), and how late in the year we kept getting boxes.  Our last boxes came sometime in november, and were stocked full of crops that could overwinter (squash, pumpkins, potatoes, beets, onions, etc), and even some items that had been canned for us!\n\nOur experiences working with Vicki have been nothing but positive.  My husband and I both love the emails she sends out just before the dispatch of every week's boxes - telling us news about the farm, tips on what to do with the produce, and more about her work.  Having had a chance to email back and forth with Vicki about the progress she's making, I have to say that I am seriously impressed by her forward thinking attempts to collaborate with other small farms in her area.  Currently Vicki is working on educating other farmers about growing crops to overwinter, and helping them find other venues at which to sell or donate excess crops/foodstuffs that haven't been able to sell.  I love the idea that not only are Genesis Growers trying their best to bring me the highest quality local produce possible, but they are also striving to find ways to collaborate with their neighbors to create access to local products that can be distributed even in the non-growing months (or saved up to fill out the boxes in the usually-leaner spring weeks).\n\nIt will be interesting to see where things lead with the farm, and what other new plans Vicki makes.\n\nThis year other CSA members decided to put together an email list for discussions, which has already proven to be extremely useful in getting recipes for lesser-known spring crops.  \n\nAside from the internet presence of GG and those involved, there are also parties held at the farm a couple times per season in order to get everyone together and feeling more connected to where their food is from.\n\nI can't recommend this particular CSA farm more highly; I hope her following continues to grow.",
            "author": "Lisa L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-04-14",
            "description": "This is my first year participating in Genesis Growers's CSA program and I am certainly pleased so far. I did a fair bit of research before choosing Genesis for it's long seasons, diverse crops and competitive pricing. Our farmer, Vicki, is very organized and has great communication with us. I'm looking forward to the rest of the Spring and Summer!",
            "author": "Jasmine J."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-09-04",
            "description": "Approximately three months into our summer 2012 Genesis Growers CSA membership, I can report that the quality of the fruits and vegetables we have received from GG has been very high.  The sweet corn, in particular, was excellent, and the watermelon we received was perhaps the best I have ever tasted.  Additionally, our pick-up location is an easy 10-minute drive from home, and it has been rewarding for us to consume locally raised organic food while supporting the efforts of a farmer who has chosen to earn her living by providing healthy produce to Chicago-area residents.\n\nWith that said, however, we have decided not to renew our membership with GG for 2013.  \n\nHaving worked previously with an outstanding CSA in Wisconsin (Two Onion Farm), we expected 1). that our substantial GG CSA investment would essentially comprise our vegetable budget for this summer and fall, and that, 2). given the vagaries of farming, we would sometimes encounter less appetizing produce items which we could choose to embrace as envelop-pushing meal-planning opportunities.  \n\nWhile GG has met our expectations on point 2  - we have twice enjoyed a delicious new recipe for baked kohlrabi gratin with dill, for example - we have been repeatedly disappointed on point 1.  Despite the wide array of vegetables listed in the GG Crop Chart, which we consulted before joining the CSA, our boxes have been consistently short on basic summer dinner vegetables.  We have received little or none, for example, of nourishing staples such as green beans, salad greens, Swiss chard, or broccoli, and have relied almost entirely this summer on grocery store purchases of essentials like tomatoes, lettuce, and carrots.\n\nAt the other extreme, our GG boxes have provided us with an over-abundance of vegetables we would have enjoyed in smaller quantities.  The appearance of our fourth cabbage in eight deliveries, for example, prompted me to write this review.  With the burden of this less appealing produce, we are, I suspect, actually eating fewer, and less nutritious, fresh vegetables this summer than we did last year, while having spent considerably more money.  \n\nThough it's been an especially difficult growing season for IL farmers, comments in earlier Yelp reviews (see John K., 10/19/2011) suggest that the disappointing weekly produce assortment is not simply a consequence of this year's drought.  \n\nIn our eagerness to participate in a mutually beneficial relationship with a local, organic farm, we failed to appreciate the important distinction between a true CSA - like Two Onion Farm, in which the entirety of the farm's harvest is distributed to its pre-paid members - and a farm business such as GG, which seeks to maximize profit from its two income streams, the CSA and its farmers market sales.  With its delivery boxes dominated by bulky (e.g., peppers, cabbage) and nutrient-poor (e.g., cucumbers, eggplant) fruits and vegetables, our 2012 GG CSA membership was, we have now realized, an expensive mistake, a poor value for our money.",
            "author": "Sheri M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-12-07",
            "description": "Genesis Growers is awesome! I did a lot of reading up on Chicagoland CSA's (that also delivered to Evanston) and I always came back to this farm. My wife and I signed up for the medium box and the weekly bounty that Vicki, our farmer, provides is amazing. Not only do we get lots of fresh veggies and herbs, but also loads of fruit! Vicki works with many nearby growers to further diversify the offerings. The farm box really is so jam packed that we don't need to get produce anywhere else. Thank goodness for modern refrigeration because sometimes the weekly summer box was plenty enough for two weeks. Vicki sends out emails before each pickup day summarizing the past week's affairs and what's in the box. Her stories are great and they've really helped give me an appreciation for where all that food is coming from.",
            "author": "Vincent C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-10-27",
            "description": "This is a great CSA. Farmer Vicki works very hard and loves what she does.  She writes emails from the heart and gives you the honest dirt of a farmer's life. It helps me appreciate more where my food is coming from and how it is grown.  It also makes me very aware of the reality of weather and crops failing and the unexpected of it all.  When I signed up with a CSA I wanted to support a local farmer and get fresh organic food.\n\n I also expected to have to be flexible with crop failure and not getting more of my \"favorites'. I totally get it.  Vicky grows things certified organic and she uses old farm equipment that is perfectly suited to dig up weeds, etc. The farms hands also pull up weeds, including Vicky, it's a labor of love.  The farm party was great and it gave us the full picture of all that she does.  For her to throw a farm party is huge, it's her one day of the week to rest.  I'd rather have her farming and growing our food than having several parties. \n\nI have heard about other CSA's and believe that this one is one of the most organized out there.  It's a small operation, a farmer lady and a few farm hands...it's amazing how much work they all do for us.",
            "author": "Karen L."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-11-25",
            "description": "We used to purchase a CSA share with King's Hill Farm when we lived downtown and they set the bar and standard for what we came to expect from a CSA. Unfortunately when we moved to the NW suburbs there were no convenient pick up points for KHF and so we tried Genesis Growers based on other reviews and the close pickup point. We were very disappointed with the whole program - it was more expensive than KHF and we got less of everything - the amount of produce, the variety of produce, and the quality of the produce. Nothing lasted more than 2-3 days and over half of my boxes were delivered to me with at least one item that was already moldy or rotten. We had to throw out so much produce because it was spoiled that I ended up buying all my produce at the grocery store and felt like I was just wasting my money. I'm glad others had a good experience because I think CSAs are an amazing way to get local, organic produce and support farmers but my experience with GG was very negative so we will not participate next year.",
            "author": "Christine D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-04-15",
            "description": "This is my first year with Genesis, but so far the vegetables (and fruit and herbs) have been excellent. My eating habits have been much improved and we are expanding our recipe collection.  What I love most about Genesis Growers is Vicki's excellent emails and continued communication. She responded back to me immediately on 2 different occasions, even before the CSA started. And the pickup locations are convenient throughout Chicago. Awesome CSA in Chicago, without question.",
            "author": "Russ B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-02-17",
            "description": "i love genesis growers -- vicki is absolutely the best farmer ! we signed up for the medium share for summer and fall. the two of us had just the right amount of fresh produce :0 the variety of veg and fruit was high, and i didn't feel that i was constantly eating the same things for the entire season.  of course i wish there were more tomatoes, but that's a csa for you. we also had the egg share - every other week a dozen eggs, so tasty and fresh!  and the share of chickens, which were amazing as well.  the price is great, the food is always fresh and tastes amazing, and supporting a local farmer is just a great thing to do. there are many many many pick up locations around the city, including the green city market on saturdays.. sign up early so you don't miss out !",
            "author": "Izabella d."
        }
    ],
    "priceRange": "$$",
    "name": "Genesis Growers",
    "address": {
        "addressLocality": "St. Anne",
        "addressRegion": "IL",
        "streetAddress": "8373 E 3000 S Rd",
        "postalCode": "60964",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JNc0445tkr0yK1VtkWN2fw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18159531512"
}