{
    "aggregateRating": {
        "reviewCount": 13,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-27",
            "description": "A Sam's Club/Costco like warehouse without membership fee.  GFS carries bulk size items from spices to fresh groceries to frozen foods and everything in between.  They also carry party and cleaning supplies.  The price is comparable to other clubs or grocery stores.\n\nI love the fact that they open at 7 am in the morning.  The store is always clean and organized.  I must mention the employees are friendly and helpful.",
            "author": "Shih C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-11-25",
            "description": "Great store, great location!!! Employees are nice, I love Antionette (she is really a people person). All of my great buys are here: Mozzarella sticks, blocks of cheese, case of fries, bags of frozen fruit, gallon size condiments and cases of sweets. The only down fall is I love their bacon, but it is over priced.",
            "author": "April W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-01-30",
            "description": "Went here for the first time about a year ago and I tell you what, I think it is a absolute great place to shop. Almost everything I have purchased here is great. I think there frozen chicken breast are the best by far. They're cut nice a skinny instead of the steroid and salt water infused ones you buy at Walmart that are hard to cook. Wish one was closer to my house then I would go there more than Costco.",
            "author": "Adam H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-09-20",
            "description": "My favorite place to buy in bulk. However, some of their items are overpriced that I normally buy at Sam's Club for way less. There's never any line and I'm always in and out in less than 20 minutes of I'm not buying a lot. The cashiers are friendly and a huge bonus is... they have complimentary coffee in the first aisle which, is a plus on those early morning shopping trips. Its open to the public and not only for businesses.",
            "author": "doreen s."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-09-11",
            "description": "One stop shopping at its finest and the best part is that membership is NOT required.  The only place one can usually find pricing and availability of this sort is at a warehouse shop like Costco or Sam's Club.  Some of their pricing and merchandise matches what is found at their competitors.  A typical membership at a warehouse club is usually between $30 - $100 dollars depending on the perks but at warehouse clubs they usually prefer cash, debit or American express.  At GFS all forms of payment are accepted.  Zing!\n\nI needed to make something for a picnic with forty plus guests and needed a few ingredients.  I was able to get 90% of the items needed here, they had the last 10% as well but that portion I wanted to make from scratch and not purchase in a can.  I phoned ahead inquiring, there was a little less than ten minutes to closing and yet they said to stop by.  There were a few employees watching the door and pounced on me to help out as I entered which was great.  In and out in less than ten minutes and surprisingly I only spent money on what I needed.  Got a huge bag of deluxe meatballs with over a hundred meatballs for about $9.99, thinking that there may not be any way to warm my dish at the picnic I scooped up a medium size tin tray with cover for less than two dollars and also purchased a couple smaller tin trays (less than a eighty cents) that could support the weight of the dish I was planning to make.  My idea was to throw a few tea lights into the smaller tin trays, light them, then place the bigger tray filled with entree over it.  (This worked perfectly the following day, FYI)  Of course if you want to do it the easier but more expensive way, GFS carries the entree warmer pan with cover, carrier and warmers.\n\nSince I didn't overspend on the last trip, I think I'll have to head back sometime to take a look around. Ha.",
            "author": "Jacob J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-02-26",
            "description": "I am obsessed with tracking down ingredients locally. I guess I see it as a chase whereas others likely see it is as a waste of time. One ingredient has eluded me for several years: high gluten flour. A couple of times, I have asked Kaufman's, and they were generous and obliged, though I felt annoying. Asking a coffee roaster for beans or a bakery for flour is just outside what they're comfortable doing. It took me a while to understand that and not be angered. Anyhow, the flour - It can be found here, though bleached, in a gigantic bag that lasted me months and I make a lot of pizza. And if you like to freeze your flour and don't have a separate chest, good luck with this bag! I've since started ordering from nybakers.com.",
            "author": "Brian M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-10-21",
            "description": "GFS has been a welcome to the Evanston area - much better quality than Sam's and much closer than Costco.  Customer service is uber friendly and helpful.  I was able to find everything that I needed for my daughter's birthday party here.  The fruit was super fresh and someone mistook it for farmer's market/organic quality!\n\nOverall, I really appreciate having GFS here and especially with no membership fees!  Check your Sunday papers as they typically have a $5 off of $50 coupon in here.",
            "author": "Dee W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-31",
            "description": "Just when you didn't want to find room for a 16 pound/pack of anything, you can feel good about having two cases of coconut milk, or an extra 4 pounds of Mediterranean Mix aka \"Crack Mix\", as it's known in my house. Ask the staff for anything and they will get it for you. BEST rinsed and bagged spinach in the area everytime. Baby Salad Greens blow away the WF bags at 1/2 the price. Regional blueberries from SW Michigan.\nHats off to Brian, the Manager, and his excellent staff for keeping customers happy and bringing in new products.",
            "author": "Michelle D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-06-18",
            "description": "I awaited patiently for this location to open, great spot to have it. Stopped in last week just to sneak a peak and the customer service\n was flawless. I grabbed a carton of 32 eggs for 2bucks!! WIN!!  I was looking for turkey bacon and one of the cute brown male employees walked me to each area\nthat it could possibly be in, no luck, but thats what i want when im walking around lost in a store!! \n\nThis week is their GRAND OPENING WEEK, and they are showing off quite well ! \nStopped in because on my previous visit I spotted some must have Beef Ribs. On my way in there were food vendors, \ntents, and picnic tables set up outside the store. WOW, Incredible free breakfast, scrambled eggs, crossiants, oj,  bacon \nand  sausage patties as well as links provided by a brand named Jones. The ppl at my table said the Jones bacon and sausage was soo guuud!!\n\nOnly thing missing this morning was the classical music.\n\nGFS is great when buying in bulk or not. You don't need a membership nor do you have to buy as much in quanity as when shopping at Sams Club or Costco.\nIf your tryna buy a few bananas this is not the place (they don't have single item produce). Its more of a warehouse for ppl who may have a small restaurant, big family, caterers etc. This location is kind of a mix between Sams Club and..lets say Aldi (ok, the good items in Aldi)  Lots of dry goods, aluminum pans, paper goods, chef wear,  plenty of KOSHER items and if you're having a backyard bbq there's plenty of pre-made food that'll make your guest think the event was partially catered. \n\nSome things were hella expensive but most prices are what you'd expect for large quanities of whatever. Msg to the super cool General Manager from KALAMAZOO, MI ..\"Purchase Turkey Bacon and turkey Sausage so we dont have to go all the way to Sams Club!!\"\n\nI must say the staff is super nice and it made me excited to spend a little more time than I actually needed to in there.\n\nWelcome 2 Evanston GFS.... I hope your enthusiasm is ongoing!!",
            "author": "SayGrit P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-12-09",
            "description": "Great store I actually used to work here and I still shop here because it's close and convenient although some items are too large for me and my family.",
            "author": "Marcus T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-12-12",
            "description": "I am LOVING GFS! So much better than Sam's or Costco for food items. Sure the selections aren't as expansive as the huge warehouses but the selections are plentiful. Prices are good on bulk items and the staff is almost too friendly \"if there is such a thing\". Store is new, clean and bright. Shelves are always stocked full, parking is plentiful and no membership fee is a huge plus. I am so pleased that GFS opened up a store in Evanston.",
            "author": "Jeff S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-02-28",
            "description": "This place is great when getting a lot of basics and you want it CHEAP. Things like: paper towels/ toilet paper, household cleaning supplies. \n\nBIG cans of 6 in 1 \"All Purpose Ground Tomatoes\"  when you are making a vat of NJ Mafia style \"Sunday Gravy\".\n\nOr, if you are doing a \"Church Pot Luck\" and need to make about 200 portions of Mac and Cheese.\n\nThe customer service here is ALWAYS very friendly and the place is conspicuously clean. Great quality, much of it IS name branded stuff and about 20-50% less than what you'd get at the Jwelz or Dominick's for those basics. And you don't have to get a membership. It's walk in, shop and walk out. Open to the public.\n\nThere are some thing that I prolly wouldn't get here. Buy your \"dry/ storage/ pantry\" basics and household chemicals are all here. And if you are feeding a CROWD, you really can't do too much better.",
            "author": "Jeremy D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-10-22",
            "description": "Great staff, excellent inventory and good prices!",
            "author": "Bill K."
        }
    ],
    "priceRange": "$$",
    "name": "GFS",
    "address": {
        "addressLocality": "Evanston",
        "addressRegion": "IL",
        "streetAddress": "2424 Oakton St",
        "postalCode": "60202",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/NWJ2mZk2cFJ_mkaYw1kAxQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18478640266"
}