{
    "aggregateRating": {
        "reviewCount": 212,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-12-28",
            "description": "Green City Market is as good as advertised.  I've been going for the past 7 years and its fantastic to see how much it's grown.  \n\nSimple things to know\nThe fruit and vegetable selection will change throughout the summer.\nIt's better to go early so that you have the best selection.\nAnd order your pizza first before the line gets long. \n\nThe market features amazing vendors that dish up other tasty favorites - grilled cheese, bakeries, veggies, flowers, meats, cheeses, dairy, basically anything that you'd prefer fresh and locally grown.\n\nFun date idea to meet here, buy all your supplies for a meal, and then go home and cook all that goodness up!",
            "author": "Adam R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-30",
            "description": "We love the Green City Market! This is a great place to spend your Saturday morning on a nice day and pick out fresh produce, fresh herbs, and grab lunch!  I always come here to pick up local honey (from Chicago Honey co-op) and hot sauce (from Bushel & Peck's). Also the famous Raclette cheese sandwich is worth the trip every time. AND its pet friendly. \n\nI am sad to see the outdoor market come to an end this month but I am very much looking forward to the indoor market experience.",
            "author": "Mikayla D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-09",
            "description": "I love the Green City Market!!! I myself am extremely bias of the produce that comes from Michigan. If you didn't know, Michigan has phenomenal soil that creates wonderful horticulture and produce. In the fall you have wonderful apples, in the summer you get delicious cherries and blueberries. Green City Market is where I go to get my true taste of Michigan produce.\n\nIt also features amazing vendors that dish up other tasty favorites - grilled cheese, bakeries, veggies, flowers, meats, cheeses, dairy, basically anything that you'd prefer fresh and locally grown. \n\nI typically leave with more than I planned for and end up cooking a delicious meal right from scratch.  One of my favorites is the raclette cheese stand - they melt raclette cheese onto French baguettes with hot lamps....so good!\n\nPro Tip - come with $20 in cash and try to form your own recipes with just the $20!",
            "author": "Zach S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-11",
            "description": "Very, very nice farmer's market. Tons of fresh produce, and handmade food products like honey and syrup.\nThere are a few good vendors as well offering up some delicious pastries, pies, tamales, wood fired pizza etc. definitely worth a visit. If you're in the area it would be a great way to get something fresh for those Sunday dinners.",
            "author": "Tyler K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-06-15",
            "description": "Awesome farmers market with great produce! Check the seasonal calendar to know what type of vendors to expect when shopping for your fruits and veggies. You can always count on the delicious cheese, apple cider donuts, crepes, flowers, jams, and grilled cheese and raclette! \n\nIt's fun to buy random items for your fridge, but I've found it best to check out what's in season in advance and come ready to shop to make a nice fresh meal for dinner. Most produce is fresh and driven in that morning from Michigan, so it can't be beat.",
            "author": "Michaela S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-05-27",
            "description": "What a great start to our Saturday morning while visiting Chicago. Now downside is parking is horrible but we are in a big city. Growing up and spending several summers in Europe I've come to not only admire but truly love farmers markets. There's just something about vendors on vendors selling items they've come to perfect. Now the produce selection wasn't huge like the markets in Europe but it was enough. And if you're used to farmers markets that sell homemade crafts this is not the market. But food! They sold tons of food both fresh and hot goods. This is a market to definitely check out if you're ever downtown Chicago. Come hungry and leave full. Another plus is you get to enjoy live music while sitting in the lawn or even just walking around.",
            "author": "Aisha H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-14",
            "description": "A spectacular Farmers Market located in Lincoln Park! A plethora of fresh food from independent sellers, a handful of hot food and pastry vendors, and a great way to spend a weekend morning! Crepes, carnitas & cookies stand, the most amazing looking croissant breakfast sandwich, made to order pizza, excellent mini burgers, smoothies, grilled cheese & more! Do not pass up the Jambon Baguette with ham, pickle, and Dijon. It's a spectacle to watch them make it. They have a huge Cheese wheel under a heater and they melt the cheese right off onto the bread! \n\nA few negatives are that there are not enough drink options, no tables to eat or sit, and 2hr parking was advertised for $10 with validation in the lot next door but it actually costs $16. \n\nOverall, very busy, lots of hussle and bustle, dog walkers abs baby strollers everywhere, a quaint Market with lots of tents! I've been to the West Loop location but it doesn't compare in size, variety, or hot food vendors. There's also a location at Park at Wrigley. Def experience it while the weather is nice!",
            "author": "Michelle T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-07-08",
            "description": "Love the market but I will never buy flowers there again. Bought these beautiful flowers yesterday at the tent at the southwestern corner of the market and they are all droopy and dead already...not happy , especially because prices at the market  are not the cheapest.",
            "author": "Lysa C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-02",
            "description": "This is a great Farmer's Market, especially that it is so close to the Zoo and great foods around the area! The apple cider donut in this market is phenomenal! The fruit, vegetables and flowers here are beautiful too! Love the vibe and location. Will frequent this market regularly!",
            "author": "Simon G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-24",
            "description": "This market is fantastic! \n\nIt's a must do in the summer. Grab a pastry or some other tasty treat and wonder through all the goodies. \n\nThe flowers are wonderful and of course any of the produce.\n\nMy must-do at the market is getting a pastry from Bennison's. They're the BEST danishes in the city! \n\nBut you can't go wrong with any of the food vendors. When it's warm/dry, bring a picnic blanket and enjoy lunch at the market!",
            "author": "Kaley K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-10",
            "description": "I could not have planned my trip to Chicago and hotel location better. When I awoke and opened the hotel room curtains, I was pleasantly surprised to see a large farmer's market! It's a beautiful location in the park between Clark and Lake Shore. \n\nOver 50 vendors and almost all had a sample of some kind (did I mention I love free samples?). Produce, flowers, cheeses, meats, prepared foods, and other specialties. I loved the melon stand that had over a dozen varieties with a self-serve sample set up with a melon baller at each one. Who knew there were so many melons?!\n\nThe jams and pickles were good too- sweet, spicy, or a nice combo (raspberry habanero was particularly good- sweet and tart up front with a slow, warm heat to finish).",
            "author": "Melissa D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-04",
            "description": "After living in Lincoln Park for 6 years, I finally ventured out here. I advise coming early - I got here at 8 (it opens at 7) and by the time we left at 9:30 it was far more crowded and a lot more hot.\nOverall - it was great! Amazing selection of produce from lots of vendors. Many bakeries with pastries and breads, salsas and pasta sauces, fresh eggs and juices, you name it. Lots of samples. Vendors were very friendly and happy to answer questions and talk about their products. It's exactly what I was hoping for.\nHowever... can I just say, the Abby's Crepe tent was THE biggest waste of money I have ever encountered. Like... I almost had to laugh. We stopped there, and for starters, you order on one side and pay on the other. But nobody tells you that. So I stood around like an idiot (and their employees did not smile at me, offer to help, or anything - they just stood there ignoring me) until several minutes went by and I said - um, can I order? And then someone said \"you order on the other side.\" Uh, ok, thanks.\nSo where you order is where the menu/prices are. Holy shit - a \"butter and sugar\" crepe is $5. Ok if you cook, you know that it probably costs $.25 to make one crepe, so that in and of itself is a joke and a half. But my husband said, let's get our son a butter/sugar crepe, and he himself wanted the blueberries and cream crepe which I think was $12. $12! I was expecting MAGIC. \nWhat I got was... some girl who didn't seem very adept at crepe making, trying unsuccessfully to swirl the batter with her little wooden thing, and then basically piling the batter up in a pile and putting in a plate and sprinkling sugar on top. There's my $5 butter/sugar. My blueberries and cream? Similar mess of a crepe... with some fresh blueberries inside, and a dollop of whipped cream. I thought it was a blueberry compote or something - nope, just plain blueberries which roll all over because there's nothing holding them together in there. There was a different guy making the savory crepes, and he actually looked like he knew what he was doing and I greatly regretted not getting something he was making. But be advised, the costs for all these crepes were $12, $15 etc. which is just ridiculous. \nHonestly. Other than this, I thought the market was great. I just wish we had picked something else for our snack.",
            "author": "Simeen A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-08-17",
            "description": "I head to Green City Market every Saturday morning. I have two must-have items--fresh flowers and fresh tomatoes. This place gets very busy late morning, so try and get there early. I am fortunate to be able to walk because the police show-up at 8:00am on the dot and start to ticket cars that shouldn't be on the road. The other caution is pricing, which is all over the place and where one may buy non-organic produce at a higher price than organic if not careful. The front entrance booths are always the most crowded, but not necessarily the best bang for your buck!!! The crepes made on the spot are to die for but the line does get backed up quickly. It is my favorite thing to do on a Saturday morning!",
            "author": "Linda A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-20",
            "description": "Green City Market had their huge BBQ today and it was sensational. Other than it being a tad toasty out today, it was a hit. The vendors and their food selection was A+. The balance of Food and Drink vendors was well thought out and drool worthy. Definitely worth the price of the tickets. I left so so soooo full and satisfied from all the pop ups. Of course Maple & Ash killed it, as did several of the other guys. Find a lot of new places that have been added to my MUST VISIT list, so stay tuned for those reviews \nSome parts of the park were muddy, but that's just nature and can't be helped. Looking forward to next year and the gluttony that will surely follow.",
            "author": "Zeke D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-29",
            "description": "This is a fun place to go on a wed or sat (days they are open). They have all sorts of vendors from the surrounding area. They have amazing butters, cheeses, bread, fruits, veggies and also foods to eat. Most of the tents let you sample the food. It can get a bit crowded, but if you go when they open you get a better selection. It's a bit pricy, but for me, it's a treat for myself :)",
            "author": "Trisha F."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-07-14",
            "description": "I asked the people who worked at Abby's Crepes how long they would be open. They said 1:00 pm. I went off to go-fest looking forward to returning and getting some crepes for lunch. I walked from the far north end of the park and arrived back at the booth at 12:40. Guess what? They told me they were closed. That's certainly not what they said earlier. When I explained that someone there told me 1:00 pm and I'd walked a very long way back specifically to get there ahead of time, they just shrugged. So yeah, a lengthy walk back for absolutely nothing. Thanks for the awesome customer service, guys; I really appreciate it.",
            "author": "Charlotte M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-22",
            "description": "I think this is where you'll find me Saturday mornings this summer. \n\nI finally checked out GCM and I loved it.  It was a lot smaller than I thought it would be, but there was so much to look at and a great variety of fresh fruits and vegetables...I can't wait to see what the rest of summer and fall holds. \n\nFirst stop...the smoothie tent. Fresh strawberry/blueberry smoothie is like sipping on sunshine. \n\nThen wander around to pick out your favorite goods. Don't forget your reusable shopping bag--makes shopping so much easier! Tomatoes (green, red, yellow), asparagus, lettuce, squash, squash blossoms, potatoes, strawberries, peas...a nice array.  There was also cheese, pasta, salsa, pickled veggies, meats and seafood to purchase as well. \n\nHungry?  there's grilled cheese, crepes, artisan pizza, tamales for purchase at their respective tents.  \n\nAnd there is also a kids section--Club Sprouts--where they offer kids activities and food tastings for the little ones.  With all the fresh offerings I cant wait to take my son here, maybe have a picnic and then head across the street to the zoo.",
            "author": "Aimee M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-05-06",
            "description": "This was opening day at Lincoln Park and my first time- I was underwhelmed. If you just want the experience of shopping at an outdoor market with (some) decent local produce then fine. Over half the market though is overpriced, ready made food kiosks or other premade or packaged food.\n\nI was amazed at how little some of the produce vendors knew about their own product- I said to Green Acres for example I knew they were not organic but wanted to know about another certification they have- this man dismissed it and said \"yeah, we're organic.\" They are not. The same person when asked whether they had ramps (common in spring) did not know what a ramp is! This happened at another stand and it suggests they have no real connection to the food they're selling. Isn't that the reason people shop from local markets?",
            "author": "Pilar L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-11-26",
            "description": "Best farmers market in Chicago- hands down!\n\nPick the best produce of each season, find fresh flowers, and munch on locally sourced food while you're at it. GCM will never fall to second place.\n\nGet there as early as you can, as it does get busy.",
            "author": "Romana Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-05-19",
            "description": "I came here on opening weekend with my friend and we tried this amazing melted raclette cheese on a toasted baguette.  They melt the cheese in front of you and scrape it from the wheel.  I was drooling just watching them do that.  They serve it with spring onions, baby gherkins and Dijon mustard. You need to order it with the ham. They forgot to put it in ours, but it was still good because the raclette  alpine-style cheese was just heavenly.  It was the best and I was very happy.",
            "author": "Christine H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-28",
            "description": "Quite possibly the best farmers market I have been to. \n\nA fantastic selection of vendors, and most have quite reasonable prices. Almost every vendor accepts credit card, and the location in the park makes for a relatively cool and comfortable experience in the Chicago summer.",
            "author": "Zach T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-16",
            "description": "Go early. Like, as early as you can stand. I know it's a Saturday and you're exhausted from the work week...just take my advice, okay? Unless you like the thrill of dodging leashes and strollers. It's a nice sized market but when it gets crowded, it'll seem very small....\n\nI think it's to be expected that farmers markets will be have steeper prices than regular stores. I also think that if you are a person who tries to buy organic as much as possible, and depending on where you tend to shop, the difference isn't that noticeable. \n\nThe green juice I bought was yummy. The kale pesto went on my linguine that very night. And the cherries alone were worth the trip on a hot day.",
            "author": "Iman W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-27",
            "description": "Running from 7 AM to 1 on Saturdays from roughly May 2nd through October 31st, this is one of the best local organic markets in the city. The GPS address is 1800 North Clark Street and more information can be found at: chicagofarmersmarkets.us but I can tell you that it is a wonderful source of clean, unadulterated food that is reasonably priced. My wife and I are raw vegan and we leave with bushel loads every time we shop here. Not only is it one of the longest running markets on the calendar, but it is one of the oldest and most respected in the Chicago area.\n\nUnique items about such as zucchini flowers, beet ketchup, artisan cheeses, organic non-gmo tofu, and on and on. Breakfast crepes are amazing, Gayle's cheese sandwiches are to die for, and there is a portable wood burning oven that turns out authentic italian-style pizzas nonstop (a good portion of the crowd was carrying pizza boxes while they shopped). Parking is a premium but the market opens at 7 and paid parking doesn't start until 8, so we try to get there at 7 and get our shopping done in an hour so we don't have to pay. An hour for us is plenty of time and we dally.\n\nOf all the markets we have frequented in Chicagoland, we like this one the most.",
            "author": "Dan H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-28",
            "description": "There's a knife sharpener! Tons of tomatos! Snacks! Bread! \nBUT-was there coffee somewhere? I missed the coffee. That is why only 4 stars.",
            "author": "Judith M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-09-06",
            "description": "I think it's great to support local farmers, buy fresh food etc.  But, it's a 2 way street.  Plenty of times I have seen farmers bringing substandard produce and charging high prices for it.  Example, yesterday (Sept 5) we went to GCM.  We bought some cherry tomatoes from a farmer.  We came home and found rotten cherry tomatoes in the bottom of the package.  The package cost $4 and seemed like a good deal, but we got taken.  At the same time, we were buying mushrooms and the mushroom farmer saw us put a substandard mushroom in our bag.  He pulled it out, and put in a good one and said, \"I don't want to sell a bad mushroom\".   Farmers need to accept the responsibility for bad produce.  Also, people like me need to call out the bad ones, and call out the good ones.  Not everything here is 5 star, and not everything is 1 star either.",
            "author": "Jeff C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-12",
            "description": "This is one of the best Farmers Markets I've ever been to. It's big and has plenty of offerings. I always find a large variety of fruits, vegetables, canned goods, breads,  and cheeses.\n\nI went to the market on Wednesday and Saturday of this week and both days are equally awesome, although the set-up is a little different each day. \n\nA few of my favorite purchases from this week: peaches, garlic, purple carrots, and pickles.  I'm also in love with the freshly squeezed fruit soda from Seasons Soda. I had apple mint flavored soda on Wednesday and cantaloupe flavored on Saturday. \n\nIf you are traveling to this market, I plan you get started early. I only live 3 miles away but the commute to the market can be tricky after 10AM. I like to get up around 8AM and get there first thing. If you are driving, there is metered parking on Clark, I've never had a challenge with finding a spot. (especially early in the AM)",
            "author": "Crista L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-04",
            "description": "Green City Market is a must do for those living in Chicago and for those coming into the city and want to do something a little less touristy.\n\nThe market is just south of Lincoln Park Zoo - walking distance to Old Town and easily accessible to public transit, Divvy Bikes, Bike Paths and Bus Routes.  Lots of great local produce, flowers and local products.  \n\nA great Saturday morning stroll.  Highly recommended.",
            "author": "Mat M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-11-23",
            "description": "Loved the autumn colors here on an October morning last month. Despite the rain & nasty weather, my friends and I had a really nice breakfast at Abby's Crepes!\n\n* Butternut squash, rapini, roasted apples ($10) - 4 stars\nhttp://www.yelp.com/biz_photos/q9ozbKbWtURmz2zZqyi7XQ?select=HCOx5jzJsLSG5yLkBniwJg#OVjUUZ1c0zWMSQ7YrwE_nQ\nhttp://www.yelp.com/biz_photos/q9ozbKbWtURmz2zZqyi7XQ?select=HCOx5jzJsLSG5yLkBniwJg#nsTNxMiP_d5RDRlnUlqA4A\nThe crepe was really soft, yet held the butternut squash well. Which, by the way, made a really nice savory crepe. I just thought the rapini was a little too sour - a little less of that and it would have been perfect!\n\nFull menu: http://www.yelp.com/biz_photos/green-city-market-chicago-2?select=6q8YD9C3d2dNiW9UTElU1g#6q8YD9C3d2dNiW9UTElU1g",
            "author": "Ziyan C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-11-14",
            "description": "Definitely one of the best farmer's markets I've ever been to. Prices are a little high but you're paying for high quality food made by people who actually care AND you're in Chicago...so it really should be expected. They have fruits, vegetables, grass-fed meats, dairy, eggs, pickled vegetables, flowers, honey, and several other fun local finds. They also have food vendors and I really think my husband only agrees to accompany me because he loves the bacon glazed cookie that the lovely chefs over at Cookies and Carnitas make! (They also have really great pork rinds!)\n\nBottom line is Green City Market is an outstanding place to find local, seasonal food and support your local farmers. I recommend going pretty early as it can get a bit crowded, especially if you're trying to find somewhere to park.",
            "author": "Lauren F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-13",
            "description": "Delicious strawberries at Klug's Produce Stand! We loved the grilled cheese, too :) Local blueberries grown alongside the lake.  Cheese, meat, produce, fresh flowers.  Live music.  Lots and lots to look at. A great place to sit under a tree, enjoy a sandwich, and watch the world go by! Even on a hot day like this past Saturday (mid 90s) the shade feels good underneath a tree.",
            "author": "Julia S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-05-22",
            "description": "Wow.\n\nCompletely worth it - I am a little loathe to share this place with anyone for fear that it shall not live up to my previous experience the next time I visit Chi town.\n\nCame here with my brother and sister in law, and totally loved the organic, delicious, gonna make you love it foodfest. Grilled cheese sandwiches here will make your knees tremble. Elk jerky will make you become a voracious velociraptor, wanting more; pea tendrils will then make you want to commit to extreme veganism - can I say more?\n\nKudos to all the purveyors here - you are all heroes in your own communities, and certainly serve your patrons well. I can only hope to strive to offer the same excellence in my own microcosm.\n\nWill most certainly be back!!!",
            "author": "Alex D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-07",
            "description": "Loved it!  My first visit to the Green City Market was yesterday - and I couldn't believe I hadn't stopped in yet.  While there were plenty of market stalls, there were also plenty of food stalls as well, so you can definitely make this a destination for dining.  \n\nI didn't buy much on this trip (the bike made it somewhat difficult), but I did pick up some flowers and fruit and both were high quality and priced right.\n\nA great farmer's market in the city and I highly recommend it!  The salad greens looked amazing as did basically everything else there.  I did notice that even though I was there around 11am, things were already beginning to sell out, so don't delay if you're going to visit!",
            "author": "Kathleen C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-09-02",
            "description": "On June 7 of this year, TimeOut Chicago published a small item extolling the Becker Lane porchetta sandwich at Green City Market (http://timeoutchicago.com/restaurants-bars/15408866/becker-lane%E2%80%99s-porchetta-sandwich-market-watch).  They painted a hell of a picture and really revved up my taste buds.  I cut it out of the magazine and kept that little nugget in my top dresser drawer.  I wasn't going to go several miles out of my way to spend $12 on a pork sandwich, but in case I found myself at the market at any point this summer, I wanted to keep a reminder of this supposed marvel.\n\nWell, it took nearly three months, but I finally got the sandwich.  And it was worth the wait.  And the twelve bucks.  This was one of the best sandwiches that I have eaten in recent memory.  And the guys slinging them are pretty cool too.\n\nIt was worth the trip by itself, but the rest of the market seemed pretty anemic.  Was it the Labor Day weekend?  The recent drought?  There were noticeably fewer vendors and patrons than I remember from the last few times.\n\nShrug.  I'll be back next spring for another porchetta.",
            "author": "David R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-29",
            "description": "BEST FARMER'S MARKET IN CHICAGO EVER!\n\nThank you so much for the hard-core recommendations of Yelpers! I loved eating the colorful grapes, ranging from pink to purple, of Green Acres that is based in Indiana. They were juicy, sweet and easy to eat, since the skins were thin. They were so good that I bought 4 bags of grapes. I highly recommend you stopping by Green Acres! \n\nI also saw booths that sold crepes, jams and honey. I am definitely interested in stopping by sometime this week again to check them out. \n\nDON'T MISS OUT THE GREEN CITY MARKET!",
            "author": "May Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-04",
            "description": "Produce, fresh flowers, and locally sourced food. I'm always finding a new food to try cooking with while I walk around.",
            "author": "Abby M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-17",
            "description": "This place is really cute. All of the vendors are very friendly, keep in mind that many of the vendors have a $10 min. for cards. The produce had a ton of variety but I wish there were more stands. The 5ish food tents were all very tasty, especially the grilled cheese one.",
            "author": "Sarah W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-05-20",
            "description": "I went today for the first time. It was smaller than expected. But maybe it was because it was cold. \nI bought a grilled cheese that was really good. It's in walking distance to the free zoo and conservatory. \nParking is tough but I found a free spot!",
            "author": "Rustygirl M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-29",
            "description": "Oops! Looks like we're back indoors. This market is year round. As of this week, it's only on Saturdays in the Peggy Notebaert Museum.\n\nSo hands down this is the best market in the city. From Spring to Fall a great variety of fruits and veggies.  This time of year crunchy apples, acorn squash, broccoli, greens, brussel sprouts, root vegetables, tomatoes, onions, garlic, potatoes, sweet potatoes, just to name a few.  Everything is fresh and you get to know your farmers.  There are also cooked foods(eg. Grilled sandwiches, apple cider fritters, crepes, soups, chili), cooking demonstrations, meats, baked goods, salsas, etc. \n\nIn the summer you can take the little ones to the zoo and in the winter enjoy the museum.",
            "author": "Abina G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-06",
            "description": "I love this place. A Saturday morning stroll combined with a stop by the green city market makes for a perfect start to the weekend.\n\nFrom fresh flowers, to organic produce, to made-on-the-spot food...the market is a wonderful place to stop-by for that single ingredient you need, your week's groceries or a fun outing.\n\nSome of my favorites: Nichols Farm, Abby's crepes, Mint Creek.",
            "author": "Lauren K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-09-09",
            "description": "I could possibly give this 4 stars one day, but I think 3 is fair for now. I went with a friend on a gorgeous morning and we took a lovely stroll on our way there. It is a bit unpleasant to get to, you are better off taking the bus. Don't count on parking. We got there and tried some food. We started at Zullo's and my egg/lamb/foccacia sandwich was fine, the apple cider donuts were good (read: they will make you fat). Then we moved down the aisles and I got some more food. Brings lots of cash, you will spend it all. I then got a smoothie and then ended the day with a crepe (~$12). All of the food I ate while I was there was fine, but it didn't blow me away and I'm not sure it was worth the cash outlay.\n\nI do want to comment that this farmer's market isn't that big. I understand this is a city, but I didn't think it was anything to write home about. Especially when every day it's open is 'strap your kid in a stroller and bring your dog(s)' day. Fortuantely I didn't see anyone (human or dog) drop a deuce anywhere. The selection is ok. The day I went it was cucumbers and peaches galore. I bought some berries and eggplant, but again, I wasn't blown away.\n\nWhen the weather is beautiful you could definitely make a day of it here, so bring a blanket and/or chairs (lots of other people do!) and try to get some flowers... they were gorgeous.",
            "author": "Stephanie H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-10-24",
            "description": "As I progress deeper and deeper into my passion for food, I learn that I need to figure out ways to balance my love of sweet desserts with healthy meals.  Over the past several years, I have been better about incorporating organic ingredients, fruits, and vegetables into my daily food repertoire, but I also want to educate myself in the locavore movement.  I now search for farmers' markets when I travel so that I can interact with regional foodies that are dedicated to providing the masses with naturally-produced culinary components that are healthier for the patrons and the environment.  \n\nSo, while in Chicago, I made a point to ask my waiter at the green restaurant, Moto, for his recommendation on a local market.  He advised us that the largest compilation of vendors would occur at the Green City Market in Lincoln Park the following morning.  My friend and I immediately added the destination to our itinerary.  The next day was sunny and perfect for being outdoors.  We easily navigated the direct bus route from the River North area to the southern entrance of Lincoln Park.   \n\nWe were greeted by dancing toddlers surrounding a friendly man playing festive music on his bongo drum.  The adorable scene brought smiles to our faces before we even had the chance to see the delicious food stations we would soon encounter.  Vendors were selling everything from artful loaves of crisp bread to brightly-colored produce.  There were also stands that were actually cooking lunchtime snacks like grilled, made-to-order hamburgers and custom fruit smoothies.  I was particularly wowed by a sun gold tomato jam that acted as a sweet spread to breads and a tart marinade for meats.  Unfortunately, the airplane liquid laws prevented me from purchasing a jar.\n\nThe breadth of products available from the dedicated, gourmet providers was truly exciting.  This was by far one of the most elaborate displays of local goods I have had the pleasure of interacting with.  My Saturday afternoon spent at the Lincoln Park Farmers' Market was a positive, upbeat experience that allowed me to feel more like a native Chicagoan than a tourist.",
            "author": "Alison C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-11-06",
            "description": "I visited this market religiously when I lived in Chicago and make a point of stopping if I visit. It's one of the best markets I've visited in Chicago, Kentucky and California. \n\nThere's a massive selection here and the quality is or near perfection at every vender. \n\nWhether you're looking for fruits, vegetables, dairy, meat, breads or prepared food make sure to stop here on Wednesday and Saturday morning before heading to a grocery store. \n\nI suggest:\n\n-Pasta Puttana, Handcrafted, farm-fresh pasta that you can take home and cook. Great flavors that can vary every week. My favorite is the seasonal herb.\n\n-Zullo's, Fresh Doughnuts, Foccacia, Pop-overs, Pizza\nthe doughnuts here are unreal, so is the pizza and foccacia. Obviously you can't go wrong, must try!\n\n-River Valley Ranch, Mushrooms, Pasta sauces, Spreads, Salsas\nI'm obsessed with their cheese spreads and the mushroom sandwiches you can get at the market.\n\n-Hoosier Mama Pie Co.\n\n-Crepe Stand \n\n\nThe market organizers are always having great events to support the community and local farmers, events for kids and more so it's good to check their website or follow them on a social media channel to stay up-to-date.",
            "author": "Misty B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-11-10",
            "description": "I enjoy this place occasionally on Saturdays during the summer. It has a nice people watching scenes and many singles and families with kids.\n\nI love their crepes. Tried mushroom and cheese crepes and caramel crepes. I wanted more even after finishing those... this place has also nice smoothies, donuts, sausage. \n\nFresh produces are nice but more expensive than wholefoods. Flower markets are not a bad deal. They have nice sunflowers during this time of the season.",
            "author": "Grace C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-09-03",
            "description": "I've been to farmer's markets in Italy and other places so I won't compare apples to oranges, but for Chicago, the Green City Market does pretty good and I'm glad to see this idea catching on. I like this market better than the one at Daley Plaza, somehow it seems more natural to buy fresh fruits and vegetables in a park setting than in the middle of the Loop.\n\nAt Green City, you can find an assortment of fruits, vegetables, fresh herbs, honey, flowers, even pies (and I'm bummed that they were all sold out by the time we got there). We sampled some peaches and had to get them. Too bad I couldn't buy anything else because we were heading to Perennial across the street for brunch. It was hard to look but not buy. Saturday morning crowd was not too bad. I'll have to plan better next time and pickup ingredients for my own brunch.",
            "author": "Mahsa T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-11-19",
            "description": "Always get great quality stuff here. My favorite is the tofu stand- so yummy! Also can get some good honey, flowers and of course produce. They even have a portable brick oven pizza stand in the summer! So good",
            "author": "Laura J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-03",
            "description": "This place is great!! This open market in the summer is so amazing. Fresh fruit, veggies and prepared food galore. Please bring your kids, BRING your dogs enjoy the day with the creatures you love. See you all there!!",
            "author": "Food I."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-29",
            "description": "BEST THING TO DO ON A SATURDAY MORNING HANDS DOWN!!!\n\nNew summer Saturday routine...\n1. Green City Market\n2. Lie at my pool all day working on my tan, enjoying a cocktail or two.....\n\nI LOVE this farmer's market. You cannot go wrong. There are so many awesome things to see and sample and smell.... sigh... I wish it was more than just twice a week (Wednesday and Saturday). I want it everyday! I've run out of tomatoes and I now refuse to buy them at the grocery store. They MUST come to me from Green City Market! MUST! There are gorgeous fresh flowers (I'm bringing home fresh peonies this weekend) and local honey, fresh baked bread, meat, veggies (MUST get the tomatoes!), fruit, jams and jellies and pie! There is nothing not to love. I've been to my fair share of farmers markets, but I must admit this one takes the cake. It doesn't hurt that it's practically in my front yard, either.",
            "author": "Christy Q."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-04-13",
            "description": "Farmers Market. Everything is fresh /organically grown! Take a beautiful stroll through all of these stands fruit/veggie/cheese/meat stands & Pickup your cooking ingredients here! :)",
            "author": "Kristine D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-12-23",
            "description": "This is a fantastic farmer's market. I've been told to get here super early, as early as 7 am, to get good produce, but that was not my experience at all. I arrived later morning and there was still plenty of good produce to go around. In the fall, you can find apple ciders, lots of different kinds of apples, mushrooms, gourds and peppers. I will definitely come again during the summer, and empty out my pockets because the prices can sometimes be twice as much as in the grocery store.",
            "author": "Sarah Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-22",
            "description": "I have gone to farmer's markets for nearly 30 years, in all the different cities I've lived in, and the places I've visited (if I could find one).  I had heard a lot about Green City so it was on my to-see list.\n\nConsidering it is the biggest in the city, I was surprised by the size; it's not a heck of a lot bigger than the Temescal or Grand Lake farmer's markets in Oakland. and smaller than the KCC market in Honolulu. At this time of the year there was a nice selection of produce.  More expensive than CA, which is and isn't surprising.\n\nWhere Green City really whups CA is in dairy and meats.  If I were flying and not driving back, I would seriously consider a freezer full of meat, cheese and cream.  Seriously, organic grass-fed cream for $5/quart?  In CA markets you are lucky if you get one or two meat vendors.  Here there were at least 6.",
            "author": "alameda a."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-25",
            "description": "This is very embarrassing, but I have never been to a farmers market, until 2 weeks ago.\n\nI am very glad to have finally taken the time to check it out.  We didn't have intentions of buying anything because brunch at Perennial was next on our agenda.  However, we could not resist that yummy looking strawberry rhubarb bread pudding from Floriole.  It was just okay.  I could, without a doubt, make better.  It was way too eggy and didn't seem to have enough bread.  It tasted like sweet eggs.  (yuck)\n\nWe were very impressed by the beautiful flower vendors.  Peonies galore!!  Lilies, too.  I'm not a huge flower fan, as I prefer something that doesn't die within a few days.  In the event you are having a dinner party, this would be a very lovely and simple way to create a stunning centerpiece.\n\nI had no idea the market sold eggs.  And even meat.   This is the place to pick up items for a magnificent feast.  Please invite me.  I'll bring Caroline M.'s soon to be famous homemade strawberry rhubarb bread pudding.",
            "author": "Caroline M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-12-29",
            "description": "I really love coming here in the summer and early fall on a nice Saturday morning.  They have all of the fresh produce that you can imagine.  They also have an assortment of baked goods, meats, smoothies, and honey.  I'm sure I'm forgetting other details, but it's a great experience.  \n\nDo beware of dog droppings.  I think every dog owner within a 5 mile radius is drawn to this place on the weekends.",
            "author": "Luke S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-09-15",
            "description": "By far my favorite farmers market.\n\nThe good: Go here if you want a lot of options. They have everything and stuff you have never seen before too. I didn't know purple green beans and white asparagus existed. I mainly go for the fruits, greens, cheeses, and honey. A lot of it is organic too. The farmers are really nice and the quality is very high.\n\nGet there early, like 8 if you wanna get first dibs esp if you're into tomatoes. They sell out fast. Def get the apple cider donuts from zullos too!\n\nThe bad: You will not have anymore money FFFFFFFFF dfakdshfafheri. Seriously you will be paying out the ass and unless you're into that kind of thing, it's hard to justify coming here for all your groceries every week (exception - you make enough money......anyone?). If you don't like strollers, babies, and dogs I highly suggest you stay away as well.\n\nEven though I can't afford a lot, I like to go anyway. It's a great Sat morning thing you know? If you go early, you should be able to find parking but after 10:30, you're basically SOL on that front. CTA that shit and save yourself a headache.",
            "author": "Monica M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-07-08",
            "description": "I guess I'm alone in my opinion here. I find the market to be somewhat of a disappointment. Mostly people go on about the food, which can be gotten at the vendor's brick & mortar establishments. Not to mention, you would pay less. They seem to up their prices at The Market. Also, as many times as I have gone, the local chefs get the first dibs on all the stuff. Especially the heirloom tomatoes, when they become available in the late summer. More times than not, the fruit I have purchased has mold on the bottoms of the baskets. The veggies seem to wilt before I get them home. I try to get there right when they open, so I can't figure out why this happens most times. Wish I would love it because I appreciate the concept but for the prices you pay, I find the quality lacks. This is just one women's opinion.",
            "author": "Kim H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-06-16",
            "description": "New to Chicago and was very excited about the Green City Market.. it's kind of small but I guess I'm used to the huge Californian ones. There's a handful of prepped foods (burgers, ice cream, tamales..), a few cheese, and maybe a dozen produce stands. Is it just the season... or do the farmers only do strawberries? It is in a great location though, with plenty of space to hang out on the grass and munch on your new purchases.",
            "author": "Vivian H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-11-01",
            "description": "Dear Green City Farmer's Market, \n\nWas your father a thief? 'Cause someone stole the stars from the sky and put them into my review. I'd give you a bajillion stars if I could. Just let me taste you.\n\nOooh, yeah, nom nom nom, give it to me. I relish those mountain rose potatoes of yours. I desire your creamy milk more than words can express. How I want to manhandle your naturally raised chicken thighs. I beg you... slather me in your summer butter. Oooh, ahh, let's pork 24-7. \n\nThis market is incredible. Definitely one of the best in the city. I go back-and-forth between this one and the Logan Square Farmer's Market. I can't really choose a winner though. That would be like asking: Who would you rather bone: Marisa Tomei or Naomi Watts? Silly question. I want to bone both of them. At the same time. \n\nNot only is the Green City Farmer's Market year-round, but the quality of vendors is magnificent. While not all of the farmers are organic (which is kind of a joke of a label thanks to the FDA), the majority practice sustainable farming. That means they actually care about the land they use, as well as the animals they raise. If that matters to you, too, then you should really come to this market. Yes, it can get crowded, but honestly, it's not unmanageable. It's not like you're walking into a Wal-Mart on Black Friday, and it beats the heck out of Whole Foods or any other generic grocery store, which is likely to be even more packed on a Saturday.\n\nBig-ups to some of my favorite farms here: Meadow Haven Farm, Heartland Meats, Hawk's Hill Ranch, Ellis Farms, Green Acres Farms, Genesis Growers, River Valley Ranch, and Nordic Creamery. (I'm sure I'm forgetting some, and I imagine there are many other great farms that I haven't tried yet.)",
            "author": "Filly G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-25",
            "description": "My favorite farmer market in town! The people, the dogs, the croissants, the fresh peonies in the spring... The experience is just wonderful!",
            "author": "Chou M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-11-18",
            "description": "Green City Market is great for its twice-a-week offerings, Wednesday and Saturday. I went on a Wednesday and was told it was about half the size of Saturday's market, but I also benefitted from half the crowd size, and a Chef demonstration by Rick Bayless.\n\nSr. Bayless demonstrated the making of a Thanksgiving Squash soup, taught us about different types of squash, Mexican cinnamon, cane sugar; and noted the educational component to the GCM that delineates it from other farmer's markets in the City. Chef Demos take place at 10:30AM on Wednesdays and Saturdays inside the big white tent.\n\nDonate to the Market and help yourself to a nice cup of Intelligentsia coffee! Get some pastry or a crepe to munch on while you wander. \n\nGet your seasonal fall finds here: dark green kale, vibrant Swiss chard, acorn and butternut squashes, fresh apple cider. What are those weird purple and white carrots good for? The farmers are only too happy to discuss it with you!\n\nThere's free parking across the street from the Peggy Notabaert Nature Museum, or street parking on Cannon Drive. Highly accessible by the #22 Clark Bus as well. The Green City Market runs through Dec. 23, then goes Saturday-only in January. What hearty finds await Chicagoans in the middle of Winter? I can't wait to find out!",
            "author": "Kyle H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-11-18",
            "description": "I have been several times over the years to the fall location next to the Nature Museum. There are several products that Christopher and I are addicted to and need to restock periodically. Christopher loves the monkey buns from Bennison's Bakery, and we love many of the cheeses and of course the produce they offer. \n\nToday was a special visit. I made the trip down to see Rick Bayless from Frontera Grill do a cooking demo. He made a butternut squash soup with apples and chipotle. He is a wonderful public speaker and stayed around to answer questions and take pictures. He was very generous of time and spirit and is a great supporter of the City Green Market. And YES..... they gave out samples of the soup at the end of the presentation and it was wonderful. Even Christopher liked it and he hates squash. And YES, I had my picture taken with the chef. I'm so happy right now I could squeak!! \n\nEvery Wednesday through the end of the season there will be other top quality Chicago area chefs doing demos  at 10:30 AM. I will be back for sure!!!\n\nSupport local and sustainable farming!!!!!!",
            "author": "Pam D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-05-30",
            "description": "It deserves a million stars if I could give it. This is hands down the best farmers market in the city. Organic, fresh, bountiful produce - it just makes me happy. You can also get food from the vendors like grilled cheese sammies, tamales etc so you can munch while you shop.\n\nOf course it is expensive than usual stores, but the quality of the food is absolutely incomparable. Apples, strawberries and asparagus are bountiful right now. I know i will be making a lot more trips here.",
            "author": "Vaidehi T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-05-26",
            "description": "For that guy or gal who went over to one of the couple cheese stands looking to get their fix of jack Cheese with morels and onion... and was told that a trio of utter douchebags cleaned them out...\n\nFuck you.  You probably live in the area.  Get some next week.  \n\nIt's utterly refreshing to run through a list in your head and find practically everything that you're looking for at a Farmer's market.  This place is one of them.",
            "author": "Allan C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-06-30",
            "description": "Green City Market is easily one of North America's best markets. I missed the wonderful midwestern produce, honey from Indiana, fresh flowers, food samples, live music and cooking demonstrations from some of Chicago's best chefs. I have gotten zucchini flowers and they make the best fritters. \n\nI used to live 15 minutes away and I would always go here to check out what they have here. Not that I can afford to shop here all the time but they have some pretty wonderful stuff here. I only wish the market would be a lot bigger. It just seems many of the vendors sell very similar products.\n\nThe market is easily accessible via buses. It could get crowded later in the day; so come as early as possible.",
            "author": "Kwoky L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-14",
            "description": "OK, lets just call it what it is:  A big farmer's market.  \n\nIf you're looking for Fruits, Veggies, Cheese, Meat, and a handful of other specialty items, this place is great.  Also, if you like to cook, this place bestows great inspiration.  Finally, it's a perfect place to try something new.\n\nTo be clear, I've never eaten at any of the food stands, so I have no review of them yet.\n\nThe downside:  Green City Market is not a secret.  after 9am, when you combine all the strollers, people with their dogs, and oblivious cell users (I know, all three groups exist everywhere, but they all LOVE farmers markets, and flock to them like Larry \"The Cable Guy\" sprints towards terrible movie roles).  \n\nIf you have a car, it'll be difficult to park, or you'll be paying 9 bucks.  I suggest riding your bike over if you have the option, or using pub trans.  Also, simply moving around the market after 9am is like walking barefoot on a carpet covered in legos:  it's going to take you a while, and someone's foot might hurt.  \n\nOutside of my gripes, it's a perfectly good experience.  Just remember: unless you just plan to go and hang out, plan to hit the market early.  It is certainly worth a visit.",
            "author": "Jim K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-10-26",
            "description": "We went to the Chicago Green City Market since we were going to the Lincoln Park Zoo and it's just right there on the South end of Lincoln Park.\n\nLots of booths:\npumpkins\napples\ncranberries from MI\ncheese from Wisconsin\napple cider\nmushrooms\nsome kind of grass juice thing\n\nWorth checking out.  Just saw this on Yelp:\nCome celebrate the end of the Outdoor Market season with a special 9:30 am tasting provided by some of Chicago's greatest pastry chefs.",
            "author": "Ann L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-19",
            "description": "I finally checked out GCM this past Saturday. What a great market and it's HUGE (twss). There was a nice variety of produce and eats...which we all know I appreciate as by evidence of my waistline. I snagged some beautiful looking red leaf lettuce, beets, red carrots (!!!), peaches, red onions and micro greens. If I did not have errands to run after my trip to the market, I would have snagged a bunch of flowers as well but in the sub tropical temps we are experiencing right now...I knew they'd never survive. Next time! \n\nI arrived around 10AM and parking was crazy. It was hot and I did not feel like circling around nor did I feel like walking a great distance in the heat so I parked my ride in the paid lot....which is $9 for 2 hours or less. Kinda spendy...kinda like GCM. That is my issue with this market. I felt it was kinda on the expensive side and while I appreciate local organic produce...I really don't want to pay $5 dollars for blueberries. I think the veggies I snagged were right around what you'd pay for at a market. The micro greens were by far the best deal the GCM had to offer. I almost breezed past this stand but thankfully my friends had me stop for a moment and try some samplings. Who knew that micro greens could be so damn delicious? Not me, that's for sure! \n\nI really wanted to hit up the tamale stand but SIX DOLLARS for ONE tamale? No bueno. The burger stand smelled pretty delicious as well. Next time I'd like to hit up the Becker Lane tent and grab myself some pork....next time as in when it's not 100+ degrees outside.\n\nGCM, I am impressed with you but I had to knock off a star b/c...where the hell were all the tomatoes?? I hope you make this up to me upon my next visit. Please & thank you.",
            "author": "Joanne W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-05-19",
            "description": "Maybe it was the cold \nMaybe it was the wind \nMaybe it was the time of the season \n\nWhatever the reason, I was a little underwhelmed by this market when I attended opening weekend. \n\nTalking to a few vendors I heard that the unseasonably cold weather and wind made them consider not setting up, so I'm assuming a number of other vendors weren't as brave. I expected see more variety, more stuff just asking to come home with me, but I left empty handed. \n\nIt may be the time of the season, but the majority of vendors were selling cheese, herbs, plants, and meats. The cheese was fantastic, I could've made a meal out of the samples alone. The main thing that seemed to be missing were the fruits and veggies.\n\nI grabbed some lunch while I was there. The amazing aroma of crepes was calling my name, but sadly it wasn't meant to be. The wait for crepes was horrendous, I was told it would be a 45 minute wait; had I foreseen that I would've put an order in the minute I arrived instead of after browsing the market.\n\nI settled on a quesadilla from another vendor. At $10 I found it very pricey since it lacked that wow-factor; it also was more tostada-like. The people working the stand were very friendly and I was impressed at how they made use of everything, even using biodegradable plates, etc. that would later be composted. \n\nDespite the cold it was nice to sit outside and eat my lunch near a couple of musicians entertaining the crowd. The other entertainment, a tap dancer-accordion duo, was interesting to say the least.\n\nI'm going to make more of an effort this season to get my lazy butt out of bed and stumble the few blocks over here more frequently. It's pretty pathetic that I've lived this close for years, but only visited 2 or 3 times. Hopefully more visits will equal more stars!",
            "author": "Mary T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-05-24",
            "description": "I enjoy a good farmers market.  I like to eat food that is in season and support my local farmers - and by local, I mean the Midwest.  \n\nWhat I don't like about the Green City Market are the hippies and stroller moms doing drum circles in the middle of everything.  Can't you go to Gymboree?!  Or put your toddler on a leash so that I don't trip over him?\n\nI don't view a farmers market as a place to hang out.  For me, it's an alternative to a grocery store.  I want to get in and get out with my vegetables and it really puts a harsh on my vibe when a couple of yuppies stand in front of the scale to debate how their going to braise their leeks when I just want them to get out of the way so I can pay for my tomatoes and go home.  I mean, guh!  \n\nOther than that, I do enjoy this market.  I like that there are numerous vendors so that you can comparison shop.  I like the cider smoothies and the warm apple cider zeppole.  \n\nI don't find it very cost effective.  In fact, it's about the same price, if not more, than buying at a grocery store but the quality is so much better. \n\nFirst world problems...",
            "author": "Amy H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-14",
            "description": "After my first experience, I knew I would be back again and again. I can't get over how phenomenal this place is! All of the vendors are amazing, and even when it's busy there is no shortage of places to sit in the shade and enjoy a purchase or two. You should get here super early though because the good stuff does go fast! Everything is situated in rows with no real organization but that's half the fun! There are booths offering produce as well as booths for smoothies, ice creams, burgers, sodas, pork sandwiches, I could go on and on and on. This place is super accessible by multiple forms and manners of transportation, I chose to walk from my apartment down Fullerton on a beautiful Chicago summer day. Bring reusable bags too, the farmers/staff like that as do the rest of us environmentally conscious people! I will never be able to get enough!",
            "author": "Courtney W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-05-23",
            "description": "I was making my way through my neighborhood to get a sandwich from the spots I frequent everyday (boorrrinnnggg) when I saw white tents in the distance.  Could it be? Is it that time of year already? Oh yes it is....The Chicago Green City Market has arrived! Whoo hoo!\n\nI skipped on over to the market, which will be here every Wednesday & Saturday throughout the entire summer. Another whoo hoo!  I sampled a few cheeses and delicious veggies.\n\n I made my way over to the crepe booth, which was calling my name, until I saw a young woman walk who looked like she was really enjoying her delicious veggie sandwich. And I can see why she enjoyed it after having a goat cheese with veggie sandwich myself!  Goat cheese is one of my favorite things ever, but what really made this sandwich so tasty was the fresh vegetables they loaded onto it...I don't even like asparagus, but couldn't get enough of the asparagus on this sandwich! YUM! $8.50 seemed a bit steep for a sandwich at a market, but I\"ll pay $8.50 for this sandwich anyday!\n\nWelcome back Chicago Green City Market...I have a feeling we're going to get to be very good friends this Summer!",
            "author": "Andrea R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-05-03",
            "description": "The market is back for the season!  I love this market so much.  I love trying all of the new foods and meeting local small businesses.   Today, some of my finds were a bacon cookie, grilled cheese and onions, amazing pickles, delicious jams, wheat grass and wonderful organic produce.  The market is very family/stroller friendly and also pet friendly!  Parking is tricky so it would be easier to take the cta.",
            "author": "Nichole F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-06-10",
            "description": "What a fabulous farmers market! This market focuses on local, sustainably raised products. It's open Wednesdays and Saturdays in the Southwest corner of Lincoln Park (you can park in the lot off Stockton at North Ave. and get your parking validated at their booth). \n\nI wasn't expecting there to be too many vendors there on a Wednesday, especially since the weather this morning looked kind of iffy, but my mother and I braved the clouds (which burned off anyway) and headed down to the park. So glad we did! Not only were there vegetables, but also honey, cheeses, meats, baked goods, flowers, herbs, demonstrations (someone from Uncommon Ground was doing a demo while we were there), foods prepared while you waited (Mom and I split a crepe), and more. There was even music: a duo played folk tunes on a banjo and hammered dulcimer. Many other shoppers were there as well, which surprised me for the week day and the previously questionable weather.\n\nI got: \n- small, sweet strawberries from Michigan\n- green garlic (like a cross between bulb garlic and a green onion or something; I plan to make a recipe I have for Chai Chicken Wings with Green Garlic Aioli)\n- spring onions (look like overgrown green onions)\n- butter lettuce (I am now looking at all my salad dressing recipes to see what is worthy of dressing this lettuce, it looks so nice!)\n- radishes (lots of varied types of radishes to be seen, different colors and shapes)\n- portobello mushrooms (the vendor i bought from was selling only mushrooms, as well as mushroom salsas and pickled mushrooms in jars, and they were beautiful; often the mushrooms in stores look kind of blackish where they're not supposed to, but these were pure white on the stems, very fresh)\n\nI rushed home and used the mushrooms to make Mollie Katzen's Nut-Crusted Portobello Mushroom Fritters for dinner, which were delicious. Having all this lovely produce at my disposal made my pull out my recipe binder and look at my salad dressing recipes again as well as ideas for other meals. \n\nFor getting me re-inspired about my cooking alone, the Green City Market deserves five stars. But it's also a nice setup with a lovely mission. I hope I'll get to go back this season; you should definitely check it out too. Even if you don't cook, no one can go wrong with a basket of berries to eat under a tree as the sun comes out.",
            "author": "Shannon M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-05-24",
            "description": "So...don't judge but after several years of living in Chicago, I FINALLY went to the Green City Market. \n\nI'm a convert...now all I want to do on Saturday mornings is to wake up early (like 8AM early), get to the market, buy fresh produce, and eat tasty food before everything runs out.  \n\nSure, I think I got ran over by like 2,436 strollers and stepped on by dogs of various sizes.  But it is totally worth it.",
            "author": "Tiff W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-08-06",
            "description": "I am so happy I finally made it to this place. I love that everything is fresh and locally grown from the area. The market sells everything from fresh fruits and vegetables to breads, cheeses, meats, flowers, even homemade ice cream, sandwiches, and other lunch things. Everything looked and smelled delicious. The only things I wish were different were:\n\n1. The prices are expensive here. And I am a poor college student. So that is not fun.\n2. Most of the vendors are cash only.\n\nFor about $20 I bought 6 peaches, a pint of blueberries, an onion, and an ice cream cone. See, told you it was pricey. Worth it? You bet! Not for weekly shopping but for the occasional extra special ingredients for summer cooking or on a fun lunch date, I think it's a wonderful local option.",
            "author": "Christina F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-13",
            "description": "Really loved this Farmer's Market.  If you find yourself in the area, you will have to make a trip out!  I wish they had more variety of venders, however, I enjoyed walking around and bought some amazing fruit at a decent price.",
            "author": "Angela L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-12",
            "description": "veggies and cheeses and flowers, oh my! green city market is a feast for the senses. just don't buy everything that tempts you in one visit or you'll go broke. the fun part of that is that you never run out of new things to explore.\n\nfor organic fruits and veggies go to green acres farm! my favorites (though hard to choose) are the kale and eggplant. my girlfriend can't get enough of the beets and shallots. try the ground cherries- not only delicious, but cute. something i look for in a fruit. :)\n\nlove the empanada thingies and the cider donuts at zullo's. we may have gone a just a tad overboard with our last order, which added up to $24. see what i mean about indulging in all your temptations?\n\nseedling has the best apples i've ever tasted. i exaggerate not.\n\nand ya'll know i'm a cheese girl. plenty to choose from here! when i want to treat myself i get a baked cheese from brunkow. just heat it up and it gets all crisp and buttery. it is what i'll call skies-opening-up-revealing-rays-of-sunlight-and-the-sound-of-angels-singing good.",
            "author": "Erin E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-10-13",
            "description": "I spent this Saturday (a beautiful day) at the Farmers Market for the first time. It was such a great market, with plenty of prepared foods as well as fresh produce. I tried the crepes, and it was yummy! I would definiately go back to browse or to buy produce! The zoo, being on the same block, made for a nice stroll afterward.",
            "author": "Laci B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-03-05",
            "description": "We went on Saturday and came away with a very nice variety of quality items (beef brisket, four different cheeses and some artisinal honey.\n\nThere was about 12-16 vendors (about what I was expecting because it is still winter), with quite a bit of overlap, which is to be expected at a farmer's market.  We will be making additional trips to this during the summer months to get the full experience.",
            "author": "George H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-09-26",
            "description": "FINALLY I was able to experience the Chicago Green City Market, of course towards the end of the season.  I can tell you that everything all the other Yelp reviews claim is true.  Here's a few recommendations:\n\nPreparation:\n-Set your loudest, most annoying alarm for super early allowing you to make it to the market before 9 am for the best picks.  Public transit to the market is a must (Sheridan-151, Armitage-73, Clark-22 are the best options for a close-by bus stop).\n-Collect your reusable, eco-friendly bags (preferably your Yelp one to show off)\n-Wear your favorite label outfit, but not without forgetting extra deodorant and cologne/perfume (to mask the odor of some of the Hippie vendors who don't wear any)\n-Put on your extra large framed sunglasses to secretly check out all the good looking Lincoln Park/River North/Gold Coast yuppies.  It's a great cruising zone.\n-Prepare your bathed teenie dog in its best costume with the flashiest leash (or set him/her in a Gucci purse)\n-Throw some tissue and a plastic bags in your bags from step 2 just in case you step in dog droppings\n-Bring a white cane to let everyone know your path and clear your way\n-Run to the ATM for a wad of Jacksons ($20 bills)\n\nBuy:\n-Begin at the Mama Hoosier's Pie Company if you want a pie.  They'll be the first thing to go.\n-Head to Zullo's for a light breakfast of soft, freshly fried doughnuts ($5 a cone; a bonus is visiting Flora Confection's booth and they'll spoon some Pate de fruit on a doughnut or two), or possibly a fresh, seasonal, organic focaccia sandwich, and/or a muffin from Floriole's Bakery.  Grab 3 sample cups of apple cider or give a $1 tip for a cup of Intelligentsia coffee and you've got your breakfast out of the way.\n-Venture past all the booths with fresh herbs, flowers, produce, meats and dairy products by following your nose and eyes (longest line) to the best.  Shop away!\n-Have your knives sharpened to create your own meals with all the items your purchased.\n-Get your watch battery changed in order to realize how much time you've spent at the market.\n\nLeave:\n-Head out feeling broke but great by supporting and promoting local, sustainable agricultural practices and businesses.\n-Next week, do it all over again!  It's well worth the experience, outside air, pleasant skyline views and great products.\n\nAwarded Review of the Day in Chicago, Illinois on 12/29/2010!",
            "author": "Richie D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-09-10",
            "description": "I was somewhat ill-prepared for my first visit to Green City Market;  I didn't know I was going to have to \"bring it\" to a farmers' market, but that's because I forgot it was in Lincoln Park.  Next time I will be sure to bring a tiny purebred dog in a purse, or alternatively, a large purebred dog on a leash.  I will borrow a toddler and some skinny jeans to complete my \"market chic\" ensemble, and I will need someone to constantly text on my Blackberry.  Then I'll pwn that market.  \n\nThe best I could do this time was enjoy Zullo's egg focaccia sandwich and apple cider donuts.  Wait, that part was pretty awesome.  \n\nI was intrigued by the tofu vendor and the selection of sandwiches, but ultimately decided that $10 for a sandwich was too much.  They appeared to be high-quality and very large, but still.  I did end up with two frozen veggie burgers from River Valley Ranch.  The sign advertised a burger that was 90% portobella and 10% black bean, so I was in like flynn.  Back at home, they were good with a little goat cheese and a whole wheat bun.  Even my carnivorous lunchmate liked it.  \n\nOn the day I visited, the weather was cool - in the 60s with wind and sunshine.  I felt a little sorry for the Snookelfritz vendor, and may have had a sympathy sample of some ice cream so she wasn't totally ignored (I do what I can).  But, that said, a hot tea, cider, coffee, cocoa or glogg vendor could really be a great addition for the cool weeks at the beginning and end of the outdoor season.",
            "author": "Beth R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-08-04",
            "description": "The produce looked great, if a bit pricey. Not enough eat there choices and the ones there ARE pricey for what they deliver. Parking is a hassle. Still, it's a pleasant environment. I'm glad we went.",
            "author": "John T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-19",
            "description": "I love absolutely everything about Green City Market.  You can find me here almost every single Saturday morning.  There is great variety and dependable organic produce. \n\nMy blog has a review of the market and what I purchased recently . . .  \nhttp://youngfoodies.com/green-city-market-616-visit/",
            "author": "Jessica C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-04",
            "description": "Green City Market is a perfect example of just how amazing Chicago can be.  You walk into lower Lincoln Park and you see children playing, dogs taking naps, musicians banging away on drums and other instruments, and local growers selling their delicious wares.\n\nEverything I've gotten from GCM has been delicious, especially the grilling cheese that....I'm sorry to say I forget to sells it.  If anyone remembers, can you please respond with the dairy's name?  I need more of it or I'm going to die.\n\nBasically, go.  If you go early it's cooler out and there is more selection, but it's also more crowded, so it's up to you.  Do not miss it, even if you don't buy anything.  It's still an invigorating experience.  It really makes you feel like you're part of a community!",
            "author": "Anna B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-24",
            "description": "went to the green city market for the first time this weekend & was very impressed with the large selection of fresh produce!!! it was a bit crowded though (definitely try coming early/also parking is limited), but we managed to browse through pretty much everything. there are so many fresh vegetables to choose from, & the vegetables are so vibrant in color! Fresh red, yellow & orange tomatoes!! we ended up leaving with fresh tomatoes, peaches, japanese eggplants, peppers, fresh basil, cheese & honey. the gcm is a great b/c its located right in the city, but you still get to support the local farmers. there's plenty of samples & toward closing time (1pm) many of the stands offer some great deals on the produce they sell. i'm planning on going back this weekend!\n \n*don't forget to bring some reusable bags to hold all your produce & to help be more eco-friendly!\n*gcm is open wed & sat",
            "author": "Roxy A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-29",
            "description": "The Green City Market is one of those brilliant places where community, culture and food meet to create something quite special. I can't speak highly enough of the dense, veggie-filled Floriole quiches or Zullo's fresh (warm, unbelievable) donuts.\n\nThe market is unlike others in Chicago because it offers familiar faces and open spaces; sitting and enjoying a fresh crepe from Abby's filled with Prarie Pure cheese and Klug Farms greens, listening to a guitarist down the way or taking in one of the market's many demonstrations can be one of the season's greatest treats.\n\nThe GCM combines a remarkable level of hometown warmth with a unique sense of place, with local growers and vendors like Burton's (maple syrup, maple water and other outstanding treats) who remember your name and your preferences week after week.\n\nThe produce is fantastic, as should be expected. Every farm, from Seedling to Heritage Prairie, shows the utmost care for their product and their customers. I highly suggest coming right as the sun bursts through the trees in Lincoln Park - Wednesdays are a wonderful, leisurely time, and Saturdays can get a bit crowded - to grab the best of the vendors' offerings.",
            "author": "Matt S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-19",
            "description": "this outdoor market is open during the morning hours on Wednesday and Saturday.  \nmy daughter and I bought raspberries.  these raspberries tasted just like the berries from the raspberry bush from my childhood backyard.  we also purchased a raspberry mini pie (we really were craving raspberries), tender spinach, a cucumber and tofu.  the tofu is in an inconspicuous area, behind the green wheat grass extractor, in coolers.  the salesman said it is the best and it was pretty darn good.",
            "author": "Sandra T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-04",
            "description": "Walking around the Green City Market is my FAVORITE Saturday morning activity! Nothing beats the atmosphere. Some of my favorite things to enjoy a the market are the crepes, the Seedlings smoothies (in the summer), the Seedlings cider (in the fall), and the grilled cheese. I can't leave without a bag full of fresh in-season fruits & vegetables, and some meat and cheese. I also love buying some of the fresh fruit jams, salsas, or honey as gifts!",
            "author": "Kelly R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-29",
            "description": "The Green City Market is a must see place here in Chicago. Who would have thought you could buy fresh fruits, vegetables, and cheeses ~among other items~ right near the heart of one of the largest cities in the world. Sure, there are several other farmers markets in Chicago, but the size, all year around and pure benefits of the Green City Market in Lincoln Park just do not compare. \n\nI took a group of 15 four and five year olds to the market for a fieldtrip. The information table and several other booths were glad to have the children taste their products and educate them on the true meaning of organic. What is organic you ask? You will just have to go ask. \n\nThe location of the Green City Market is perfect. You can get on the 22 Clark bus or the 151 bus or even the Lasalle bus to get there easily. I think it is a good idea to make a day out of your trip. You can go to the new free Lincoln Park Zoo farm which is located just across the street from the market. At the farm you can taste test several items and learn more about farming, milking and other farm related activities. \n\nI highly recommend taking someone from out of town to the Green City Market. I took my grandma who is from a small town of 19,000 people. She was amazed that right here in the city, she could feel at home on a farm and shop for fresh produce. \n\nOh yeah, I forgot to mention they do cooking demos as well.",
            "author": "Christian H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-06-06",
            "description": "Definitely a five star review.  Green City Market has it all...produce, herbs, grass-fed meat, specialty breads, canned foods and sauces, flowers, and cheese. Oh the cheeeese!  They also have a few stands with food made-to-order.  Lots and lots of vendors, lots and lots of choices.  Conveniently located off the North Ave or Clark bus and an easy walk to the Sedgwick brown line.  \n\nI went yesterday when it was pouring, so I walked very gingerly as I'm apt to wipe out.  Thankfully I didn't, but it would have been amusing to ride the train home covered in mud.  \n\nI left with a veal shoulder roast, asparagus, canned asparagus/spinach dip, cheese and an apple.  I look forward to this dinner.  Dinners with extra fresh ingredients always excite me.  Don't get on me about the veal purchase...it is grass fed and organic.  And, I'm sure, delicious.  It will be prepared by my husband; who will grill it with a nice balsamic glaze.",
            "author": "natalie v."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-10",
            "description": "This is how you get more fruits and veggies in your diet. We bought: peaches, creminis, green beans, corn, red carrots, and two types of beets. And we sampled lots of cheese and pickled mushrooms. \n\nMake sure to bring cash. If you don't, walk over to Nookie's. The ATM fee is only $1.50 and it's pretty close.\n\nAlso make sure to bring your own water bottle. They have one of those water thingies, but they were out of paper cups and everybody was using their own bottle anyway.",
            "author": "Amanda H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-17",
            "description": "Its that time of year, again, to drag your sorry behind out of bed at the crack of dawn, and try to beat everyone else in the city to the Green City Farmer's Market for the biggest, reddest, juiciest strawberries, apparently only available between 7:00am and 7:08am.\n\nI can't quite tell you what the difference is this year, but the Market feels more spacious.  Your still going to bump into people while fighting your way to the front of the bread stand (croissants!  strawberry-rhubarb danish!), but it feels like it flows a little differently, and I'm digging it.\n\nThe best way to get here is by bike or bus, I don't even know how the parking works (I sold my car when I moved to Chicago), just be sure to bring enough bags, and maybe a friend, to carry home everything you didn't even realize you wanted/needed until you saw it and HAD to have it (wasabi goat cheese?  yes please!).\n\nI love to visit the chickens at the Farm in the Zoo on my way out... my nostalgia for living in rural VA hits me hard every time I visit the Market.",
            "author": "Vanessa U."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-11-27",
            "description": "This is my candy store!!!!  And I go to the small one on Wednesday!!  Unfort on Wednesdays they do not have the poultry available, at least the last few times I went.......and I found out the embarrassing way.  Twas raining, and raining hard.  We had the majority of our goods, and were going to check out to see if any poultry was available.  The info tent pointed us in the right direction.  1st tent, nope.  2nd, nope.  etc etc.  We come to the last tent, and I walk up first, my lady in my wake, and ask the 3 people standing there, \"Do you guys have any poultry?!?\"\n\"Um, no, this is a food demo.\"\n\"Ok\"\nAs we are walking away, my lady giggles to me and says, \"that's him.  That's Rick Bayless\".\nShe had no right, but she took away some of my cool points nonetheless.",
            "author": "Philippe F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-09-15",
            "description": "Huge fan. This farmers market gets better and better every year!\n\nYou name it, they have it. Plus, they hold the market all year (at the Nature Museum in the off season). For a $5 purchase, you get parking in the lot at the Chicago History Museum for $9. Pricey, yes, and you can take some public transportation or walk if you're lucky enough to live right by.\n\nThey have everything here. The Nordic Butter is awesome. Cheese, meats, breads, milk, fruits and vegetables, gorgeous flowers. \n\nThey have such diversity that I found tuberose here (grown less than 100 miles away) in the middle of August!\n\nI love, absolutely love and appreciate, that they have little signs on all the booths to show where the seller/farm is located and how far they are from Chicago. \n\nThey have dinners and chef demonstrations. It's a great community.\n\nI encourage everyone to become a member - such a worthy, wonderful cause. I cannot wait one day to bring my family here and have the kids enjoy it too!",
            "author": "Kristen C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-25",
            "description": "Went here for the first time today, granted I've only been here a week. Took a lovely stroll there since the weather was BEAUTIFUL. I think I already have created a love/ hate relationship with this place. \nI love the variety of produce and different vendors. Coming from Houston, I haven't really seen such a large farmers market before. I'm a sucker for locally grown produce and a huge sucker for cheese and fresh bread.  I hate that I just can't help myself when it comes to farmer's markets. Although delicious and fresh, it can also be a money guzzler. =( I also hate that it is walking distance from my place, which makes it easier for me to spend my money. BUT farmer's market greater than the jewel.",
            "author": "Audrey W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-11",
            "description": "Went to the Green City Market 2 weekends ago. I was starving, and had an amazing egg focaccia sandwich. Also bought a nice assortment of heirloom tomatoes, a white eggplant, some fresh corn, and golden raspberries. Overall, a fun farmers market with lots of fresh and exotic food to offer. \n\nOf course, some things were overpriced, but that's up to the consumer, no?\n\nWill be back, hopefully to get some pies from Hoosier Mama. They were sold out by the time I made up my mind =[",
            "author": "Sandy N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-09-19",
            "description": "I like farmers' markets, and this one is particularly excellent.  Today, as I was wandering along through the tables covered with beautiful and aromatic veggies, fruits, herbs, cheeses, breads and jams I could almost imagine that I was back in my village market in France.  That is, until the guy with dreadlocks sat down in a folding chair and began drumming.  It suddenly went from being a lovely market day to feeling like an Occupy Wall Street event.  Hence the four stars.",
            "author": "DD B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-03",
            "description": "This farmer's market is HUGE. Come early as I made the mistake of arriving around 11am. It was packed.   I bought some gorgeous multicolored carrots and berries.  I did not get a chance to buy any meat, they have several vendors for poultry and pork products.  The prepared foods are great. They have a crepe station, a place cooking just mushrooms, Italian and I ended the day with a buttermilk fed pork sausage from one of the vendors.  It was served on an brioche-like roll. The sausage was phenomenal--clean flavors, not too salty.  Can't wait to go back again.",
            "author": "Nhan P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-01",
            "description": "I've lived here for 5 years and yesterday was my first trip to the market, for this I'm very disappointed in myself.\n\nIt was full of dogs to swoon over, samples of fried/grilled cheeses, and buckets of fabulously delicious produce. \n\nAnyone that knows me can attest to the fact that I am a real nut for arugula, I eat it by the boat-load for lunch so I had to have a bag of freshly picked arugula. At $2.50 a bag, it was cheaper than whole foods, and it was the BEST tasting arugula I've ever had. \n\nBring cash (a lot of it), go with friends, and have a crepe for breakfast before picking up groceries for the week :)",
            "author": "Rachel W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-29",
            "description": "Love love love this place!! We usually go to get brunch and have never been disappointed. Had the brat with several kinds of mustard, had a floren-trio crepe, had blueberry smoothies, the grilled cheese, pies from Hoosier mama's.  Everything is delicious!",
            "author": "Aimee R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-18",
            "description": "Very lovely farmers' market - the location is awesome, the products are great, and the vendors offer lots of samples and information about their wares. \n\nIt does the double duty of the best farmers' markets, which I think is to:\n1) Deliver awesome food (MUST try the apple cider doughnuts and the cider at the very least) \n2) Inspire you to make your own!\n\nThis time I was inspired to get some new herbs for my indoor apartment collection, freshly baked bread, and some apples to make pie - can't wait to make good use of all of them and hopefully go back soon!\n\nIt is a little overpriced, more than the grocery store, but considering its location that's not terribly surprising - just make sure you only pay for the truly special items!",
            "author": "Anna P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-12",
            "description": "I had my check list. I had cash. I had some time. I thought I was set, I was wrong. So very... very.. wrong. \n\nI forgot my tote bag, (however I did see a few Yelp ones which made me giggle on the inside). I mean I had a few things to get, but did I need a large tote bag? Yes. Hell yes I did. The thing is, there are so many wonderful and intriguing items that looked and smelled so good, they awoke ideas. They took me to another place. Such friendly people, such decent and even low prices on super fresh veggies, fruit, eggs, milk, meat, pasta, breads, pies, cheeses, butter, herbs that it left my mouth salivating. My eyes bulging from so many possibilities. My heart so conflicted, could I possibly get something from every table? Could I get everything from every table? Oh. Em. Gee.\n\nSurprises were around each corner. Some tables were selling food cooked up right on the grill right there. Some tables just said, \"Here! Try this tomato!\" Products sampling abound, smoothies over here! People of all ages all around me scouring, smiling, hmm hawing over this peach, this apple, this pastry... what wasn't a surprise? Seeing as many smiles and content faces as I did. This place really is a mecca of foodie heaven. How to get to heaven? I'm glad you asked.\n\nGo. Walk right in. No fees. It costs nothing to walk through, but to buy. Cash my friend, cash would be king here. Bring a large bag, don't be like me. Don't think that you would just get a few items that will help make your dinner on Friday outstanding, because that would be foolish. You will laugh at yourself, \"Ha! Silly person!\", because there is too much to not to get. Temptations abound! Get there early if you can before your prized blackberries are all gone. And time. Because in the end, you just need a few more minutes to scope out that tent over there with that awesome corn or all those mushrooms. \n\nI have my bags. I have my memories. I have my determination to get back there. This time with plenty of money in hand and large tote bag in the other and a smile all over my face.",
            "author": "Rob L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-23",
            "description": "The Farmers Market that gives all the other farmers markets an inferiority complex....right? \n\nGCM hits the right note on a few important elements: \n\n1. LOCATION. Right off the bike path, accessible by public transit (walk from Sedgwick Brown, long walk from Redline North/Clybourn), and even some scant street parking to be had. This little crosswire between Lincoln Park and Old Town is RIPE FOR THE (yuppie) pickin', but they let everyone in...even dogs! and babies! Surrounded by a big ol' huge park, bring a blankie, buy some fresh, happy stuff...and have yourself a day of it. \n\n2. TWICE PER WEEK. Yes, twice. Wednesday and Saturday mornings. If you have the option, hit up a Wednesday...much less busy. However, Saturdays are still worth it. Fight the crowds for that produce, peeps!\n\n3. SELECTION: Large and bountiful offerings. Portabello by the pound? Sure. Apple cider smoothies made with sweet cherries ($5, and SOOOO worth it)? YEP. Berries, peaches, fruits, veggies, leaves of every variety, fresh flowers...you name it, they've probably got what you need. The chefs of Chicago don't come here for the run of the mill crappola, so trust that you'll find some pretty stellar shiz to go in your frizz. \n\n4. LOCAL: Farmers from Michigan, Illinois and surrounding all come up, pop a tent and pimp their fresh stuffs. Eat right from the ground we walk upon, my friends. \n\n5. PRICES: higher than your local bodega, but lower than Jewel. You pay for quality. I am currently drowning my computer keys in the juiciest peach I ever did eat, courtesy of Flamin' Fury Peaches. $5 for 5 peaches, worth every penny.\n\n\nIf you haven't seen Food, Inc yet...well go, then I'll see you at the market. Trust me. \n\nTips: \n-bring cash. \n-make a morning of it.\n-fresh flowers make almost anyone happy. Sunflowers easily sub out roses in the summer. (ahem, boys...do it). \n-bring your Yelp eco-tote. \n-bring a blanket, camp out and have a healthy lunch. Lots of great options (mushroom peeps make paninis!)...\n\n\nI biked down to Green City Market. I'm so...urban. Apparently ;)",
            "author": "Colleen C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-04-18",
            "description": "I visited the Green City Market a few times last year. There is a great selection of foods including meats, dairy, canned fruits and veggies, etc. The best part was the section of baked goods. We picked up some stuff and made a picnic with it after we visited the museum.\n\nThe weather looks nice today so we can head back this morning.\n\nTodor Krecu\nhttp://hotfortea.yelp.com/",
            "author": "Todor K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-19",
            "description": "I love the GCM!\n\nI recommend getting here right when they open.  It gets crowded fast.\n\nI love getting here early and grabbing a cup of coffee (for a donation) at the info booth and strolling the market before I decide on what to buy.\n\nOr if I come in the afternoon, when it's hot, I grab a 100% fruit popcicle from the seedling fruit stand.  Best thing at the market!!\n\nI love all the produce here and the variety of meats available.  Only wish the market was able to sell fresh meat.  \n\nIf you haven't come to the GCM  yet, do so ASAP!",
            "author": "Lizzy P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-05-22",
            "description": "3 cheers for Farmers Market season! Hip hip hurrah, hip hip hurrah, hip hip hurrah!! I wandered over to Green City market this past Wednesday on what can only be described as PERFECT weather. It was glorious indeed my friends, the sun was shinning, it was 75 degrees with a light breeze, trust me it made the 1 mile walk there from my office simply delightful.  FYI--if you are planning a trip, go early because some vendors run out of stuff quickly.\n\nNow it is really early in the season, so there isn't alot of variety at the moment, you must wait a bit for the fruits to come in. What they do have currently is lots & lots of asparagus, rhubarb, and tons of fresh herbs. They are the potted kind so you can purchase & then plant right away. They also have wonderful organic pastries, breads, lettuce, canned tomatoes, mushrooms, meats, cheeses, etc. \n\nIf you are looking for some more variety, I would wait a few weeks and then hit up the market. There are some downsides to this particular setting though: \n\n**No parking--it is located in Lincoln Park not far from the dairy farm section of the zoo \n**CROWDED!!! does not mattered if you go Wed or Sat--this place gets packed. \n**STROLLERS--I cannot even begin to tell you how many times I got knocked in the legs by people pushing strollers--honestly people--LOOK!! \n**Layout--they pack a ton of stuff into the area and it can be hard to get to certain booths because of that. \n\nI look forward to going to this market often over the next few months.",
            "author": "Unity O."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-08-01",
            "description": "This market was not that large but I guess I am not sure what I was expecting.  Husby and I were in town so my parents, sister, and her husband met up here.\n\nIt was hot. There were too many big dogs walking around.  There didn't seem to be much of a varied selection in regards to produce.  A lot of stands sold organic, grass-fed meats that looked like you had to order and have it delivered later.  One place was making food and it smelled fantastic.  I saw a lot of cheeses but couldn't get close enough to steal a sample.\n\nI think there were just too many people and too few stands.  My parents raved about it and said many restaurants purchased things from this market.  Looks like they get all the best things.",
            "author": "Sara M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-05-22",
            "description": "Saturday mornings are simply the best time of the week.  I won't get into details but if everyday started as a Saturday, I would die a happy, happy man.\n\nThis is definitely the largest market I've been to in the city.  I love the chicken, turkey, butter and fresh egg options available that I cannot seem to find elsewhere.  As with many markets, you'll find booths selling the same items so walk through the whole market before you settle on one purchase.  Being spring, asparagus and rhubarb were found everywhere along with many different types of fruit and vegetable plants that can be transplanted in your own garden.\n\nThe downside?  Too many people.  SUV strollers were causing pedestrian traffic jams and dogs were barking everywhere and getting in fights.  I'm really not in the mood to get bothered with such things at 8 AM on a Saturday.  My advice would be to head early, avoid the rush, and get your pick of the produce.  An hour is all you need to make a full swing around this place and buy to your hearts content.  I will be back.",
            "author": "Dusty K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-03",
            "description": "Green City Market is a must not miss for Northsiders. \n\nAfter a peaceful Friday night in I decided to head to the Green City Market on Saturday morning for some fresh produce for a dinner gathering that night and to check out the scene that IS the Green City Market. \n\nThe weather was not so great and threatening storms and STILL it was PACKED. Had to walk around for a bit to find a pole to lock up my bike and the place was just crawling with children and strollers and young parents. Definitely not for those with little patience for children as I was ran over by strollers at booths and pushed through by small children clamoring for samples. \n\nNow onto the good part. THE FOOD. Most of the booths are selling similar things as they all have what is in season. Some booths are friendly than others and some are just not (ehem...Hoosier Mama Bakery.) I enjoyed a lamb bratwurst with sauteed mushrooms at the fest and like it so much I bought a pack of them. I also had an excellent berry smoothie made with apple cider from a very popular booth. Be prepared to wait for food prepped at the fest, though it is certainly worth it! \n\nThe produce was super fresh and I thought, very reasonably priced. The meat was also an excellent value with both the lamb brats and a pound of bacon at a much lower price than a grocery store. \n\nGo, enjoy the weather, try the different foods and do something good for the world while your at it :)",
            "author": "Ashley V."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-05-11",
            "description": "Ryno and I had a great time walking to the Green City Market on Saturday! (Yes, you can bring your 4-legged friend as long as they are on a leash!) \n\nThere were a variety of veggies, baked goods, cheeses and meats that were available for purchase. Also, they were selling yummy honey that's farmed 30 miles west of the big city as well! I'm gonna have to pick up some of that next visit. \n\nI got a spring salad mix, which I dressed up with some (of my) home made cilantro-balsamic vinaigrette on my sandwich, and it was SOO good! \n\nAlso, a bakery from Evanston had a booth there, and their asiago herb ciabatta bread was super tasty!\n\nI'm going to come with a bigger bag next weekend so I can bring home some more veggies! :-)",
            "author": "Erin B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-10-22",
            "description": "Directions for a perfect Wednesday (or Saturday) morning:\n\n- Follow your Autumn wanderlust through the park, ending at Chicago Green City Market.\n\n- Fuel your shopping experience with a cup of robust Intelligentsia coffee. \n\n- Order a thin-as-air sugar and butter crepe. If you're more sweet on savory, get yours filled with fresh herbs and cheese.\n\n- Peruse the vendors' goods and find fresh apples, pears, berries, squash, tomatoes, pumpkins, herbs, breads, cheese, jams, pierogi, cut flowers... I could go on forever so I won't!\n\n- Sample the cherry-kissed apple cider. \n\n- Stand back and take a look at our beautiful city, the turning leaves against the backdrop of a clear cerulean sky, and breathe in the crisp, dry air. \n\nLife is good... buy local.\n\nNOTE: Green City Market is now open all year-round. From January 17 - April 18, 2009, the Market will take place on the 1st and 3rd Saturday of each month.",
            "author": "Jelena Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-11",
            "description": "Yay, the Green City Market is back in Lincoln Park for the summer/fall!  Heaven for foodies.  Even though it was quite chilly this past Saturday, I ventured out to see what sort of local goods I could pick up.  There was asparagus galore, lots of scallions and rhubarb and herbs - all the good springtime fare.\n\nIn an effort to buy and consume more local and organic ingredients, I heaped my bag full of asparagus, fingerling potatoes, a couple of tomatoes (these aren't quite at their peak yet), and a lovely little rosemary plant for my windowsill.  All this for $11 was a pretty good deal, I thought!  And you really can't put a price tag on knowing that you're not feeding yourself and your family nasty chemicals and pesticides.  To me, that is infinitely valuable.\n\nI was eying the beef from an Illinois farmer from Mendota (middle of the state, I believe).  I may have to spring for a couple steaks at some point this summer.  Grass-fed, hormone-free beef rocks my world.\n\nThe Green City Market will be a weekly event for this foodie.  Looking forward to berries and tomatoes and corn and all that good summer produce, straight from our local farmers!  And who knows, you might get a glimpse of a \"famous\" Chicago chef? :)\n\nAlso - next time I'll come hungry - the crepe stand looked amazing!",
            "author": "Emily Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-24",
            "description": "Best farmer's market in the city! Am I biased because it's across the street from my house? Probably but deal with it! I also love that it's year round though I'll admit, I frequent it much more in the summer when it's outside, but it's nice to have the option. I have never encountered an unfriendly farmer or vendor, and though the prices might be higher and the produce doesn't last as long as that bought in a grocery store - there is a reason! Everything is organic and pesticide free even if it's not \"certified organic\" (a very expensive process to just get a stamp on your food), and I love that all the farmers are local (I think I read within a 2 hour drive?). It gives me great pleasure to support these local farmers, get fresh, pesticide free veggies, and maybe indulge in a crepe, pastry or grilled cheese while I'm wandering around",
            "author": "Becca S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-04-08",
            "description": "Love the quality of the fruits, veggies & flowers! A fresh crepe first thing in the morning isn't too bad either. \n\nCan not wait for May 6 to come ---- Green City Market goes back outside!",
            "author": "melissa g."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-09-04",
            "description": "If going to this place makes me a snob, well then I'll permanently wear scotch tape on my nose to look the part.\n\nMan do I love this place!  From the absolutely fresh produce, to the completely cool and different things I find here, this has become a weekend tradition for my SO and I.  \n\nAmong the items I have discovered and loved since visiting this place two years ago:\n\n(1)  Chicago Honey Co-Op Honey\n(2)  Garlic Scapes\n(3)  Handbag bread\n(4)  Turkish Eggplant\n(5)  About 20 different varieties of tomato\n(6)  French shallots\n(7)  One helluva awesome French baker (southwest corner of the market)\n(8)  Patty pans\n(9)  Eight ball zucchini\n(10) Japanese zucchini\n(11) Hen of the woods mushrooms\n(12) Some sort of cheese that you can grill but doesn't melt\n(13) Michigan fruit -- all of it from the blueberries to the cherries to the apples to the nectarines.  All of them are good!\n(14) Damn fine crepes\nand (15) Butternut squash\n\nI can't begin to tell you how many hundreds of meals I've had in the last year that have included vegetables or produce of some sort from this market.  And I can't begin to tell you how much my appreciation of food has grown as a result of this market.\n\nGive it a try.  Bring $40 and let the creative cook in you go crazy!  You'll love it!",
            "author": "Justin B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-08-02",
            "description": "What do you get when you cross lovely, fresh, organic produce and cracked out/drunk people yelling at each other at 7:15 on a Wednesday morning?  You get the Chicago Green City Market.  Not that I am complaining, mind you, I SO dig on the urban \"performance art\" that constantly surprises you in Lincoln Park, for some reason, though, when its that early in the morning its somehow surreal.  Bring coffee, you will want to be awake and alert for this.\n\nMany tents offering a lot of the basics (peaches, berries, tomatoes, squash) and some throwing in a few little oddities (french breakfast radishes, anyone?)  There is also a meat vendor, bread vendor, and what appeared to be...crepes?  No way!  (Side note, I didnt get to try them as they were still setting up, damn).\n\nStuff is super expensive, which is to be expected for that quality and that neighborhood, but you can get discounted parking in the very convenient Stockton Drive lot for $4.   When I was there I bought some gorgeous cippolini onions, french bread and squash blossoms.  \n\nI would recommend going there on Wednesdays, it seemed to be very low-key and laid back.  My heart started palpitating imagining the scads of hyper dogs, strollers and toddlers that I felt sure appeared on Saturday mornings.  \n\nSmall, but well worth it.  Especially if you get a free show from some weirdos a few hundred feet away.",
            "author": "Carolynne M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-09-18",
            "description": "I was here 2 weeks ago. \n\ncame on Wednesday.\n\nwas not crowded because it rain hard on Tuesday night and early Wednesday morning.\n\nthe grasses were stll soaking wet.\n\nthere were only a few stands.\n\ndid not find the Amish stand(I found them the next day in the loop).\n\nbrought some nice honey crisp apples and sweet juicy peaches from a Michigan farm.\n\n--2 apples for $3 a pound.\n\n--5 peaches for $6.\n\nyes, more expensive than the supermarket but everything was really fresh.",
            "author": "Linda C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-05-22",
            "description": "The start of Farmer's market is the signal that summer is here!! Now that I have a shorty, I need to find places that are family friendly and interesting for my baby.  Lots of vendors from Wisconsin and Michigan with quality offers, we picked up flowers and veggies on this trip.  Best part about this is the location right next to LP Nature Boardwalk...mommy gets to socialize with the GF on a lazy saturday and baby gets to see the animals and natural habtat.  A win-win situation!",
            "author": "shirley m."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2006-06-18",
            "description": "If shopping for local organic produce doesn't make you and your body feel good, nothing will.  Not only is it good for you, it is good for local farmers as well as the environment.  This location has a lot of vendors so it is worth going to, and being at the Park just makes it more enjoyable.  \n\nOne thing to keep in mind though, take public transportation, parking is tough.  \n\nAlso, get there early.",
            "author": "Urszula H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-06-01",
            "description": "I like coming here, especially early early i the morning. It really makes me want to rush home and start cooking!\nThe apple zeppelotes(not sure how to spell) are great! Deep fried apple donuts with cinnamon sugar! Hot out of the fryer!\nIt's seasonal which I isn't a bad thing at all but you can't go in with a game plan...I think that was my problem. You have to just see what's there and plan accordingly and you will never be disappointed.\nI learned to love rhubarb two weeks ago and will go back as many Saturday mornings as I can!",
            "author": "Pontip M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-09-18",
            "description": "I'd been dying to go here for awhile, but why get up early on a Saturday to trek it to Lincoln Park when there's a wonderful market right down the street from me?  But Top Chef the Tour stopped here so now I had an excuse to leave work early and venture out to the market.  \n\nIt wasn't quite as pretentious as I had had in mind all this time.  There were so many vendors it was insane.  So many choices.  I liked seeing people being recognized by vendors and saying hello.  I thought this thing was so big that it wouldn't have any personality.  I wanted everything...and what made it worse is that Bleeding Heart Bakery was there (in a far off corner which I was not happy to see) and then all the great freshness around me!  \n\nDownside, with it being so large I had to walk to the zoo to use some form of facilities...why aren't there any port-a-potties or was I missing them?\n\nAlso, apparently they close at 1:30 but around 10 til 1 everyone started breaking down their booths with people still milling around.  A couple of places I didn't even get to.  I was hugely disappointed with that.  \n\nBut I'll be back and I can't wait to finally get up on a Saturday for a lovely bike ride (or call off work on a Wednesday) to visit it full and apparently get there waay before 1 PM!",
            "author": "Lindsay S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-06-11",
            "description": "This market is open Wednesdays and Saturdays.  I have to say that for a Wednesday at 7:30 in the morning it was full with a lot of folks.....some look like it was a stop off before heading into the office (*grin*....I used to know what that was like).  The vendors rotate, some coming in every other week or even once a month, which is a positive in my book as it keep it changing as well as something to look forward to week to week or even month to month.\n\nStands that were there had a good assortment of fresh herb plants (basil, thyme, oregano, etc), nice arrangements of cut flowers.  Many stands with fresh produce - and an excellent amount of heirloom tomatoes, which are an issue due to problems in other states.  Meats included sheep and elk.  Several stands were selling prepared dishes/meals right there on the stop.  Breads and pasteries were also abundant.\n\nThere are two area on the fringe of the vendors rows that have nice plastic chairs to sit down and relax or enjoy something you just purchased.\n\nSo why 4 stars?  Well parking is tricky and there is lot near by, but $9 at standard price for 2 hours with a discount to $5 if validated in the Green City Market, but I still think that is pricey.  You can park on the street for free until 9am.....IF you can find a spot.\n\nNext the prices were a bit high, but consider these folks are driving some distance to make it to this location I can understand if gas costs are baked into some of these prices.  I'd say everything was $2 to $4 more than what you'd find in say a Whole Foods based on grocery shopping I did just 2 days ago.\n\nConclusion........This is must see for anyone.....great quality food, a ton of selection compared to other markets, and true support for sustainable relatively local growers.",
            "author": "Michael E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-01",
            "description": "A delightful early morning experience every time!  I cannot resist the  flowers, sweet peaches and raspberries.  Although the prices aren't a bargain - like $4 for a teenie box of raspberries - you can buy 4x that amount at Costco for $3.99.  That's ok, it's not lovely shopping at Costco.   With the wind blowing and the sun shining on my back, I am a happy  shopper.  I always find cute families and LP'ers with their green shopping bags frolicking through the park, buying fresh breads, jams, honey, flowers, veggies, fruits and many other items.  In addition, there are coffee and lunch stands serving up some incredibly tasty, healthy items.  Now that I am addicted to the flowers and fresh produce, it's hard to resist this glorious shopping in the park.  A must on Wednesday and Saturday mornings.  \n\nParking is scarce because the farmers park their large trucks and vans  on Clark Street and therefore take up a considerable amount of spots.  Go early (like 7AM) for best parking, picks and to avoid the crowds.",
            "author": "Maria R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-09-20",
            "description": "So they do have many items but I feel that you can get similar fresh veggies and breads at other farmers markets throughout the city. After fighting for parking we had to step over so many strollers and dogs that we were more frustrated with our experience there. We do love going to the farmers market but are going to stick to the ones that are closer to home.",
            "author": "Bari L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2006-07-02",
            "description": "We were mesmerized by this amazing farmer's market. We went memorial day weekend so the selection wasn't what it could have been yet. They also have a bit of a mini food court. The organic crepes and burger are fantastic.  The burger comes from the owner of Campagnola and is one of , if not the best one I have ever had. The beef is organic and comes from one of the stands there.  There is a Panini's stand at the eastern edge of the Market.  Bennison's bakery from Evanston has a booth as well.  GCM also makes crepes that are better than anywhere in Chicago.   This is definitely worth a trip from anywhere to attend Chicago's most well known Farmer's market.  Its a bit pricey, but worth it.\n\nIn the winter time, Green City Market moves inside to the Notebaert Nature museum.",
            "author": "Alan R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-20",
            "description": "Why does it seem to always rain on Wednesdays (aka Green City Market days)? It is an odd phenomena indeed! Luck for me though the rain held off until yesterday afternoon making a trip to the market a true treat. Intelligentsia coffee. Check. Beautiful weather. Indeed. Tasty breakfast in hand. Oh yes. Perfect way to start your weekday!\n\nI am one of those people that usually starts the morning with the breakfast crepe, but I think I'll try something else in the future. My $8 crepe was ho-hum on the latest tasting and with so many great options to choose from why spend your money there?",
            "author": "Robyn T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-06-17",
            "description": "It's tough for me to imagine anyone scoring this market lower than five stars. Of course there are always geographic snobs who are certain nothing in Chicago could ever be as good as what they had in Napa or Duchess county or some other place that is not here or relevant, but by all logical yardsticks, this place deserves top score. Early in the year (May and June) you will only find spring vegetables (fresh onions, garlic, asparagus, greens, strawberries, and rhubarb). But it's still a great source for meat, baked goods, cheese, and eggs (really, get the eggs!). Come July when the produce starts to fill in, expect everything including things you've never heard of. \n\nMore than shopping however, this market is really fun. The people-watching is great, celebrity chef spottings are common and occasionally the professional athletes that live in Lincoln Park will saunter over with their families. Regardless of time of day, find the grill stand and order the hamburger - not the fancy one, mind you, the plain one with burger, aioli, and lettuce. Wait in line for the epi baguettes (the one's shaped like rose thorns). Use the queue time to make new friends. Watch the chef demo or listen to some folk music. Have a breakfast picnic. Whatever, it's a perfect way to start a day.",
            "author": "Curt C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-14",
            "description": "There're good reasons why Alice Waters has called Green City Market \"the best sustainable market in the country.\" Very good local organic produce. Good selection with some unusual items. Interesting cooking demonstrations by top local chefs. Pricey (even higher than Whole Foods). Bring cash. You'll need it.",
            "author": "AJ H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-05-23",
            "description": "This was my second time checking out the Green City Market.  They have some excellent cheeses (with samples) and a plethora of plants and veggies.  I was hoping to pick up some fruits but by the time I got there (around 10 AM) there wasn't much to pick from.\n\nThe market can definitely get very very crowded.  People often bring their strollers and doggies.  I'm sure as it is with every open market: go there early and avoid the rush.  I'll check it out again and hopefully they can gain some more stars back.",
            "author": "Chris C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-08-11",
            "description": "Go here on Saturday religiously.. unless I've had an incredibly late Friday night.  I always come home with a very large bag of fruits and veggies.. and an empty wallet.\nMost of the vendors are super friendly and are willing to answer my dumb questions about how to cook certain veggies.. I learned how to do artichokes last week, so ask if you need pointers :)\nIf you get in good with the vendors, they tend to give free stuff (I got half a pound of garlic this past week!) or discounts.. or maybe they all just have a crush on me (kidding..)\nShopping here is expensive but a good way for me to stay healthy for the summer.",
            "author": "nicole h."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-07-04",
            "description": "I went with expectations that this would be a great market, but was a bit disappointed.  First of all, it's fairly small.  The ones located in the loop and Dearborn/Divison (if it's still there) are much bigger and offer a lot more.\n\nWhile I enjoyed the various samples, I didn't find much to be outstanding.  I did buy a jar of this addictive asparagus-spinach dip.\n\nAt times, it was also a bit difficult to get the attention of some of the vendors.\n\nI think if I'm in the area, I'll stop by, but I definitely prefer the markets in the loop moreso.",
            "author": "Rachelle G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-05-18",
            "description": "I love the green city market!\n\nGreat quality (way better than you will find at any store) and you get to stand face to face with the actual farmers- so you can ask any questions you might have (i.e. how to cook a new veggie you've never tried, how to care for potted plants, etc)",
            "author": "Mei J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-01-08",
            "description": "One of my favorite things to do on a Saturday morning is to head down to Green City Market and pick up enough produce, herbs, and bakery for the next few days.\n\nThe selection is fantastic and the crowd is manageable (minus the stroller crew). Some favorites are Bleeding Heart Bakery and the Chicago Honey Co-Op.",
            "author": "Slu S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-01-21",
            "description": "This Farmer's Market is open twice a week at a prime location in Lincoln Park. It's also an ideal location because you can easily get there via public transit or driving. it's also open YEAR ROUND! Most farmers markets are not open during the winter months, and in the winter the farmers market is located indoors.\n\nThe only thing I don't like about the farmer's market is that it is a little pricey. I usually associate farmers markets with good deals, and fresh local food is always important to me, but spending a lot of fresh produce is not something I can always afford to do.\n\nAll in all, a wonderful, farmer's market, it's especially beautiful in the summer since it's just off the lake and in Lincoln Park. Everyone should check it out one time or another!",
            "author": "Emily E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-05-31",
            "description": "Although early in the season, I was able to find some yummy things: asparagus; mixed greens; sprouts; and goat cheese.  You will pay a little more for the organic bounty, but I am impressed with the freshness and quality of my purchases.\n\nIf you are driving, you can park in the lot between Stockton and Clark, off of Clark.  $9 with validation from the Market (main info desk).  \n\nI can't wait to visit more this season!",
            "author": "Jo-Elle M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2010-06-02",
            "description": "Green City Politics !\n\nSo we went to the green city market today on our bike for some river valley five cheese spread, only to find that they are not allowed to sell it anymore.  Because  politics are interfering with commerce and the customer i will sadly steer clear from this once great market and shop at other city markets like the one on Armitage and Halstead every Saturday.    I filed a complaint with a bored house wife volunteer who told me it was because the cheese was not grown within 5o miles of the blah blah blah.... really?  Then why is the bronkow mass produced cheese still being sold there I can get that shit at jewel?  why is refrigerated meat being sold there?  Green City Committee members should listen to customers wants and needs instead of playing High horse and thinking they are always right.... Soon it will be a sea of root vegetables.   Get your shit together Green City, Sell us what we want not what you think we should have.   BOOOOO to you and your shit stain policy.  Also what's with the crepe stand then?   were those crepes grown locally you fucktards?",
            "author": "tr y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-23",
            "description": "The Green City Market is great. It serves as Chicago's premiere farmer's market, allowing urban dwellers to purchase fresh, organic, and, most importantly, seasonal produce. Yes. I said that it being seasonal is most important. Why? Because produce eaten while in in season tastes better. Of course, these are just the short-term benefits. It also helps support local, family-run farms, of which this great nation has all but killed off. Anyway... This is a review, not a diatribe against our nation's farming practices. Moving on.\n\nThere are a few bad things about the market. It can be overly crowded, somewhat expensive, and I have to take the Lincoln bus, which is not my favorite CTA bus line by any means. None of these, however, are that big of a deal. \n\nMy favorite part of the market is planning the weekend's, and some weekday's, meals around it. I see what is available and decide what to make from there. Also, I love the eggs from the market. Some of them are incredible and fresh as can be. I always try and get at least one product that I am unfamiliar with so that I can then look it up and figure out what to do with it. It makes for a great way to learn about cooking.\n\nNow, I will admit that one would have to be quite wealthy to do all their grocery shopping at the market, not to mention quite knowledgeable about cooking, so it isn't worth stocking up for the month. That is also part of the reason it is open twice a week. You go, get a few things, cook something nice and fresh, and go again when you need something... Like most of the rest of the world.\n\nAs for a few of the complaints that I have seen, such as price, selection, and parking... Come on. Really? You can get cheaper groceries at Jewel, but not always by much and most of their produce is horrible. And it is still too early in the growing season for a full on variety of products yet, so just be patient. And last but not least, unless you live in the suburbs, you do not need to drive here. The city has many other methods to get you there (ex. feet, bikes, buses, etc...).",
            "author": "Justin R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-05-18",
            "description": "We took my mom here Saturday morning and lo and behold Rick Bayless was there. I love him. Ive been watching him on PBS for years and I started to stalk him around the market hoping he would sign my boob. \nHe is probably filing a restraining order now. \nNot a lot of good produce right now, I stocked up on asparagus, but its may so I know good times lay ahead  for produce lovers like myself. I cant wait for the berries, the cucumbers,tomatoes, the squash, yipppppeeee. \nSo I know I will definitley be back in the coming weeks. Farmers markets remind me of being young again back home in the country when my parents would grow all the fresh produce and I would go out to the garden and eat things right off the vine. \nOh memories.",
            "author": "Austin A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-09-15",
            "description": "I love supporting local business and farmers, and this place is great.  Some interesting produce I have never seen before, plus bakeries, fresh breads, a freshly made crepe stand, flowers, etc.  A nice Sat morning stop in before I go about my day.",
            "author": "Lauren H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-08-14",
            "description": "I come from California, the land of expansive year round farmer's markets that are a (snotty, yes I will admit) way of life. \n\nSo, having moved to Chicago, I lowered my expectations, did my research on yelp, and chose the chicago green city market as my first farmers market to visit. I thought that the whole thing was quite small. I found some good japanese eggplants, and some divine red russian garlic (at $2 a head...so worth it). But the tomato selection was pitiful, and the one (WHAT only one???) cheese vendor's 7 or so selections all tasted pretty much the same. The grillable jalopeno cheese wasn't too bad. But I recommend that you microwave the stuff because the middle doesn't get gooey enough if you grill it. The crepes weren't too bad either, but the wait is pretty long (25 minutes at about 10:30am) and there are only a limited combination of savory goods you can put in them (cheese, tomatoes, and/or herbs).\n\nMaybe I have unnatural expectations for midwest farmers markets...I do come from the land of farmers markets with Bill the Oyster Guy and the tamale lady who will provide great stories along with her handmade tamales. So it's three stars for now, until I try out some others. Recommendations will be greatly appreciated.",
            "author": "Jenn L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-30",
            "description": "Yum yum yum.  I finally made it over here on a nice Saturday morning to try breakfast from some of the stands.  I had a crepe that was fabulous.  It was the cheese and veggie one, where you get to pick from 2 cheeses and like 5 veggies.  Herbed cheese, portobellos, caramelized onions...mmmm.  My boyfriend got a panini, I think from Zullo's, which was to die for.  The bread was made fresh that morning and so amazing.  The filling was a lamb and veggie egg scramble.\n\nThe prices are a bit too lofty for this to be a regular thing, but it's definitely a nice treat on a gorgeous day.",
            "author": "Tera D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-07-13",
            "description": "You know what I love? The Green City Market on a Saturday morning in the summer.  Although, I also love it in the fall and winter.  \n\nI unfortunately had not gone yet this summer (I know, I know...I've been busy and I'm disappointed in myself) and boy have I been missing out.  I think this had tripled in size from last year, and I'm loving all the new additions.  \n\nI love roaming from tent to tent, checking out all the delicious produce, cheese, meat, and flowers.  I probably make two or three laps before I start purchasing anything, just to take it all in.  I walked away with a pound of red potatoes, green beans, raspberries, blueberries, and a jar of strawberry/raspberry preserves for $17.  \n\nI ate breakfast before I walked over which was such a mistake.  On top of all the places selling food to take home, they had a bunch of tents making food like smoothies, crepes, sandwiches, etc. I will definitely make sure I go with an empty belly next time.  \n\nAnd did I mention that my favorite part is that this supports local farmers and you get delicious and fresh food?? You know you can't resist.",
            "author": "Melissa R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-07-16",
            "description": "The produce is always top-notch, even if it is a little expensive.  But you won't really pay less if you shop at WF for your organic produce, and at least at the Green Market you're supporting the individual farmers.\n\nThe baked goods have been fantastic each time we've gotten them, and the crepes are very nice too.  Still, the main attraction is the produce, and I haven't really had a bad experience with it yet.",
            "author": "Ang R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-11-13",
            "description": "For those who like to cook... to meet those who like to grow great fruits, vegetables, animals... a great resource for foodies!  \n\nYou gotta get there early if you wish to avoid the crowds.  It is definetly a Lincoln Park/Gold coast twice weekly event.  \n\nI enjoy having to cook seasonally.  Soups are big on the menu these days.",
            "author": "William Laurence P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-08-04",
            "description": "I tried the Green City Market for the first time last Saturday and it was amazing.  I plan on returning every week from now on.  The broccoli is amazing.  I bought a basil plant, fresh salad greens, cherry tomatoes (the best I've ever had), blueberries and some freshly made salsa.  I have been using all of my produce in meals.  In fact, Saturday night I made vegetarian Kabobs with Green pepper, onion, cherry tomatoes and potatoes from the market.  \n\nThere is also fresh milk and grass-fed and free-range meats available.  There were also tons of vendors making sandwiches and other meals.\n\nI will return this week and the weeks after.",
            "author": "J R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-19",
            "description": "comparatively, green city market is pretty big, one of the bigger in the city. the large variety of tomatoes is impressive, and vendors will usually label them. i love tomatoes, cooked or raw, so loved the opportunity to try ones i'd never had before. \n\noverall, though, i wasn't blown away by the selection of produce considering how big the market is or its reputation. it seems that many of the vendors sell the same things -- lots of tomatoes, green beans, peppers on the saturday i went. only a couple were selling herbs. \n\nif you've never been before, it can be a little confusing with the way the tables wind in various directions and irritatingly crowded. it's hot in the summer standing out in the sun waiting to get mushrooms along with a zillion other people and their kids and grandmas. i was surprised by how pricey everything is--almost on par with whole foods, which is as pricey as food gets. no wonder most of america is overweight. they can't afford fresh produce even if they went to the farmer's market here. \n\ni'm willing to pay more for quality and fresh food, but it is also hard to tell what is organic, and what is not. some vendors have signs, but it would be nice if they organized the vendors around organic or not like they do at the farmer's market i used to frequent. \n\ni'll probably be back to give it another try, maybe earlier in the day.",
            "author": "Dao N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-31",
            "description": "My review of the market really depends on what time of year it is. It is readily accessible in the summer or winter. \n\nIn the summer, the place has great produce - tent after tent after tent of bins and tables of brightly colored fruits and vegetables. It gets hot and crowded, so I suggest coming at opening. The prepared food is really good, but again if you aren't there early, you will wait a while to eat. All the vendors are friendly and you can see the wheat grass guy trying to get people to buy his shots of health. 5 stars, even with wheat grass guy. \n\nWinter is tough. The Nature Museum is hot, no one is ready to go at opening, and really - Illinois in the winter... it's a wonder that anyone survived here before modern conveniences. So there's not much choice. Really, the only good thing here in the winter is the beef. 3 stars. \n\nOverall? 4. It's really neat to have a farmer's market in the city. Just remember it's not organic or free range and it's not as local as you think.",
            "author": "Rebecca H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-09-19",
            "description": "This place was beyond my wildest produce dreams!\nIs it weird that I drove 3 hours for this? I say no.\nI loved it. It was bigger than I was expecting with lots of variety.\nI got there bright and early at 7AM and it was relaxing as all get out. \nI feel like I tried everything. \n\nCrepes? Ehhhh. Not impressed. \nThe pie lady had some cherry cobbler that ruled it, plus she was super sweet. Apple cider smoothies = bad.  Apple cider donuts = yum! \nThe flower ladies had some BEAUTIFUL stems. I made out with 30 bucks worth of flowers in that tent. Gorgeous stuff. Another bakery tent was selling plum raspberry cobbler. Loved the unique combinations; totally delicious. \n\nAll of the vendors were so friendly and attentive and it was just a really great experience overall. Also great for horse watching. I mean dogs. Yeah, dogs. Huge ones.",
            "author": "Liz R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-06-10",
            "description": "I love the green market and do as much shopping as I possibly can there.  Everything is organic, local and super fresh, so you don't have to worry about where the food is coming from and what has been done to it.  \n\nOf course, because it is all local stuff, the variety of produce available shifts and changes throughout the season.  In May, you'll see the usual spring suspects:  asparagus, lettuces, greens, rhubarb.  Now that it's June, the strawberries have shown up and I couldn't be happier!  Soon enough, there will be brocolli, peppers, corn, eggplants, every kind of heirloom tomato you can imagine and more.  I can hardly wait! That is the greatest part of the market really - every week it changes and you get to see and try different things.  It's not like a supermarket in that you expect to see everything you want to buy all season long.  There are no peaches to harvest in Michigan in May.  But when the peaches do come in mid-summer, they blow away anything you can get at the supermarket.\n\nIt can be pricey, but it is so worth it.  Think of it like this - you don't have to add much to this food to make it wonderful.  So instead of spending money and time on trying to make unappealing supermarket veggies shipped in from who knows where taste good, all this stuff needs is a dash of salt and pepper and it tastes twice as good.  My boyfriend thought he hated brussel sprouts until he tasted the ones I roasted after buying at the green market that morning: sweet, tender deliciousness!\n\nFresh produce, ciders, flowers, crackers, breads, cheeses, meats and eggs can all be found at the market, and honestly, you really can't go wrong here.  Also, it is a great thing to support local, independent farmers and to have the opportunity to actually talk to the people planting, growing and harvesting the food you eat.  \n\nIn addition to the produce, be sure to try the shortbread cookies at Floriole's stand and any of the breads at Bennisons.  Heavenly!",
            "author": "Claudia B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-07-10",
            "description": "Best farmer's market ever.\n\nMake sure to hunt out the Eat Green Food granola bars -- even though the Green City Market won't let them sell the peanut butter and chocolate ones because they're not totally local.  Although that makes me somewhat sad because they are my favorite variety of the bars, I think that speaks to the authenticity of the market.\n\nI know there are green markets in New York, but I really miss the Green City Market.",
            "author": "Kathleen B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-07-02",
            "description": "Going to the Green City Market to buy food is like going to a bar to drink.  You know that you can buy a case of beer for $15 and drink at home on your own porch or you can go to the bar and spend $5 per beer and sit on the bar's patio.  You know most of us choose the latter because it's more social to go out and enjoy time with friends, people watch, and what would we yelp about if we all stayed home??\n\nSo yes, the Green City Market is more expensive than your average grocery store, but it's more of a social experience.  At times I've come out not buying a thing, but just enjoying the weather and people watching.  It's a great activity for a beautiful summer day.  Plus they have some great items you can't find in stores.  For instance, I bought this asparagus spinach salsa that you can mix with cream cheese or hummus....it was gone in the first few days I had it.   I also bought this cheese that you grill...it's called bread cheese.  It tastes like grilled cheese.  Pretty neat.\n\nI think everyone should check it out at least once.  It's a good time!",
            "author": "Amy S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-30",
            "description": "I really like this market.   I still think the Union Square is the best one in the world - but this is really good.  Love the food demos, and lots of great vendors.  There's a really quirky old vendor who gives change in $2 bills, which is sort of amazing.  Also love that one vendor has mint iced tea.  Tried the burger stand - great meat, though they put a little too much stuff on it for me.  But, it's good - next time the crepes!",
            "author": "Haley S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-26",
            "description": "I think I was there at just the right time: a Saturday in late July, when pretty much allll the stuff ya love is right in season! People were getting pretty nutty over the sweet corn, and rightly so: it was 75 cents an ear, and let's just say this is not your Jewel's sweet corn....and I honestly didn't know there were so many varieties of potatoes (purple ! who knew?)! \n\nGreen City Market is a delight. I wish there were even more vendors! Those that were there were incredibly friendly and had such amazing products. You'll see quite a range, from bakeries to dairies and even homemade pasta and a honey co-op.  I am especially pleased with the maple syrup and portobello mushroom salsa I picked up! \n\nIt's just refreshing to wander around and see some...well....healthier looking people around.  It's a different vibe here, for sure.  It also gives you a warm fuzzy feeling to know you're supporting local farmers! \n\n I can't wait to go back.",
            "author": "Molly M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-11-06",
            "description": "The food is top notch, amazingly flavorful and the diversity of vendors is fantastic. Meat, lots of produce, even eggs and milk. And of course, cheese. Artisan breads and baked treats. And flowers. Seriously, so much good stuff.\n\nA must-visit for Chicagoans. The only reason I docked a star is because of the babies. Ugh, seriously, babies ruin everything. I really do love kids, but not with my field greens early on Saturday morning, and its nearly impossible to walk a foot without someone's precious little angel running through the crowd and getting in the way and touching the produce.",
            "author": "Linds R."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2010-09-08",
            "description": "I'm sad to drop down to two stars, but I was so disappointed with my last haul (the one I wrote about in the previous review).  The peaches were COMPLETELY moldy 36 hours later, even though I stored them as directed.  The plums had very little flavor and were just unimpressive.  The arugula and basil started wilting the next morning and the blueberries were shriveled and smelled fermented within two days.  The eggplant and tomatoes were wonderful, but I cooked them the day I got them.  :(",
            "author": "Kristl Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-07-26",
            "description": "I'm giving it another star after the visit today. So much more going on than there was in mid-May.  Lots more vendors.  My tomatoes are delicious!  I can't wait to enjoy all my produce and fresh bread.  My flowers are beautiful and cheering up my kitchen table as I write.\n\nNext week, I want to get there early enough to enjoy crepes and other goodies for breakfast.",
            "author": "Gayle G."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2010-08-04",
            "description": "Purchased Leaf and Boston Lettuce, small bunches marked $6 for 2.\n Took it home and weighed it on my Pro Globe Commercial Scale out of curiosity.\n It was $8.75lb. Need I say more?\nNew to this market, rode my bike from the near south side and will not go back, Wish I has something good to say.\nIt just brought back how exclusive and high priced fixed \"Organic and Local\" have become for no good reason but to drive  everyday pople away. Just because it is a LOCAL farmer dosen't mean they won't charge 3x the price. If you go on a warm day get there early because leaf produce decays as the day wears on but they will still charge you $8.75 lb for wilted lettuce.",
            "author": "Cindy J."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2010-07-14",
            "description": "I have no problem with the items I've purchased at GCM - the quality is great. Very pricey, but I went along with it because I like supporting local producers. \n\nThe problem is that the market's customers make shopping there such an unpleasant ordeal. I live in Old Town and used to go to GCM every Saturday morning. I stopped because I got tired of fighting my way through throngs of strollers, large dogs, bicycles, and people stopping to socialize. I felt like I was in a mob, when all I really wanted to do was buy a damn baguette. \n\nI suggest GCM build a large corral off to the side of the market and herd all the bikes, pets, and wheeled children into it, along with their parents/owners who are there to talk rather than shop. Unless that happens, I will continue to go to the farmers market downtown, which is filled with busy working folks who just want to buy their stuff and get the hell out.\n\nTo those guilty parties: This is a market. It is not a daycare. It is not a dog run. It is not a place to walk your bike around. It is not a lounge with ample room to socialize. Bring a friend to entertain your dog while you shop. Have someone take your kids to Lincoln Park while you shop. Lock up your bike at a bike rack. And move out of the market when you feel the need to cluster together in large groups to socialize. Please.",
            "author": "Kim B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-06-18",
            "description": "Gets better as the summer goes on when the berries start pouring in.  Pricey, but justifiable because of a high standard of quality & selection.  Of course, I'd like to see an all-produce market without flesh purveyors, but coming here is infinitely better than going to the paltry produce section of just about any grocery store.\n\nCrowded no matter when you go and it closes up by 2 pm, so if you're a late-out-of-the-house-on-weekends person like I am & getting here is a matter of a 45-minute commute on 2 bus rides, you might not be able to make a habit of hitting up this market.\n\nI'd stay away from the silly stand hawking 1 ounce of wheatgrass for $3.",
            "author": "Liz B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-09-07",
            "description": "I absolutely LOVE farmers markets, especially those with a great selection of wonderful produce. I went to this market for the first time last Wednesday. While its not the largest farmers market I've been to, it had plenty of selection for fruits, vegetables, fresh bread, homemade cheeses and beautiful flowers. Its so hard to show self control when there is so much good looking food, but I did my best and left with only a bagful of ingredients. The corn I picked up was especially tasty... probably the best I've ever had. \n\nThere was one downfall -- the huge Top Chef trailer taking up a huge portion of the market. While I am an avid Top Chef fan and learned about the market from the show, having a huge trailer promoting the show seemed so out of place among the organic and locally grown produce. I guess the publicity is a good thing.\n\nI hear the Saturday market has even more selection so I definitely plan to return and will be very sad when they close for the season at the end of October.",
            "author": "eileen b."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-01-26",
            "description": "I LOVE this place.  This is where I learned to love, really love, food.  They have such a great variety of vendors, from the regular veggies and meats, to home stuff and bakeries.  Everything I've ever gotten from here has been the best and I can't say enough good things about it.  If you have any questions whatsoever they are more than knowledgeable and happy to help you.  Yes, it is expensive if you're used to Jewel or Dominck's, but it's cheaper than Whole Foods!  Besides, it's nice to know who produces your food and I prefer to support actual people than corporations, even if it's a well-intentioned one (ahem, Stanley's).\n\nIt's better to go early in the morning for the best selection because things do run out.  People make entire mornings out of this by bringing children/pets and enjoying the free (sometimes good) music and the chef demonstrations.  This is where you're going to see all the top chefs in Chicago come and do stuff.  You don't want to miss it.",
            "author": "Audrey C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-06-05",
            "description": "One of the best place for organics..straight off the truck as it is...\nthe chef's demos are cool (@10:30) because they use product at the market and how to use them\nbring cash and your own bag...\nand great place to pick up some flowers w/o spending an arm and leg",
            "author": "ed B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-07-29",
            "description": "Last week my daughter and I rode our bikes to the Chicago Green City Market, maybe it wasn't such a good idea because we bought so much produce it wouldn't fit in our baskets! \n\nYou will find the freshest produce, buttery Scones that are to die for, great Coffee, Cherries, Broccoli, plants, gorgeous flowers, honey, jams, cheese, just about anything you can think of. You can roam there for a few hours. Sure sometimes it's hectic and it might be a bit expensive, but the quality here is practically perfection. \nI once bought a loaf of Apple bread that didn't last 30 mins once I brought it home and we all tried a piece. I also found my beloved Burrata cheese here that is really hard to find. You can pick up alot of your favorite gourmet items in small portions, and alot of the farmers and vendors let you taste before you buy.",
            "author": "Vanessa R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-21",
            "description": "I do love the market and the variety of items to choose from but if you get there after 7:30 a.m the place is a total zoo!  Seriously people do you need to bring your double wide strollers, dogs, carts, bikes....!!!\nThen stroll around the walking path like it is for your own personal use.\nPlease get some manners and respect other people who are simply trying to walk.\nI hate complaining but also when there is a free sample please do not push people aside to get your piggy hands on a piece of cheese.\n\nI don't think the purpose of going to a market is to leave with anxiety",
            "author": "Melissa K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-12",
            "description": "Every year I count down the days to May 6 when white tents and produce trucks appear across the street, heralding what--to me--means the first day of spring: the Green City Market.\n\nOn Wednesdays and Saturdays until the end of October, the Green City Market takes up residence in the park next to the farm at the Lincoln Park Zoo. The city skyline rises majestically in the distance, while farm animals graze and cluck behind a white picket fence next door. It's a strange and wonderful mix of Midwestern charms.\n\nSaturdays feature live music and chef demonstrations, and dogs and children scamper underfoot. Wednesday mornings are calmer, populated by retirees and young mothers with strollers. On these quiet mornings, I like to walk to work by way of the market, browsing the stalls and picking up cubicle snacks.\n\nEven this early in the season, the stalls are full of flowers and fruits, vegetables and baked goods, salsa samples and crepes. I sampled all of my favorite salsas and crackers, petted a few puppies, greeted the farm chickens, tasted some Wisconsin cheese, and admired all of the flowers I cannot buy on account of a certain fat, greedy cat.\n\nI bought a basket of Gala apples, feeling very country chic as I carried them around the market (the chicness vanished as soon as I squatted in the dirt to take photos of the produce).\n\nI love the Green City Market! For some more info and photos:\nhttp://highheelsinthekitchen.blogspot.com/",
            "author": "lara e."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-06-28",
            "description": "It's a great place to go and get fresh, interesting produce that you may not find at your local Whole Foods or grocery store.  Downside -- it's expensive and hard to park near.  I'm coming from the Logan Square area so it's a trip to get to, still I go once in a while because it's an experience.  Today I got some EXCELLENT cherries and asparagus.  My boyfriend picked up some elk sausage which he's extremely stoked about.  The crepes are tasty (go for the traditional butter and sugar and it's about as close to Paris as you're gonna get!)  \n\nAll in all, it's 3 stars because it's a hassle if you can't walk or ride there  and it's really tough to not spend a small fortune (everything looks so yummy!)",
            "author": "Kim V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-12-06",
            "description": "Undoubtedly one of the city's best farmer's markets, boasting a wide array of products sold by friendly vendors in a luscious atmosphere. Just what you'd expect from a top of the line outdoor market.",
            "author": "RJ H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-07-07",
            "description": "One of my favorite places to be on a Saturday morning.  With beautiful and delicious food grown locally and organically, I'm not sure how you could go back to Whole Foods...at least during the growing season.  Not to mention the fresh eggs, dairy, cheese and meat during the winter, now that they are year round.  It will change the way you eat.",
            "author": "Meghan B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-07",
            "description": "What a wonderful farmstand! I love the sandwich and wheatgrass stand for a tasty lunch! Some things are a little pricey but so worth it. I also bought a ton of herbs for planting.. I don't have to buy them anymore! I just made the tastiest tomato stew all from the market... Oh don't forget the Elk meat guy! Yum",
            "author": "Julie A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-18",
            "description": "It's no west coast farmer's market, but it's cool. Great sampling of Wisconsin cheeses.",
            "author": "amy h."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-10",
            "description": "This place is awesome and can get busy starting around 830 am or 9.   Great choices on things you can eat there for breakfast as well as many selections from farms, bakers, and more to take home and enjoy.  Love the ambiance, the music, and more.   Not all stands are created equal...some of the staff is friendlier than others.  I try to stick to the friendly ones.  An A+ and not to be missed place during spring/summer/fall hours.",
            "author": "Happiness L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-11",
            "description": "This market is great, especially when it is only blocks from my apartment! \n\nI recommend going Saturdays and going early (before 11). The flower and fruit selections are wonderful. I also am a sucker for the fresh cheeses and honey. \n\nWords of advice: 1) go prepared with a large tote. 2) make sure you leave enough time. It does get crowded and no one wants to be in a rush enough that they start throwing elbows to get through the crowd. \n\nI will definitely miss the market when the season is over!",
            "author": "Marie P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-06-17",
            "description": "Even if you don't fall in love with the beautiful produce, you might be won over by the delicious crepes, or perhaps even the all-organic burgers sold here.  Most of the stands are set up by the same farmers who grew the produce you'll see, so if you don't know what to do with ramps or Italian black kale, you can ask.  There are also fresh eggs (chicken and duck, but come early before the duck eggs sell out), and organically raised chicken, beef, and lamb.  Two bakeries also sell their wares here.  You can leave loaded down with herbs, vegetables to tide you over for a week, an organic chicken for Sunday dinner, crusty bread for your breakfast, and a bouquet of flowers as your reward for taking such good care of yourself.",
            "author": "Maria S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-02-25",
            "description": "How I'm yearning for spring! Sure, the weather is part of the reason (I could use a bit of thawing out), but it's mainly for the return of this fabulous outdoor farmer's market. I usually go Wednesdays, when the crowds are tolerable, and always enjoy the chef demonstrations and some of the freshest, best tasting produce anywhere. And end the visit with some excellent packed foods - I usually just stroll through the park, find a bench and chill out.",
            "author": "Purnima M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-03",
            "description": "I love the market so far. I loved the fresh produce, even though there is not much variety yet due to the season. It is quite expensive, but definitely worth the sunshine & the trip.",
            "author": "Char Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-05-24",
            "description": "the pink peonies i bought yesterday at the market are sitting right next to my computer at work and the yummy, buttery croissant i bought is a pleasant buttery memory.  so so so good.  \n\nmy roomie told me i should go so, around 7.30, we drove over and strolled through the market.  everything was so fresh!  so pretty!  so...lincoln park!  this is why people move here.  i mean you have the morning sun coming over the lake, folks are buying flowers, root vegetables and coffee - all before they get on the bus downtown.  \n\nit's a perfect thing to do on your way to work and i can't wait to go again.  i think there's a crepe with my name on it.\n\n(oh, and that butter kase cheese?  it will make you slap your mother.)",
            "author": "Delia C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-06-06",
            "description": "Green City Market is great.  I go every Saturday and enjoy buying local, organic food directly from the farmers who produce it.  It's such a great concept and something that takes us back in the right direction to appreciating agriculture and the men and women who produce it.  Local and sustainable... are the key factors of Green City and they abide by their rules.  You'll find great local foods and can trust that the market committee strictly regulates what can and cannot be sold based on where they are produced. That's great.",
            "author": "Jason M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-09-04",
            "description": "The only thing keeping me from giving Green City 5 stars is the fact that it closes at 1:30, and I work until 2:30 (more like 5) on Saturdays, so I can never get there. In fact, the only times I was able to go was when I was working there, but in those few times I fell in love. The Vella girls are so nice, and boy do they make a tasty grilled cheese! It's definitely the best place to get some tasty local produce at reasonable prices.",
            "author": "lauren p."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2006-09-17",
            "description": "The best fruits and veggies from farms in the region using sustainable and or organic farming methods.  You can feel good about what you eat when you know it isn't covered in chemicals and/or flown in from Chile.",
            "author": "sandra h."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-16",
            "description": "I make every effort to get to the market on Saturdays.  They have way more than just fruit and veggies.  Some of my favorites are the eggs and the maple syrup, and they also have excellent grass-finished beef.  The only reason I give it four stars instead of five is that it is really pretty expensive.  Not overpriced by any means because the food is totally worth it and tastes amazing, but bring lots of cash.",
            "author": "Julie G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-10-05",
            "description": "Such a treat for all of your senses! Oh, this is the place where I discovered goat cheese (where have you been all my life?) on toast with I think it was peach preserves. Mmm! Being that I was just visiting, I wasn't able to buy or make use of any produce, but I did pick up a few jars of dip and spread, and my friends and I got some really great blueberry pierogi as well!",
            "author": "Jaynie K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-08-20",
            "description": "Great market but VERY expensive.  Lots of fun, good variety and it feels great just to be there.  Bring lots of cash and don't expect to get much for it.  SUPER expensive and many items are cheaper at Whole Foods.  I know the idea is to support local farmers but sometimes it's just too expensive to do that.",
            "author": "Diana P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-10-24",
            "description": "My mom and I get up early every Saturday to stock up on the freshest, most local produce.  It's become a bit of a mother-daughter ritual.\n\nAnything you want, you can find here.  I've purchased everything from honey to cheese to butter to pork shoulder to pasta to kohlrabi to heirloom potatoes.  Seasonal, local and sustainable!",
            "author": "Emily S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-07-12",
            "description": "Organic fresh produce, meat and flowers. Lately we have gone and let what's fresh dictate our menus for the week. Prices are high, but no more so than Whole Foods, and with the cost of farming and getting into the city constantly growing the prices are fair. Get rhubarb pie for breakfast at the Hoosier Mama pie stand if the crepes line is too long.",
            "author": "Beth O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-09-09",
            "description": "This farmers' market is top notch.  It is much bigger than your average neighborhood farmers' market and is at a convenient time for those who work full-time during the week.  (I am bitter that I cannot go to my own neighborhood's farmers' market!)  The produce is outstanding, the fresh flowers are beautiful, and the other local food items -- cheese, honey, yogurt, etc. are all delicious!  I am a BIG fan of samples for tasting, and this place delivers. :) I tasted my way through every booth that I could!  Everything I bought was consumed immediately by my husband and myself, and we both agree that cooking with fresh veggies is unbeatable!",
            "author": "Becky S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-30",
            "description": "Best farmers market in the city. Always plenty of samples to go around. The crepes booth is amazing. If you prefer a smaller crowd you can go on Wednesday instead of the packed Saturday. Its located in the park with plenty of bike and running paths near by. I love riding my bike there since its only a few minutes bike ride away from downtown.",
            "author": "Lindsay R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-11-18",
            "description": "The Green City Market is absolutely amazing. If you are worried about prices - then you aren't here for the right reasons. if you want to see green garlic, young ginger, amazing IN-SEASON organically grown fruits/veggies, cheeses, meats, and baked goods - then stay, cause this place is right where you belong. \n\nI usually make it here once a week all summer to stock up. \n\nExplore, Eat, Love - umm Green City Market how I adore you.",
            "author": "Laura B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-02-07",
            "description": "Finally! Chicago has a Winter Farmer's Market! Until May, the Green City Market is going to be held every 2 weeks at the Peggy Notebart Museum in Lincoln Park. It's smaller and there's a lot of things that I don't need from a farmer's market, i.e. pastries and pizza crust, but I just love being able to buy fresh and organic apples from my favorite farmers.That's right, I have favorite farmers.",
            "author": "Corinna K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-08",
            "description": "Expecting a bigger crowd on Saturday, I was actually able to walk through with my two dogs with no problems at all. Assortment of vegetables, especially tomatoes and lettuce, flower baskets, fresh cut flowers, herbs, and cheeses (samples galore). Prices also vary, so make sure to browse the entire thing before buying. Prices are similar to the local grocery stores, but this produce looks and tastes better. You can do the entire thing in 30 minutes or less. I was a little disappointed that the line for the crepes was unbelievable. Maybe the reason the rest of the market wasn't so crowded, is because everyone was congregated in this one area. They looked amazing, and by the line, must have tasted amazing also.",
            "author": "Liz D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-09-01",
            "description": "Wonderful market, and rightfully known as one of the best in the city.  \n\nThe produce is of impeccable quality.  Of particular note were the fancy peppers I picked up last trip -- great smell and flavor, plus they came in red, green, white and PURPLE varieties, which as a foodie, kinda blew my mind.  \n\nPerhaps of even greater note the people who run the booths are incredibly friendly and willing to help you and answer questions. This is in stark contrast to some other farmers' markets I've been to where the vendors try to just throw their produce at you.  \n\nParking is problematic to say the least.  I must have turned into the wrong parking lot because I ended up paying $9 AFTER validation, which upset me greatly.  Be aware of this and either go super early to take advantage of free street parking in the adjoining streets or be ready to stomach kinda outrageous parking costs. Or use public transportation.  \n\nLastly, you know that the market is great when you see restaurant trucks lining up on the side of the road nearby.  I will definitely will be back ASAP!",
            "author": "Jenn T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-09-07",
            "description": "What a wonderful market.  The produce is so fresh there is no comparison to grocery store fruits/vegetables.  Local & organic!  It's open Wednesdays & Saturdays.",
            "author": "Heather R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2005-08-17",
            "description": "This farmer's market is completely organic and locally grown!  In addition to fabulous produce, they also sell organic meats, eggs, flowers, candles, soaps, dairy products and pasta.  There is a chef demo at 10:30am.  The market is held from May 18th-October 29th from 7 am to 1:30 pm.",
            "author": "David F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-14",
            "description": "I am in LOVE with the flowers at this market.  Such an interesting and gorgeous variety--more than just sunflowers and hydrangea. 3 bouquets for $15!",
            "author": "Laura B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-10-25",
            "description": "I've only been here once, but been to tons of farmers market, and Green City Rocks.  It has all the essentials - vegetables, meat, cheese, milk, bread,  meals ready to go, and a dude playing some hobbit-sounding music.  The selection and quailty of vegies is so very nice.   Prices are not as cheap as stanley's, but cheaper than most places for equal quality and selection. As a bonus you can sample cheese, salsa, and other tastinesses..  My favorite was a delicious giant blueberry muffin for $2.",
            "author": "chad n."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-05-26",
            "description": "Ever have a Saturday morning that you have time to kill, this is a great place to go. I can easily spend over an hour here looking at the different booths and sampling cheeses. They have a nice variety of vendors who sell here, from veggies, fruits, fresh milk, cheese, meats, honey, flowers, cider, and pasta. They also have a handful of vendors who make food to eat while browsing the market. I like to see the freshness of the products for sale, and the farmers themselves selling the products. I wouldn't say its the cheapest place in the city to get produce, but if you have a few extra bucks to spend on a vegetable for dinner, it's nice to give the sale to the little guy who grows organic. Runs til 1 in the afternoon, but I would suggest getting here early as strollers and dogs tend to make it a sh*t show by noon on a nice day. Its on the larger side as far as markets go, and there are farmers who over lap on stuff that's in season, but never a lack in variety no matter what's in season. The apple cider donuts and lamb egg sandwich from Zullo's are a must....if you're into that kinda thing.",
            "author": "Jessica K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-05-25",
            "description": "so, i may not have been able to afford a lot, but i sure did like this market!  we came a little bit later (11-ish) on saturday so quite a few stands were nearly or totally sold out, which i can't complain about due to our late arrival.  we did get some kick-ass grilled cheese though.  also had a scone from red hen bakery which was delicious as well.  next time i go i will make sure to bring my piggy bank and come a bit earlier.",
            "author": "Katie R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-08-16",
            "description": "Activity and availability in this market vary by season, and I feel lucky to be able to attend the market now in the late summer months.  Love to bake with the fresh fruit and grill fresh veggies with my meal - the mushroom vendor is the staple of at least one meal per week at my house, and it's great to snack on a crepe with fresh ingredients from the market or a burger made from tasty locally raised beef.  \n\nWalk, bike, run to the market - but don't drive!  It's impossible to park around there.",
            "author": "Joel S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-10-22",
            "description": "This was such a cute market. They have fresh... everthing! Not only produce, but fresh made crepes, yummy grilled cheese, and one thing that I think about often-Apple Cider. Now, I am not one to love apple cider, but this one in particular was sooooo delicious. It wasn't too sweet, but had just the right amount. Unfortunately, we did so much that weekend, we didn't have much time to drink the cider. I hope our friend enjoyed it at least, since we left it at her house. I wonder if they Fedex...",
            "author": "Tiffany W."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2010-06-12",
            "description": "Last year, there were signs posted that \"No Dogs\" were allowed in the market.  People were pretty good about honoriing them.  This year, there are no signs and there are dogs of all sizes and shapes, in someone's control and not in anyone's control, all over the market.  I though that the Board of Health required no dogs where food was being served.",
            "author": "william h."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-06-07",
            "description": "This market is known for its organic selection of produce, which is pretty cool for those who are solely organic eaters. Since I am not, I will just judge it on what it is. I came here today as my end destination on a long bike ride. It was great to get there and see it bustling with the Lincoln Parkers enjoying a beautiful (but way too hot) morning checking out fresh produce. They had a couple of bakery stands that looked so tempting with their fresh breads and pastries. And they had the amazing grilled cheese that I just had to try and buy, of course! I really liked the stands that had samples like the cheese stand, the salsa and jam place, and the cracker place. There was also a stand that was grilling burgers and brats, which would have been a number one stop for me if it hadn't been so hot and if I wasn't biking back. I did, however, try a strawberry rhubarb spritzer from there... which was good, but not great. I would have liked it sweetened a little bit and a little more strawberry-flavored. But, it was still refreshing after a long bike ride. \n\nNow onto the produce. Maybe it is b/c it is early in the season, but I thought there just wasn't much. I was curious about the purple asparagus so will have to try that on the grill. There were also some tomatoes, potatoes, and leafy greens. But really, there wasn't much variety. It doesn't compare to the downtown St. Paul Farmers Market, which I miss so much! But then again, this Green City Market is all organic and is not as big. They did have some herb plants, that looked nice!\n\nOverall, I was a little disappointed with the variety and the number of stands. I will have to check out some of the other farmer's markets in the city like the one in North Center and the one in Daley Plaza. It is always nice to get some fresh grown local produce! It makes me feel like at least I am eating healthy!",
            "author": "Karen L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-09-06",
            "description": "Gotta love having a Saturday morning Green City Market literally 100 feet from your front door.  It's Saturday morning, I just got back.  There was a full band out there today, the week before last there was an Irish session - awesome!  The fruit, although a little more expensive than Jewel is good.  I'm not an \"organic\" kinda girl, but I do enjoy buying locally.  My Mom loves this market and she says she \"feels like she's in Europe or something\".  Peaches, pears, honey crisp apples, blackberries, and plums were the fruit of my choice today - all very good.  I went for it and just bought that damn cheese.  Every time I go there I get a sample of that yummy grilled cheese on a toothpick.  Today I caved and bought it.  Now - off to the Windy City Wine fest to pick up a bottle or two to go with the cheese.  God, I love Chicago!  :)",
            "author": "Kelli B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-08-29",
            "description": "This is the greatest way to buy produce in the world.  They have the freshest foods of the season twice a week at fair prices.  Try the grilled cheese or a fresh made crepe.  1 hour of parking is $4 with validation at the market.",
            "author": "Stephen H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-10-01",
            "description": "I went here with Chef Mindy Segal, and it was so nice to meet the local farmers in the area.  I know people tell me that fruit and veggies in Chicago do not compare to CA's, but honestly, I thought their selection was abundant and the produce was beautiful!  I saw so many varietals of beets, pumpkins, and heirloom tomatoes that I have never seen before.  I just love seeing and meeting all the chefs who come out and support the local farmers for their restaurants.",
            "author": "Sylvia T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-06-05",
            "description": "Best market in the city (and I am a big market fan)!  Go around 10:30 and catch some great live music.\n\nGreat place to meet other moms, let baby hear the sounds of live music, get some produce...overall, just a fabulous outing for mom and baby!\n\n***5 Strollers***",
            "author": "Amy M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-07-25",
            "description": "I love this place! I look forward to getting up early and going to get some fresh veggies and milk. I got some yogurt there and it was the best yogurt I have ever had! I also found some good honey there in a glass cute bear. All our tomato plants, cilantro, basil, mint (for mojitos), serrano pepper, and habanero we got from the market. I love watching them grow and eating them :) Our tomatoes are still not coming in so we still buy tomatoes at the market. We also get peaches and strawberries for delicious smoothies.",
            "author": "Cristina G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-07-28",
            "description": "OOOOO I am SUCH a fan!!! I FINALLY got to go after high anticipation. The location is great and it's in such a beautiful area and right next to the gorgeous Lincoln Park. The first thing I did was head straight to the crepe stand to get crepes. Maple syrup one and mixed berries. DELISH!!! While waiting (it's a good 15-20 minute wait) I tried some cheese samples and stared and drooled over the fresh produce and fruits.  Next, boyfriend got a delicious JUICY cheeseburger and I got a peach gelette and cherry/apricot crisp. I even bought a scoop of sweet cream ice cream from another stand to enhance the yumminess. Bought a nice bag of mixed mushrooms for 10$ (they give you SOOO many shiitake,  baby bella & oysters) and just had a great time looking at all the different produce.. saw tons of different varieties of veggies I've never known of before (like the place with a gazillion varieties of potatoes.. who knew they had so many kinds)  I can't wait to go again. Go hungry cuz there's lots to nibble and sample on!",
            "author": "Tiffany D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-10-22",
            "description": "It's pretty much a certainty that you'll find me here once a week. Between Sun Gold tomatoes from Tomato Mountain, delicious cheeses from Brunkow, fresh baked breads, handmade pasta, gorgeous herbs, & a list that could go on for so long that it'd be obscene. I've yet to eat any of the foods made at the market. Mainly because I find them a bit too pricey for my blood, but they certainly smell delicious. With some proper planning you could easily get a weeks worth of meals in 1 trip. You'll be guaranteed fresh, local, deliciousness in every bite as well. The farmers & vendors are friendly, knowledgeable about their wares & quite helpful in what you can do with their products. If you have the need to talk to someone at the Green City staff table you'll find another grouping of friendly faces that are so happy to be there doing their job. It's such a treat to live in the middle of a big city & still be able to eat from the farm produce on a regular basis. Sure, some things are a bit pricey here, but it's still cheaper & fresher then you'll find at Whole Foods. Total win.",
            "author": "min. r."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-09-03",
            "description": "I loved this place!  Bigger than any farmer's market I've ever been to.  The people were super nice and the air was filled with the amazing aromas of fresh fruits, veggies and herbs. So many different produces to see and the colors were so vibrant.  I bought some organic apples and received a huge canvas bag complimentary!  Also, try the crepes.  We lucked out and got there right before the line became unbearably long!  My friends got the peach and raspberry crepes.  Not too sweet and tons of fresh fruit that was cooked perfectly.  Not mushy! I had the savory crepes with light cheese, mushrooms and summer squash.  Added some salsa and I was in heaven!  Prices are a bit high but you are paying for organic and supporting local farmers.",
            "author": "San N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-10-28",
            "description": "From the first ramps and watercress of spring to today's pumpkins and chestnuts, thanks for a great season! I can't wait for the indoor winter market!",
            "author": "Brendan F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-05-12",
            "description": "First time I've been there.  Hope it gets bigger, there weren't that many vendors, but we did show up a little late.  Bought five different kinds of cheeses--very pleased with the exceptional but a bit expensive Little Darling cheese.  Crepes were good, flatbread tasty and the apple cider sorbet was not to be missed. Can't wait to go back and try more.  I was super eager to try trh rhubarb honey water concotion I had read about in the Reader but it either wasn't there or it was gone by the time we showed up.  Hope to try it soon!",
            "author": "Denise W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2005-08-24",
            "description": "I love the markets in the summer and this one is great. Everything is fresh and home grown! They have a lot of organic foods which can be hard to find sometimes.",
            "author": "Julia B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-09-24",
            "description": "I really do like this place.  It has awesome veggies!  It also has the MOST AWESOME crepes, apple cider, and sampes of Brunkow cheese on the grill are not to be missed.  It is a first-rate farmer's market.  I only deducted one star because of the prices.  I SWEAR they raise them a buck when they set up in Lincoln Park, because of the affluent neighborhood.  So, if you are swimming in money and don't have worries, then it is surely a 5-star farmer's market.  If you are poor like me, then save up and indulge a bit every week.  I have visited many other farmer's markets in town, and this, no doubt, has the best quality stuff.  If you're only going to get cucumbers and peppers, then go somewhere cheaper (a pepper is a pepper is a pepper).  But I have personally experienced the better quality of the peaches, nectarines, plums, tomatoes, and asparagus.  Advice: save the environment and bring your own bags.  Bring a bottled water to wash down the crepes and many samples that are available.  (They do have water jugs for people to refill their water bottles, but it runs out about half-way through the morning on a summer day).  Dogs are very welcome, and is a great place to meet and pet dogs!  (I love that.)  There is a bike rack, and parking is available for a fee at North Ave. and LaSalle.  Accessible by the 73 Armitage, 151 Sheridan, 156 LaSalle, 22 Clark, and 36 Broadway busses.  Goes from 7am (but many booths open earlier) to 1:30pm.  However, get there before 1pm because many places sell out and start breaking down at 1pm.  Try Pasta Putana, a homemade pasta chic who has an AWESOME (but expensive) product!  If you have time, pack a picnic and eat there, and go to the Zoo afterward.  It is a perfect day in Lincoln Park!  (As if there was any other kind!)",
            "author": "Patti H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-05-30",
            "description": "I checked out the market last Saturday, and was impressed with all of my purchases (mix of lettuces, radishes, baby bellas, asparagus, and the most delicious sour dough small baguette).  All the produce was tasty, fresh, and kept well.  It is a little pricey, but it is all local and organic so you have to take that into consideration.  And you have to keep in mind things are limited because they have what is in season (there were lots of stands with asparagus and rhubarb last week).  Also, we checked out the crepe stand.  I split a savory and a sweet one with a friend.  Both were tasty, but a bit pricey.  Will go back regularly for fruits and veggies, but probably only once in a while to treat myself to a crepe.",
            "author": "L H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-09-12",
            "description": "The green city market is Chicagolands premier organic farmers market.  The quality of the foods is of a high standard.  The market features freshly picked fruits and and vegetables, free range meats and eggs, organic cheeses and baked goods, and there is even a booth selling burgers for breakfast which people line up for.  To be brutally honest I think that the idea of the market appeals to me more than the actual experience.  Being that the market is held in an urban environment I imagine that it is a pricey trek for farmers to truck in their goods and have staff there to sell it. Because of this there is little competition among the vendors and the prices are quite high.  Also, being in the heart of lincoln park parking is quite difficult to find, there are meters which are almost always reserved for the vendors. There is a parking lot but you end up paying about $9 for parking.  If you are really feeling green I would suggest biking or taking public transit.  Based on the priciness of this market I can only give this 3 stars.  Quite frankly I think it can only cater to the middle and upper class Chicagoans.  I would love to see a bigger market featuring more vendors and lower prices that would offer lower income families a good outlet for fresh produce.",
            "author": "Marco D."
        }
    ],
    "priceRange": "$$",
    "name": "Green City Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "2613 W Lawrence Ave",
        "postalCode": "60625",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/JEjDyPLN9fjxCorl8zTxbQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17738801266"
}