{
    "aggregateRating": {
        "reviewCount": 18,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-06",
            "description": "Excellent produce! The store has a nice variety of fruits and vegetables and they do fantastic taffy apples and smoothies!",
            "author": "Paulie I."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-05-17",
            "description": "I like to shop at small businesses, helps the local economy and boosts growth.\nI like their prices and variety, I'm not sure if the produce is organic.",
            "author": "Juan-Antonio Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-21",
            "description": "Great salad bar at this high-end fruit store that calls a renovated car service center home.  It's been here for close to 30 years so you know they are doing something right!  You pay for the quality but trust me their fruit veggies are fresh as can be and won't spoil in a day or two. I often grab items like their homemade salsas I can't find elsewhere and take them to parties instead of booze or flowers.  \n\nTheir homemade smoothies are a hit anytime of the year.  As others have mentioned their caramel apples are amazing and put the Long Grove place to shame!  \n\nThe staff know their stuff and will guide you to the freshest selections.It's a Hinsdale institution and deserves five stars.",
            "author": "Karma K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-03-04",
            "description": "Neighborhood fixture, we buy from here whenever we can. Always fresh, great produce. Very friendly helpful staff and owner. Small section with salsas, quad, dips, etc... chocolate, chips, etc but focus is clearly on produce. Cash only. Love this place",
            "author": "Kurt H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-25",
            "description": "This is an indoor, year round farmers' market.  Not a huge selection, but what they have is tasty and fresh.  \n\nAs the seasons change, they are totally honest about what will taste the best.  Outdoor farmers' market told us the peaches just needed a few days on the counter to ripen, gentleman in this store told us it was not worth the chance.  He was right, those peaches NEVER did ripen.  Their fruit salad is the best.\n\nSnack food, smoothies, beverages, salad bar, and they also make platters and baskets.  Right now they have a large selection of caramel apples ~ YUM.\n\nThey have a small parking lot which makes it very convenient.",
            "author": "LOIS B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-30",
            "description": "Ever had a salad from here? It is the freshest most delicious salad you'll ever make, because you have to make it yourself. Again, my cool friend has brought, or should I say made me, salads from here for lunch and I just can't get enough. I want to go and male myself one!!!!\n\nI also checked out their website and they make gift baskets, fruit & veggie trays, smoothies, Fruit salads in your choice of a bowl or watermelon bowl, and even home made taffy apples!!\n\nSeriously, check them out or get a cool friend to make you and bring you stuff. =P",
            "author": "Osiris V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-12-15",
            "description": "Hinsdale Fruit Store.....produce is fabulous.  The chicken soup is delicious (I'm eating a bowl right now).  The taffy apples are perfect.  The fruit baskets are impressive and stocked with fresh fruit; not like some where you feel as if the fruit has been sitting around for days. But, the people are what make this place so outstanding Very nice, kind and customer oriented.  Family business and you can tell they care about their customers.  I would give a higher rating if I could.  Check them out.",
            "author": "Karen K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-12-22",
            "description": "Expensive? Yes. Worth it? You bet. This store is not an everyday place for me, but when I want the freshest produce anywhere . . .the Hinsdale Fruit Store is my first stop. \n\nI love the small town feel when I pull open the door and whoever is working the counter welcomes me to the store. \n\nThe easily bruised fruit (like fresh raspberries) are market stand fresh displayed without a cover; that is only added when you purchase them so that none of the very delicate fruit gets bruised or damaged. The apples are grapefruits are piled high and the prices are clearly marked. \n\nThey also have a wide selection of specialty candies, pastas, crackers and other items to do custom gift baskets. There is also a dairy case featuring Oberweiss milks and creams in their signature glass bottles. It's how shopping used to be done and when I'm not in a hurry . . it is how I prefer to shop for fruits and vegetables. \n\nThere is also a salad bar with really fresh ingredients where you can put together the salad of your dreams with plenty of vegetables, \n\nI love the produce stand feel of them totaling my order on the side of the brown paper sack with a pencil that they are going to give it to me in. It's almost theater with food! \n\nIndependent stores like like are going the way of the horse and buggy. But for those of us lucky enough to live out this way, it's a great store to give your support to. You may never want grocery store fruit again!",
            "author": "Carol K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-01-07",
            "description": "Hands down, the salad bar is Hinsdale's best kept secret for a healthy, fast and affordable lunch. And believe it or not, they actually have on-site parking. By the way, it's a fruit and vegetable store, too. They only buy what tastes good that day. Pricing is not cheap, but the quality is high.",
            "author": "Bryan B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-05",
            "description": "I am lucky enough to work a few doors down from this place - it's a great place to go for last minute dinner items, lunch, or a quick snack!\n\nThe salad bar is amazing - so many fresh items to choose from to make your perfect salad. I also had the best fruit that I have tasted in years - a little fruit bowl filled with canteloupe, grapes, watermelon, honeydew, and pineapple - so fresh and delicious!\n\nThere's some guacamole that I've been dying to try - only thing that keeps stopping me is that they only take cash, which I usually don't carry. But I still like the old-school feel of the place, and how the friendly cashier totals your order on the side of your brown paper bag!",
            "author": "Kristina B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-06-14",
            "description": "Small quaint fruit store with smoothies and salads and pre made dinners ... Cute,  small and pricey.  Staff all seem nice.  I'm not a regular, but may come here from time to time.",
            "author": "Jenn C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-09-22",
            "description": "Small quant Fruit Store with fresh fruits and veggies.  You gotta go there and try the BEST Taffy Apples. 6 different variations, plain, walnut, peanut ,chocolate, and a few more to boot.  I get em all the time in the fall, cut them up and serve them on a plate. TASTE GREAT, AWESOME.",
            "author": "F P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-05-12",
            "description": "After all these years this place is still AMAZEBALLS!  I always get a salad from the salad bar which is always SUPER fresh and basically perfection!  I have also gotten fruit over the years and it was also perfection.  The staff has been the same since I first went in which is also so inviting.  LOVE.THIS.PLACE!",
            "author": "Angela P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-07-09",
            "description": "Excellent Harry and David caliber fruit store! The homemade taffy apples are worth the drive when in season! The best taffy apples around!! Expensive but worth it.",
            "author": "Michelle I."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-05-03",
            "description": "I really like their fruit smoothies here, and their cheesy chicken tortilla soup is amazing. Only reason I'm giving 4 stars rather than 5 is because they always sell out of the cheesy chicken tortilla or don't  have it that day when i go on lunch. Otherwise i highly recommend the fruit store, everything is always very fresh.",
            "author": "Katherine E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-03-24",
            "description": "Sure, this place is a bit on the expensive side.I think you get what you pay for, however. They have a wide selection and I find that it is all incredibly fresh, and the salad bar is definitely a step above the one at Whole Foods.",
            "author": "Ken F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-18",
            "description": "The Granny Smith caramel apples are my version of Proust's madeleine-- the sweetness of youth in every perfect bite.",
            "author": "Michelle C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-05-24",
            "description": "I'd never seen a standalone fruit store before I moved to Hinsdale.  This place is just great.  All the produce is lovely and fresh.  They also carry some specialty food items, digestive biscuits anyone?  They have a limited selection of high end dairy products (Oberweis and the like) as well.  The service is incredibly friendly and once you've been you'll stop in again.  It's also one of the few places in Hinsdale with it's own parking lot.",
            "author": "Michelle B."
        }
    ],
    "priceRange": "$$",
    "name": "Hinsdale Fruit Store",
    "address": {
        "addressLocality": "Hinsdale",
        "addressRegion": "IL",
        "streetAddress": "26 W 1st St",
        "postalCode": "60521",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/AJ5b_qf18Q0kWdi8KKheuw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16306551893"
}