{
    "aggregateRating": {
        "reviewCount": 45,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-12-27",
            "description": "This is a really cute farm to have in the suburbs and ideal for (supervised) children. There's not a WHOLE lot to see, but if you're with a kid who loves animals, it's fantastic. There are cows, horses, occasional pigs and lambs, chickens, and a roaming cat. If you go in the summer, you can tour the historic farm house and have some Homer's Ice Cream in the museum area.",
            "author": "Annette B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-05-27",
            "description": "Are the kids going stir crazy at home? Are they driving you crazy? There's a solution for that! Wagner Farm is a hidden gem in Glenview that has free parking and admission.\n\nThere are horses, pigs, sheep, chickens, cows, and more to see up close. There isn't an abundance of animals on the farm, but it's plenty to get that farm experience right in the burbs.\n\nYou'll also see that there are community farming plots being tended to with vegetables and fruit being grown by members of the community.\n\nIf you have young kids, there is an indoor play area that allows kids to play in a small silo, chalk up a cow, play make believe with toy chicken eggs, and more.\n\nStill not enough to convince you? How about ice cream, sundaes, floats, and milk shakes? Yup, they have just the thing to cool you down in the summer.\n\nThere are plenty of benches, tables, and grass to have a small picnic or just run around. It's so nice that something like this is free and open to the public in the burbs. Definitely a great place to take the family or just walk around and soak in the sun and animals.",
            "author": "Daniel Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-11-01",
            "description": "It's awesome farm love the place with beautiful animals just white horses keep attack new black horses sad to see it you can see marks on horses by the bites I know all animals are territorial but these horses need protection",
            "author": "Tvrko S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-26",
            "description": "Fun and educational place to take little ones. It's a small farm that consist of horses, cows, chickens, pigs and sheep. There are also some friendly cats that roam the grounds. \n\nThere are plenty of picnic tables ( kid size) to pack a lunch and enjoy nature and the animals around you. There's plenty of parking And the entrance is free. This place is a hidden gem. I take my LO here regularly and mommy is happy to save mommy while my LO has fun and learns at the same time. \n\nInside the museum kids can pretend to gather eggs from chickens and milk a fake cow. There is also colored chalk to draw on the fake cow a carriage and little stores that show the old price of produce. If you go around closing time 4:30ish you can even see a cow get milked. Kids of different ages will enjoy this place and did I mention it's all free?\n\nUpdate: There is now a ice cream shop inside the museum. A nice place to take the kids after visiting all the animals. Prices are reasonable and it's pretty good!",
            "author": "Audrey C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-06",
            "description": "Decided to check this place out on a Saturday morning since the kids had nothing to do.  They ended up really liking it!\nIt kind of felt like we were back in Wisconsin! It wasn't as busy or crowded like the regular zoo's either so thats a plus.\n\nYes there aren't too many animals here, but it's still quite nice. It would take about 2 full hours to explore everything around here and play in the tiny museum. \n\nThe best part is the spacious parking lot, and you don't have to pay a dime for admissions completely free!",
            "author": "Nabat N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-10",
            "description": "This place is awesome to take the kids I was very impressed and the best part is that it's FREE.... They have a mini museum on the inside where your kids can learn how to gather the eggs and check if they are fertile or an egg for eating. It's very interactive they can actually gather toy eggs and put them under light to see if there's a baby inside. There is an interactive hay lift where your child can practice lifting the hay on a pulley system. Also and old fashion grocery store so they can see what it was like back in the day. They also have an old fashion little ice cream parlor where they make there own homemade ice cream and it's delicious and very reasonable priced. They can learn how a cow is milked. A couple of other things is that they have a old house with all its original glory that you can tour. On the outside you can just walk around and enjoy the farm and check out all the animals unfortunately we went when the animals were at the state fair so we only got to see the chickens and two of their horses but it was still so fun for my daughter she had a blast. Highly recommend just let the kids get out and enjoy the fresh air and experience farm life!!",
            "author": "Ashley Q."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-10-01",
            "description": "I researched online before bringing my family out. I wished there was a map or \"you are here\" board, so we could know where we were allowed to go or what there was to see. We saw chickens, and walked out back to see horses but no one ever explained or approached us. So we guessed what we could do. One house to the north looked like some people went inside? But we weren't sure what that was. The kids did like seeing the cows, pumpkins, and chickens. Overall it was maybe 20 minutes of things to see/do.",
            "author": "Heather B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-10-02",
            "description": "We've visited Wagner Farms before, but this last visit was awful. On three separate incidents the staff was overtly rude. One snapped at my daughter for playing with farm equipment which had no sign to keep off, another rolled her eyes and snapped as I was trying to take a picture of my family because I guess they didn't like where I was standing. Lastly, two staff members were visibly annoyed that my son was standing in their way on a sidewalk. If your staff hates/finds children and tourist annoying, then maybe they shouldn't be working in a place where the public is invited to visit. \nThe place is otherwise good for small children and conveniently close to the city. Just steer clear of the staff members.",
            "author": "Chris T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-20",
            "description": "I really, really like this place. I don't really have much to say, because they're all pros! Free admission/parking...great! Not busy most during the days! But my favorite part was that me and the baby got to walk right up to the pigs/lambs and just observe them! My son was enamored with these creatures! And it's great because he got a lot of personal time with these animals and an upfront and personal experience with them, which I don't feel like you get at the zoo. \n\nGreat place! We'll be back!",
            "author": "Nicole P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-04-24",
            "description": "Today was a perfect spring day.  Mid/late April, sun shining, low wind, temps around 70.  Doesn't get much better than that!  We had driven by Wagner Farms many times before but always on our way somewhere or going home from something.  Today, we made it our priority to stop and walk around.\n\nOur little girl loves animals (what little kid doesn't?), however, she got pretty scared from the cows!  Not sure what it was, maybe she wasn't ready for how loud it would \"moo!\"  She was able to get pretty close to pigs, lambs, cows, and chickens.   The horses were off in the distance in their fields but she still liked pointing at them!\n\nInside Wagner Farms is a teacher's dream...all of the information about farms you can dream of!  Kids can pick \"eggs\" out of a chicken coop and organize them into egg cartons.  They can climb a mini silo and learn about about silage.  But best of all, they can \"milk\" a fake cow.  \n\nThere is a little gift shop inside the main barn too which has souvenirs and snacks.  Overall, this was good for a one time visit.  I don't think we will come back, but it was great to visit and see a lot of those animals close up.\n\nFor the basic information: there is parking right across the street, it's at the corner of Wagner and Lake on the edge of Glenview/Wilmette, and you can't go into the fields where the animals are grazing (for obvious reasons).  So, you just have to hope that the animals are somewhat close to the fences if you want to see how big they really are!",
            "author": "Michael N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-19",
            "description": "Nice place to bring little kids to see the tractors and animals. I have also been to the farmers market and they have a nice selection of vendors.",
            "author": "Jeff K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-03-31",
            "description": "Nice place for kids to see animals and burn off a little energy.  Stopped by after hitting up Kohl's and being told there was no onsite parking (spring break and rain storm).   Place is well kept and animals seem healthy.   My boy was entertained for north of an hour.   Lots of parking and can't beat the price (free).    Not a destination but recommend if in area for kids.  Note:  Definitely check out the kids exhibits in the barn.   My boy loved the hands on stuff and it is well maintained.",
            "author": "Daniel K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-06-16",
            "description": "My 1 1/2 yr old is so not a fan of Wagner Farm.  He takes one look towards the cows and horses (or perhaps a sniff) and breaks out into hysterics. I have to admit I don't blame him...the animals are smelly!\n\nMy 3 1/2 yr old, on the other hand, thinks this place is great....and loves getting a glimpse at the cows, horses, chickens and more.  However, I think she enjoys the activities inside \"museum\" even more than the outside, which is good because her little brother is happy in there.\n\nAnd (of course) they like the ice cream parlor inside even more. After a morning with a bunch of smelly animals, some activities inside and scoop of Homer's ice cream...I've got one happy (and smelly) little girl.\n\nWe did check out the annual dairy breakfast* this past weekend. It appears to be a great fundraiser for the fair, but we were less than impressed with the long lines (especially for mediocre food) and there aren't many more activities than a typical day. Next time we'll stick to the regular hours where there is no charge and less crowds.  And perhaps we'll leave the 1 1/2 yr old at home.\n\n* http://www.glenviewparks.org/event/12th-annual-dairy-breakfast/",
            "author": "Andrea R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-29",
            "description": "Love this place as a Farm.  We recently had a birthday party here for my daughter and the staff was ok but very strict with everything.  They said they couldn't bring in a few extra chairs into the room because it wasn't in our contract.  Very by the book which was a bit frustrating.  Overall, room was fine, party went well which is all that matters.\n\nKids LOVE this place.  Well maintained.",
            "author": "Diana P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-04",
            "description": "Great place for kids.Cows ,pigs ,horses,tractors you can make a pictures .Inside the building couple attraction like collect eggs from chicken to the basket .My son is four years old and he love it .What I like also say it's for free you don't buy any ticket and you have big parking lot on other side of street .Every Saturday is farmer market  from 8am to 12 I never was and I need to try this to .",
            "author": "Katarzyna S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-10-23",
            "description": "Today we have \"Field Trip\" and visited Wagner's farm. The weather was nice and everybody was interested in something not so luxurious and  fancy... We all are international students and everything is new for us. The place smells like it supposed to smell... village...\nBasically the place is better for kids than for adults, but was interesting anyway.\nThe museum is about 8 years but it is equipped with many ancient things. It has great little store, where you are able to buy something funny just for memory. The lady at the museum was so friendly. We stuck a conversation and she was happy to see adult visitors too.\nThe most amazing for me was the kind of carpet on the wall and below many tiny sewing machines. \nExcept cows and horses you can see the little place, where various  of organic apples and pumpkins are available for funny prices.                     \nIf you feel tired of everyday life, full of stress and emotionally tired of city life, take a little pleasant trip and have fresh air and fun!",
            "author": "Me 2."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-13",
            "description": "I can't imagine how anyone would give Wagner Farm less than five stars.  It is true that it is not an all day activity, more like two or three hours at most, but that is perfect when you are trying to entertain little kids that need naps.\n\nMy kids love everything here.  We say hi to the animals, eat our lunch from home at the picnic tables, sit on the big tractors, go to the kid's museum in the Heritage Center to play for a little while, and then end the day with some ice-cream from the old fashioned ice cream parlor. My kids hang up a picture there every time.\n\nThere is also a really interesting farm house museum that is decorated to be like it was one hundred years ago.  This is right up my alley, and I like to go in when I can, but my children are still too young to appreciate this exhibit. They will be ready in a couple of years.\n\nThanks Wagner Farm. We will visit you often!",
            "author": "Sarah D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-06-25",
            "description": "I have only been here one time. The first thing I see is muddy teenage girls walking sheep like dogs, good sign. Music, good mix of shop and non-shop vendors, I.e. get your Foodstuff goods and also buy from Farmer Harold. Good looking veges and produce. Prices are reasonable but no steal deals that I noticed. \nFair deal on summer sausage to be had. \nBring your trash shoes or rubbers because it can be pretty muddy to walk around. \nThere is parking for the market, and spill over parking at the Greek Orthodox church lot. The street the market is on can be pretty busy so be careful. They do provide a crossing guard for safety.",
            "author": "michael w."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-08-16",
            "description": "I have a sort of love-hate relationship with this Farmers Market. I've been coming here for about 3 years and rarely miss a Saturday. But, as others have noted, the prices tend to be a bit high. There's always a seller with a flea market type table (as was also mentioned previously) that just doesn't seem to fit in with the rest of the market. They claim to be sold out of vendor space every year, but folks... This is a farmers market and not a flea market. I would much rather see another food vendor in place of the bric a brac being sold. Parking is a bit difficult some of the time and I always feel like we're intruding on the Church's generosity (especially the other week when there was a funeral at the church while the farmer's market was going on).\n\nThat all said, this is one of the few Farmers Markets that accept LINK (food stamps). Not only that you get double value up to $25. So, every week I spend $25 on our LINK card and get $50 in funny money/wooden nickels. Some of the vendors seem to be less than pleased with taking the LINK tokens, but most are happy that you're there purchasing from them (even if it's with wooden nickels). Also, I am disabled and it seems as though the LINK terminal only works about 3/4 of the time and having to trek back and forth across the (busy) road is trying during the heat of the summer.\n\nIf you do go, definitely check out Miller Farms. Best produce around. But one has to wonder where some of the other vendors get their products. I've seen more than a few items with grocery store-type PLU labels on the produce and I'm sure they don't grow those labels naturally. Also, the meat vendor gets a bit testy if you ask about the provenance of their meat. What exactly is \"grain fed\" beef? Inquiring minds want to know.",
            "author": "Sue W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-07-31",
            "description": "My kids love coming to Wagner Farm and seeing the cows, chickens, pigs, and horses as well as playing inside the barn area. Personally, i dont really \"get\" the appeal (its super smelly!) but im also not 3 lol. Its an easy way to kill an hour or so and like i said my kids adore coming here so I'm happy to oblige them :)",
            "author": "L G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-01-14",
            "description": "My kids love this place. It's a great place to take the kids if you want to get them out of the house and not spend any money (admission is free). They sell cheap pumpkins during Halloween and cheap trees during Christmas. They also do a bonfire/s'mores in the Fall. There are other activities during the year that I haven't experienced first-hand, as well.\n\nThere's something especially charming about a real, working farm in the middle of a busy suburban street.",
            "author": "Geoff S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-07-04",
            "description": "I am the only 20 year old person who LOVES Glenview.\n\nOne of the reasons I do is the farmers market on Saturday mornings.  They have your usual fare, REALLY good apples at the end of the season as well as apple butter, and great bread.  Great thing is that it's on Saturday, and usually the Sunday farmer's market (like in Skokie) has the same vendors with day-old goods.\n\nIf you have little kids, this is a great place to come because it is across the street from Wagner Farm.  There is an occasional cow or horse at the market for kids to pet, and there is usually a read-along from the library at 10 am.\n\nhttp://www.glenviewparkdistrict.org/fa-wagner-events.asp",
            "author": "Jessica P."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-10-13",
            "description": "Came here on Columbus Day to by 4 pumpkins to carve on my day off. Was told to go inside with the pumpkins to buy them. When I got inside the lady said pumpkins weren't for sale today because two people called in sick who sold the pumpkins. Had to walk all the way back with my 4 cool pumpkins I picked out only to set them down and drive home. Not cool. They were heavy. Rest of the place looked decent.",
            "author": "Jimmy D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-17",
            "description": "Great place! Makes you feel like your in the country on a farm. So refreshing to have some nature and such a beautiful simplistic place in the midst of a city. I enjoy the animals. They have only Cows, Chickens, Sheep and some Horses so not a lot of animals but enough to make you feel like your at a farm. I also like the fall decorations and pumpkins they have for sale there. I really enjoy seeing the smile on all the children that are visiting there when I am there. This place is run by very sweet and kind people. I have enjoyed going here for many years and hope it remains there for many years to come. The milking demonstrations are enjoyable and educational to. It's just an all around feel good place.",
            "author": "Pamela L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-04-07",
            "description": "Wagner Farm is a great place to take kids to kill a couple hours. It's an actual working farm that was purchased by the Glenview Park District (I THINK I read somewhere that it's the last working farm in Cook County, but I'm not positive). \n\nThey have a couple of horses (Sue and Bob), chickens, geese, a pig, some sheep, a herd of cows and a couple farm cats. It's great to get out and stroll around the grounds and check out the animals. \n\nInside they have a cute play area for kids. You can pretend to candle eggs or milk a cow. I wish the \"general store\" allowed for more playing but as it's set up, it's mostly decoration. In the summer they have an ice cream shop that is hard to resist.  \n\nThe best part... it's FREE. Free parking, free admission. Can't beat that. \n\nThere's really not much to do indoors so it doesn't make for a good rainy day destination. The workers/volunteers on the farm are there to do a job and are not always the friendliest bunch. You can take your time and do and see everything in an hour or two so it's not an all day thing unless you're attending a program. \n\nAll in all... it's a fun place to visit!",
            "author": "Natalie S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-03-29",
            "description": "4 Stars to the farm.  It is well kept and my children enjoyed it.  They have cows, 2 horses, pigs, chickens, and a wandering cat.\n\n1 Star to the lady selling souvenirs.  Went in and wanted to buy a candystick for my daughter and it cost .12.  She would not take my 10 dollar bill and credit card.  My daughter was really sad.  The lady could have just given it to her.  .12 cents!",
            "author": "Andrew L."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2009-08-10",
            "description": "Good people of Glenview:  Please stop wasting your time at this market and drive four miles east and two miles south to the Evanston farmers market.  Yours is...anemic at best.  \n\nFour booths, all with the same scant selection of produce, plus one devoted just to fruits; two cheese stands; one table full of flea-market jetsam; a handful of various \"causes\" and community organizations; and baked goods from two local establishments.  This is your farmers market?\n\nThe blueberries that I got from Barry's Berries were pretty good ($7 for two pints).  Corn was expensive here, and dubious-looking to boot, but I bought half a dozen anyway (three dollars!).  I cooked some for dinner tonight, and it tasted okay.  A couple of the ears were spoiled in spots.\n\nLimited selection + high prices + mediocre quality = subpar farmers market.  Go to Evanston instead.",
            "author": "David R."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-09-26",
            "description": "My girlfriend and I are vegetarians and we went to see the animals, but not only were we not allowed to pet the animals, we didn't even get to see the pigs because they locked the gates. People were mowing the grass flinging rocks and dust everywhere-on a Saturday!? Why not do it on a weekday when it isn't crowded w people. When we walked across the field to see the horses the women who cared for them acted inconvenienced, and rude, angrily yelling at a little girl running up to pet them. Over all this farm had little to offer and we left feeling disappointed.",
            "author": "H A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-04-01",
            "description": "We come here in the summers to enjoy a tiny taste of farm life. The whole place is very kid friendly! Check out their special programs- they are worth trying out. The home tour is my favorite. Kids always like \"milking the model cow\" in the museum part of the farm. The old country store is adorable! They have done a nice job with keeping this landmark in good condition! Check it out next time you are in the area... There is lots to explore here.",
            "author": "K M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-11-05",
            "description": "For our first visit ever, we came here on a warm and pleasant October afternoon for Corn Fest. Wagner Farm is just that - a farm, though it is a touristy one. Upon entering through the parking lot in front, it didn't really seem like a lot to do. There was a tilled-over field with soil turned up in large chunks. To the kids, climbing over the mini-boulders of hardened soil seemed like the whole purpose of our visit, but after a few minutes we were able to steer them elsewhere.\n\nWagner Farm, while it is still a working farm with some livestock and a corn field, is an educational place for kids to see what old-time farms looked like. A row of rusting old farm implements sat on the edge of a field. The kids got to climb and pose on a dilapidated tractor too.\n\nIn the main building, there are numerous exhibits on farming, demonstrating how to lift a bale of hay, milk a plastic cow's fake udders, or pour slop to a fake pig waiting for its meal. There's also an old-fashioned store, complete with a non-digital cash register that my kids were fascinated with, as numbers popped up on top with the punch of a button. My kids especially enjoyed scraping little seeds off of the brush-like ends of broom corn to make little whisk brooms. We got to take those home too.\n\nThere's a little gift shop and snack bar alongside in the main building.\nOutside, there's a small barn with geese, chickens and some goats. It's not a petting zoo, but the animals were eager to see the many visitors stopping by.\n\nFinally, they sold apples and pumpkins. The apples looked really good, and there were varieties I had never heard of. At $1 a pound, they were even better than farmer's market prices. I got me a suncrisp apple, which was sweeter than a honeycrisp and a little softer inside.\n\nA pleasant fall day is the perfect time to see an old-fashioned farm like Wagner and escape to an earlier time without leaving the suburban realm.",
            "author": "Mike O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-16",
            "description": "A true gem in glenview's heart my kids enjoy every single moment of their visits also has free  and accesible parking ice cream shoppe inside building I love to swing on the tree in the \nmiddle of the farm  and feel the breeze oh childhood memories also they have picnic tables great place to a nice family time",
            "author": "Sushigirl d."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-04-17",
            "description": "Fun place!  Kids love it!  Nice place to go in a beautiful day, you feel like you took a mini road trip, it takes your soul out of city mode for a few!  They also have fun small events.  Fun to stop by after or before the farmers market.",
            "author": "Marnie B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-08-06",
            "description": "Be warned: this is not a petting zoo.  It is an 18.6 acre working dairy farm that's been restored to approximate what an American dairy farm would look like circa 1920.\n\nIt's owned and operated by the Glenview Park District, since the last of the Wagner family died in 1997.\n\nThe farm has free public visitation hours (M-Sat. 9-5, Sun. 9-3).  You can see cows in the pasture, chickens, draft horses, sheep and pigs along with a barn and a restored farmhouse.\n\nA separate building, the Heritage Center, has interactive exhibits for kids to learn about early 20th century farming.  Kids can simulate milking a cow (the teats squirt water instead of milk), hoist heavy hay bales by pulling a rope, gather up fake hen eggs. There's a 1930s-era grocery store to see.  And a gift shop - try a bottle of sasparilla (it's like root beer) while sitting in a rocker on the front porch.\n\nWagner Farm also offers educational programs you can register for through the park district (i.e. learn about the milking parlor - participate in a milking demo with actual cows, sign up to do farm chores).\n\nWe went one Sunday afternoon to see the farm and while it was interesting to check out, we got through everything in about an hour.  I was kinda expecting a petting zoo, and my daughter was more or less done after petting a lamb through the wires of the pen.\n\nFrankly, I think kids would get a lot more out of the experience by signing up for one of the programs.  Wagner Farm also has special events throughout the year such as an egg hunt, a dairy breakfast, a barnyard dance/ice cream social.  During summer, it also hosts the Glenview farmers market on Saturday mornings.  I think it's definitely worth checking out, but I'd try to do it in conjunction with an event or the farmers market.",
            "author": "Kathy R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-04",
            "description": "It's free, it's fun for kids and the staff was friendly. Great way to entertain the little ones for a few hours.",
            "author": "Javier B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-03-31",
            "description": "I chaperoned for my daughters field trip here and I thought it was pretty cute.  Unfortunately the day we went it was raining so I am sure it would be nicer on a sunny day.  \n\nThe farm is pretty small so it's good for small kids.  They have quite a informative tour that they took us on.  The let the kids shuck corn, grind it, and feed it to the cows-they got a kick out of that.  As well, they had the usual cows, pigs and horses to look at.  \n\nInside they had some interesting things to look at.  The kids got a real kick out of the fake cow you could milk.  As well, the area where you can play with the plastic eggs was a hit.  \n\nThey had a little discussion where they talked to the kids about butter and how it's made.  Then they passed around small jars of cream and allowed the kids to shake them to help turn the cream into butter.  Of course my daughter dropped the jar and it broke everywhere but the staff was nice and didn't make us feel bad about it.  They also let the kids taste the butter they made on a graham cracker-my daughter wasn't crazy about that though.\n\nOverall it was a cute little trip that took about 3 1/2 hours from door to door (leaving from the city and including eating your own sack lunch there.)",
            "author": "Jennifer C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-06-08",
            "description": "Had a birthday party there for my two sons, five and seven. The indoor facilities (described in great detail in another review) were clean and engaging. My five year old had fun milking the cow, playing with the eggs and running around. The floors were very clean and it is a pleasant space to be in. \n\nWhat we particularly enjoyed was the horse-drawn hay ride (an additional $125) that seated about 20 people. For thirty minutes two teamsters (no, not those teamsters, that's what they call the farm hands) directed two beautiful horses around the farm (the horses looked like Clydesdales).  At one point the horses took to a gallop, adding some excitement. Both birthday boys had the opportunity to take the horses' reins. \n\nUnfortunately, the two college girls that directed the party did a poor job of time management. The first 20 minutes we waited for the horses to be ready. As a result, there wasn't enough time on the back end to do the craft activity, the building of the bird houses. That was a real bummer and an inexcusable lack of planning. Had the workers been prepared, I certainly would have given an additional star.\n\nFor those of you who don't know, a cow is a female, a bull is a male. A steer is a castrated bull. Most meat you eat comes from a steer. Don't ask about how a bull becomes a steer, you don't want to know. The farm has no males, only cows. Once they park district took it over they deemed it to high risk to have a bull roaming around.\n\nIt is very nice to have a farm preserved on the north shore. I would recommend coming here, especially to those who have limited experience with nature.",
            "author": "Rafi A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-11-08",
            "description": "We came here on a Family night where they had smores and storytime for free!  What a fun location and the best part was it was all free (I believe that you pay when the kids are 2+ but adults were free and our son was too little to have to pay).  We all got cups of apple cider and smores to sit on the bales on hay to listen to storytime.\n\nThey have a barn where you learn how to pretend milk a cow, pick eggs, and how to process vegetables that are grown on the farm.  Their dairy farm also includes cows, horses, sheep, chicken, and pigs.  Definitely a fun family destination for an afternoon.",
            "author": "Dee W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-08",
            "description": "Bringing a group of kids and watching them pump water, grind corn, and feed hens is really a blast. The staff is very friendly and gave the kids a bunch of great information about the cows. There was a three or four week old calf there and the kids were enthralled. Our kids were equally interested in the sheep and pigs, but we only made a quick visit to them, and the horses were hanging out across the pasture, so we just waved.",
            "author": "John V."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-14",
            "description": "Summer months are few and the days can pass by fast. Getting the most of a Summer experience can be found with visiting the local Farmers Market. Glenview's Farmers Market is continually growing every year and to some it is small compared to the surrounding suburbs. Being able to find fresh flavorful tomatoes, basil, and inspirational seasonal ingredients are found here. Meeting local businesses and small crafts men and women is a plus. I like to try out the baked goods from Zingarella, High Rise, and Foodstuffs. Places I would not normally visit throughout one given week are here at this place. The kids like meeting the animals that are brought in from the Farm across the street. I can get my knives sharpened and ready to go by the time I am done perusing the goods. Easy parking in the lot and at times the boys scouts are ready to help with bringing your packages to the car.  Adding this weekly adventure gets the kids out and ready to make Summer memories.   \n\nEvery week the vendors vary so check out the website to see what will be available. \nhttp://glenviewparks.org/index.php/glenview-farmers-market",
            "author": "Giselle S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-08-01",
            "description": "I've been going here for three years and I can't imagine how I haven't written a review yet.   The Glenview Farmer's market is here on Saturdays from late June through October.\n\nMy three year old son absolutely loves coming here.  Their big barn has a place to pretend milk a cow, harvest eggs, process corn and bale hay.  The 1920's farmhouse captivates my son.  They also have a working dairy farm with cows, pigs, horses, sheep, chicken and roosters.  Its a great place to spend the day with young children and unless there is a special event its free.  They now also have a outpost for Homer's Ice Cream in the afternoons during the summer.",
            "author": "Alan R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-11-20",
            "description": "Wonderful kid friendly place that was so generously given to the community by the Wagner family.  Has indoor interactive center that is great for children on a wet or cold day.",
            "author": "Robert T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-05",
            "description": "Lots of vendors and fresh fruit. Not much extra here than other farmers markets. No super great deals here either. But lots of fun and very friendly people!",
            "author": "Allison G."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2011-09-08",
            "description": "not really a lot of farmers selling stuff. 2 or 3 booths selling produce at grocery store prices and a bunch of booths from local glenview businesses like foodstuffs. unfortunate, i live right by there and would happily go every weekend if it was better",
            "author": "Chuck B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-10-14",
            "description": "We (3 adults) came here for the first time this past Saturday after having driven by for years and thought it was so nice, and a lovely respite from the city.  The cows are cool and seem used to people and small children.  There were 2 piglets (Casper and Pumpkin) that were too cute and very warm as they were rolling around in the mud.  We bought some squash and guessed the weight of an enormous pumpkin.  We visited the museum that was old school, but educational about farming nonetheless and sat on some of the old John Deere equipment that was used back in the day.",
            "author": "Maria W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-07",
            "description": "Other reviewers did a good job of describing this place and what's available. I had a great time with my 3 year old, who enjoyed looking at the animals and running around for a few hours (for free!) But, I wanted to warn parents considering a visit on a school day: we came on a Friday morning, and there were several pre-school and elementary school groups there going on tours that we were not allowed to participated in. The tour guides discouraged us from standing near the tours and would not let us participate in any of the activities. It might not have been a problem because there's plenty of space and we easily could have entertained ourselves away for the tours, but my daughter noticed that the kids on the tour got to do special things like pet a chicken and feed the cow. As you might imagine, it was really difficult to explain to my daughter why all the other 3 year olds got to pet the chicken and she did not. Unfortunately, there is no daily tour for the general public, so there is no opportunity to do the tour activities if you don't arrange them with a group ahead of time. So, if you're going with your kids, I'd recommend going on a non-school day, or steering clear of the tours from the get-go, so your kids don't notice the activities. Like I said, there's plenty to do without the tours, but once they see what the other kids are doing, they're going to want to tag along.",
            "author": "Devon W."
        }
    ],
    "priceRange": "$",
    "name": "Historic Wagner Farm",
    "address": {
        "addressLocality": "Glenview",
        "addressRegion": "IL",
        "streetAddress": "1510 Wagner Rd",
        "postalCode": "60025",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/9CDTNJfufvlNOO7chcJzqA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18476571506"
}