{
    "aggregateRating": {
        "reviewCount": 17,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-29",
            "description": "You can tell there is a great market manager behind a great market like this.\nIf you see her, say hi and tell her what a good job she does to make it a great place to go on Sundays. Her name is Pat and she is super tall and always active about the mkt. Just ask a vendor to point her out.\n\nOpening day! Going to find out about their link matching program.",
            "author": "Meg r."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-02-14",
            "description": "I just adore this market so close in my neighborhood! Well organized. Great selection. Terrific people. Here are the dates for 2014 - \nJune 8, & June 22 : \nJuly 13, & July 27 : \nAug. 10, & Aug. 24 : \nSept. 14, & Sept. 28 : \nOct. 12, & Oct. 26 :\nBelly Dance Show at 11:45am on 6/8 * 9/14 by Arabesque Dance & Fitness!",
            "author": "Sonya B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-28",
            "description": "The Independence Park Farmers' Market is awesome. Lots of organic produce to choose from, a local grass-fed beef farm that also offers organic chicken and great pork and lamb products, a Wisconsin organic farm offering a variety of salsas and jam, and homemade soaps! Just wish there was even more to choose from, but it's a great place to support local growers!",
            "author": "Megan P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-09-08",
            "description": "Pretty good farmers market. They have all the fresh fruits and vegetables that you would expect. I bought olives, cornichons, and sundried tomatoes. Bought some puffed tofu. Bought a deer antler for my dog. Had a tamale and iced coffee with coffee ice cubes (awesome). Everything seemed a little pricy compared to other farmers markets I've been to, which is the only reason I give them 3 stars instead of 4.",
            "author": "Maxim L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-08-25",
            "description": "Lovely farmers market with great vendors friendly people, kids and dogs, Coffee, crepes, tamales, fruits, vegetables, pasta, honey, and much more. Kids craft table, blue grass jam, always something to enjoy.",
            "author": "April B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-08-27",
            "description": "Definitely a step up from the farmer's market I usually frequent in North Center at Damen and Lincoln.\n\nThere were quite a few vendors selling everything from dog treats to cheese to produce to meats. I really enjoyed walking through the market.\n\nI noticed there was a little craft center set up for children, which I thought was neat. They were making beaded necklaces, it appeared.\n\nWe ended up getting some of my favorite farmer's market cheese (apricot brie), a jar of hot habanero jelly from Katydids (which was the reason we went to the market in the first place), and a frozen pack of bangers for my husband.\n\nWe did have trouble parking though. A lot of the side streets around the park are no parking zones, and the two lots belonging to the park were full. Also, though there was great variety in goods offered, there was usually only one booth selling a certain item - so one booth selling cheese, one booth selling jelly. I would have liked to see more of a mix in the vendors.\n\nStill a solid choice for a farmer's market on the north side.",
            "author": "Christina G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-11-30",
            "description": "Obviously a little late in the year but whatever.\n\nThis farmer's market was a little slice of happiness every other weekend this summer. Yes, it's on the small side, but for a neighborhood market, it was pretty perfect. The park itself is a lovely venue and the layout of the market keeps everything spaced to the point that even with a crowd, it never feels too crowded. \n\nThe vendors represent a decent assortment of fresh veggies, local baked goods, soaps, tea, etc. Oh! And the olive stand was a definite stand out! I may have also felt like a mushroom pimp for River Valley Ranch a time or two, but that's ok. \n\nThis was a bright spot on my Sunday and I can't wait for next year. This is truly the epitome of what I feel a neighborhood market should be!",
            "author": "Channyn W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-05-21",
            "description": "Yes, this event keeps getting better every year. The Plapp Family organic flours and frozen meats are a standout. Fruit tarts (sold by a nun in an actual habit?!) are delicious; organic salsa is another favorite. \n\nArea musicians have made this an interesting folk music venue worth taking a look. Some are businesses have made it into the mix, including belly dancing, yoga, knife-sharpening & the Urban Worm Girl.\n\nAs a neighborhood guy it's always a pleasant place to encounter neighbors and get stocked-up on fresh veggies and fruit for the week.",
            "author": "Ken L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-02",
            "description": "Ignore any reviews on this market from before the summer of 2009 -- this is truly an event that has come into its own recently. There's an excellent selection of produce, baked goods, even organic meats and ice cream. I highly recommend the sharpening and watch guy - I was leery of handing off my Wusthof to a guy in a tent, but he did an excellent job.\n\nAnd you can't beat the vibe - the playground is packed, there's usually a string band, and you can get a smoothie and watch a softball game. And did I mention indoor bathrooms in the field house. God Bless Independence Park.\n\nDates for 2010 (alternates with the one in Portgage Park):\n\nJun 13, 2010 : Jun 27, 2010 : Jul 11, 2010 : Jul 25, 2010 : Aug 8, 2010\nAug 22, 2010 : Sep 12, 2010 : Sep 26, 2010 : Oct 10, 2010",
            "author": "I B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-09-18",
            "description": "Forget Green City and Logan Square markets --Check out Independence Park Market instead!\n\nSince last year, the market has gotten bigger and better! There are a ton of vendors to shop at: Jeanette's Patisserie, Ruth & Phil's Gourmet Ice Cream, and other stands including handmade pasta, Nun's bakery that feeds the homeless,  Sweet corn etc etc. As well as free music!\n\nThe park is so beautiful and serene and well-kept too!\n\nIt's a joy to shop here!",
            "author": "Jeanette S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-05",
            "description": "Here are the dates for 2009-\nDates:\nJun 14, 2009 : Jun 28, 2009 : Jul 12, 2009 : Jul 26, 2009 : Aug 9, 2009\nAug 23, 2009 : Sep 13, 2009 : Sep 27, 2009 : Oct 11, 2009\n\nHours:\n9 am - 1 pm",
            "author": "Laurie V."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-29",
            "description": "I'm not sure when One Sister, Inc. started coming with her pirogi, but they are awesome. \n\nMy wife and I get the waffles or tamales every time for brunch (depending on if we're in the mood for sweet or savory).\n\nIt may be small, but it used to be even smaller, and it only seems to be growing now. The more people that continue to come, the more vendors will come, too. It only makes sense. Sure, you can't get everything you need there, but you can get a lot of diverse foods and support local growers and suppliers!\n\nPlenty of street parking on Hamlin and down on Byron too!",
            "author": "Nels W."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2009-07-03",
            "description": "This farmer's market seemed even smaller than Logan Square's. We arrived around 12:30pm, and there were hardly any booths. Maybe some vendors had already packed up, but I would have liked to see more produce. There were other stands with baked goods, kettle corn, candles, etc.\n\nNon-vegans might like the gourmet doughnut stand. One of last week's flavours was maple bacon.",
            "author": "Beth M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-06-15",
            "description": "My children woke me up at 8:40 a.m. this past Sunday morning to attend the first Independence Park Farmer's Market of the season. The market, which opens at 9 a.m. and runs until approximately 1 p.m., is a huge hit with my three children. I like it, too, and have been pleased to see it grow from one actual farmer and three products' vendors clustered on the sidewalk in 2007 (2006?) to the moderately sized market it is in 2011. \n\nFor my fellow farmers' market fans, I would say that the Independence Park Farmers' Market compares in size to those found on Tuesday mornings in Lincoln Square or in front of the MCA/Seneca Park. The elements are similar and, in some cases, the vendors are the same: Delightful Pastries, Marilyn's Pies and the Knife Sharpening by Dave are regulars to the Independence Park Farmers' Market. I am hopeful that the Wisconsin organics farm returns for a second year at Independence Park, although there are several farmers from the south suburbs and Berrien County, Michigan that bring some lovely fruit and vegetables. Although I didn't buy any of the flowers, the 60618 fresh-cut flower vendor had some gorgeous, locally grown stuff. One of these days, I am going to get a worm bin from the Urban Worm Girl. Otherwise, our family's must-visits outside of the farmers include Stivers Coffee, pain au chocolat from the French nun, Delightful Pastries and yummy soap from Big City Suds.\n\nThis has become the Sunday morning destination for the West Walker/Independence Park/Old Irving Park set. The playground is crowded with parents and toddlers while older kids go zipping around the track on bikes and scooters. Even the tacit tension between neighborhood DINKs and parents is at bay during the Independence Park Farmers' Market.",
            "author": "Caroline B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-09-12",
            "description": "This is our first summer in the neighborhood, and I am really glad this farmers market is a community resource.  Fair selection of produce, but this farmers market has a lot of baked goods, cheeses, organic doggie treats, fresh noodles, organic meats and even ice cream and crepes!  Today there was a group of belly dancers performing, a string band and free yoga classes.  I love taking our dog here and chatting with neighborhood folks, everyone is really friendly.  In the future, I'd like to see even more produce offerings for a higher rating on my end, but to me, this farmers market is \"A-OK\" as is.  :)",
            "author": "Jillian S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-24",
            "description": "This farmers market keeps on getting better and better.  Last year it was quite small and we opted for the larger Logan Square market instead even though we live in the neighborhood.  This year this market is twice as big and the selection 10 times better.  Logan Square is getting really crowded lately and we're trying to go to the Independence Park market more and more.  The produce is fab and there are some great unique vendors - like the coffee stand, waffle booth, and the knife sharpener (!)",
            "author": "Amy Q."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-04",
            "description": "I'm very happy that the market is much improved this year with more vendors and better produce! I skipped last year's market because I was disappointed by the lack of farmers. But I won't miss it this year. \n\nAt our last visit we had our knives sharpened, picked up some yummy sunflower/rye bread, delicious berries, bok  choy, ramps, broccoli and asparagus from a sustainable farmer. YUM!\n\nA beautiful setting in a charming and historic park.",
            "author": "k b."
        }
    ],
    "priceRange": "$$",
    "name": "Independence Park Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "3945 N Springfield Ave",
        "postalCode": "60686",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Pdp8_IS1F29HxLiv9K7c-w/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}