{
    "aggregateRating": {
        "reviewCount": 2,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-28",
            "description": "Legends South Farm is a Chicago Botanic Gardens community farming location on the south side of the city, located on the site of the old Robert Taylor homes. Like many of CBG's community farming sites, this farm is lovingly maintained by staff, volunteers, and community gardeners to produce wholesome food for their communities.\n\nThe site takes up just a few city blocks but is a lovely little area of nature among crowded home sites and buildings. There is street parking available and a lot (undesignated) to the south side of the farm, with free parking in both areas. Farming sites are available for rental to community gardeners, and food is grown here for WIC program boxes, farmers markets, CSA and local restaurants. This is such an amazing project, and a wonderful way to bring healthy foods and nature to urban communities!",
            "author": "Brande O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-03",
            "description": "A beautiful Chicago Botanic Garden city farm, managed by Windy City Harvest. This land is well maintained, supports multiple agricultural incubator businesses, and helps to manage the community allotment garden associated with the property.",
            "author": "Kay K."
        }
    ],
    "priceRange": null,
    "name": "Legend South",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "116 E 43rd St",
        "postalCode": "60653",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/O5rtIsfPRWZIM793GPjxcg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17736240213"
}