{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-23",
            "description": "Really a great farmers market. Everything from the donuts sold by the church ladies to the vegan muffins to the fresh produce. Took home some great corn on the cob that was so sweet it almost didn't need butter....a great thing to do on a Thursday morning......",
            "author": "jim s."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-07-19",
            "description": "This is by far my favourite Farmers Market of its kind, as I love coming here. All the fruit and vegetables are home made, and the baked goods tastes home made, and right out of the oven. Right by the market, there is a playground where you can eat what you bought, and your kids can play in the parke. Unfourtanrtly, just about everything seems pricy, and strangely, overpriced. This is unexpected for a event such as this. Anyways, for the most part, I enjoy the produce, but not the prices. My favourite thing to get here is the mini apple pies, which cost just under $6, which I can't complain about. On normal occasions, parking isn't difficult, but this year, I founded it harder than normal. 4 stars, is what I rate it.",
            "author": "Seth M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-27",
            "description": "Great morning for a farmers market!!! The fresh flowers, fruits, veggies and bakery good. So much to purchase so little time to prepare it and eat the it!!! Oh don't forget the kettle corn for a snack!!",
            "author": "M Z."
        }
    ],
    "priceRange": "$$",
    "name": "Libertyville Farmers Market",
    "address": {
        "addressLocality": "Libertyville",
        "addressRegion": "IL",
        "streetAddress": "W Church St",
        "postalCode": "60048",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/cMf1_I4a7PO_7MM2sPSjPQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18476800336"
}