{
    "aggregateRating": {
        "reviewCount": 167,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-02",
            "description": "A gorgeous late September Sunday morning and cocks are crowing... somewhere in Indiana. HA! \n\nBut on this morn, we Funksters are in Wrigleyville with the Red Line rattling the window panes as our AM alarm clock. Coffee, bagels, cheese, fresh fruit and Uber are the order of the day.\n\nWith the aforementioned groceries disappeared, Mr Uber was at Ms Baseball Funkette's Party Barn door straightaway. Then before you could say \"Bob's yer LGBT Uncle who used to be yer Aunt\", we are deposited at the Logan Square Farmers Market or LSFM.\n\nMusic, vegtables, bread, fruit, pastry, soap, flowers, bikes, organic and the opposite of organic?!?, dogs, over-priced and priced just right, strollers, cheese, sausages, wagons, salamis, honey, empanadas, crepes, art... maybe a Garfunkel (props to BNL)...\n\nAll in all this Farmers Market was one beer tent shy of Sunday morning PAR-TAY! Clearly one of the best FM's we Funksters have perused in a long time. \n\nAnd to top it off, just at the end of the block... a little \"While You Where Sleeping\" surprise... as Bill and Ted were known to utter, Most Excellent!",
            "author": "Funk D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-05",
            "description": "This outdoor LSFM is the farmers market to be at!! It's a personal favorite! Located a couple blocks from the Logan Square CTA- Blue Line. Vendors offer a variety of fruit, vegetable, honey, pressed juice, pizza, bread, live music entertainment, pastries, meats, flower bouquets, salsas, cooking oil, tamales, empanadas, and lots more! Vendors are certified with organic foods.\n\nMy favorite vendor is the Windmill Ginger Brew (non alcoholic ginger beer that tastes like concentrated soda juice). If you love ginger, kombucha, and wheat grass shots, you'll LOVE this. The chorizo empanada was also memorable and full of flavor. We brought a ton of vegetables, sourdough loaf, sunflower tendril peas, Chicago Co-op Honey, and had a pizza from the Langhe Market vendor.\n\nCompared to Wicker Park's Farmer Market, there are more vendors and it is more crowded. If you are specifically looking for meat, Wicker Park has less expensive options. LSFM is my favorite, overall. Most vendors have a samples of their products, and are looking to start a conversation with their customers. So much fun!\n\nThe Logan Square Farmers Market is May-October on Sundays from 10:00AM-3:00AM. I would recommend this place for co-op members, people watchers, and farmer market lovers. Be sure to check it out, and you may even put this stop in your Sunday routine!",
            "author": "Mandy C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-16",
            "description": "One of my favorite farmer's markets in the summer in the city. Lot of vendors, from flowers and veg and fruits to ready made food like a taco stand and pizza. I got the pizza and it was delicious and very fresh.",
            "author": "Julianne Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-12",
            "description": "Truly something for everyone here -- this year-round farmers market is conveniently located and easy to get to, usually OK street parking, features local food, fresh fruit and produce, love music, dog treats, locally made cheese, flowers, live music and street food vendors. It's fun for the whole family to walk around tasting and buying local food, supporting local small businesses, stay for lunch and do some great people watching.",
            "author": "James B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-11-15",
            "description": "On a nice day, this market is a great stroll. Lots of people watching, dog watching, and fun things to buy.\nMy favorite is the salsa/mushroom stand. The canned spicy mushrooms are my fave, but we eat them in like one day.\n\nI also like the flowers and cheeses. Of course there's always seasonal veggies and fruits. Sometimes they seem super pricey, but I guess you're paying for quality.\nThe only area I find lacking is the prepared food/things to eat while you walk. There's a taco stand, some type of asian chicken stand, juices, ice cream and donuts. It's a nice variety, but we've tried them all and they're just okay.\nI do love Letizia's baked goods. They have some really good cookies and little pizzas.",
            "author": "Leanne A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-01-07",
            "description": "At a time when it's zero degrees out and everything is covered in dirty snow and ice, we were pleasantly surprised by the indoor farmers market at Emporium. My husband and I met up with a friend to grab some food and walk around the market. It was so cool that you could still order beer and other drinks at the bar while people shopped all around you. There wasn't a lot of produce, but there were still your typical farmers market goods such as honey, fresh bread, soaps, some herbs, and canned sauces and salsas. \n\nThe best part was the selection of snacks to nibble on while you're there. We had delicious steak tacos and my friend had both Filipino and Latin American empanadas. \n\nThis is a great spot to hang out with friends when you're looking for something different to do than stuffing your face at a breakfast diner. I mean, I love doing that too, but I wanted something different and this was great!",
            "author": "Arelys A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-01-30",
            "description": "There are 2 separate Yelp pages for the indoor and outdoor Logan Square Farmers Market, but I'm writing a little bit about both on this page (the indoor one).\n\nThe indoor Logan Square Farmers Market exceeded my expectations.  The outdoor one is so large, so I didn't know what to expect from the indoor one when I visited recently.  The indoor location is easy to find, and has large signs outside of the building labeling it.  There also appears to be a parking lot next to the building in case you want to drive to the market.  \n\nThere are some awesome vendors inside the Logan Square Farmers market.  Examples of products you can buy include: fish, soy cheese, veggies, gourmet ginger beer/ale, Italian sausage.  There are countless other products to pick from as well.  Most of the vendors are so outgoing and passionate about the products they sell.  I spent a little bit more money than planned during my first indoor market visit, but there were just so many appealing products I wanted to try out.  \n\nIf you are looking for a fabulous outdoor farmers market during the warmer months, you really need to also hit up the outdoor Logan Square Farmers Market as well.  One of my favorite things about the outdoor market is the fact that there are several vendors serving hot food to go.  Both the indoor and outdoor market's are well run and a pleasure to visit when you are looking for Midwestern produced foods/products.",
            "author": "Yvonne I."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-11",
            "description": "One of the best Farmers Markets in Chicago.  Tons of vendors, plenty of parking (illegal) along with a nice location make it a must stop.  I tried honey from the honey vendor. Outstanding.  They have a GARLIC Farmer vendor with all types of different garlic. Must stop here!  Truffles from Katherine Anne's? They got em.  Tons of hot food as well as drinks and such to be had.  Bring cash & plenty of it. Talk later",
            "author": "Michael H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-06-04",
            "description": "Logan Square Farmers Market was an uplanned stop after brunch over Memorial Day weekend.  There was a great assortment of food options - not only to have a snack, but also some very nice looking veggies, flowers, cheeses, etc.  The prices were a bit more expensive than some of the other markets (a chocolate cooke was $3), but the quality was good and the stalls all had very friendly staff.\n\nI'd stop in when in the area, though not sure I'd make a specific trek here as I have closer markets to me.  \n\nSome of the stalls were the same as ones that are at the Green City Market, but in a smaller venue, so less of a wait!",
            "author": "Kathleen C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-22",
            "description": "The Logan Square Farmers Market is a true gem. There's something for everyone - whether you're looking for fresh produce, baked goods, fresh flowers, live folk music, or local food. \n\nThe vendors are friendly, and the crowds have gotten bigger of the years, which is a testament to what a wonderful market this is.\n\nParking is free on Sundays in the lot on Emmett, just north of the Logan Square blue line station.",
            "author": "Debbie S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-01",
            "description": "This farmers market offers a great selection! \nWe tied the pickle/cherry/peppermint snow cone from Jo Snow and it very refreshing. Definitely worth a try. The produce I bought was of great quality as well as the baked goods. Several items to eat at the market too. Good place for lunch",
            "author": "Sarah L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-10-02",
            "description": "Look out Lincoln Park!!! This is the Sunday farmers market. Live music rings in the air.....\n\nFruits and vegetables(blueberries, cherries, plums, peaches, greens, watermelon, swiss chard, string beans, potatoes, onions, garlic, mushrooms, carrots, beets, lettuce, tomatoes.... ok must I go on? Let's just say summer's bounty.\n\nOn the prepared side:flavored shaved ice, ice cream, iced tea, fruit drinks, chai, confections, hot sauce, bread and other baked goods(including a gluten free bakery), kale burgers, beef burgers, pizza, sandwiches and of course Gayles grilled cheese sandwiches(with a gluten free option).\n\nFor the home there are flowers, plants and soaps, snacks for pets.\n\nThis has become my favorite Chicago farmers market. And I  have to agree with others that the vibe is much better here.",
            "author": "Abina G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-30",
            "description": "I like this market a lot. It reminds me of the markets I grew up with in Southern Illinois. Lots of vendors with fruits, vegetables, pastries, breads, and handmade products. There is even a doggie treat stand, chocolates, homemade sodas, donuts, cheese, olive oil and balsamic vinegar, flowers and gluten-free/vegan desserts. I just started going to this market two weeks ago and have been doing my week's shopping here. I can easily find a parking spot in the neighborhood and take my little dog (she seems to be a big hit with everyone) with me. My husband commented last week on how good our dinners dishes have tasted since we started shopping here. They have a water stand, too, which is helpful since it's been awfully hot lately. The organizers of this market are doing an awesome job!",
            "author": "Betty S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-31",
            "description": "Such a fun farmers market with so many great produce, fresh flowers, bread, a variety of food options and everything in between! Nice location and great place to people (and dog) watch. Gets pretty crowded and prices are a little high but definitely one of my favorite farmers markets in the city.",
            "author": "Ann P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-26",
            "description": "This is my favorite farmer's market in the city. The selection is great the location on a warm rain less day on the boulevard is beautiful. Otherwise this market moves indoors down the street during the cold months and on rainy days. The very nice mix of vendors keeps me coming back time and time again. As others have mentioned, sometimes parking is a bit of a challenge but I usually find a spot after a few minutes of looking. After I have found good place for my car, I seek out my favorite vendors. Well to be perfectly honest, I stop at just about any vendor that catches my attention with their offerings. I don't memorize all of the farmers tables that bring out beautiful produce because many overlap with the same offerings. But I try to stop and purchase from as many of them as I can. Depending upon my upcoming week's food needs. I try not to purchase too much because I don't want to lose anything to spoilage. Plus I realize I am paying a premium price for for that was very recently picked and usually taste better and has more nutrition that the typical grocery store. When you purchase at a grocery store, you don't know how long ago it was picked therefore it probably is not as fresh or nutritious.\n \nI always have to buy microgreens for my salads at American Pride table. If a need a picker upper, than a energy jolt at City Press Juice and Bottle is always nice. It's hard to pass up the beautiful and unique flowers at The Flower Garden. La Boulangerie makes some very good bread, as a matter of fact some of the best in the city. Who can resist Letizia's Natural Bakery tempting sweets?? For those of you that love homemade style sausages and bacon then at stop at Underground Meats is a must. I have never been let down by any of my purchases at any of these vendors.\n\nEach time I pass the Jake's Country Meats table I always remember that once again I forgot to being a thermal bag with ice in it to purchase meats?!? Next time Jake because I do care about eating quality meats that were not massed produced and raised humanely.\n\nAlso, if you didn't eat anything and are hungry after shopping for the upcoming week then there are tons of great restaurants within 2 miles of the market. Good luck in your farm to table search for great produce!",
            "author": "William G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-19",
            "description": "I am so in love with my neighborhood. Today, Almond & Olive played while I ate my amazing stuffed cabbage leaves, and the entire experience took my breath away. I love this community of farmers, and I can't wait to make amazing things with all of my beautiful fresh ingredients.",
            "author": "Stephanie M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-03-19",
            "description": "So long for winter market 2 doors down from me! but can't wait for this summer's outdoor market!",
            "author": "Allison F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-05-22",
            "description": "Several vendors including farmers, flourists, food, flavored snow cones, tofu, etc.  Easy access too blue lines and a few bus lines.  They even have parking for bicycles.\n\nA negative was too many baby carriages and they moved slow.\n\nI participate with the city farm compost system and the farmers market is a drop off location for their compost buckets.  Definitely will be going on a regular basis.",
            "author": "Sean S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-26",
            "description": "This is my favorite farmer's market by far.  I live in Lincoln Square and our local markets try, but they are no comparison to Logan Square!  They have a variety of produce stalls and cheese, which is my key priority, but they also have other tasty products, breads, honey, soap... but I REALLY come here for the \"street food\"!!!  COME HUNGRY!  There is always interesting hot foods, plenty of vegan options, if that is your thing, and fun shakes and drinks.  I have not been to the indoor one, but need to remember to continue to support this amazing market.",
            "author": "Kristin V."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-08-04",
            "description": "I've never visited the indoor market during the cold months, but I am a huge fan of the outdoor market.  \n\nI only wish they were open earlier (10am to 3pm Sundays)  just so we can get an early start on the day AND have breakfast at the Market, yes, even on Sundays we are up early in the Mommyhood.\n\nThere is fresh seasonal produce, flowers, herbs, meat, cheeses, jams/jellies/honey from local farms.  There are food stands--tacos, crepes, zeppole, sno cones, and probably more that I fail to recall.  Something really for everyone! We really enjoyed the fresh berries and cherries from our last visit. And the sno cone syrup is on my list for next visit.\n\nThis is a great place for all ages--I appreciated the little area where a live band was setting up and they set up a place for kids to draw and pin up their artwork on a clothesline as part of the \"art' section.  Lots of strollers so watch your heels.  Lots of dogs out with their owners. Catch a sunny breezy day and the LSFM is perfection.",
            "author": "Aimee M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-28",
            "description": "My main goal going to the Logan Square Farmers Market was buying some asparagus. I love it and it's nearing the end of its season. I had to get me some! I bought some at the first stand I saw for $4. Then I saw some at another stand for $3. And then!!! $2!!!! What a rough life I lead. Lesson learned...check all stands before committing! I'm horrible with commitment and see what happens when I finally man up and bite the bullet, totally screwed! Just kidddding. :D\n\nMany thanks to the homie Matt R. for reminding me about this Sunday market. I went to the market this past Sunday and I must say this ain't your 'burbs farmer market. There are so many booths - a wide variety of fruits, veggies, baked goods, jams, meats, cheeses + music!!!  - just about everything you could ask for. There are also so many people - hipsters, families, friends, couples, a bit of everything. And! When it's 90 degrees out it can be a bit brutal with the people everywhere. I've never been to such a busy farmer's market in my life. \n\nI absolutely see myself coming back but I'm going to wait for a day that isn't so blistering hot so I can do more than a quick run through.",
            "author": "Sarah S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-08-22",
            "description": "Probably one of the best if not the best farmers market in the city. Along with being consistent, LSFM holds it down with options on top of options of organic booths and fresh foods. I imagine some people do their \"grocery\" shopping here and it would not be difficult. \n\nThere are also some \"restaurant\" style food options for lunch that are located throughout but most notably on the eastern most part of the market. Get your fresh flowers and plants, cheese, fruits and vegetables, while enjoying a nice summer day.",
            "author": "Rawlins R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-30",
            "description": "Love love love this market. It's my all-time favorite. Opens at 10...haven't been to the indoor winter market, but LOVE the summertime market. Great food, photo ops, people watching, dogs allowed, fresh everything. Friendly lovely market to meander thru on a Sunday morning. Parking? Not so fabulously easy but worth it. C'mon down.",
            "author": "Renee R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-06",
            "description": "Totally charming and perfectly sized famers market. Excellent array of options - my faves were the goats' milk soaps, Ludwig Farms cheese and the homemade caramel lady with her son. My friend bought tons of veggies and some pepperoni. Wonderful way to spend a few hours on a nice Sunday! Follow it with a delicious brunch at JAM.\n\nSuper dog friendly if you live near there and want to bring your pup.",
            "author": "Caroline B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-25",
            "description": "Voted best farmers market in the city and rightfully so. This market has more organic vendors than any market I've been to in Chicago. Tons of great options from produce to pasture raised eggs to homemade kale burgers. Last time I was there I bought organic cherry tomatoes, eggs, and some tomatillos. So great!!",
            "author": "Nicole B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-12-21",
            "description": "This is such a cute farmers market! Cute and small, but dense with interesting vendors. There were vendors selling apples/apple cider, tofu products, baked goods, gift tags made from bark, jams, and many more items. Many of the vendors also offer samples of their products, so you get a chance to try before you buy! \n\nNosh (many food stands) is in the back. Try Gayle's Grilled Cheese (and get the one with the grilled onions, it's my favorite). There are also other vendors selling bao, empanadas, tamales, soup, etc. Plenty of seating in the back as well!",
            "author": "Linda L."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-08-11",
            "description": "3.5 Stars\n\nFarmer Markets in general will always get at least 3 stars from me because whats not to like about people selling healthy fresh produce?? Only reason I don't rate this one higher is because compared to the other ones I go to Im just not really feeling the atmosphere. Not to say it's disogranized, but I guess I just like the surroundings and ambience of other Farmer Markets better (Daley Plaza, Green City, Division Street). Everyone is really friendly, produce and fruit (love the peaches) are fresh...I don't know something about the vibe is off. I was about to say maybe it's a little too family friendly for me and all the kids throw me off. LOL...can't put my finger on it.",
            "author": "Tavi J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-17",
            "description": "I liked this little farmers market.\n\nThey have lots of everything...cheese, bread, meat, veggies, fruit, jams, sauces, flowers, and food in general.\n\nSo, yes the farmers market is expensive...but this is every farmers market in the city.\nI got some fresh rhubarb, kale, cucumbers, cheese, unicorn tears hot sauce!\n\nI love the little snocone stand!  I tried out the rose rhubarb one.  Delicious.\n\nI also had some tacos, which were extremely flavorful and super cheap!  $2-3!!!\n\nOverall, this farmers market is perfect.  Its not huge, but it has everything that is expected at a market.",
            "author": "Stephanie L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-10-13",
            "description": "Surprisingly larger than I thought it would be. There is a great variety of stalls. Great place if you're interested in the -free stuff: Gluten free, dairy free, etc. Lovely place to take your kids and pets. Additionally, there is real food served such as grilled sandwiches, burgers, etc.",
            "author": "Lily Z."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-04",
            "description": "To gain entry into the Logan Square Farmers Market, you must possess at least one of the following:\n\nA stroller (bonus points if your toddler is clad in baby Toms)\nA dog (bonus points if it's a mutt and/or rescue and/or has only three legs)\nSeveral visible tattoos\n\"Handcrafted cocktail\" moustache\nAt least one item of vintage clothing\nCirca-'68 Jagger haircut hiding under a knit hat\nStatement sneakers\n\nIn all seriousness, none of these are a prerequisite, but you will for sure see all of the above, and in many cases, by a single individual.\n\nSo the Logan Square Farmers Market has grown and prospered much over the last few years, and since I go just about every week in the season, an update (and addition of a star) is very much warranted. I actually live so close to this Market, that it's practically on my front lawn. I couldn't avoid it even if I wanted to, so I've learned to embrace it (not that I have much of a choice).\n\nThey've added a lot more vendors over the years, like Katherine-Anne Confections, Spencer Jolly Posh Foods, Rare Bird Preserves, and Koval Distillery. Food options aplenty: Zullo's, which sells zeppole (donut holes), Cherub's (great tacos), bangers at Spencer's, crepes at Cook Au Vin, Puffs of Doom (artisanal cream puffs) and several stands that sell baked goods.\n\nObviously there's a ton of produce stands selling fruits, vegetables and herbs (my favorite is the one that sells any and all varieties of mushrooms), as well as flowers. Prices are generally the same from vendor to vendor, but it's worth it to scour the market before purchasing to make sure you're getting the best deal.\n\nThere are also tents for community organizations and local businesses like IGO Car Sharing, and Alive Rescue, an animal rescue group.\n\nCash is king at the Market, but if you stop by the Logan Square Chamber of Commerce tent, you can pay by credit card and get vouchers to use at the various booths. There's almost always live music playing at the Market (sadly it usually involves banjos). Leftover and excess food is donated to a local food pantry.\n\nThere's a lot of good things happening at the Logan Square Farmers Market. I do wish they were open earlier than 10 am, but I guess lazy hipsters like to sleep in on Sunday mornings.",
            "author": "Melanie S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-11-10",
            "description": "One of the greatest hidden gems in the city! If you haven't been here yet, go! Come hungry and leave happy, along with some fresh goods!",
            "author": "Nicole G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-09-04",
            "description": "Okay, after five years, I must revise.  This market has probably tripled in size, and serves both types of patrons--those who want to shop for real goods and those who go for something to do (possibly even, dare I say, to see and be seen?).  \n\nThere is definitely a lot to see, taste, and smell.  The market strikes a good balance between prepared foods, specialty foodstuffs, and actual produce.  Size and variety is an asset which most neighborhood markets cannot boast.  One could eat very very well there, then go home and eat very very well for the next several days.  Despite the east-end profusion of wild boar ravioli and organic snow cones and artisinal cream puffs et alia (all very delicious, I'm sure), down on the western half it is an honest to goodness farmers market with more fruits and vegetables than you can shake a sprocket wrench at.  Color me satisfied.  I will still go to Evanston on Saturdays, but if I need produce on a Sunday, Logan Square would be #1 on my list.\n\nIf there is one significant criticism left, it's that the booths are too close together, both side-by-side and across the aisle, leading to general crowding and an inability to \"take it all in.\"  I just didn't feel that I could look around or ahead and get a good sense of what was available.  I couldn't really see a booth until I was right on top of it.\n\nOh, and also, the opening hours are laughable--10am to 3pm.  Bunch of lazy hipsters!  By 10 in the morning I should be at home with my wares, cooking second breakfast.",
            "author": "David R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-10-10",
            "description": "The LSFM and the Green City Market are my two go-to markets in the Chicago area.  Both are excellent, but I tend to like the vibe of Logan more.  The vibe is definitely very laid back with lots of families and their fantastic canines spending what I believe is the perfect way to spend a Sunday afternoon.  \n\nMy go-to stand places for produce such as corn, melons, and carrots is Geneva Lakes.  Their goods are consistently of good quality and prices are super reasonable.  If salad mix, kale and other greens are what you're looking for, hit up Growing Home (located right across from Geneva Lakes).  They tend to also have fantastic tomatoes in the summer as well.  More awesome than their produce is their model.  They're a non-profit organization with urban farms in the South Side of the city, and they really do a great job in training less privileged people in the community by providing training on the job and in the future.  For meat, Mint Creek, Cedar Valley and Jake's are present at the market.  Both Mint and Cedar have fantastic eggs and Jake's ham and bacon are top notch.  \n\nYou cannot leave the market without having brunch.  The two vendors I tend to gravitate towards are Gayle's for grilled cheeses (breakfast ones are decadent) and Spencer's for a banger+back bacon sandwich.  Floriole out of Lincoln Park has a stand to help curb your sweet cravings.  Aside from the sweets (love the doughnuts), they have these personal sized pizzas ready to be devoured.  I have yet to try one, but they do look good.  If you're looking for a loaf of sourdough or a baguette, La Boulangerie is your stand.  I love the sourdough bread!  The consistency makes for a great sandwich or some French toast!  \n\nDespite being located in a busy area, parking is actually not too difficult to find.  You can always find spots on Milwaukee within a few blocks.  The area is also easily accessible by the Blue Line and various CTA bus lines.",
            "author": "Mark Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-10-02",
            "description": "I had a wonderful time being here. One of the better farmers markets that I've been to. I would recommend to anybody that enjoys coming together to celebrate fresh, and local foods.",
            "author": "Jaedrian D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-17",
            "description": "This is a five star, kick ass farmers market. I don't see why this deserves anything less than 5. At least for me. This is as good as the Evanston farmer's market, but with a very specific different focus.\n\nEvanston is basically all varieties of plants and flowers, logan square is basically all varieties of vegetables and restaurants from the area. \n\nNotably, chicago diner had these bahn mi wraps (which are *awesome*) 2 for $5, as well as some awesome taco stand which had equally amazing Horchata. Did I mention the tomatoes the size of a grapefruit? Yeah, this has to be seen to be believed.\n\nLocation is a little difficult for parking (plus to Evanston), but variety is good. It's also notably smaller, but there's plenty of open grass areas to sit and relax (minus to evanston, you only have tables near the entrance).  \n\nI'll be coming back here every weekend, and I love that the crowd is logan square crowd (different age group) vs Evanston market crowd.  Not everywhere accepts credit cards, but many do. All I can say is, go forth and check it out! This includes many of the vendors seen in Evanston, and seen at the Glenwood market (the folks with the mushrooms and the tomato sauce folks).",
            "author": "Matt R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-02-25",
            "description": "Don't miss the Logan Square Farmers market- the best in the city, and right in the heart of Logan Square.  It's a scene all right!",
            "author": "Bart S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-07",
            "description": "Surprisingly decent selection of local produce and meat as well as things you don't necessarily find at the average farmers market-- stuff like smoked fish, or a pretty decent selection of bread. I was also pleasantly surprised by the balance between prepared foods and fresh produce-- thought there was going to be more in the way of vegan cupcake food trucks or some such yuppie nonsense, but it was really pretty balanced and the selection was great.\n\nMy major gripe is the $5.50 for a dozen eggs, which every stand seems to subscribe to. At that price, I can handle some environmental degradation from factory farmed eggs. I walked there from my house, so it'll be okay.",
            "author": "Nat Z."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-11-20",
            "description": "Got some nice sized live herbs here way cheaper than even Trader Joe's. My mint plant is thriving- $3 well spent.\n\nIt's a little farmer's market, but I'm spoiled and my first year and a half of farmer's market experience was in Madison, WI. I'm not sure how anyone could compete. It's cute and has great hours- much later than any weekend market I've heard of.\n\nFruit & veggie prices seem reasonable. On par with the organic stuff at someplace like Whole Foods. Shop around before you buy though- prices on the same thing vary a lot.",
            "author": "Laura H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-08",
            "description": "Awesome market with a great variety of produce, meats, cheeses and goods. The venders are happy and smiling and the prices are more than reasonable for the organic homegrown options being offered.",
            "author": "Ariel B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-12-12",
            "description": "Buying from farmers and food producers is really important to me. LSFM offers me the opportunity to do so 46 out of 52 weeks a year.",
            "author": "Whitney R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-09",
            "description": "Wow. What fun. Fresh vegetables galore. Freshly baked french rolls. Assorted jams, jellies, salsas, barbecue sauces. Freshly made foods. Artisans all.",
            "author": "Bob R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-29",
            "description": "Solid Sunday Market with Yoga on the grass, good vendors coming from as far away as Indiana and Wisconsin, and a bit of a party atmosphere make this a place to visit again and again. \n\nI wish they rented the Mega Mall on Milwaukee and did this all winter! They should.",
            "author": "Marc R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-25",
            "description": "I FINALLY got around to coming to the Logan Square Farmers Market regularly last month (took me damn well long enough) and I am in love.  \n\nA) It is a five minute walk from my apartment\nB) If you get there a bit earlier (say by 10ish) it isn't crazy crowded\nC) All the vendors are so friendly and helpful\nD) A lot of the vendors accept credit cards (which is great for me since I don't ever carry a lot of cash on me)\nE) Great variety of organic and local vendors\n\nI've been picking up primarily produce (there is a plethora of fresh, tasty, local fruits, veggies, meats, cheeses, etc), but will definitely be coming by closer to lunch one day to grab some eats (I always see people wandering around with really great looking tacos).\n\nAnd I believe the farmers market head's to an indoor location once it gets too cold out.  A year-round Farmers Market is soooo good in my book.\n\nIf you are in the area check it out - you won't be disappointed!",
            "author": "Natalie C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-09-25",
            "description": "Great variety. Lots of fresh fruits & vegetables. Organic soaps, dog food, local restaurants. A bit pricey. Lots of hipsters. Area is great.",
            "author": "Alejandra L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-23",
            "description": "This Sunday Market has really changed since I wrote my initial review. It still has great food finds from local purveyors in the City, Downstate, and Michigan, but has really expanded, offering more prepared food, bakery, holistic services, and sellers of bric-a-brac.\n\nMy last visit being an example of the diversity: I got chard, local honey, tamales in black mole sauce, free acupuncture, a book, a GB Packer wrestling mask, and a slap on the ass! How's that for weirdest farmer's market visit ever?\n\nThe Farmer's Market is the centerpiece of businesses that have grown up around the square. It's like, the gateway Sunday drug! The Market moves indoors for the winter, to the Congress Theater starting Nov. 6.",
            "author": "Kyle H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-29",
            "description": "Not a huge market, but a really nice, neighborhoody one. They have a little bit of everything, from frozen meats to breads, honey, soap, and prepared foods and bevs. It's not crowded, but also not depressingly deserted. There's nice bike parking. There's also an area at the east end where people sit and enjoy the wares they've bought. It seems dog-friendly it doesn't affect traffic at all because it's on a side of a street, and goes into a park.",
            "author": "Mira S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-05-27",
            "description": "What an awesome Farmers Market! \n\nThere were tons and tons of vendors, lots of options, and it wasn't horribly crowded. It's a great way to spend a Sunday morning/afternoon!\n\nWe ventured around, taking a look at the yummy goodies that each booth has to offer. There was salsa, freshly baked bread, veggies, and every single potted flower that you could think of.",
            "author": "Shaina K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-06-03",
            "description": "Thought this was OK. Definetly more unique than suburban Farmers Markets. Was hoping for more fresh cut flowers instead of all the potted ones. Some areas were rather crowded and some vendors seemed non existent. Went later in the day around 1pm so that might have been the cause.\nI would go back to this again and I do recommend it.",
            "author": "Megan D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-10-09",
            "description": "I guess I'm a bad Logan Square neighbor because it took me years to finally get here. With a toddler needing fresh air, the farmer's market has been our go to Sunday activity. Throughout our various visits, we've gotten lots of delicious local vegetables, fruit, tacos, cherry limeade marshmallows, and cider donuts. This is a great diverse farmer's market. I've avoided the drool worthy bread and pastries, but they always look so tasty. New Wave is smart to have a table set up to get an iced coffee fix while wheeling around my little dude.\n\nI like that the market is set up on one part of the street and into the boulevard. Oftentimes, we go to the part of the boulevard where families set out blankets and eat their farmer's market goodies. My toddler loves to walk around this grassy boulevard, greet dogs and neighbors, and eat Goldfish crackers. Overall, I like this market. It's made for a fun Sunday activity in the Square.",
            "author": "Carrie S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-02-25",
            "description": "I must disclose that I've never been to the outdoor market, but with cabin fever raging we decided to take a trip to the indoor farmer's market, just to get a hint of summer.  The indoor market is housed in an old bakery.  I thought they had a good variety of wares despite the fact that February isn't exactly growing season in Illinois.  They did have apples, and very delicious blueberries that were grown in Michigan and frozen, and tasted oh so fresh, as well as some indoor-grown greens.  This time of the year the market focused more on goods like baked goods, candies, sauces, and more.  The baked goods included the ever illusive vegan macaroons and creme puffs.  Yes, I admit I tried both of them and they were delicious!  I also fell in love with the kale burgers, lovingly made and frozen for your convenience.  \n\nThe market also offers a variety of local restaurants serving up their specialties, as well as musical entertainment that varies each week.  Truly, it's a pleasant way to spend a chilly Chicago afternoon until we can get outdoors.  I plan on going back.  I also can't wait to check out the Logan Square Farmer's Market this summer.",
            "author": "Debra L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-24",
            "description": "I love a Farmer's Market I can walk to -- just gets ya in the mood!  Just grab my reusable tote bags, my sunscreen, and my cash and I'm off to a fun Sunday at the market!! The Logan Square Farmers Market actually accepts credit cards, but you have to get a ticket then take it to another cashier tent and then come back to the original vendor's tent.  This is great for those using link cards, but otherwise slightly inconvenient.  If you have cash, better to use that for transactions to save you wait times in the cashier line and your vendor lines.  \n\nEven on days when I don't need groceries, I still enjoy heading to the Logan Square Farmer's Market as it's a great place to lunch.  I love their mexican food vendor.  They offer tacos made to order!  The line is usually pretty long so be prepared to wait a little.  There are also other restaurant vendors that sell brats, chicken tenders, and other foods.  \n\nThe variety of fruits and veggies here are great.  The farmers that come to this market to sell their goods are super friendly as well.  Whenever, I didn't know the difference between certain veggies or how to cook them, they answered my questions in a very friendly way!  Thus I always left feeling empowered and excited about my fresh finds at the market.  There are also vendors that sell honey, jams, and flowers -- the usual variety you would find at a farmers' market. I truly enjoy coming here when I get a chance.  The prices are pretty on par with other farmers' markets and it's great talking with the vendors. \n\nMy only gripe is that sometimes, after a Farmer's Market, the boulevard is left a mess.  Probably more the customers of the market causing the issue than the vendors, but sad when food/garbage is left on the grass or picnic table.  I usually walk my dogs down this area either the evening right after or the morning after, and it just plain sucks when people don't take the effort to throw their garbage into the many trash cans around and they just leave it. \n\nAll in all, the Logan Square Farmer's Market  has all of the staples you'd expect from a farmer's market -- fresh fruit/veggies, jams, flowers, and ready to eat foods.  Best of all it's right in the middle of the homely Logan Square neighborhood so you get that feeling of escape from the city.  It is truly a gem!",
            "author": "Jasmine P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-10-02",
            "description": "I love this farmers market, the produce stands are set up to look like mini-Whole Foods.  There was one stand selling brussels sprouts on the stalk this past Sunday and they sold out so fast!  (BTW, I had no idea brussels sprouts grow the way they do.)",
            "author": "Tiffany L."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-07-16",
            "description": "Mocha + Almonds = MOCHA ALMONDS! \n\nI am glad that I only bought a pack of the mocha almonds because I cannot stop eating them! If I smell like mocha and look like an almond when you see me, please don't be surprised or try to run away from me. I promise that I won't turn you into a mocha almond too.\n\nAs much as I love the almonds, I wish that they and the other food stalls here are cheaper. According to my friend, who is a chef, the tomatoes and mushroom here are fresh yet too overpriced. \n\nRegardless, I will come back to check out the jam next time. \n\nFood: 3\nService: 3\nDecor: 3",
            "author": "May Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-20",
            "description": "Love Logan Square Farmer's Market! They have a great variety of vendors. Ready to eat food/dishes, as well as tons of fruits, veggies, cheeses, and meats to take home and cook up a good dish. There is also always live music entertainment that you can listen to during your meandering walk through the market. The musicians vary from week to week, so there is a good variety. It is great for all ages and even dog friendly! You can also pick up a beautiful bouquet of fresh flowers. I have never been to the indoor market during the colder months, but plan to try that this winter. If you haven't made it to this farmers market, I recommend going soon as it will go indoors at the end of October!",
            "author": "Michelle D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-03-23",
            "description": "The Logan Square Farmers Market has relocated for the winter and it's with Nosh for winter '13-'14. Many of the usual vendors from the summer market come to this one as well. There is a great mix of raw ingredients, prepared foods, and local craft goods. There are still enough options to give you some meals for the week but not nearly as much as over the summer. There it's everything from salad mix, to free range meats, to fresh cheese, to kale burgers. Check it out if you haven't yet! It's worth the trip!!",
            "author": "Kelsey K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-01",
            "description": "Okay, people, we only have two more weeks left of this! Think it ends like October 20th or something. Anyone know the date? Probably could look it up. Anyway I agree completely with Amanda below. Best Sunday activity and I've done the yoga! Really great. The best part about the Logan Square Farmer's Market (and I do love the one in Wicker Park) is its not too hustle and bustle like so many others. Yeah, its gotten bigger but its still got this raw neighborhood feel which I love.\n\nDefinitely hit it up before the weather completely goes yucky.",
            "author": "Alexis R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-04-11",
            "description": "Oh, I love you Logan Square Farmers Market. \n\nI love strolling through on a lazy Sunday morning. Grabbing some fresh produce from local farms, vegan baked goods from local shops or even a full lunch to eat in the grass. \n\nI suggest going earlier in the morning, as it tends to get pretty crowded as the day progresses. Still great for people watching, and dogs are welcome! Which is great, but my dog doesn't do well with crowds. It does get a little frustrating when everyone is all over the place. But I can't blame them for being distracted by all the goodies and not paying attention to where they or their stroller are veering. \n\nI'm happy that the winter market has moved out of the congress lobby, as I feel it's in a better location now. But I'm so excited for the summer market to open up in May, so I can feel the sun on my shoulders as I fill my bag with the most delicious market offerings.",
            "author": "Whitney B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-28",
            "description": "This is easily my favorite farmer's market. It always has a small-townish feeling to it and you sort of feel like you're at a state fair, but with much much better food and produce to select from. \n\nIt's amazing how crowded the Logan Square Farmers Market has gotten over the years. Now you have to wait in a good sized line just to get some horchata from Cherubs' stand! Seriously, I'm not kidding. It's fairly crazy as it's not like Cherubs is all that far from the Farmers Market and it's not like Cherubs is barely ever open. To the victor goes the spoils I guess. \n\nBut, that really isn't the point. What is the point is the absolutely fantastic produce, meats, and breads you'll come across here. While I wouldn't say that this is the cheapest Farmers Market out there, that also isn't the point. You come to a quality Farmers Market to get really good wares, which is exactly what you get from here. \n\nSimply put, I always look towards the few Sundays I have off during the summer and the Logan Square Farmers Market is exactly the reason. I just can't get this kind of quality in stores. I'm also able to get a great amount of quantity to go with the awesome quality as well. If you fancy yourself as someone who even remotely enjoys cooking, this is one of the best Farmers Markets to come to. Trust me, you won't be disappointed.",
            "author": "Keith A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-26",
            "description": "What are you doing Sunday morning? Wanting to get out for a quick stroll around the neighborhood? Want to pick up some produce, but the grocery store never has fresh produce? Want to take your dog for a walk with new scenery? Want to do yoga? Want to grab a bite to eat? Want to pick up some new flowers to replace those dingy ones in that vase on the counter? You can do all this and more any given Sunday at the Logan Square farmers market. It isn't too big, but they pack a lot of great stuff into the space they reserve. They have everything from produce, flowers, meats, eggs, pastries, to ready-to-eat meals. It's great even just to walk around and look at everything, it can be a very eventful Sunday morning mere blocks away from your doorsteps.\n\nAlso, they sometimes offer free yoga lessons too (I don't  know all the details, but it looks fun). I believe the farmers market goes until October, it's a great Sunday ritual for me!",
            "author": "Amanda F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-05-31",
            "description": "Strong game, Logan Square. Strong game indeed. Midwestern farmers go hard in the paint.",
            "author": "Jay T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-13",
            "description": "Ok I just love going to farmer's markets. This is a farmer's market plus some. \n\nThis is a rather large market. If there is something in particular that you are looking for, then you will will find a vendor here that will sell it to you. There are so many different booths set up and there is live music, you can easily make an afternoon out of a visit here. You could call it more of an event rather than just going to a farmer's market!",
            "author": "Dave S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-06",
            "description": "I prefer to go to the Logan Square Farmers Market over the Wicker Park one because there is so much more variety.  The farmers market is structured in that vendors selling goods are in one section, and vendors selling prepared food are in another section.  They also have live music performances.  Overall, the prices are about the same at each vendor.",
            "author": "Alexandria T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-17",
            "description": "The rating is for atmosphere/vibe and variety.\n\nI don't know where these other reviewers are finding cheap farmers' markets, because I haven't been to one yet. This place is not Aldi or Walmart, there is no mass production to grow the profit margin. That's kinda supposed to be the point: paying more money to have better quality AND getting the benefit of meeting some of the people who grow the food.\n\nIt's beautiful. There are a few flower vendors. Random non-food vendors. Random musical performances. Prepared food vendors! This year I've eaten bangers and donuts and chimi-churri sauce covered meat. Loaded with kids and dogs. \n\nThe cheesemonger and mushroom people who are at every Chicago-area FM are here. \n\nI don't stock my pantry here, but I always find something fun and delicious.",
            "author": "Britini R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-23",
            "description": "Most relaxed  and comfortable farmers market in Chicago. I love coming here on Sunday, even if I'm not buying anything.",
            "author": "Dina F."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2011-09-06",
            "description": "AM I AT AN OPEN AIR WHOLE FOODS? \n\nHOLY OVERPRICED EVERYTHING, BATMAN.\n\nI love a good farmer's market. I do. They're lovely. I grew up in the small town, and as a child was surrounded by vegetables from the garden, and as much fruit as MN weather could support. \n\nI have never, ever, been to a farmer's market with prices like this one has. I could drive for an hour or two, find a produce stand on the side of the road, and still save money, gas included, compared to what I'd spend here. A quart of fruit (about 1.5#, people) for $5 or $6? What? At that point, you're gouging me, I don't care how local you are, or how nice you are. I could stop at almost any gas station in WI and get cheese just as fresh and organic and the cheese people tried to sell me for a third the price. Don't even get me started on $15/# sirloin. \n\nI understand we're not in rural America; we're in the third largest city in the country. OK, I get that. The problem is I can get produce and meat anywhere from 25-50% cheaper from many different places in the city. It's just as organic, natural, and most importantly, it tastes just as good. \n\nI am willing to pay more to support a local farmer (local in this case being within a 50 mile range, which isn't very local if you think about it), and I am willing to pay more for \"better\" quality. I am NOT willing to subsidize someone's career choice to this degree. I can drive through rural IL, WI, or MI, and find just as much fresh organic produce along the side of the road, for half the price, if not less. \n\nLogan Square, I love you. Take that farmer's market and shove it in Lakeview or Lincoln Park, where its prices belong.",
            "author": "Adam S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-06",
            "description": "I'd done heard tell about how special this market was, but I did not witness it for myself until recently. After brunch at Longman & Eagle, a friend of mine and I wandered through. This does not compare at all to the one in my neighborhood, and in fact it puts it to shame. And it's not just the variety of goods and produce and specialty foods, but the sheer size of the market, its perfect location in the wooded boulevard, and the interesting crowd it draws. Lots of people were sprawled out on the lawn and parkway, picnicking, playing games. I think George Seurat would have a great time painting a few scenes here. It all just feels very European. I managed to pick up some scrumptious truffles and made some mental notes about what I would buy when I come back here on my own. What a delightful surprise this market is, and it well exceeded my expectations. Shazaaaaammm!",
            "author": "Jack P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-02",
            "description": "Ahhh, the Logan Square Farmers Market gets a rating upgrade.  I am so much happier with the market and all that is has to offer this year than I am with last year's performance.  Yes, it's still small.  Don't get your hopes up and think that it's expanded or anything - it's still on the same part of the boulevard near the Square.  However, things have just gotten a lot more bustling and happy!\n\nWe took a trip there today and the place was packed!  Seeing so many people there was really, really great.  I'm glad there's a lot of Logan Squarers who come out on Sundays to mingle with others from the neighborhood.  There were kids, dogs, musicians, artists - representatives of the community!  Each week there's a musician (or group) filling the market with some nice sounds.  \n\nThere's a few more vendors than last year and each booth seems to have more to offer than last year.  There's tons more produce (especially fruit!) and a lot of specialty products that I don't need but want anyway.  Five Cheese Garlic Spread from the River Valley Ranch?  Delicious!  Various cheeses from Provenance?  Super!  Blueberries from Noffke's Farm?  Bravo!  Crèpes from Coq au vin?  Chouette!  \n\nI'm much happier this year than last and going to the market has become a staple of my weekly comings-and-goings, rather than a once-a-month thing.  Get yourself out there to participate in the awesome neighborhood happenings - there's much fun and food to be had!",
            "author": "Jenna S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-09",
            "description": "Mere steps from my apartment each week, I get to witness a growing example of a Chicago \"animal\" - the baby farmer's market.  You can tell these younger versions of the full grown farmer's market by a few telltale signs:\n\n1) There are pregnant women.  The first stage of farmer's market development is to lure these with nutritious (mostly) organic food so fresh that not even one of Chicago's healthy food purveyors can compare.  When fully grown, the adult farmer's market will have strollers being pushed around by breeders with no manners and their screaming children.  Thus the baby farmer's market is better. \n\nLogan Square Farmer's Market is, unfortunately primed to grow up pretty quickly as it's on pavement and not grass making it easier to push a stroller.  Ick!\n\n2) The market is smaller than a full grown market.  Don't be fooled, however.  Like many small, adorable youth in nature, the baby farmer's market might rip your face off with its hidden power.  From organic soap (with $1 samples) to fresh bread bakeries to Michigan fruit, it has everything you need.  The adult farmer's market may have more stalls, but most of these are based mainly on redundancy.  Five cheesemongers are nice, but if they're good, one will suffice.  And,\n\n3) While it does not fear strangers, the baby farmer's market will stick close to its nest.  Instead of recruiting from all over the city, LSFM sticks to the west side for restaurants (with almost no lines) and non-farm vendors (including a couple local food co-ops).  The produce is from all over, but it's got a good local flavor.  And a secret I've never participated in, you can purchase farmer's market baskets for the season and pick up weekly produce if you're in the neighborhood.  Also, the market likes to call back the same vendors week after week and year after year.  It breeds a feeling of familiarity that many adult farmer's markets don't have.\n\nLogan Square Farmer's Market already draws customers in from all over the Milwaukee Avenue corridor so it won't be long before it's much bigger.  It has room to expand further down Logan and it's already gotten larger each year.  I'm just going to appreciate it now before it grows up and gets bothersome like many of the mature farmer's markets in Chicago.",
            "author": "Michael G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-09-13",
            "description": "Loved this farmer's market. Almost too many selections! After going to the 61st street farmer's market in Hyde Park for the past few months, where they have less than a dozen total vendors, this farmers market was overwhelming! \n\nWe ended up having to sit down and plan out our meals for the week instead of just picking up what looks great. \n\nI did end up with about a dozen peppers of various varieties - even a dark purple one! We like to try something new, so we picked up some mustard greens - no idea how to cook them yet, though! \n\nThere were also TONS of dogs!\n\nCan't wait to go back next week!",
            "author": "Elisabeth C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-01-04",
            "description": "We spent a lot of time in LA, and visited some of the best farmers markets out there.  Given the hearty 4 seasons that Chicago experiences, Logan Square farmers market is seriously one of the best out there, year round.  Winter, Spring, Summer, Fall, all bring a nice bounty appropriate for the season.  Huge variety, high quality and quantity, friendly farmers and vendors - you can't ask for much more.  Flowers, fruits and veggies, bakers, distillers, tofu makers, local artisans, gardeners, weekly entertainment, it really is all here.  Every week that I am able to make it, I am exceptionally happy and it is a great start to my week.  My usuals include: phoenix bean tofu, the mushroom farmer - grab bag $10 = awesome, french baguette, homemade foccacia, and a cheese of the mongers selection, among other seasonal selections!",
            "author": "Stephanie W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-09",
            "description": "It's small, but it packs a big punch!\n\nMichael G and I wandered over to the Farmer's Market to check it out before our road trip to Milwaukee. He warned me in advance that it's nothing like Green City Market over by my house, which ended up being a good thing (at least to me).\n\nFor starters, the stroller patrol seemed to be missing from this farmer's market, but from the number of pregnant women I encountered they'll probably be in full force next season. Also, there was less redundancy instead of 5 different cheese and meat vendors there was only one or two of each. Lastly, the lines and crowd were much more manageable; the wait for a crepe at Green City averages 30-45 minutes, in Logan Square it's more like 5 minutes tops. \n\nAll of the vendors at this market were friendly and very enthusiastic about what they were selling. I sampled some creamy jack cheese which made me weak in the knees. The Abbey Brown guy suggested a $1 remnant bar of soap since he could tell I was struggling with the decision to part with my cash. The bar is a perfect, dreamy smelling reasonably sized trial size, I also got a little card so I know where else to find them through market season when I become hooked. I picked up some amazing bread products from Golden Rise Bakery, mmm are their baguettes delish! To cap it off my visit I enjoyed a wonderfully yummy butter and sugar crepe from Cook Au Vin on a park bench while listening to accordion music, it made me feel like I was kicking back in Paris. Le sigh...\n\nBottom line: It's small, but a well chosen group of vendors which maximizes selection and minimizes redundancy.",
            "author": "Mary T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-09-13",
            "description": "I havent been to too many Chicago farmer's markets outside of the downtown area, so this farmers market was a nice change of pace. We were waiting for our seats at Lula Cafe and just browsed around. It seemed like everyone that shopped here had a dog.  If it werent for the food stands, I would have thought this was a dog park.  The weather was cloudy and drizzly but the vendors were still out selling their products (food and non-edible stuff).  Prices seemed a bit high but its a farmers market so thats to be expected.",
            "author": "Janet E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-09-06",
            "description": "Man has this farmer's market grown!!!  There are far more booths and random yard sales along the boulevard than before.  The variety is vast: organic vegetables/fruits/jams/salsas, pastries/bread by the past beloved Chundy's shop called Golden Rise Bakery, used books, milk-fed lamb meat, smoothly sweet local honey, gorgeous spring flowers, organic soaps, Cupid's churros/empanadas/tostadas/horchata, Cook Au Vin crepes made in front of you by the chef himself, and Tandoori Chicken sandwiches/Samosas.  Heck, just come for a mid-morning snack!\n\nNot only this but the Logan Square market has a feel unto its own (if you don't know what I mean, think bicycle + arty/new age + dog enthusiasts--or check out my New Wave Cafe review to get a better idea).  With this in mind, you can't happen to pass by the various unique live entertainers including a washboard-tap dance team, a honky (not meant to be insulting) tonk folk music group that sings songs in other languages and Lil Ethan's Back Rubs, a boy who offers should massages for 25 cents with his dad accompanying him at his side.\n\nIf you're hunting out a Sunday market, don't miss out between June & October, 10 am - 3 pm.",
            "author": "Richie D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-18",
            "description": "Not too many years ago, this market was small and not that impressive. I still went and hoped that it would grow. And every year it has. This year, I was blown away with how much bigger it has gotten. A lot more vendors and people have made this into a phenomenal market. Since it has started up again, we have gone every Sunday. You can get veggies, fruits, at times fresh cut flowers, breads and all sorts of prepared foods.\n\nWe have enjoyed walking over, looking at all the wares and planning delicious meals based on what we buy.  And they all accept credit cards! As a person that keeps no cash in the wallet, it helps to know I can still shop.  \n\nKeep it up Logan Square Farmers Market! I expect it to grow even more next year!",
            "author": "Jean C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-11",
            "description": "LS Farmers Market gets better every year!  I'm really pleased with the variety of vendors that they have.  They have yard sales nearby, and a lot of local businesses have tents set up.  They even have outdoor yoga!  My only gripe is that I wish they opened up a bit earlier!  Right now they don't open for business until 10:00am.",
            "author": "Angela L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-05-06",
            "description": "HELP SAVE OUR MARKET!!\n\nA story in the Chicago Tribune reports that Alderman Rey Colon of the 35th ward is not planning on approving  permits for the market this year.\nThe article indicates that he is doing this in retaliation because the director of the Logan Square Chamber ( who runs the market) supported his opponent in the recent election.\n\nSo let me get this right....he's mad at someone for not supporting his reelection so he shuts down a market that been enjoyed by the whole neighborhood since it's inception.\n\nLet him know that his temper tantrum  will not be tolerated. Call or email his office and let him know WE WANT OUR MARKET!!!",
            "author": "vanessa m."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-06",
            "description": "I just love it!  Lots of fresh food, lemonade, homemade stuff, some terrible live music (but that's alright).  This is a small farmer's market, but I feel that there's a bigger sense of community when you are visiting these smaller and more focused events.  We spent some time people watching while waiting for a table at a nearby restaurant (which I kinda regret, should have eaten one of those crepes they were selling).  Love it, will be back next weekend!",
            "author": "Daniele R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-09-27",
            "description": "This market is in our neighborhood and we frequent just about every Sunday.  The selection of produce is great, although this year it seems a little prepared foods heavy.  Jakes is wonderful, I love seeing Nate and Lou Ann every week - knowing who raises your meat is the best thing.  Their Italian Sausages and bacon are wonderful.  Piedt Farms is also great, has the best corn I've eaten and we love their Honeycrisp apples also.  Spencers Sausages are at treat also, and this year the Chi-Scream cart has been something we look forward to each week!  I'd say that the LSFM is a very close second to Green City and is much more convenient to get to so certainly check it out.\n\nThe biggest hang up I have with the market is some of the vendors won't let us try their product before buying which is something that is a given at Green City, and a big reason we choose to shop at FM vs. grocery stores.",
            "author": "L T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-11-06",
            "description": "OMG! The prices here are way more than they are at Jewels!! Durrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr, I don't get it. Does it have something to do with the fact that Jewels can buy in bulk from massive farming operations that can contain their costs easier, all the while engaging in unsustainable farming practices and spraying the food with Agent Orange? Stupid microeconomics. You slay me with your six syllables and complicated logic.\n\nI mean, seriously, I could totally drive an hour or two, find a produce stand on the side of a country road and still spend less on produce than I would at this market, even after accounting for the cost of gasoline. (Never mind the fact that I'd be wasting two to four hours of my life driving to the middle of Bumfuck, Nowhere.)  And once I randomly found a produce stand after driving around aimlessly for a couple of hours, I'd definitely be able to find every kind of seasonal produce, bread, meat, and cheese in that stand because as everybody knows, those rinky dinky stands hold an unlimited supply of food and always offer the largest variety possible. And sometimes they give you super awesome splinters! For free! But really, I wouldn't drive that far for produce. Instead, I'd just drive a little further west of Logan Square and buy a watermelon from some guy in a smelly truck parked on Fullerton who looks like Chewbacca. What's not to like about Chewbacca? \n\nLook, let's not kid ourselves. These local farmers are totally full of bullsh*t, and I ain't talking about the pasture-raised kind. I mean, who do they think they are avoiding Monsanto products and sacrificing crop output somewhat, just for the sake of sustainable farming and not destroying Earth's resources?! Really??? That's just dumb. Also, any fool knows that driving a refrigerated truck for 50+ miles is insanely inexpensive, not to mention really fun. How dare they bump prices up to cover the cost of such things! I'd rather just drive two hours to buy my groceries and receive some free splinters. Wouldn't you?\n\n....\n\nLogan Square is a great community, as evidenced by how much this market has grown over the past few years. Frankly, this market is phenomenal. The variety is good with plenty of vendors, and the atmosphere is friendly. I'd rate this market a close second to Green City. \n\nIt's cool if you don't want to shop here, and I can sincerely say that you'll get no judgment from me on that. But if you go here and then whine about the high cost of local, sustainable, organic produce and pasture-raised meat, then frankly, you're incredulously ignorant. Sure, some of the food is overpriced, but when you study the economics of what you're buying, most of it isn't. You're a silly willy nilly billy if you think buying organic, \"natural\" food at the grocery store--yes, even Whole Foods--is comparable to buying from a local, sustainable farmer. \n\n\nThese are my favorite farmers at the Logan Square Farmer's Market, which is in no way suggestive that other vendors aren't also great: Otter Creek Farms, Jake's Country Meats, M's Organic Farm, Nordic Creamery, River Valley Ranch, Roedger Bros Blueberries, Sweet Earth, and Tempel Farms.",
            "author": "Filly G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-01-23",
            "description": "Farmers market in the winter? No way! \n\nThere's something fun about walking into a post-apocalyptic looking Congress Theatre lobby and checking out the various vendors. It's like I just walked into bartertown. Two enter one leaves? I'm too used to this place being filled with punks and metal-heads, not local farmers educating me on organic dog food and how blueberries are kept fresh in the winter. \n\nI can't stay negative, because a winter farmers market in Chicago is like a bed and breakfast in hell. Of course you're not going to get the myriad fruits and vegetables, but you will have a good selection of sustainable and grass-fed meat, cheese and artisan breads. They'll even make you a grilled cheese sandwich and a cup of coffee!",
            "author": "David G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-03",
            "description": "What to say about this lovely little market?!?\n\nI love it.\nBut that's probably not enough. Right?\n\nIt gave me a hard time though when I hit it for the first time last week. But a little crucifixion on some talk threads was not enough to keep me from coming back and trying to find the Holy Grail of fresh bread and flaky croissants, aka 'La Boulangerie' aka 'Cook au vin'.\nSo today - we were back man, and ready to fight the battle.\n\nWe found the wanted stall (not super obvious but they are the dudes making crêpes too) and much more. Fresh flowers ($5 bouquets), home-made macarons (with flavors changing every month), food vendors (ALREADY cooked! ha!), fruit and veggies, cheese, meat and a couple of other bakeries. It's small, yes, but quaint and diverse.\n\nNice job, Farmers.",
            "author": "Aurore L."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2010-10-12",
            "description": "The Logan Square Farmers Market is pretty measly with few stalls and not nearly enough produce.  The Daley Center and Lincoln Park Farmers Markets beat it out by a longshot.\n\nHere's my beef: Why is the strip of Logan Boulevard near Milwaukee Avenue left such a mess after the farmers market is over on Sunday?  Trash litters the site, bins are overflowing with stinky organic garbage days after the market is over and the grass is totally bald.  Isn't it counter productive for a bunch of folks who are all about supporting local purveyors to leave such a giant mess?",
            "author": "Elizabeth B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-29",
            "description": "Terrific way to spend a Sunday morning! This a great family-friendly and dog-friendly atmosphere with a variety of vendors and things to do. \n\nFrom yoga on the lawn, to pizza, bangers, produce and pastries, the LS Farmers Market has it all! \n\nEven if you don't need produce, bring a blanket, buy some food and picnic on the boulevard!",
            "author": "Stephanie W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-28",
            "description": "This is one of the best farmers markets in the entire city. I've watched it grow over the years and every time I come I am able to get yummy eats, veggies, and locally made soaps and artisan bread.  It's a great people-watching event too.  I love it that there's a great farmer's market so close to my home.",
            "author": "Miss M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-19",
            "description": "This is my second fave market after green city. Lots of variety, but gets WAY too crowded.  I lost 20 dollars here the last time because people kept jostling me while I was trying to pay.  That said, great variety, good people watching, and a variety of lunch options if you're making a morning of it.  Thanks!",
            "author": "Haley S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-19",
            "description": "Though the Logan Square Farmer's market isn't as big as the Green City Market, I found the selection to be much more varied and balanced. All the produce looks fresh, and I get the feeling some are coming from smaller farms, which may account for its variety. There's less of everything, but no shortage as far as I could tell, even coming later in the day. \n\nMost of the vendors I interacted with were very friendly. I prefer this market over Green City as it's also a lot less crowded, and Sunday fits my schedule better, but it's nice to have options on different days.\n\nThe only downside is that it is just as pricey here as at Green City market or Whole Foods, which is as pricey as it gets. Aren't we in the heartland of farming country--midwest? I am willing to pay more for quality and freshness, but it just seems exorbitant to charge $3 for a bit of italian parsley, and not a huge selection of herbs here, either. I can't seem to find anyone who sells cilantro. I thought this town was big on Mexican food.",
            "author": "Dao N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-03",
            "description": "2 things to help you before you go to this farmers market - \n\n#1 you must come hungry \n#2 you must come with a list of some sorts, or at least some notions of what you want \n\nUnfortunately we went here this time with my parents, after a brunch at Longman. We wandered for like 30 minutes, admiring the produce and all the yummy looking prepared foods that you could buy. \n\nWe were very upset, since we were stuffed AND had no notions of what we wanted. Since everything looked good, it was very hard to even begin thinking of meal planning. \n\nDefinitely will need to come back again before the season is over and buy up more then flowers and heirloom tomatoes. Maybe we will just come here for brunch next time....mmmmmm",
            "author": "Evelina L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-06-01",
            "description": "Opening day and i biked over at 10 am .. the shoppers and stalls were already beginning to buzz.  yes, there were bunches of radishies, but there were more dogs than radishes!  \n\ni paid a pretty penny for Abbey Brown chamomile bath soak but my first bath was worth the sacrifice. And the baked goods were high quality. \n\nMy only disappointment is the crepe stand.  They are French, they were the black berets, and their method is reminiscent of the Paris street vendors. Mon Dieu!  - the crepe is inferior.  It was dry, tough, too sweet and the time it took them to make it was excruciating.  They also should have noted on their menu that savoury crepes were unavailable until one of them retrieved the batter - an hour after opening.\n\nThere are a few sellers of bits and pieces of art, dishware, books, chairs, etc in the adjacent parkway in the shade .. all in all a very pleasant way to spend Sunday morning.",
            "author": "Darkling S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-03",
            "description": "I was here a few weeks ago and they had a very large selection of seasonal fruits and vegetables. Fresh flowers, fresh organic meats, and many other unique items. As a chef I would recommend this farmers market to anyone visiting the Chicago area during the summer. The one draw back to this market was the price but worth it for the fresh produce and other organic products. Cheaper than the high end organic grocery store down the street that starts with a W.",
            "author": "Matthew T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-18",
            "description": "Love that this farmer's market is so close to our apartment. It's a perfect walk for the pup on the way there, and then she usually gets some tasty treats!\n\nI've hit up larger markets in the past, but I really like the size of this. It's small enough to not be overwhelmed by chefs and people buying in mass quantities, but larger and more diverse than the French Market in Lakeview, for example. \n\nI always manage to find something tasty- usually a fruit which ends up being delicious dessert. This past weekend I snagged some green beans that were so fresh they snapped like crazy! Also got some cheese curds that were still squeaky!! EEEEEEE!! Anyone originally from WI knows that's the only and the best way to eat cheese curds :)\n\nLastly, I love that this farmer's market really hits it's stride around 12 noon. I hate when places end by noon on the weekend. I'm far too lazy to get up around 9, which is why I've never actually made it to Green City Market. Rolling out of bed around 10:30 and hitting the market just before noon is perfect!",
            "author": "Julia C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-03-10",
            "description": "I'm getting pretty excited for the outdoor market to come back despite the fact that it is always crowded with strollers and dogs. I also love the fact that a little impromptu flea market springs up on the outskirts. \n\nThe crowd factor is the only thing that really puts me off.\n\nThe indoor market is pretty good too. I don't get a lot of stuff there when I go cause I like to buy fresh veggies and such, but I've had ok luck. There is also always something going on and farm fresh eggs year round. I can be into that.\n\nI know there are occasionally some issues with prices, but honestly, if you don't want to pay good money for good food then the farmer's market is not for you. And I'm pretty sure most of the people who complain can actually afford to pay more for their food (something you actually need to live). If you honestly can't afford to pay more for food but would like to the market accepts LINK (although it does take a bit of finagling).",
            "author": "B. B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-16",
            "description": "I really love a good farmer's market, and Logan Square's does not disappoint!   \n\nGreat selection of fruits, veggies, meats, fish, flowers, mushrooms, honey, granola, soap.  Overall, I really think they've done a good job balancing the presence of producers to prepared foods or crafts/businesses.  \n\nYes, the prices can be high.  Most are at farmer's markets.  I'm willing to pay more to support local farmers and to get really great tasting, fresh produce.  \n\nI haven't tried it yet, but I believe most months of the outdoor market I could probably buy everything I need at this market for the entire week.   Also doesn't hurt that it's within walking distance of my house.  Love convenience.\n\nWhile they sort of accept credit cards - it's kind of a pain because you have to go back to the Chamber tent and pay for each vendor individually.  If you buy from 4 vendors, you will have 4 different small charges on your card.  After learning the hard way, I always stop to get cash on my way.  So much easier.",
            "author": "Christine F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-12",
            "description": "I read the yelp reviews of this market before I went this Sunday, and I have to say that I'm pretty surprised by how many people are calling this market small. I know Green City is huge, but this market is almost as big as the Union Square farmer's market in NYC (which is our biggest market). \n\nThe vendors here are great... almost everything is organic, which is certainly appreciated. I got lamb's liver from Mint Creek that was awesome and a bunch of veggies and some cheese and bread. Everything was great.\n\nTried some horchata and a taco which was good, some savory hand pies from the apple cider donut people that where amazing, and a chai tea that was tasty too. I love that vendors can cook at the markets in Chicago. What a bonus!\n\nThe only thing that surprised me was the lack of milk and butter but the Dill Pickle food coop down the street had both.\n\nAll in all, this market gave me some serious market envy.",
            "author": "Julie K."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2010-08-12",
            "description": "I don't know which Wicker Park FM these people have been to, but Logan's had way more vendors than Wicker Park does - hands down. The variety was very nice and all but the prices were ridiculous.\nThe crepe stand was there and right next to it was some bakery that had awesome almond croissants - $3/pop and very disappointing stale mini pretzel rolls (no wonder they were 5/$1)! \nHowever, I am eternally grateful that Macaron Chicago had a booth and I was able to purchase those heavenly mouthfuls. What a find! \nThanks Logan Sq. for trying but I'm going to stick with Wicker Park from now on ...",
            "author": "Ivanka B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-14",
            "description": "stopped by the LSFM looking for something sweet post-brunch in the 'hood.  live music from the grand ole aubrey band gave life to the market.  LSFM seems small enough to feel intimate and manageable while offering up what you need.  plenty of fresh vegetables, baked goods and fresh meats.\n\nzullo's apple cider doughnuts more-than satisfied my sweet tooth.  freshly-fried goodness rolled in cinnamon sugar - phenomenal.  also picked up some local honey from chicago honey co-op.\n\ndefinitely glad we stopped to check it out - i'll be back.",
            "author": "Gina R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-28",
            "description": "I really like wandering down here on a Sunday for some fresh produce shopping.  It's not really that crowded, and for the most part Vendors are friendly and laid-back.  I really appreciate that I can go up to most of the stands, look around, and not have to endure too hard of selling tactics.  That can get AWKWARD.  \n\nAs others have noted, there is some pricey stuff here.  Most stuff is of great quality, so I don't mind shelling out a little extra cash.  I also have had some good luck in engaging in some good old fashioned bargaining--THAT you can't do so easily at Whole Foods.  Some examples:\n\n-  I wanted to buy 8 bulbs of fennel for dinner grilling.  They were marked at $2 each.  I asked if I could have a deal since I was buying so many, and they gave me 8 bulbs for 10 bucks.  SCORE!\n\n-  A woman asked if I wanted some of her beautiful tomatoes.  I said, They look delicious, but they're a little out of my budget.  She gave me a paper lunch sack FULL for $5.  \n\nOh, and shop around the various stands before you decide where to buy, that will help with your bottom line too.",
            "author": "Brook E."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2010-10-17",
            "description": "Other than a tasty taco (rock on, Cherubs), I never leave with anything.\n\nThe produce is barely adequate, I know it's organic but I've hit my fair share of farmer's markets (that sounds as lame as it is written) but it's barely worth the price. The wilted flowers, pastries (not from the French place on the corner) look stale as my friend bit into his almond croissant disappointed, the meat looks fine but not mouth wateringly delectable, the jam beautifully packaged but nothing to go with it.\n\nIt's also littered with tag sales, which I usually love, but are sucky and unnecessary. The overrun yuppies and their accessories are usual fare but since the market is so small they seem overwhelming. And trash. Serious amounts of trash.\n\nIt's nice to be outside but not a shopping venue, it's more like an outdoor concert minus the concert.",
            "author": "Lauren M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-13",
            "description": "Shamefully, today was my first visit to the Logan Square Farmer's Market, despite living here for five years.  Sundays are just a little crazy for me, I guess.\n\nI realized just how shameful it really was though, once I managed to do a full swing through it.  They have a GREAT selection!  It's still early in the season, but there was a nice variety of fruits and vegetables.  They have a number of booths that are selling meat and cheese as well - I didn't get any today but I am definitely going to be getting some in the coming weeks.  Flowers, french bread, baked goods, and herbs rounded out the mix.\n\nIt was a great first visit and I intend to follow it up with many, many more!",
            "author": "Megan K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-27",
            "description": "They've upgraded and expanded significantly this summer!  \n\nThere's probably 2x as many vendors, more selection of fruit, veggies, meat, and bread.   In addition, there's a new taco stand, and a new stand for vietnamese spring rolls and a few more places that sell packaged goods (hot sauce, jams, salsa, spreads etc.) as well as all the usual suspects.\n\nAnd it's still only 3 blocks from my place.  I believe it still goes through mid October outside on Logan Blvd, then I think it moves inside to the Congress Theater Lobby.  \n\nGet here before the summers over!",
            "author": "Shayna N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-13",
            "description": "There's really nothing better to do in Logan Square on a nice summer morning, than to take a stroll through the farmers market.  If you are okay paying a little more for fresh product, you'll leave the market inspired to cook a great meal.  For people that live in the neighborhood over the years, you know the leaps this little market has taken to expand each year.  I like to hit up the cheese guy, since he'll slice your cheese in front of you depending on how much you are looking to spend.  I also like taking home a few large portobello, drizzling them with olive oil, balsamic vinegar, salt & pepper..and throwing them on the grill.  If you go to the market hungry...then some tacos from Cherubs is the way to go.  Is the market comparable to the large ones in California...no....will it do the job, sure it will.  So go hit up the cash station, and come prepared to be inspired to make something delicious.",
            "author": "Gamaliel E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-26",
            "description": "For the city, this is a great farmer's market.  It isn't too crowded although there are a number of strollers and a lot of people during peak times... things tend to get picked over by later in the time as well (it's 10-3pm ususally so go earlier).  This doesn't compare to a more rural countryside farmer's market but brings some good produce, meat, and other items to the area.  Note, don't expect everything to be 100% organic here - so ask how much something is sprayed, how it is treated, etc.  Another tip, bring your own bags so you can carry what you buy home.  You can drop quite a bit of $$$ here versus buying organic at Marianos/Whole Foods but we have had some pretty delicious fruit/veggies from here still.  Finally, as of 2013 more and more vendors take Square and electronic payments; however, cash still is the easiest to deal with here.",
            "author": "Travis W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-01",
            "description": "Logan Square is tied with Glenwood Farmers Market up in Rogers Park for Best Farmer's Market in IL in the National State-By-State search.\n\nPlease vote for them now if you've enjoyed your experience at the market!\n\nhttp://action.farmland.org/site/PageNavigator/Americas-Favorite-Farmers-Markets/sign_up_vote_new?market=1163",
            "author": "Jesse B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2010-02-02",
            "description": "This is just a review of the indoor winter farmers' market.\n\nIt's very small, and doesn't have hardly any produce.  I think they should just have used some of the empty stalls in the MegaMall and they would have fit in fine.  I'd say it'd better than nothing, but there is really no reason for me to go here.  Maybe it's better for you.",
            "author": "Nessie V."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-12-07",
            "description": "Summertime Logan Square Farmers Market - awesome\nIndoor Logan Square Farmers Market - eerie and bizarre\n\nI'm glad they are keeping it going but when I checked it out for the first time this last Sunday it kind of reminded me of a post-apocalyptic gathering of vendors selling random items in the midst of a nuclear winter. Everyone walking around the cold hall in their winter coats, a quiet guitar being played somewhere in the cavernous lobby\n\nThe crepe guy and the pork guy are there and most of the goods are canned or baked but it's winter so its not like they'd have fresh vegetables. I'd like a few more vendors and maybe some louder and cheerier music. Ambient lighting wouldn't hurt either.",
            "author": "Raphael D."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-06-03",
            "description": "Just went.......opened today..... What to say.... Hmmm... Good to walk through in the day when boredom got u.  I always thought that markets are for shopping, but at this market only window-shopping is possible. Common really......!!!! Pound of tomatoes is 4.00 bucks and  and pound of meat is ranges from10.00 to 40 bucks. And anyway there were like 15 stands and half of them were flowers and herbs. I would love to support farmers with all my heart ( parents used to own farm---worked all my childhood) , i know how hard to be one of them, But sorry guys....won't buy a bunch of lettuce for 8 bucks. \nThe major folks there are 'New waive hipsters'  who look poor and educated but surely don't have any student loans and real bills to pay (there is no way you can afford to buy anything at this market after ur monthly bills).\ntwo stars--- because it was nice day to go for a walk.\nyea.... and check the one star review of Adam S. really good summery.",
            "author": "Anna A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-10-15",
            "description": "Definitely one of the best Farmers Markets in the city!  Nice variety of vendors interspersed with restaurant offerings. Try the tacos and apple cider donuts -- to die for! Great selection of seasonal fruits and veggies, grass-fed beef, farm-raised meats and organic bakery items and treats. Nice bonus is the pop-up flea market that sometimes takes place on the adjacent boulevard. Parking is sometimes a challenge, but a few trips around neighboring blocks pays off every time.",
            "author": "Marcee W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-07-05",
            "description": "Maybe I don't have a baby in a stroller, or a dog, or both, or even a dog in a stroller.  I kinda felt a little underwhelmed by my first visit.  Perhaps it was the time of year, or the fact that it was July 3rd and a lot of the farmers would rather be partying in their fields and setting off organic fireworks made of beets and ginger beer?  Maybe I was hoping for more of a renaissance fair atmosphere.  It just felt like a so many booths were imitations of each other.  I have the mentality that says, oh if you walk down to this dejected looking booth they will have some phenomenal treasure for less then the cost of any other booth.  No, the produce and the pricing was rather uniform and I didn't feel very compelled to explore because of this redundancy.  Also, it can get to be exhausting having your feet crushed by stroller wheels.",
            "author": "Martha Z."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-28",
            "description": "Ahhhh, Summer in Logan Square. \nI adore my neighbourhood, especially due to the market. Who doesn't like consumption for a beneficial cause?!\n\nI had an especially great experience this morning so I thought its time for a review.\n\nAt this market you can:\nSign the petition for a single payer health care system and discuss the legislation and the literature plus donate, if you wish;\n\nSupport a local Logan Square publisher by buying books by neighbourhood and Chicagoan authors,\n\nBuy delicious 8year mature cheddar, fresh cheese curds and other cheesy delights;\n\nBuy heirloom tomatoes and candy stripe beetroot or a multitude of other fresh fruit and veg as well as salsas, local honey, organic meats, fresh cut flowers and wonderful baked goods.\n\nSupport Humboldt Park's youth programs by buying delicious hot sauces, jam and pesto from Co-op Sauce, LLC\n\nEat Cook au Vin's legendary crepes; a pint of ice cream from Logan Square Kitchen's resident NiceCream, or a good ol' British banger sarnie or bacon buttie (yes I do bring by own butter to make it a buttie -what of it?) or perhaps a delightful cone of zeppole from Zullo's! (plus many more tasty treats!)\n\nIt may not be the cheapest place to stock a pantry each week but it is a delight to accent each meal with some of the market ingredients.\n\nKeep that in mind, and try not to get run over by stroller wheels or jumped on by the many over zealous dogs.... \nGreat people watching, a nice picnic spot and plus you'll never know what discussion you'll get into -or listen in on ;) - next!",
            "author": "Sarah M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-02",
            "description": "What a fun farmer's market!  I stumbled across this market (when I was hoping to find the fresh honey man) after brunch and I kinda wish I had access to a kitchen!  I actually bought a bag of granola for a friend (\"it was DELICIOUS!!!!\") which only made me sad this market is a plane ride away.  Come for the entertainment, fun locals, and most importantly, the fresh veggies and fruits! (and baked goods!)",
            "author": "Yosh H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-14",
            "description": "I'm a big fan of this market. It's walking distance from my house so that probably helps.\n\nThe neighborhood has done a great job in selecting vendors that provide seasonal items that are of great quality. Plus, there are lots of options for breakfast/lunch ready food that is made on the spot from places like Vella Cafe and Treat. \n\nIt has a European vibe to it too. Sometimes it feels like hobits will be coming out from around the corner. Maybe that's just when the flute player is on stage...\n\nAnyway - I stock up on all my produce for the week and I'm never disappointed in the selection. If something isn't in season, it's not there and I'm just fine with that.",
            "author": "tracy j."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-11-27",
            "description": "ABSOLUTELY LOVE this FARMERS MARKET and probably is the BEST ONE!  Organic fresh and variety of fruits and vegetables in all colors!!  Worth buying the raspberries, blueberries, and baby purple cabbages and more!  Including sweets such as Lucille's and Katherine-anne Confections. Handlebar also have great veg foods.  Fall time get the apple cider donuts!!! yummm!!  My fave vendor is Co-op Sauce!!  Buy five same or different hot sauces for only $20 and best pesto!  Half the year its outdoor and rest indoor.  I like the outdoor since its bigger and more shops present.",
            "author": "Monica K."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-06-12",
            "description": "Great music.  Good food vendors.  Fun atmosphere. But the prices are ridiculously high. Adam S. had a great review that is spot on.",
            "author": "Albert K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-07-19",
            "description": "Logan's farmers market is short and sweet.  I didn't see too much in the way of cheese vendors (except for Provenance, who had a booth there like other local vendors Fonda del Mar and Vella Cafe).  But they had a decent organic selection of meat (ham, bacon, chicken, etc) from a few vendors and a great selection of vegetables.  Most were decently priced, somewhere in between a neighborhood grocery and Whole Foods - which is what you should expect for organic food with no middleman or fancy marketing on the part of a store.\n\nI wish I could do all my shopping at farmers market's, but I still have to get some other staples elsewhere (sliced ham - Wally's, Mexican produce and other products - Windy City or Cermak or Carniceria Jimenez).  But in all, it's a nice neighborhood feature on Sundays.",
            "author": "Timothy M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2010-06-26",
            "description": "I used to really love going to the Farmer's market off the square, the selection was great, but something horrible has happened this year. \nThey've dis-allowed the awesome yard sales that the residents would have just next to the market. In order to have a yard sale, you'll have to get a stupid permit!! How unamerican is that??? Also the crepe guy is not there anymore! He had the best food. The only hot and ready food there this year has been a taco booth, and I can only really handle eating tacos after 12pm.",
            "author": "Nana H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-06-01",
            "description": "It's not a one-stop shop like Green City Market, but I kinda like it that way. I just got back from their opening day, and am quite satisfied. I got some great-looking spinach as well as a tomato plant. If I liked radishes, I could've loaded up-there were 2-3 stalls with them. I was 2 minutes late for Golden Rise Bakery's last loaf of Russian black bread, alas. Next week.\n\nTo address some others' complaints: if you get up at the crack of noon, you shouldn't expect them to be stocked with everything you want. I got there at 10:30, and I'd say 10% of the stuff was already sold out. Unlike supermarkets, these guys don't have semis full of Chilean produce coming and going. \n\nAnd here's the best tip I can give: have breakfast at Johnny's Grill (see my review) beforehand. The lining of grease in your stomach will help keep you from buying more than you're gonna eat at the market. Oh, and they ARE accepting credit cards for the first time this year.",
            "author": "Jamie J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-06-23",
            "description": "In light of David R.s message, I suggest he attend a few more markets before completely bashing our little market in Logan Square.\n\nOver the last 3 years, the market has grown.  While it is not a comprehensive market a la Green City, it is perfect for neighbors and anyone else looking to spend some time supporting local businesses and getting a little fresh air.\n\nI've gone over in the morning (this market doesn't begin until 10 am), and have found a few things each visit, which is about what I expected.\n\nMy last discovery was a dozen farm fresh eggs for only $4.  Organic eggs were $4.50 -- on sale -- yesterday at Jewel!\n\nWicker Park does have the Nichols farm booth (with lots of produce options), but it really doesn't have that many more booths & none of the prepared food offerings (since it is a city-sponsored market, as opposed to Logan Square, which is independent).  I use this as a comparison since they are both on Sundays, and located in similar neighborhoods.\n\nHeck, check out the new market at Sears Tower if you want something even smaller.  New markets need customers to thrive, and the more that come to Logan Square, the better it can become in the future.",
            "author": "Ellen H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-09-11",
            "description": "It's getting better.  I first went this year when it opened, early June, and returned this weekend after an initial disappointment.  The number of booths was still few, but the variety of produce has improved.\n\nI got some organic corn that was freakin' great.  There was a stand that sells berries and peaches, both were awesome.  A few stands had squash, which were good, too.  There were booths selling honey, and entrees or something from Lula (*shudder*), as well as the truck with pulled pork sandwiches.\n\nOverall, it has some stuff to supplement your vegetable shopping, but by no means replace it.  This last time was cool, I chatted with the farmer selling corn, got a corn fritter recipe off him.  My big disappointment was that I woke up late and by the time I got there (1:30pm), the berries had sold out. :(",
            "author": "Samantha G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-19",
            "description": "What a treat it is to have a farmers market so close and with a good selection. It's a little on the small but I find everything that I need and I can just relax in the grassy knoll. If you haven't eaten yet I recommend the crepes, there are delicous. When I say I can get what I need I usually stick to the fruits and veggies but they also have farm raised meats, cheese, herbal soaps and different jams and salsa's. There is so much packed in this little area. I can't wait until the Dill Pickle Co-op opens up nearby. \n\nSide Note: Some vendors are starting to accept credit cards but remember to always cash on hands and singles if you have them.",
            "author": "Roberto F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-07-25",
            "description": "Not nearly as huge as a farmers' market you'd find in some other neighborhoods, but it doesn't really need to be as huge as those, either.  Unfortunately, there were really only two booths that had meat or veggies that I recall, but one booth did have some yummy looking fruit.  Several local businesses sold cheese, sandwiches, flowers, etc.\n\nI picked up an organic whole chicken (which I've yet to try), some cipollini (Italian for \"little onions\"), and some garlic.  The cipollini and the garlic were phenomenal, with a great, interesting flavor.  I tried a bit of the garlic raw, before sauteeing with the cipollini and other things, and wow, the flavor was so subtle and delicious.\n\nI plan on going back every Sunday that I can.",
            "author": "Mike S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-12-04",
            "description": "I love the Farmer's Market in LS. It's my favorite thing to do on a Sunday in the summer. I love the French bakery booth, and the salsa booth, and the flower booth. I munch on my French bread and listen to music if they have something going on. And sometimes I bring my blanket and dominoes and just hang out for the morning.  It's always a great experience. However, I have not been in the winter....it's strictly a summer event for me.",
            "author": "Cara T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-12-03",
            "description": "Great news! The Logan Square Farmers Market has moved indoors for the winter! From 10 a.m. - 2 p.m. on Sundays, stop by the lobby of the Congress Theater and check out the winter market. They expect to run through March, with a few Sundays off for holidays. I assume then they'll go back to their outdoor location on the boulevard.\n\nThe winter market plans on still providing locally produced agriculture products, so expect root vegetables and fruits that have been \"put up\" by canning or drying. Although, right now there are still a ton of apples at the market. And cider! I got a bag of honey crisp apples and some cider for Dallas. I'm told that throughout the winter you can also still get greens and mushrooms that they grow indoors or under glass or plastic. And there will still be farm fresh meat and eggs. Of course, all the baked goods and prepared food items will still be available. Along with the apples and cider, I got some lettuce and 2 bags of homemade granola.\n\nAs well, the winter market may also showcase Logan Square Chamber member businesses. All in all, it doesn't seem like they're going to have issues running the market through the winter, which is exciting.\n\nI'd never been to the Congress Theater before and thought it was funny that my first trip there was not for a concert, but for the farmers market!",
            "author": "Rachelle B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2007-07-27",
            "description": "E for Effort, S for Small.\n\nI set out last Sunday morning with a spacious messenger bag across my shoulders and a tuned-up bike, happy to speed through the city through glorious rays of sunshine, excited for a holistic shopping experience that will fill my bag up with lots of food grown right. \n\nI got all of the above, except for the \"lots\" part. For some reason, I had always envisioned this to be a bigger market -- it just seemed in line with the Logan Square lifestyle (the veggie-heads and organicos, I mean). But it was about 15 stands along a little sliver of a cul-de-sac between Milwaukee and Logan... cosy, but I was disappointed for the downsized shopping experience.\n\nNevertheless, the market tried hard and that almost made up for it. All the vendors and farmers were happy to explain their products on sale, there was free sampling, and you could feel the goodness of the earth in the air. I left with a pint of blueberries from Michigan, a block of chipotle cheddar from Sugar River, Wisconsin, and a blueberry-peach tart from Logan Square standard Lula Cafe. (During the week, these transformed into toppings on yogurt, grilled cheese sandwich and a nice dessert with vanilla gelato a la mode.) I can't complain about a great way to spend a Sunday morning before softball -- now I'm just waiting for the market to be supersized.",
            "author": "Desiree K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-10-18",
            "description": "Logan Square Farmer's Market, Hurrah!\n\nIt's fabulous! \n\nAs noted in other reviews, this market has gotten way way better this year compared to last. Packed with people every week, and folks actually hung out there chatting with community spirit this year. :) It feels like a \"real\" farmer's market. \n\nIt's such a Logan Square neighborhood thing. It's like: everyone's there! You feel like you fit in, and it's fun to admire everyone's earthy style. \n\nAs for the food, Hurrah! I have gotten so many great ideas, tips, suggestions, and encouragement from the various vendors this past season. I've made sorrel vinaigrette, squash bake, roasted baby onions, sweet turnip salad, and honey crisp oatmeal bake all for the very first time this year. I made the most delicious butternut squash soup this very evening for the first time. Let's just call this market the \"cherry popper.\" (Woodstock organic farm & City Farms are my fave.)\n\nThis is not to mention the dead sea bath salts, chamomile face soap, and fresh flowers!  This market is great on many levels.\n\nIt's growing, to be sure. But it's an important (and wonderful) community hot spot now. I only wish the Chicago growing season was more like California and less like Siberia........ can't wait til next year!!!!\n\nI love you, Logan Square Farmer's Market! Thanks for all the delicious vegetables this year!",
            "author": "Jocelyn P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-31",
            "description": "I am amazed at how much foot traffic this market is getting. It seems to be picking up more and more steam as time goes on! I popped by yesterday really fairly late, around 2:30 and it was still totally hopping! There was even entertainment in the form of a fella with a washboard accompanying a tap dancer.\n\nIt's not a big market, as others have mentioned, but it's a nice little market with some nice offerings and I'm glad it seems to be thriving.\n\nAnother interesting thing this year seems to be the impromptu yard sales on the boulevard! There were a TON of people out there and had I wanted to scrounge around through other people's castoffs after purchasing my produce, I'm sure I could've walked away with a few items!",
            "author": "Renee E."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2007-06-03",
            "description": "When I first read about the farmers market on my block, I was elated.\n\nWhen I arrived, I was crushed.\n\nMaybe I arrived too late. I got there at 1 p.m.; the market runs 10 a.m.-3 p.m.\n\nMaybe it's too early in the harvest.\n\nMaybe I just don't know how to shop this style of farmers market.\n\nWhatever it was, this place just didn't work for me. There were just as many carnival-style, fast food vendors as actual farmers, and the selection was quite limited.\n\nOther than a few tomato plants, I don't think I saw a single fruit. Some booths were selling subscriptions to CSA's, but I don't play that.\n\nI wanted to walk over, grab some produce and meat, maybe some dairy, and walk out. Cash for food from the people who made it, simple.\n\nI guess it's back to shopping Jewel.",
            "author": "Kiarash Z."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-08-24",
            "description": "I just went for the first time, and I was a little worried because of some of the Yelp reviews - but I think those people just don't quite get it.  Yeah, the Logan Square Farmer's Market isn't huge, and it doesn't have the variety of Green City.  But for a local, neighborhood farmer's market, I think it does a good job.\n\nIf I didn't live in the neighborhood, I probably wouldn't go.  I can't lie.  That said, though, all the people at the booths I went to were friendly, and I managed to pick up some nice carrots and scallions, as well as a few different baked goods and some specialty soap.  It's really nice to have it in the area, and I'll be coming back.",
            "author": "C. A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-19",
            "description": "I love trolling the market on Sundays.  Great way to kill an hour or so.  I think the market gets better every year...except there's not a big Wisconsin presence yet.  If you guys have been to the Dane County Farmer's Market you'll understand what I'm sayin'!",
            "author": "Jonathan W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-06-05",
            "description": "The market is open for 2011 and in the past year the strollers have multiplied in number and doubled in size. See last years review. The apple cider doughnuts are unforgettable and worthy of top bill at the market. It seems to have grown a little in size even though the alderman that will remain nameless almost denied their permit. Give me a break. I also love that New Wave Coffee is right there because it is always to grab a drank some doughnuts and get down to some intense people watching. There is plenty to see hear. Welcome back farmers market I have missed you since you been gone.",
            "author": "Steve M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-07-01",
            "description": "Thanks to whoever pointed out this market starts at 10 and goes until 3.  I either didn't know or forgot that part.  I've often missed farmers markets because on weekends I like to relax for a while before getting started.  Like until noon.  When I read that at 11 I realized I still had a chance and yanked my ass out of bed.\n\nI'm glad I did.  Yes, it's small, though I was told it was bigger today than even last week.  I got beets - the guys working the stand told me some easy ways to cook them.  They also had a cute plant called a rabbit tail, I think it was.  But I kill plants, so I left that for someone else.  The next stall over I just asked for advice, I ended up with chard for the stir fry my boyfriend is planning for this week.  And one more over, some beautiful cherries.\n\nThere was also some soap that I glanced at (I love handmade soap, but I'm very happy with what I'm using), and a place where you could sign up for 3 months of produce or meat from a sustainable farm in Ottawa, which we will probably sign up for.  My favorite purchase?  The Greek flatbread.  That was my lunch.  Damn was it tasty!  I wish I had another piece.  There were also a stands for flowers, bakery, and yummy sounding sandwiches that I will most likely check out next week.\n\nGo and check it out.  Buy some produce.  Support these people and our market so that it will stay and get bigger!",
            "author": "Leigh L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-23",
            "description": "I live in the area and would definitely recommend the Market to others nearby, but my real reason for writing is to recommend one of the best vendors ever, Cedar Valley Sustainable Farm.  They are THE place to go if you want delicious, natural meats.  I started getting the chicken and pork chops a few years ago, and was blown away.  The burgers are also fantastic, as are their steaks.  My fiance and I loved it so much (natural AND delicious!) that we joined their meat share/CSA this winter, which has been awesome.  It's also surprisingly affordable.\n\nI would recommend that any omnivores looking for some quality local meats stop by Jodi and Beth's booth at the Market and give their products a try.  Delicious!",
            "author": "L L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-12-04",
            "description": "Based upon the increased selection and attendance at this year's market along with excellent live music, the rating goes up to five stars.",
            "author": "Michael F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-31",
            "description": "My favorite market so far! and is in my neighborhood! every year grows!",
            "author": "Alejandra V."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-09-18",
            "description": "I know they're trying, but this is just not a very good Farmers Market.  Not enough selection, and what is there is too expensive (notable exception for the flower people).  It is nice to get the co-op honey and some treats from Golden Rise, but since I could walk to Golden Rise anyway...\n\nAnd one thing I hate about the LSFM, is that everyone brings their dogs.  This is not a good idea, people.  Its a very small space, and if every third person has a dog, guess what?  They're going to bark and lunge at each other.   And the last two times I was there, I was knocked around by dog's \"play\" fighting.",
            "author": "Alyssa S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-06-14",
            "description": "Excellent selection packed into a tiny space.  Reasonably priced fruits, veggies, baked goods, and organic meats.  Check out the musicians playing the market, I've heard some great local tunes there!\n\nAnd the pulled pork is HEAVENLY :)",
            "author": "Zipper G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-09-29",
            "description": "I really love that there is a farmer's market like 2 blocks from my house.  I've been 3 times (every sunday since i moved here) and will keep coming till winter starts just to support it.  I believe in supporting local growers.\n\nHowever, selection is hit or miss (altho quality is decent) and value is not near as good as Stanley's.  There's about 6-8 stands selling fruits and vegies, one dude with lots of bread and muffins, Provenance has delicious cheese, somebody has soap and oil, a crepe setup and a tofu burrito stand. And a couple of other non-food tents like voter registration.",
            "author": "chad n."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-09-16",
            "description": "I think many people miss the point of smaller neighborhood farmers markets. The smaller markets offer independent, smaller businesses an opportunity to \"get their feet wet\" in the farmers market, and allow you to walk a block rather than take a bus/bike ride across town to shop. If you look it up or search for them, you'll find there are nearly a HUNDRED seasonal markets throughout the city. Most of them, like Logan Square, are independently run; they are not funded by the City. They cannot all be like Green City. And who would want a production that big in a tiny corner of Logan Sqaure every Sunday anyway?! \n\nI find the smaller market to be refreshing compared to Green City or Daley Plaza's market (which are also great in their own ways). And the prices tend to be a smidge cheaper. The vendors at Logan are more attentive and appreciative of your patronage, probably because they're not as busy. I'm on a tight budget, but I make it a point to support this market and other independet ones in neighborhood \"pockets\". Any time you can buy from a farmers market, you're helping support local growers, (often) organic farming, highly motivated business people and  talented artisans, and you get high quality products. \n\nOne thing people need to keep in mind when shopping at markets (and buying organic in general) is: It costs farmers more to produce smaller crop yields when they don't use chemicals. And don't forget the cost of gas it takes them to get that one bushel of fresh asparagus all the way from Michigan to your doorstep. Small farmers vending at these markets are not using non-regulated chemicals in foreign fields and using inhumane labor to bring you cheaper, redder apples from Chile. They take pride in their work, and we should show our appreciation by purchasing from them when we  can.\n\nIf you want to pay 49 cents for green beans, go pick you own at a local farm in Indiana or Wisconsin. Once you figure in the price of gas and the time it took you to pick them, you might as well have paid the Logan Square market price. Or just go to Dominicks and get the non-organic ones grown in a greenhouse in Argentina, and pretend they're from your own backyard.\n\nHowever, I do think the Logan market could use one or two more produce vendors. I think the neighborhood could support it.",
            "author": "Brigette S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-09-21",
            "description": "Man I love this farmers market. Yes, it's expensive, and yes, it's crowded, but it really has become a neighborhood gathering place on Sundays, which is always good. My family and I come here after church every Sunday to buy food, picnic, and socialize with the neighbors. Also it has really expanded this summer, and together with the picnickers is beginning to take over several blocks of the Boulevard. For me, it's less about the food (although it's delicious, and there is enough variety and competition that you can search for some good deals) and more about the social interaction in a beautiful, green urban setting. I hope it grows and grows, and I hope the police ease up on the spontaneous yard sales that sprout up adjacent to it. Also would be great if the Alderman finally got the cajones to close down the Boulevard to cars every Sunday as well. Wishful thinking I suppose.",
            "author": "Matt B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2008-07-27",
            "description": "Very very few booths, very very high prices, nothing special. I usually like to support famer's markets, but their selection of vegetables left me very underwhelmed. There was just no incentive -- why pay five dollars for a half pound of raspberries when down the street at strack & van til they're 99 cents?\n\nIn the end all I bought were some lillies for four dollars (dumb on my part, but they were rather pretty) and two bottles of soda. Nothing else was even remotely worth checking out. Wait, except for one lady who made homemade yarn that was GORGEOUS. She's the reason I give this two stars -- if I were a richer woman, I'd have stocked up on that fantastic hand-spun yarn.",
            "author": "Bier S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2008-08-08",
            "description": "I come from Des Moines, where the farmers market is HUGE and CHEAP and AMAZING... if you have been to Madison, similar situation. So I have a REALLY hard time with all of these pseudo farmers markets in the city. I like the thought of supporting this one though as it is one of the only if not the only farmers market not run by the city. \n\nLast year I would hit the market before work and buy flowers for the bar where I worked and that was really nice, I love the flower booth there, but this year I work at 9am on Sundays and for some reason this market sleeps in and begins at 10am which is silly because we all know that farmers get up at 5am..... at least real ones..... maybe I am just an Iowa girl that wants to hit the farmers market and I hate sleeping in.",
            "author": "laura heather h."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-06-03",
            "description": "This market was at the top of my list.  Since I've moved here (seven whole days ago) all I've heard for a MUST-DO is the Logan Square Farmers Market.  \"You HAVE to go, the market is HHHHHUGE and has absolutely everything\"  was the frame of what several people had told me.  Well, they lied.  Though the market is pretty big, one third of it is dedicated to coffee and breakfast./lunch vendors, and as for \"having everything\"  I did see some good variety including homemade soaps, honey, a solid amount of greens and a plethora of overpriced meats, I did NOT see anyone with dairy products.  None.  We went to the market with a list of greens and cream and were only able to attain 50% of it.  We stopped to ask the very helpful fella at Mint Creek what the dairy situation was and I guess there's one vendor that brings milk every other week.  This week was not our week.  It's milk, people.  Not askin for much here.   Anyway, I'll stick to the market on 61st.  Less tattoos and more produce.  Plus they have milk.....all weeks.",
            "author": "Anna H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-10-21",
            "description": "This is a great little farmers market! If you live in the neighborhood, it is definitely  worth checking out. I'm sad to say that I have lived in the logan square area for 5 months and only now just getting over there when there is a couple sundays left. \n\nLike Ellen was saying, the selection depends on the season. This is not a grocery store where things get shipped from all over. The farmers are very friendly and will tell you about what they do and where they are coming from. I picked up a half gallon of apple cider from a farmer that drove a couple hours from Michigan. I think is really cool that people drive a little out of the way to share their tasty food and we should take advantage of it!\n\nThe prices are very reasonable, probably would spend the same amount at dominicks. I paid $3 for a half gallon of apple cider and $5 for a loaf of walnut bread. Both were great but especially the cider. It was sweet and did not have that bitter after taste that I usually get from grocery store brands.",
            "author": "Joe C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-03-01",
            "description": "this is a very good farmers market except for the location. it is very crowded and and cramped.  there could be even more great vendors if it would move onto the street away from where it is now. there is so much space around the square, i hope the organizers realize how big this could become and move onto the main streets for the day.",
            "author": "William B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-22",
            "description": "I like the Logan Square Farmers Market.  There is a nice variety of vendors and lots of organic choices.  Some vendors are pretty pricey - but you get what you pay for!",
            "author": "Cathy O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-11-17",
            "description": "The Logan Square farmer's market is similar to my penis: it's small, but worth visiting every once in a while for about 2 or 3 minutes.  Did I mention you could also get fresh baked yeasty products there too?  What's crazy is how sleepy I get afterward.",
            "author": "Pete H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-09-09",
            "description": "A few years back, I posted about Logan Square's tiny farmers' market and how disappointed I was at its size.\n\nTime for a vastly overdue update: The market has grown and grown over the years and is totally amazing now.  You can get fresh meats from a number of vendors every week, veggies from even more vendors, and all sorts of tasty on-demand eats, as well.\n\nThere's a lot of interesting booths there these days, and it has become a regular staple in my routine to head over there on Sundays and browse around.",
            "author": "Steve S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-04-03",
            "description": "I'm just happy to have the Logan Square Farmer's Market in my neighborhood and I hope that it continues to grow and get more diverse.  It's a great way to start my Sunday morning, and if I'm really feeling saucy I'll also bring home flowers from Fleur.",
            "author": "Alyssa V."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2007-06-15",
            "description": "Eh, not a bad Farmer's Market.  It's not very big.  I liked some of the pastries and fresh bread that were being sold.  If I ever find my self wandering around the neighborhood on a Sunday, I'll pass by the market and see what's what.",
            "author": "Amy H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-30",
            "description": "Although this farmer's market is probably the smallest one I have ever been to, it still offers everything you could ever want. They have everything from fruits and veggies to soaps, pies, salsa, hot sauce, flowers, smoked fish and even handmade sno cones! My husband and I have bought some veggies from the farmer's market and the prices are a bit high. The quality of the item is great but it could get very pricey to do your produce shopping there. We love to buy the bangers and smoked sausages, on top of being very cheap, they are the best sausages we have ever had. Once you attend a few times, you know exactly what tents to pick up your items from and we have that down to a science now! Most if not all accept credit cards, they will hand you a ticket so you can pay all at once from the associations booth in the front of the market. Overall, very convenient farmer's market, not too large but enough variety to keep your interest.",
            "author": "Jenn K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-06-11",
            "description": "I visited my friend In Seattle a few weeks ago and now have a massive case of market envy.  Alas, there was no one throwing fish, nor were there booths upon booths of..  well, anything.  There were probably only about 10-15 vendors total.  I was pretty disappointed by the lack of fresh produce..  I had visions of walking out with shopping bags full of carrots, broccoli, apples..  sigh.  There was a distinct lack of a variety of fresh fruits and veggies.  However, what was there was good stuff.  I left with a bunch of peonies, a loaf of garlic bread, mixed greens, croissants, herbs, strawberries and a whole chicken.  Everything thus far has been lovely.  I like that it starts at 10..  I tend to sleep in, so not having to drag myself out of bed to get there at 7 when some of the markets start is a major plus.  Something tells me the only way this place will grow is with some TLC from the locals, so get off your butt and head over there.\n\nUpdate 7/8/07:  Just visited again, and my, how this little gem has blossomed.  I think this place has almost doubled the number of booths in the past few weeks.   I came away with not only flowers, bread and another (presumably) delicious chicken, but plenty of fresh produce (cherries, peaches, broccoli, new potatoes, snap peas, lettuce--yum!  And there was plenty that I wanted to try and couldn't carry).  And Provenance, an awesome wine and food store, is going to be coming there starting next week.  Hooray for my neighborhood!",
            "author": "Becky S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2010-08-01",
            "description": "I gave this market another shot in the height of growing season and I'm just not impressed by the selection or how overcrowded it is despite going early.  The flowers were nice but prices seem higher than LPFM...and again, Lincoln Park has more selection.  Better selection on baked goods at LS.  Vendors were very friendly overall except for one...who conveniently \"forgot\" to give me my $6 change...and made no attempt to give it to me.  Good thing it registered because I don't think the tomato and ear of corn I bought were worth $10!   I guess organic doesn't equal honest.",
            "author": "Sarah N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-01-28",
            "description": "I LOVE IT!!\n\nSpring please come back and soon. My meals just aren't the same without you! \n\nMy salads don't have the bright and beautiful edible flowers as a garnish on them.\n\nMy soups don't have the variety of veggies in them!!:(\n\nNot to mention that my life isn't the same without the Wisconsin CHEESE!!\n\n\nI am  patiently waiting for your safe return!!\n\n\nP.S.\n\nPlease bring back Fonda del Mar and Cook Au VIn, my son's miss  FDM corn tamales and CAV crepes!\n\nTHANK YOU!!! :D",
            "author": "Blah B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-10-02",
            "description": "I don't agree with the other reviewers that offer the opinion that LSFM has limited  or average quality product.  It's not a grocery store...you can't go to the farmer's market saying I must have apples or tomatoes in June.  It's SEASONAL, flexibility is key.  Additionally all the produce I've bought at the market has last 3X longer than the near-refuse sold at Jewel, Dominics or Stanleys.  It's a crowded market and the vendors are knowledgable and in a good mood.  I'd pass on the bread stand - tarts, cookies - bleh, the baguette is not good (like crusty Wonder Bread).  But!  Mmmm iced coffee at the Vella stand.",
            "author": "Anne M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2007-09-03",
            "description": "this farmers market is very small and surprisingly pricey (when i think farmers market, i think dirt cheap).  i like the idea and what they have available - but not the price.  maybe i'm a little too stingy, but  i think i'll stick with the store down the street that sells 7 peaches for a dollar, thanks.",
            "author": "Katie R."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2007-08-12",
            "description": "I love that Logan Square has a farmer's market but it's sort of lackluster.  Very small---maybe only 6 or 8 tables.  Not a lot of stuff on the tables either.  I was able to find some great flowers and I can always get a really nice cup of sweet tea. Maybe it's because I'm used to the downtown weekday farmer's markets with tons and tons of tables packed with merchandise.  I have high hopes that it will keep improving and it's worth visiting but don't go planning to fill up on veggies & fruits for a week.  It's just not there yet.",
            "author": "Jenny S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-09-12",
            "description": "If you live in Logan Square you really should support the logan square farmer's market on Sundays.  The past 2 weeks have been great.  Heirloom tomatoes and other nice fruits and veggies.  Also, I get the co-op honey and it's the best honey I've ever had.  Right now the flower selection is amazing and cheap.  So check it out-- 10:30 is the best time to go.",
            "author": "Madge S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-03-21",
            "description": "This really makes the nighborhood during the warm months.  The vendors do vary slightly from week to week, so it can be a bummer when what you want is not there.  But it is fun.  Relax, get a crepe.  Kind of small, but y'know its just for us Logan Square folks.  You can go to bigger ones somewhere else.  I can walk to this one.",
            "author": "Jonathan C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-08-19",
            "description": "The crepes are awesome! worth going for but they take forever! wish some more vendors would join up.",
            "author": "Amanda P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-11-03",
            "description": "I don't think it's really fair for me to rate the Logan Square Farmers Market because the first time we went was the second week of October, and they shut down at the end of the month. Therefore there was not a lot of selection, and I was hoping for more produce to choose from. We were able to buy a large bunch of fresh basil for cheap, and hopefully when it rolls around next Spring it will be a more lively place. It is nice to have a farmers market close to home where we didn't have to worry about parking.",
            "author": "Brenna O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-19",
            "description": "I like this market. Mostly. I like getting to know the area farmers and artisans who grow and make yummy treats. I like that it's seasonal and fresh - as nature intended. Yes, you will not find peaches or apples in the early summer. Because that's not how nature works in this part of the world. But if you come open to trying new foods and willing to be flexible on your purchases, you can find some great eats while supporting local businesses. \n\nThe prices...well, without knowing how agricultural businesses work, I won't claim to know if they're overblown...but they ain't cheap. So bring some cash and come ready to try something new.",
            "author": "elysia a."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-06-05",
            "description": "Logan Square Farmers Market is my favorite farmer's market in the city.  It's a nice sized market with sufficient variety - it's not too big or too small.  Prices are decent compared to other markets, like Green City Market.  It attracts a decent crowd, but isn't too busy. Parking is easy to find and we often bring their dog with us.  It starts late (10 AM) compared to many farmer's markets on the weekend.  I think this is a plus because you don't have to get there crazy early if you think you may be looking for something that might get sold out.  And who wants to get up early on a Sunday?",
            "author": "Amy Q."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-06-25",
            "description": "It's a cute little place and a welcome addition to the neighborhood. It is small but the people are nice and they have a great selection of the basics. Go early though.",
            "author": "Sara B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-10",
            "description": "just an update on the one stand i also like a lot--it's \"m's organic farm\" the farmer is really sweet and generally wears overalls and a baseball hat. they also have a csa if you're interested--you can do either $15 shares or $25 shares. she was very patient in showing me what came in each order as she wasn't sure how much of a bushel (the usual way of measuring the share) she typically gives out.",
            "author": "erika s."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-07-01",
            "description": "ok so i LOVE LOVE LOVE farmer's markets...i think it's the country girl in me who remembers the days when the produce guy used to deliver stuff  to my grandma's house on the back of his truck...i just moved to LS about a month ago and wanted to check out the local market...they had some good stuff but i was a little miffed by the fact that there were no tomatoes except cherry tomatoes. i mean seriously, no tomatoes?? summer=tomatoes...i thought the selection was very slim compared to what i find at the MCA market, but since it's in the hood i'll still give it a chance, it's a good excuse to take a walk around Logan Square",
            "author": "Kara M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-24",
            "description": "I can't believe how much bigger the market got in 2010- there at least 10 more vendors. I love the fact that there is everything from fruits, veggies and herbs to grass fed beef to fresh bread.  I think the number of prepared food vendors is high compared to other markets, which I kind of love- buy some tomatoes, have a crepe, have a great morning!",
            "author": "Kara C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-09-28",
            "description": "I love the Logan Square Farmer's Market!  Yes, it's smaller than many others.  However, it's become a Sunday ritual for me...I enjoy supporting the area farmers and local businesses, meeting friends for brunch at the crepe stand, sipping iced coffee from Vella and seeing neighbors.  The vendors are super friendly, and I've purchased some of the best blackberries and heirloom tomatoes here.  Golden Rise bread - yummy!!  The apple-flavored and coffee-flavored caramels are tasty little treats too.  I heart Logan Square Farmer's Market!!",
            "author": "a.m. g."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-09-11",
            "description": "maybe i am a country girl... well yes i am a country girl but I was expecting more. Some items were very cheap (corn, cucumbers and peppers) but my FAVORITE green beans were outrageously priced! I did pick up a bundle of sunflowers that were beautiful for about a week. And some yummy peaches from Michigan.",
            "author": "Tonia G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-11-26",
            "description": "Now that it is late Nov., oh, I miss the Logan Square Farmers Market. The veggies and fruit, the friendly faces, the flowers, the performers. It's a neighborhood gem. They sell what's in season so you get to go with the flow and learn new recipes. All the vendors are happy to share their tips. I am looking forward to another great summer next year!",
            "author": "anonymous a."
        }
    ],
    "priceRange": "$$",
    "name": "Logan Square Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "3107 W Logan Blvd",
        "postalCode": "60647",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/rJFh723ng3cuueK6sGkUBg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17734893222"
}