{
    "aggregateRating": {
        "reviewCount": 6,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-06",
            "description": "I love this place.  It's one of the best things about Naperville. I buy all my vegetables here, and take a big bag to work to make salad at lunch. I can't even count the number of times people will comment on how delicious it smells--salad! --because everything is fresh and at its peak.  One person asked me why I don't get tired of it every day.  But when produce is this fresh, you crave it.  The tomatoes are the high point of the  season for me.  Juicy, silky, sweet-- I look forward to them all year.  Last night I had a chopped tomato over burrata with fresh basil, olive oil, salt and pepper-- heaven.  Mayneland is a treasure and I hope the community supports it to the fullest.",
            "author": "Francoise D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-02",
            "description": "I grow many things but my garden space isn't big enough to grow all of the things I want. So I both garden and use a business worthy of my money. \n\nMayneland has been in business for generations. A small local business who gives so much to the community. Their produce is minimally treated and picked fresh and ripe every day. It's not picked \"under ripened\" and then driven across America in a gas guzzling semi. And best of all, they donate the unsold produce at the end of each business day to \"Loaves and Fishes\"!  Why wouldn't you want to support a local business who does so much for our community? \n\nBring cash or check. Actually, just bring your checkbook; you might see all of the produce and not want to have to keep it below your cash on hand. \n\nI am making vegetable soup tonight and every vegetable was still growing as of this morning! Knowing that brings a whole added level to the words \"comfort food\".",
            "author": "Melanie B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-02",
            "description": "OMG! Where have you been all my life!  My husband stopped on his way home from work and picked up strawberries and asparagus. I haven't eaten strawberries in years because the ones at the stores just have no flavor.  These actually taste like strawberries!!!! Ate them all in a day.  Will be going back to get more. And the asparagus was huge! And delicious as well! You have to go!! We will never go back to the stores again!",
            "author": "Darci D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-08-05",
            "description": "Family owned and operated, MayneLand Farm is in Naperville.  They have a bountiful selection of the freshest veggies and fruit; absolutely the most gorgeous tomatoes!  I like red onion on a burger or in a salad, but seldom buy because stores usualy just have huge bulbs and I have no use for more than a slice or two.  Their stand has large and small Red onions..they had purselane and dandelion greens and several varieties of lettuce...and as I was leaving I was invited to sample a wedge of melon.  When you go, take cash....or a check.  Was easy to find (between Diehl and Ogden, just off Washington)  Be sure to like their FB page: https://www.facebook.com/MaynelandFarm/ and learn about them on the web http://www.maynelandfarm.com/",
            "author": "Joan S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-10",
            "description": "So close! I can't believe this is so conveniently located on my way home from work!!",
            "author": "Maeghan S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-14",
            "description": "Cute little farm to hold you over during the week in between Saturday Farmer's markets!\n\nThey have fresh veggies and fruit and strawberries that actually taste like strawberry! They also have raw honey.\n\nDefinitely on my list.",
            "author": "Angie E."
        }
    ],
    "priceRange": "$",
    "name": "Mayneland Farm",
    "address": {
        "addressLocality": "Naperville",
        "addressRegion": "IL",
        "streetAddress": "27W265 Bauer Rd",
        "postalCode": "60563",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Rz_29EKLe88uL8ZTE2ZBGA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16303571877"
}