{
    "aggregateRating": {
        "reviewCount": 6,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-17",
            "description": "Montalbano Farms CSA program is fantastic!  We have been with them since moving to Chicago three years ago and absolutely love the fresh produce we get to enjoy throughout the Spring, Summer and Fall.  \n\nTheir CSA offers several options including weekly customizable shares or the more traditional week/biweekly box option in a variety of sizes.  If you need to miss a week here or there, it is never a problem though.  \n\nAside from a variety of share options they also offer several pickup locations throughout the city that are almost always close to some type of public transit.",
            "author": "Erika U."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-05-29",
            "description": "We did this last year and it worked out great, so we signed up another year. These guys break their backs pulling weeds every day so we don't have to consume pesticides. There are many CSAs to choose from, and I'm sure most all of them are great, but I haven't had any issues with this one and highly recommend it.\n\nFor those of you that don't want the commitment of picking weekly, bi-weekly pickups and/or have a hectic schedule, they just launched a program where you can carry a balance and order what you want, when you want throughout the season.",
            "author": "Nick S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-11-12",
            "description": "What a wonderful CSA! This was our first year doing it and we loved every week. It was great to be able to choose your own produce and I suspect next year will be even better now that they have some data to work with as to what to grow more of.\n\nProbably my favorite thing was the braising mix (baby kale, chard, and other greens) that you could cook up for a nice meal in itself. The carrots in Oct were the sweetest I've ever had. My friends and family all loved the produce that I would share.\n\nThe best thing about this CSA is the fact that you can place multiple orders for different drop sites. Having family spread across Chicagoland, I was able to share local produced with anyone who wanted to try!\n\nKeep it up!",
            "author": "Patrick L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-11-05",
            "description": "Montalbano Farms' CSA is great. My small share was in the mid $30s per week. \n\nPros!\n-Many pick up sites throughout Chicago\n-The farmers care. A lot.\n-Weekly newsletters including updates from the farm, crops included in the week's CSAs, recipes\n-The produce is delicious and arrives at the pick up site clean and cold. Greens are kept damp to maintain freshness. \n-The season is longer than most (until mid-Nov)\n\nNB: no fruit included in the CSA package. \n\nI plan to sign up for another CSA with Montalbano Farms though next time I shall select the Custom Share so I have more control of what produce I receive! That being said, the weekly selection was overall quite good and a great way to eat vegetables that you might not normally buy.",
            "author": "Sera J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-11-12",
            "description": "This was my first year and I will be back!  The produce is organic, flavorful and beautiful.  Farmer Rob and Farmer Christina are just the best!  Friendly, knowledgeable and ready for feedback to better serve their customers.  So grateful to find them!  I cannot say enough nice/good things about Montalbano.  I can't wait for next year!\n\nMJ Deamon",
            "author": "MJ D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-07-22",
            "description": "We have a CSA arrangement with this farm and are extremely impressed with the produce we've received. Farmer Rob Montalbano is an approachable and enthusiastic guy who rents two acres from another organic farm and pulls a tremendous amount of clean, fresh produce from the ground each week for his subscribers and his farmer's market booths. He also sends out a weekly newsletter detailing the ups and downs of the week, what bugs are getting him down, and which bugs are saving the day and eating those bugs. The newsletter also highlights a few recipes for the more off-the-beaten-path vegetables, helping you make the most of your weekly haul.\n\nI've seen the boxes of a few other CSA's available in the area, and I was very glad we picked Montalbano Farms. Farmer Rob has them beat, remarkably, on quality, quantity, and variety. Also he's very accessible-- if you have any questions you can call or e-mail him.\n\nYou can find his stand at the Logan Square Farmer's Market on Sunday mornings, Wednesday nights at the Evanston/ Ridgeville Farmer's Market, and at the Englewood Farmer's Market on Thursdays.",
            "author": "Anders B."
        }
    ],
    "priceRange": "$$",
    "name": "Montalbano Farms",
    "address": {
        "addressLocality": "Sandwich",
        "addressRegion": "IL",
        "streetAddress": "17551 Frazier Rd",
        "postalCode": "60548",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/6U-_oJZ9kA5giS2ZIo7yJw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16308828008"
}