{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-09",
            "description": "There was a time in my life when I was a carb-loader, errr I mean vegetarian.    However, there was a night time football game in college, I craved a hot dog, and it was all over.  True story.  So, now I eat meat, but try to only think of it as originating in the package it comes in.  \n\nWe had been eating more and more organic meat, but I still didn't feel that great about it.  I mean, I am not the folks from Portlandia, (http://www.hulu.com/watch/208808) but I would prefer that my food be antibiotic and hormone free and actually know it for sure.  So, I did some research and found out that Nature's Choice was available right at the Frankfort Farmer's Market.  Hooray! \n\nWe signed up for the CSA and egg share and couldn't wait for our first delivery.  We get to choose from two different bags and there is always a great selection.  Not only do I know exactly where our meat is coming from, but it tastes great.  Unlike anything I have ever had.  Like what meat should really taste like. The eggs are also delicious and we go through quite a few each month.\n\nBefore Nature's Choice, my husband lived in fear that I would give up meat again, but with this quality of a product, he can rest easy that this won't happen.  In fact, we have already decided that we will continue with the meat and egg share throughout the winter and spring.  It really is a great value and a great product.  Try it out!",
            "author": "Emily B."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-06-15",
            "description": "I have bought from farmers over the years, I had purchased from this farm and everything seemed great until one order we were upcharged for eggs because they didn't have the size we wanted so they increased our order to the larger eggs $1 more per dozen and never even mentioned it. Then on a different order we had a slight issue with our ham slices being discolored and having an odor. This was over the course of buying from them for about 2 years and about 10 different orders. They black listed us from ordering from them because we had pointed out those 2 things. Be careful when you order from them because they don't take well to anyone trying to mention that something may have been bad or wrong.",
            "author": "Steve E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-26",
            "description": "I found this farm selling at the Lombard Farmers Market this past summer (2012). I had never considered organic meat, figuring the stuff at the local grocery store was good enough. I was WRONG! Their meat has much more taste, less fat, and the animals are fed NO corn, antibiotics or hormones. Grass-fed and free-range, it's the best of all worlds. They have opened my palate to what real meat is supposed to taste like. The only thing they could do to make it more perfect would be to add dairy items (although they do offer free-range eggs). I plan on ordering from them year-round - they offer a delivery service once the farmers markets close down. You can't go wrong with Eric and Samantha and their wonderful farm.",
            "author": "Sherrie H."
        }
    ],
    "priceRange": "$$",
    "name": "Nature’s Choice Farm",
    "address": {
        "addressLocality": "Grant Park",
        "addressRegion": "IL",
        "streetAddress": "9445 E 5000N Rd",
        "postalCode": "60940",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ih3dJdcbNqfSqQn0lnfGPg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18154722934"
}