{
    "aggregateRating": {
        "reviewCount": 72,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-22",
            "description": "I've been coming to Oak Park Farmers Market for 20 years and every year it has improved upon itself and expanded to offer more and more delicious and unique things like cheese, bread, honey and jams/sauces in addition to standard fresh fruits, plants, flowers and vegetables. \n\nI'm one of the few people who don't actually care for the donuts themselves but I do love how Pilgrim Church shares the donut sale proceeds with so many awesome community non-profits. I also love the gathering of talented folk musicians who come out each Saturday to play near the donut stand! The musicians were gone by the time I arrived at 12:30 today so be sure to come early if you want donuts, music and the full variety of stands open. About a third were already sold out or broken down by 12:35 which is a shame since I can never get to the market before that time due to a class this year. \n\nFinding nearby metered street parking can be a challenge but if you park a few blocks away and walk in to the market you should be ok.",
            "author": "Siobhan D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-10-13",
            "description": "I just attended the Farmer's Market this morning. I like this market, I have gone several times a year for a few years. \nAlthough there are quite a few vendors, the vendors and products are the same each time and each year. There are seasonal items which is great. \nI would like to see a little more in the way of food products you can snack on while walking through the market. \nAlso, I'm never entirely sure why Carnivore isn't in there. Carnivore supports local farmers and I usually wind up buying a lot of produce after I shop there. \nI would like to see a bit more variety. \nIt is a nice market though, it's run well. \nI consistently by chocolate croissants from Katie's and flowers from the Stand in the south/east corner of the lot. \nThere are lots of parking options and it's right down the street from a lot of shops and restaurants. I do recommend going early.",
            "author": "Elizabeth P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-03",
            "description": "Really good experience coming here on weekends with the kids.\n\nThe church parking lot where the farmers market is makes their own donuts - cinnamon, powdered sugar and plain. All excellent! I'm not sure if the donuts are more popular than the items from farms.\n\nNormally, I come to get fresh honey and a few fruits. The oak park community turns out every weekend for the market and you will often bump into neighbors....make sure you've wiped the powdered sugar off your moth.\n\nPrices can be a bit high. But, feels good to support real farmers making real food.\n\nDid I mention donuts?",
            "author": "Omowale C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-07-21",
            "description": "This is my local farmer's market located in the parking lot of Pilgrim's Church on Lake Street. It opens early so I recommend getting there early (b 4 11am)before everything is sort of picked over. The selection of vendors/area farmers ranges from fresh fruit to flowers to salsa, jellies, olive oil and meats.  Don't forget to stop by the donut booth where local businesses/churches/groups host every week and proceeds are then donated. The donuts are phenomenal!! There is also usually an eclectic group of musicians of all ages jamming together during the market hours. It's convenient that most vendors accept credit cards and of course cash. I believe you can use link cards too.",
            "author": "Caroline W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-13",
            "description": "Great selection of produce, flowers, cheese, etc. The donuts r fresh and today was roasted corn day. I wish there were a few more options for coffee and breakfast. Can't wait to try out our fresh honey and real seasonings, not the salt filled choices from the grocer.",
            "author": "Anne S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-06-19",
            "description": "Great selection of freshly grown vegetables and fruits.\nCool selection of jams, cheeses and spreads.\nThe only problems are the whole thing is cramp/stuffed into a parking lot \nand there is hardly any parking in the area. HUGE Hassle",
            "author": "Martin P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-10-20",
            "description": "Of all the farmers markets in the area this is probably my least favorite!! The produce is pretty good. The market lacks prepared food and bakery items which is disappointing. I know they don't allow bakeries because they do bake sales and donut sales but I'm not a fan of either of these!",
            "author": "Kacie R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-20",
            "description": "Yes. I do come here for the donuts!!  They are so good, they melt in your mouth. Yum!  This market has a wide variety of produce and plants. You can get anything from veggies, fruits, cheese, eggs, honey, jams, herbs, plants, beeswax soap and meats!  ;) but don't leave without trying some of those delicious donuts!!",
            "author": "Johanna A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-15",
            "description": "I try to make it to the OP farmer's market once or twice a Saturday a month without running late to work. That has been an unsuccessful feat! Anyway, OP farmers market at the Pilgrim Baptist Church is famous for their homemade donuts which you gotta wake up real early in the morning to get...seriously! *Sidenote: Do not buy a couple of donuts and take to work! Even if you put your name on them, some idiot will steal them!*  It's that good. \n\nLast year I went I tried a sample of this cranberry salsa from a farmer from Michigan. It was so good, I went back and bought another jar and saved it for Thanksgiving. I also bought a bunch of golden beets, I never had them before. They're good for roasting and putting in a veggie taco! \n\nSo OP farmers market is great for their selections and location...",
            "author": "Corelle P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-04",
            "description": "LOVE\n\nThis is by far my favorite farmer's market....it's the right size and has a perfect amount of great, friendly vendors.  They remember you week after week and make the experience great.  \n\nAnd have I mentioned the wonderful donuts...wait...I won't because I don't want the line to be any longer (no donuts here!)",
            "author": "Kathleen C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-13",
            "description": "Love this farmers Market! It's so home town and full of happy people enjoying the summer. From residents playing folk music and singing to all the smell of cinnamon and sugar home made donuts!! Usually a line for the donuts but well worth the wait.  There's tree types of homemade donuts : plain, cinnamon and sugar, or powdered sugar. My all time favorite market in the area.  Really good selection of fruits and veggies stands. Also fresh baked goods and cheese vendors, jellies and sweets.  My favorite things to buy are the fresh flowers that are offered at a really good price and last a long time since they are fresh cut. It's very family friendly and great for bringing he wagon to carry the kids and goodies you buy. There's always parking and easy to get to. Too bad the weather in Chicago only allows the market to go from May to October.",
            "author": "Elisabeth H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-06",
            "description": "Our family loves going to the Oak Park Farmers Market. There are lots of great vendors offering fresh locally grown produce, flowers and more. Oh and the church sells some incredible donuts! And there is even a band. Last Saturday's of the month there are special activities for the kids. Not to be missed!",
            "author": "Todd K."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-08-02",
            "description": "Nothing special.  Good looking produce, but expensive even by farmers market standards.  The famous donuts here are quite ordinary, but at least cheap.  Nice garden plants and fresh cut flowers.  Always a good bluegrass band.   What this market really needs is prepared hot food.  But Oak Park won't allow it.",
            "author": "Joshua N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-18",
            "description": "Love this Farmers Market. There is an abundance of produce stands. A few organic produce stands. \nYou can find local honey, local pasture raised eggs and proteins. \nCheck out the mushrooms and salad mix at Tree of Life. They are right by the bakery stand by the church. \nStovers stand has great fruit and jam's and such.\nBeautiful flowers and lovely people abound! \nCheck this market out on Saturdays.\nI tried the donuts and found them to be overly sweet.  Try one for yourself though, a lot of people love them.",
            "author": "Lola P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-03-07",
            "description": "My own town has a perfectly wonderful Farmers' Market but I have to admit it, the one in Oak Park is bigger and better.  It is like your average Farmers' Market times at least two.  Any fruit or vegetable you want, it is here, in triplicate.  Plus, unlike my town, they do not allow dogs so you can walk around without any barking or dog poo to avoid.  Perfect!\n\nI know what you are thinking, hmmm, Kathleen does not usually get quite this sentimental about produce, there must be something else going on here.\n\nFine, yes, there is.  The donuts.  The ambrosia that is sold hot, fresh and in a sugary circle of fantastic flavor.  Those cinnamon donuts are the stuff dreams are made of.\n\nI can't wait for this Farmers' Market to start up again.  I am coming donuts, I will be there!",
            "author": "Kathleen M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-13",
            "description": "Love this farmers market! I go every weekend in the summertime. The fresh produce is great, and several vendors sell honey, eggs, cheese, ice cream, and meat as well. The fresh-made donuts they sell every week benefit a different local charity every week. There's also a garden stand that sells lovely plants, and the staff is super friendly and knowledgeable. \n\nMost vendors accept credit/debit cards, and last summer there was a special program that gave Link card users double their money in purchases (spend $5 for $10 worth of goods, etc.).",
            "author": "Carolyn S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-02-03",
            "description": "Fun to visit and a nice way to relax and mingle with other Oak Park locals, but most produce is very overpriced for what it is.  What it is? Fresh and Local.  What most isn't: ORGANIC or NON-GMO.  \n\nWith the type of clientele that Oak Park provides a market like this, I would expect a bit more in terms of value (like getting organic non-gmo produce for the prices charged here normally.) But, I totally understand you are at least in part paying for the experience.  \n\nIs the City of Oak Park just charging the vendors too much to allow them to charge competitive prices???",
            "author": "Kristin S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-10-10",
            "description": "I just moved to Oak Park and decided to take the first Saturday in my new place to explore the area - wow was I pleased!  After the quick walk down Lake Street and past the Oak Park River Forest High School campus, I got to the large Farmers Market.  Such a great selection: from soaps, veggies, fruit, honey, cheese, donuts, and breads... you really get all that you could ever want!  Make sure to bring some cash - while some places do accept cards, I found myself out of money and wanting more from the places who only took cash.",
            "author": "Chloe M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-26",
            "description": "This is as good as a farmer's market gets if you live near the area.  Although it's not as diverse as some great markets on the Pacific Northwest or West Coast, it provides a good selection.\n\nOn that note, the selection is NOT created equal.  I recommend walking around once before you purchase.  You will see that although their website states they are \"organic\", not everything sold here (produce wise) is organic.  I don't do GMO's, chemical spraying, and the like but you have to ASK the families because I found that after asking this year (2013) almost all, with the exception of 3 booths sprayed pesticides and in some cases, also fungicides.  That is NOkay in my house.\n\nThere is a booth that sells grass-fed cow/goat cheese, spreads, butter, and ice cream that is AMAZING.  And although there are two booths selling meats this year (that I saw), only one of them is grass-fed (Heartland Meats), and even they said that they supplemented in the last 3 months before slaughter with grain, yet couldn't tell me if it was genetically modified grain??  I figure, 3 months of fattening on the grain, but a lifetime before that pastured, I will compromise and okay that meat.  Plus, I appreciated that he took the time to talk to me, answer my questions and inquiries regarding feed, gmo's, and purchasing in quarters.  Which is more than I can say for the other booth that handed me a brochure after my questions that included only pricing.\n\nMy favorite family booth is Tree of Life.  They have wonderful, quality, beautiful produce and the two of them are seriously the most friendly people I have ever met.  They answered all my questions...they are completely organic, no chemical spraying, and they have a CSA (community share agreement) if you want to buy boxes weekly.\n\nAll in all, I frequent this market every weekend.  And past reviews also state they only accept cash.  However, they except credit cards at some booths and others that don't will give you a receipt to go to the \"yellow\" tent and they will ring up the sale for you.  You can then return to the booth of purchase, hand them the paid receipt and pickup your goods. \n\nAlso, in an attempt to help those who are having hard times and unemployed, this farmer's market will also accept the IL Link card.  You pick out your goods and return to the \"yellow\" tent with your receipt, pay with your Link and then return to pick up your goods.  Additionally, because you purchased REAL food from a farmer's market, in lieu of junk at a grocery store, you also are awarded a match coupon for every dollar you spend up to $20.  You spend $20 on your Link card you get another $20 in coupons to spend at this farmer's market.  That's $40 of fresh produce for $20 off the Link card.  I think that this a wonderful incentive to help steer people to REAL food in lieu of soda's, chips, and junk.  I don't know how long that goes on, I just asked about the program because I saw the signs.",
            "author": "Denise S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-02-17",
            "description": "Been here for years. Savour Magazine did a write up about the donuts that are made on site. Lots of Farmers with Organic produce, lovely flowers & Nichols Farm from Illinois. Open from 7am-1pm from Mid May thru the end of October. A Saturday A.M. staple. Support your local farmers & CSA are available.",
            "author": "Jen R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-02-03",
            "description": "Donuts. Enough said.\n\nAlso, most of the vendors accept credit cards which is great.",
            "author": "Stephanie R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-11-14",
            "description": "One of the best farmer's markets around. Lost of organic choices. Most vendors are from Wisconsin or Michigan, but a few are more local. Great cheese, jams, breads, eggs/meat as well.\n\nGo early to avoid the stroller-fest - unless you have a stroller then go late so I can have some space and retain my sanity. :-)",
            "author": "Karen Anne B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-11",
            "description": "The donuts are amazing and really cheap! If you come any later than 8 and would like a donut prepare to stand in line. They are totally worth it. This is a nice small market, the flowers are fresh and beautiful, they have a vendor with the best...how do I say..I believe it's a baked cheese. You heat it up and it's really delish. Most vendors accept cash only, so bring that and have a great time.",
            "author": "Alana D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-07-20",
            "description": "The produce here are fresh, that's great, but the price is way too high at some of the vendors. Most of the veggies and fruits were sold for $3 to $5 per pound, being not organic, that's ridiculously expensive for what they are. You can get non-organic fresh produce at Jewel for much less, and I guarantee you they taste the same. Locally grown is NOT the same as organic, and should not be charged as equals at this farmers market. The selection wasn't that great either, just your standard tomatoes, zucchinis, green beans, and fruits like cherries and peaches. The baked goods are great though, since you can actually taste the difference between home made and store bought. Don't get me wrong, I would love to support the local farmers, but they are just charging too much for what it is.",
            "author": "Rui C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-12-17",
            "description": "I'm mainly writing this to add to my donut list, but the produce has always been of good quality and the donuts, though not the best I've discovered to date, are soft, hot and delicious.  There is a reason people wait 10 minutes in line.  \nIf you get there mid-morning, expect to park a good 5 minute walk away (not that it makes that much of a difference- its a nice walk anyway)  - that is of course, if you opt for some place other than the parking garage adjacent the church.\n\nRead the other reviews for more in-depth detail.",
            "author": "Brian C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-04-07",
            "description": "This is such a gem, and one of the things that makes Oak Park so great. Fresh, organic, local produce! Fabulous donuts! My only complaint is that the whole area is mobbed by the market on Saturdays. But hey, a good market is going to draw a crowd, right? It's a sign that you're in the right place.",
            "author": "Brittany V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-18",
            "description": "Perhaps I'm biased considering this is within a \"longish\" walking distance from our home, but it's fantastic!\n\nThere is a large variety of stands with a huge variety of vegetables, fruits, dips, cheeses, breads, and even meats!  Though it's sized to be large enough to attract people from outside of the immediate Oak Park area, it still feels extremely communal and relationship based.  Just check out the middle schooler selling water bottles just outside of the farmer's market grounds, or the adorable 6-year-old down the street whose mother sits on their front porch watching from afar as her business-minded daughter sells lemonade.  It's sweet and quaint, but crowd serving.\n\nAnd can we talk about the donuts?  Oh the donuts, oh...oh...oh....Ok, I'm done moaning about their goodness now though my tummy is still craving one.  And I'm not beyond the irony about the deliciousness of donuts at a farmer's market, but when you have one, you'll never go again and not get one.  And if you do, then you've got way more self control than I do.  Or my husband.  Or my in-laws...or basically anyone on the face of the earth that I know.  Enjoy!",
            "author": "Amanda B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-18",
            "description": "What a cool farmers market.  I avoid the weekend farmers market in the city (too many people, strollers and dogs) but this one is great.   Its right on Lake Street, and its in a church parking lot so you're not on top of all the other shoppers. \n\nIt goes until 1pm, and I arrived approximately 11:30.  There was still everything left.  So many veggie and fruit vendors, and meat, ice cream, cheese, and tons of plants.\nAnd the donuts are pretty rad, too!",
            "author": "Julie A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-10-12",
            "description": "Great little farmer's market with pleasant vendors, a wide variety of fresh and unique things, and the best donuts each Saturday!  A live folk band and many happy faces.  Great spot on a Saturday morning.",
            "author": "Mary Ann C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-14",
            "description": "I never realized how lucky we were in Oak Park.  We've had a Farmer's Market for decades, before anybody realized how important they are.  The Market has had a long time to become what it is, and what it is is great.  \n\nMy favorite is Nichols' Farm, with the yellow bins -- tons of different varieties of tomatoes, potatoes and apples in the fall.  Nichols' shows up at markets around Chicago -- you can always recognize them by the bin color.  Farmers are always set up at their usual spots, everybody's always got the most lovely stuff come August.  Great market, and an OP institution.",
            "author": "Vicki R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-09-08",
            "description": "grand\ntons of organic local produce, meats, and cheese.\nJams, oils, egss, and others.\nDonuts, bluegrass, nice people.\nthey take cards, and you support farmers, not factory farmers.\n\nneed a say more.",
            "author": "robert a."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-06-28",
            "description": "I decided to check or this place after reading the reviews here. There were a lot of different things being sold: Flowers, vegetables, baked goods. Not much variety in vegetables. However the cherries I bought are delicious! I've already ate half the box... Might regret that later... But they taste so much better than the grocery store variety! So definitely check this place out. And bring your own bags! And remember to smile!",
            "author": "Safee L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-24",
            "description": "Besides the no dogs allowed policy, this is probably the cutest farmers market I have been to! We live close to wicker park and logan square ones... \n\nMy husband remembered the same donuts from when he was a little baby over 30 years ago, his grandma used to live in the neighborhood, so it was very cute to see him bite into the yuminess and go back in time! \n\nIf something is around for that long - you can't go wrong! \n\nWe bought some heirlooms, fresh mozzarella, cheddar, corn, fresh flowers, etc. So far, everything has been fresh and fantastic! \n\nGlad that we have friends in the hood to visit and sneak to OPFM...",
            "author": "Evelina L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-06-05",
            "description": "More than just a farmer's market, the OPFM is my official harbinger of summer. Between the gentle buzz of the happy crowd, the INCREDIBLE homemade donuts (made from scratch on site), the gorgeous flowers, and the charm of the community bluegrass band, this is my favorite thing to do on a summer Saturday morning, regardless if we buy anything from the local farms (which we always do.)\n\nAs far as the produce goes, it isn't \"discounted\" like supermarket produce for a good reason:  it is the real thing, grown by hand by farmers who do it right.  And it is local and sustainable and incredibly fresh and delicious.  My favorite haul comes about midsummer when the tables and tables of incredibly colorful heirloom tomatoes begin to appear.  You will not such variety, beauty and flavor in a supermarket.",
            "author": "Matthew R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-26",
            "description": "The beef from Heartland Meats is amazing. Their filet tips are fantastic. We use them a lot for steak salad and I'm sure they're great for kids. The vinegar and honey is also so good and the flower vendors have beautiful flowers. I have been coming to the market for many years and it's a great part of summer. It's also nice to support the local charities and clubs that have bake sales at the market. One of the cheese venders has a spreadable jalapeño cheese that is addicting!",
            "author": "K H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-07-14",
            "description": "Now I love the farmers market, but I think they could be doing a little better.  They should try and get more straight up produce, and less boutique type vendors selling pricey hand made soaps and the like.  \n\nThat's my only criticism, that and it could have been placed a little closer to somewhere with decent parking.  I ride my bike as much for avoiding the parking hassle as for the exercise.  Also, bike riding gets you green cred with the faux-liberal elite of north Oak Park.  \n\nI agree with comments of the more proletariat reviewers, it is expensive for those of us without 6 figure household incomes.",
            "author": "Pete D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-09-22",
            "description": "What is the obsession with the doughnuts? I didnt think they were all that. I'd much rather munch on a Krispy Kreme. I think my taste buds must have been out of whack on my first visit to the market last Saturday because the line for the doughnuts was a mile long. \n\nI really enjoyed the place. I got a lot of nice pictures and a lot of fresh veggies and fruit. Everything was super fresh and yummy. I loved that my raspberries came in a tiny wooden carton. It gave it a real midwestern old fashioned feel. \n\nThe prices werent that fantastic. $2.00 for a cilantro bunch? Yikes! I really thought that the prices at a farmers market would be cheaper considering my food didnt have that far to travel. I dont really mind  though because it is supporting local family-owned farms and not big corporate conglomerate farms!",
            "author": "Kymberly J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-05-24",
            "description": "Love at first bite.. er buy! \nOK first we ate two warm cinnamon sugar donuts and coffee! \nSeriously, Asparagus, Local meat, fresh bread, fresh eggs, radishes and so much more. Prices are a little pricey but its all organic and local and super fresh! Amazing flowers including the most amazing peonies I have ever laid eyes on and the smell fills my bedroom and when I wake up and see then it takes me back to my grandmother garden when I was little! \n\nSuch a great market and I look forward to whats to come. \nNext week I am taking pictures!!!!!",
            "author": "Josclyn W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-09",
            "description": "i've been shopping at the oak park farmers market since i was a child.  and i've been bringing my own kids here for 12 years.  excellent variety and lots of great regional farmers.  the best place around to find local dairy, produce, culinary herbs, houseplants, flowers, handmade preserves, honey, maple syrup and all kinds of fresh, seasonal, sustainable, edible goodies.\n\none of my favorite vendors is brunkow dairy, of darlington, wisconsin.  definitely the best squeaky-fresh cheese curds around.  and be sure to arrive early for the fresh doughnuts from the pilgrim church!!!\n\na great place to find beans, greens and asparagus in june; peaches, peppers, cucumbers and cherries in july; sweet corn, melons and berries in august; apples, pears and plums in september; fresh cider and pumpkins in october.  yum!!!\n\n** in response to cameron's \"delusional\" review, below, i don't think it's entirely fair to say that holland, michigan isn't \"even slightly local.\"  as a professional chef, and someone who closely considers the source of my food (including carbon footprint, overall environmental impact and proximity to the ), i take exception to the idea that the oak park farmers market isn't about supporting local farmers...\n\nnext time you're at the market, take a minute to talk with one of the vendors.  my kids and i spent 10 minutes talking to a beekeeper (from nearby elgin, illinois) about pollination and honey production.  and, believe it or not, sustainable farming isn't the most profitable career path...  i have no problem paying a 20-50% premium to buy my fresh, michigan-grown cherries from a family farmer.  it makes me feel a lot better than buying them at jewel, after they probably spent two weeks in a shipping container, en route from chile or mexico.\n\nas a native oak parker, i'm proud to know that our village and it's residents have supported a non-profit community market for more that 30 years.  you call oak park a community of \"privilege,\" and that may be true, to some extent...  but i would argue that it is also a community with a rare sense of responsibility and social conscience.  next time you want to show what a wealthy and indiscriminate twit you are, there is a whole foods right down the street...\n\nand i challenge you to find me the same quality, fresh-made doughnuts, anywhere \"local.\" **",
            "author": "Jason G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-12-23",
            "description": "Commentary on a couple other posts...\n\n1. RE: complaints that the market not that big or doesn't offer that much variety (e.g. in a review posted in June of 2008).  It is true that in the early part of the summer, there isn't much variety.  By July and August, the selection really increases.  This is all part of the natural growing season.  You can buy what is coming out of the ground at the time.  While some might find it inconvenient, I like to eat what is fresh now within driving distance.  It's not ALL I eat, but at least I think I'm a little more in touch with the land that feeds me.\n\n2. Red Hen Bakery is back in 2009, and is also opening a shop on Lake St. and Oak Park Ave.\n\n3. RE: prices.  Some prices are higher than at big grocery stores, but not higher than organic, locally farmed produce you'll find elsewhere (and food at Whole Foods isn't as local as it appears).  The thing is, the reason that big grocery stores ship food all around the planet is largely because it is cheaper to do so!  Or they wouldn't do it (or they would really jack up the prices for strawberries in December).  Quality of produce and high labor standards are sacrificed for the sake of cost-reduction.\n\nThe value you get at the OP market is not from lower prices (because really, it costs money for the farmer's employees to drive to OP and sit there in a tent making change all morning--they wouldn't have to do that if they were to sell everything to Whole Foods for example), but from knowing more about your food, when and where it came from, who harvested it, etc...\n\nAnd yes, the donuts still rock.",
            "author": "Aaron A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-29",
            "description": "After reading all the 5-star reviews I expected the market to be much much larger. The selection was great, the variety was ok, for the season, I can't complain. The donuts were awesome! Honestly, I'd come back just for the doughnuts. \n\nHere is a forewarning for first-timers - get there early. If early for you means 10am, that's too late. Trust me. It gets really really really crowded. Ideally, you should be done by 9am. Plus, you don't have to pay the meters until 9am anyways. Go do your shopping and then come home and take a nap!\n\nI wish the market was a lot more spread out because it gets pretty crowded and hot in there, even though it's an open air market.",
            "author": "Victoria h."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-15",
            "description": "Actually a lot of fun even though I don't get to go as often as I want.  Nice way to spend your day.",
            "author": "Hadi S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-05",
            "description": "Is it INSANE that I look forward to waking up early on Saturday mornings because of the OP Farmer's Market?  Thought so.  And, I do.  I actually get giddy over it.\n\n* $1 bag of fresh cat nip for my kitty.  He gets one every week.  Spoiled cat.\n\n* Only the freshest and most in season fruits and veggies.  All grown by farmers within a 200 mile radius.\n\n*  Fresh flowers to brighten my kitchen and my day.\n\n* Donuts.  The donuts that everyone talks about.  I have yet to savor them.  I WILL wait in the line this year.\n\n* Always a come one come all, free for all live blue grass jam session.  Grab your instrument and come on down!  Anyone is welcome to join in.  I always stop shopping and listen for a bit.\n\nLast year the chef from Trattoria 225 started doing the occasional cooking demo here.  He'd creates a recipe based on what is in season and will be available in plenty at the market.  This is what actually enticed me into his restaurant.  Great addition to the market!\n\nOP Farmer's Market is definitely not a large as Green City, but it has a heart almost twice the size!",
            "author": "Kelly S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-10",
            "description": "I'm laughing at all the donut reviews- so many mixed opinions.  They're ok, what I love about them is if you're timing is good they are still warm when they're served.  Warm donuts are nice.\n\nThe selection of food, herbs and plants here is fabulous.  I always find an excellent selection of herbs to plant in my garden.  I also enjoy the farm that offers selections of indigenous plants for my  garden.  I know they will do well because they are supposed to be growing here.\n\nI olnly wish they'd let me bring my dog into the market.  I always have to leave her tied to a tree. :(",
            "author": "Lisa D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-15",
            "description": "Cute little market.  I didn't find the famous doughnuts though.  And for some reason, all the berries (blue- and rasp-) were the same prices at each vendor.  Still got a good deal on taters, and they had Japanese yams.  Yamtastic!  (get it?  I'll be here all week folks!)\n\nThe plant vendor was nice a quite a character.  I might get something from him next time.\n\nParking is a bit crazy, but I managed to find a spot relatively quickly.  Really close to the El though.",
            "author": "Nessie V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-09-11",
            "description": "Did someone say, \"Donut?\"  \n\nYou'll know you're nearing this particular farmer's market when you get a whiff of freshly made donuts in the air.  That's right.  Donuts.  Instead of just the usual market fair of fruit and vegetables, flowers, herbs, cheeses, baked goods, etc., you get donuts made on the spot by the dozens if you wish.  Cinnamon, powdered or plain, they are all amazingly soft and melt in your mouth. \n\nCome to think of it, I've only really purchased a few other items in the numerous times I've been to this particular market (but don't get me wrong, everything looks top-notch!)...I usually go just for the donuts.  Guess that's the Homer in me!  \n\nGgaaarrrrgggghhhhh.....doooonnuuuuuuttsss!",
            "author": "Clarissa J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-02",
            "description": "No, this is not Chicago Green Market!  Don't expect it to be.  This is a small community Farmer's Market in a Church parking lot on Saturday mornings and has been going strong for 30 years!\n\nThis is what small community farmers markets are supposed to be like.  I can ALWAYS be sure to run into a neighbor or friend of my parents (yes I grew up in Oak Park), or even the odd old classmate.  Has the selection gone down in the past years?  Yes, but from what I understand (talking to some of the VERY FRIENDLY growers) alot of that has to do with the fact that the US has been going through rapid changes in weather that has affected the farmers; drought, light winters and cool summers.  I have noticed that there are fewer venders as in the past.  Possibly, many suburbs have started to follow Oak Park's example and started up their own Summer Farmer's Markets.  \n\nAs for the doughnuts, as stated by a past poster they might not be the best tasting ones out there but the fact that the money collected goes to various community groups makes them taste that much better! Oh, and the inch layer of sugar helps too.\n\nNow, on to the complaints of prices.  Anytime you plan to purchase organic, \"picked fresh\", ripe produce you will pay more.  That is one of the reasons people love farmers markets over Jewel (or even Whole Foods).  Here you know that the produce was just picked and has not ripened on a truck crossing the country.  Also I don't mind paying more for the expertise of the farmers.  I have often received great recipes and advice on how to best prepare the produce right from the people who grow it!  To me that is worth a bit of money.\n\nNow if you want a jumbo sized farmers market, by all means head over to Green market.  If you want to experience a wonderfully friendly community market with really good doughnuts, good coffee, bluegrass jams, a fantastic flower section stop by the Oak Park Farmers Market.  Oh and how could we all forget the roasted corn!  Fantastic roasted fresh corn!",
            "author": "Jennifer S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-08-10",
            "description": "I like this Farmer's Market very, very much.\n\nLast year I would have given this market five stars, it seems this year there are fewer vendors. But I still enjoy it.\n\nSome of my favorites...\n1. Chicago Coop Honey (see separate review)\n2. Steve Owens Flowers (beautiful and reasonable sunflowers, lilies and mixed bouquets)\n3. Geneva Lakes Produce, WI. (love the pan peppers)\n4. Heartland Organic Meat (just beautiful & delicious)\n5. The dough-nuts baked fresh in the church.\n6. The herbs from the vendor at the south-west end of the market (I forgot their name) they are so knowledgeable and helpful with suggestions.\n\nI always come home with a sack (or two) of some really great \"goodies\" every time I go.",
            "author": "Liz M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-08-22",
            "description": "There's a ton of things here I could rave about, from the Brunkow cheese guy to the tomato girls giving me a morning fix of wheat thins and bloody marys I didn't know I needed. But the obvious reason to come here, after all fruits and veggies are said and done, is the donuts. \n\nYes, the line can sometimes wrap around two corners. You might be standing for a half hour or more if you don't get there early enough. But the smell will hit you as soon as you step out of your car--no, as soon as you drive by, and it won't leave you alone until the donut's in your mouth. \n\nThey have cinnamon and powdered sugar varieties, but the donut base is so damn good that none of that stuff is necessary. It takes everything in my power to keep moving and not cause a human traffic blockage when I take the first  bite. It's a religious experience. A small gift from a power higher than anything we walk among on a daily basis. I sound dramatic, I know. But I am in no way kidding. This thing is from another world, and the market becomes a blurry haze around me when I stand still, taking bites slowly from the opaque wax paper bag. Time stops. Which is convenient, because it makes up for all the minutes lost waiting in line.",
            "author": "linni k."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-06-11",
            "description": "As both a resident of Oak Park and a 'frequent farmer's market shopper\" , I can certainly attest to the freshness of the items brought in by the vendors.  About ten years ago a lawsuit was settled in favor of the Oak Park Farmer's Market in response to a farmer who claimed to have grown califlower which was later determined to be false.  The organizers of the OP farmer's market are committed to supporting only truly fresh items trucked in by the growing farmer.\n\nThere's a great sense of community at the market along with lots of politics, community groups and homebaked goods mixed in.  The bluegrass/folk music players are outstanding.  And I've seen people bring their instruments and jump right in.",
            "author": "Cheryl V."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-21",
            "description": "I really enjoy the OPFM. I go almost every Saturday and it's a real treat. It would have to be to get me out and about so early on a weekend morning. \n\nThere are a nice variety of vendors though the organic producers are super pricey, FYI. Especially the tomatoes. I paid $3.50 for 2! That said? Some of the most flavorful and juicy tomatoes I have ever had. \n\nThe bread vendor is wonderful. The flowers and plants are spectacular and generally knowledgeable. \n\nOf course, there are fresh donuts--and they are good--but that's the point. Everything is fresh and delicious. I really can never go back to grocery store strawberries again. they are like strawberry-flavored cardboard compared to fresh ones. \n\nOh, and there is a live blue grass jam band hanging out and playing all morning. It's a real scene in the OP on Saturday mornings because of this great institution.",
            "author": "Bex M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2006-07-08",
            "description": "It's weird, everyone at the Farmer's Market is always in 'nice mode'.  I've never run into any crabby-pantses there.  Maybe they all got there in time for the doughnuts, which are super tasty, but almost always gone by the time I get there.  Go early for those and the best selection of everything else.\n\nAnd if you eat meat, stop by the Heartland Meats guy--it's not cheap, but it's damn good stuff.  You'll be a believer.",
            "author": "Natalie R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-06-05",
            "description": "Produce, shmoduce.  Gimme those donuts!  I don't like donuts as a rule, but these melt in your mouth and don't leave that slimy aftertaste.  Another thing I love is the bluegrass band that plays under the trees so you can enjoy some tunes while you wait for and eat your treats.  \n\nThe fruits, flowers and veggies are pretty good too.",
            "author": "Lisa B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-03-16",
            "description": "Great items, though sometimes the prices are a bit high.  Understandable considering the neighborhood (upscale).  A great place to browse and people watch on a nice sunny day.\n\nAlso, stop by the World Can't Wait table outside the Farmer's Market main area and help us make people aware of why the Bush administration needs to be impeached.  Visit www.oakparkworldcantwait.org.",
            "author": "Edward B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-08-08",
            "description": "I've been to many of the Farmers' Markets in the area(I lost count, but it's a lot), and I've learned a few things:  Most of the vendors show-up at several of the markets each week; product does not vary much from place to place(I prefer the markets with more food than \"art\"); pricing is similar; parking is challenging at most of them; many of them have live music...\n\nTo bottom line it: The Farmers' Market nearest you is the best Farmers' Market at the time(with some exceptions, of course). Try to visit each Farmers' Market at least once, and find your own favorites. The Oak Park Farmers' Market has a good mix of foods, and people.",
            "author": "Michael G."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2011-08-13",
            "description": "After walking 45 minutes from my house to get here (with my small dog), I was met with 'no pets allowed'. Frustrated to say the least. For as 'progressive' as oak park is supposed to be, this policy's a little stuffy (yet not so surprising, I guess). \nI've been here in the past (sans dog) and some of the vendors offer really good products, but from a dog friendly perspective, you're better off going to the farmers market in Wicker Park.",
            "author": "E W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-05-29",
            "description": "the opfm offers a fine array of fresh veggies, fruits, flowers, baked goods, etc. etc. without ever seeming overwhelming. between the friendly vendors, the bluegrass style band, the kids walking their dogs, and those amazing pilgrim school donuts, the opfm always has a warm and welcoming vibe. \n\nif you want a donut, i recommend getting there as early as possible, since the lines tend to get ridiculous. they sell donuts with powdered sugar, and donuts with cinnamon sugar, but i highly recommend the original plain variety.",
            "author": "Meghan L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-07-11",
            "description": "SHOP LOCAL.  SUPPORT YOUR IL FARMERS!\n\nI really enjoy waking up early on Saturday morning, going for a run, and then on my way back home stopping by the Oak Park Farmer's Market.  I love living in OP, the families and kiddies in red wagons really make it feel like summer.  \n\nI primarily shop at the market to support my raging flower habit!  Check out the flower stand on the north end by the dough nuts.  They have a lot of lilies and glads and flowers to make interesting bouquets.  I also browse around for good-looking in produce.  This year has been a little meager, but for your choice of produce, go early.   \n\nOccasionally I get the delicious dough nuts and enjoy the music.  Seeing kids dancing around always makes me smile.",
            "author": "Lynne M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-06-24",
            "description": "1.  Atmosphere - great coffee, insanely good donuts.  They're not just good.  They're \"insanely\" good.  Live folk music for free is awesome.  People are nice, all the vendors are very friendly.\n\n2.  Prices - marked up.  Of course, its Oak Park.\n\n3.  Selection - This is the one downside.  I would like to see more vendors.  There aren't very many options as far as meat is concerned.  I like/love organic meat.",
            "author": "Jayson F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-08",
            "description": "Oak Park River Forest Farmers market is fun and  has great prices and the quality is Excellent!",
            "author": "Tommaso S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-10-03",
            "description": "I've never been to a farmer's market before just cuz. My mom goes to them sometimes and I think she'd be into this one.. because, well... I don't know.. it has a nice selection of produce from farms if you're into that. I bought a huge heirloom tomato at one of the stands and it was beautiful.. a nice deep red.. ended up being really yummy in this saute I made. I didn't see where they sold these \"famous\" donuts.. oh well. I don't really like shopping on saturday's and I'm reminded why.",
            "author": "Izzy N."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2012-05-25",
            "description": "Seriously? This whole thread looks like a circle jerk. The OP farmers market is a.) seriously limited in selection, b.) CRAZY, INSANE, OH MY GOD overpriced, c.) NOT EVEN SLIGHTLY local (OK - Holland, Michigan is over five hours away. That's about the CLOSEST farmer you'll find there. There are parts of central Ohio, Nebraska, and Tennessee that are closer), and d.) if you think this is superior produce, I only half want your drugs because - though you're undeniably happy delusional - you're just beyond lost in happy land. What is with the drool fest on the donuts? They are deep fried donuts that you can get pretty much anywhere that people actually bake and understand the concept of \"baking\". Are we talking about an actual farmers market or what a very privileged community wants to imagine a \"farmers market\" to be? Where I grew up, there were actual farmers markets and THEY got well deservered criticism for being overpriced. Their prices did not hold a candle to the stones that the OP farmers market shows. I found a $9 half pint of blueberies in blueberry season, and the blueberries were from CALIFORNIA. So I gotta think at some level we're not talking about farms or markets, but luxury good and conspicuous consumption Well, hell, I can go to Dean and Deluca's if I want to show what a wealthy and indiscriminate twit I am. And I'd STILL be saving money.",
            "author": "Cameron B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-11",
            "description": "I'm a fan of the products being offered, but it is by no means discounted. Which I understand completely, but I just can't afford to go their very often. My girlfriend convinced me to buy an heirloom tomato for $6 and yes it was by far the best tomato I've EVER had in my life, but it was also $6 so I would hope it would be very good. \n\nAll in all I would say check it out and stick to your budget if you have one. Because you can spend quite a bit in a very short time. I didn't get to try the donuts, but they smelled and looked amazing!",
            "author": "JJ B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-27",
            "description": "Okay... 4.5 stars... they're making the donuts smaller. What's up with that?",
            "author": "Carrie W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-25",
            "description": "Come for the locally-grown fruits, vegetables and other assorted knick-knacks. Stay for the fresh donuts by the church. Don't worry, you'll find them. Just watch for the line of people around the block. No joke. But worth every agonizing second you have to wait!",
            "author": "Chris M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-03-16",
            "description": "I long for summer and the Oak Park Farmer's Market!One of the best in the area. You can find meats,cheeses,sauces,jellies,fresh flowers and plantables as well as your expected fruits and veggies. Love to go there and get great,locally grown produce.Starts  in May and runs through October,Saturdays 7AM-1PM.",
            "author": "Patty V."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-06-14",
            "description": "I have to agree about the pricing, sometimes it does seem high.  Yet, these small farms must drive here, harvest their crops, etc. they cannot compete with the chain grocery stores so you may pay a little more. As one other reviewer suggested  buying strawberries from the back of a truck parked on Austin, I hope she/he enjoys their shopping at those locations.  This market has been running for many years, does it get crowded-yes, are there a gazillion strollers-yes, can it be expensive-yes ... but if you don't like crowds go early, same for strollers and if you feel the pricing is high shop elsewhere.  There are wonderful donuts and coffee, entertaining music by local groups, and fresh produce some organic (and no it isn't more costly than Whole Foods-I don't think any place is).  As all Farmers Markets it is part produce shopping and part meet and greet.  Have fun and enjoy the experience.",
            "author": "Betty M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2008-06-22",
            "description": "So I'm totally going to rain on the parade of everyone who has written a review before me. I went to the Farmer's Market with high hopes. I heard all about the donuts (and they were good, heavy but good). Now as for the actual market, I was less than impressed by the selection of produce and homemade goods. I expected the market to be larger with more vendors and it was small but sort of spread out to look like more, no really great deals, and nothing really stood out to me. A few people had jam and jars of salsa but only about two vendors. I was ready to stock up on fruits and veggie, and home made goodness but nothing! Think I'll check out a couple of the city ones.",
            "author": "Rhonda G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-09-29",
            "description": "I love farmers markets and I can honestly say I enjoyed this one. As yet I have nothing to compare it to as most of the ones I visit are in Houston, however the pickings were similar (fewer organic options at this one, compared to Houston-Upper Kirby). Unfortunately I was unable to try the smellicious donuts as the line was down the alley, stretching around the church. Plenty of the usual suspects, lots of tomato, corn, peppers and they looked great, colors vibrant. Next time I will attempt to survive the donut line & actually try the donuts. Peaches were delish.",
            "author": "y b."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-09-01",
            "description": "We live in the apartment complex adjacent to the farmers market, so this makes me love it and loathe it just a little bit. I love the market for it's variety of items and for the way it seems to bring the community together. People just come OUT for this thing and it's great to take in the hustle and bustle. Of course, having to deal with the hustle and bustle all morning gets a little tiresome and then I start to wish the whole thing would go away. :)\n\nBut this market seems expensive. I have been to other farmers markets in other areas and other states  - and maybe this is just an artifact of living in this area - but this one seems really pricey to me. I'd love to support it more, but truthfully we are not really able to afford the fruit prices. The vegetable prices seem a little more reasonable, but the fruit prices can sometimes boggle the mind. I am always amazed when those frugal tips websites suggest shopping at a farmers market to save money because on the weeks that we have done so, we seem to spend more. \n\nThis leaves me in a quandary. I buy what I can from the market and then find the other products elsewhere. I wish I could do more to support the products and the farmers, but it is out of our budget. I realize that they have to turn a profit, but sometimes I wonder if there is a bit of price inflation because of the assumption that all the people in Oak Park are pretty well off in terms of disposable income. As I said, I've been to less expensive farmers markets where I really was able to save money. \n\nThe doughnuts? Very good. They have the taste and feel of being homemade and that is a nice change of pace from a chain store doughnut.",
            "author": "Stephanie S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-02-01",
            "description": "Not the best selection, but excellent quality!  As with any farmers' market, the selection differs week-to-week, but overall, we've made some great finds here.  Really wonderful and fresh veggies and even a local, organic meat purveyor!  Lots of flowers and we've even seen local wine and cheese makers here from time to time.  Not huge, and not a ton of variety (we do miss the farmers' market in Union Square in NYC), but the smell of the doughnuts in the air is heavenly!  Since everyone else seems to have opined about the doughnuts, I feel obligated, being a bit of a donuttophile myself-- not my favorite style (cake), but a very good representation of the breed.  Overall, the smell would get higher marks from me than the taste, but I'm more of a glazed fan any day.",
            "author": "Kevin G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-09-05",
            "description": "fantastic farmer's market.  easily accessible from the city by bus or el.  the donuts ARE amazing, freshly made on site & delicious.  warm, tender and sweet on the inside and lightly crispy on the outside.  The juxtaposition of a huge array of fresh fruits and vegetables and DONUTS in the morning on a Saturday is amusing -- shall I munch on a honey crisp or a white carrot OR a cinnamon donut?  the donut usually wins.   the sweet corn is overflowing at the front table, but it's worth elbowing your way in for a spot to pick out your choice cobs.  all the fruits and vegetables here are locally grown and picked recently.  You can find some unique and interesting items that you may have never seen before -- odd varieties of onions, radishes, carrots, apples, etc. etc. and samples abound.  In addition there are many premade items (salsas, pickled things, sauces, dips, marinades), dairy, meats, juices, plants and flowers available.    there's an aging hippy jammy banjo-y band that plays near the donut line.  I'm not into it but it can be interesting for the kids, I guess.",
            "author": "L N."
        }
    ],
    "priceRange": "$$",
    "name": "Oak Park Farmers Market",
    "address": {
        "addressLocality": "Oak Park",
        "addressRegion": "IL",
        "streetAddress": "460 Lake St",
        "postalCode": "60302",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/hl6cDs0t1cgJpdCZyHWJdA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17083585780"
}