{
    "aggregateRating": {
        "reviewCount": 20,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-02",
            "description": "This is the Schaumburg farmers market which is tiny but mighty.\n\nThe official location is by trickster gallery but strictly speaking it tends to flow around and past that space. Generally speaking there is tons of non gallery parking available. Pretty much anywhere you'd use to park at the nearby library or that parking lot where Dominick's used to be.\n\nThis is one of the smaller farmers markets around with less then a half dozen food stalls and perhaps a dozen booths selling food. Having said that you can get everything a typical household will need grocery wise as there will be local food crafters-hummus, cheese, bakers,  local jams and oils along with meat and vegetable stalls. The meat truck is not a rancher-but he does deal directly on  weekly basis with the farmer/ranchers who provide his goods. Thus only one step removed from the source and he is very knowledgeable about the stuff he sells. One of the baked goods suppliers is an abbey which means you will be buying from nuns. Say what you want about nuns but they have a single minded steadfast approach to old school styles of preparing foods. Their old world rye is a masterpiece of baking, as are some of the french pastries(the abbess was Belgian originally. Her family ran a bakery back home. She knows what she is doing.)\n\nThere is upon occasion unremarkable local music and there can be booths about the local gardening club, the library association,  the Schaumburg Park District and other local service type things. \n\nGenerally speaking even though this is not an extensive farmers market, it is an extraordinarily wonderful  source of high quality super tasty food items.",
            "author": "Steven W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-08-18",
            "description": "Although there still seems to be some empty and abandoned places at this site from when this was originally built,  there are amenities here make it a good local destination for all.\n\nThe Friday Farmers Market is one of my favorite markets in the NW burbs. Strong anchors here, like Schaumburg Township District Library, Oberweis dairy, Bonefish restaurant and Trickster Gallery make this area unique and inviting. \n\nI've been here to walk our dogs, listen to a concert and even take photos on the well-groomed, scenic area around the pond.\n\nThis was once a hot scene when the Pokemon craze was in full swing and you could find people of all ages walking around while glaring at their mobile devices.\n\nAlthough I wish there were more dining and activitie to choose from here, it is still a nice place to come for a brisk walk, even into the late Fall and Winter months.\n\nAlways plenty of close parking (for cars or bikes) available here too.",
            "author": "Mel C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-06-19",
            "description": "This is a small but nice farmer's market.  I'm very sad to see that the french man who sold olives, pita and dips is not there this year.  That was my main reason for going.  His blue cheese stuffed olives and pita were AMAZING!  Everything is pricey but typical for a farmer's market.  When available, the heirloom tomatoes are terrific (sold at the largest veggie stand).  The crepery is WAY overpriced.  The fresh lemonade is fantastic as well.  I also love the giardinera & muffuletta mix from The Pickle Guy.",
            "author": "Patti S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-27",
            "description": "Schaumburg has the best Farmer's Market I've seen in the Chicago suburbs. Located in the Trickster Gallery parking lot, the place is always packed with a variety of vendors: veggies, fruit, cheese, breads, cakes, eggs, meat, spices, sauces, honey, coffee, a vegan breakfast food stand, and more. Gotta Bee Crepes usually makes an appearance (with a very long line for amazing, fresh crepes) and the knife sharpener is fun to watch. Most most other markets just have Tupperware tables and artisan craft booths -- you won't find that here. It's a real market with real food. I can fill my kitchen with the goods available here, and I often did. \n\nThe only bummer is that the market is open on Friday mornings, which means people who work weekday jobs are unable to attend. Fortunately for me, that wasn't an issue. Whew!",
            "author": "Laura N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-14",
            "description": "Great small town touch!  Relaxing time, with great options.  Outstanding blueberries,  cherry butters,  freshmade flavored hibiscus tea, made to order crepes,  French pastries,  organic meats,  etc.  Highly recommend!",
            "author": "Tiffany H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-08-08",
            "description": "I love this place. It's no Portland or Boulder, it's a small parking lot in the Chicago suburbs, but set your expectations right and you'll be happy you came.\n\nHighlights:\nFresh fruit and vegg\nPickles (OMG HI!$*^#$)\nBruschetta (rumor is, there's a second guy who sells Bruschetta now, and one is slightly better and cheaper than the other -- info provided by the Bruschetta Expert aka my mum)\nFlowers (so pretty, but they'd die sitting in my car for hours before I go home)\n\n\nKeep walking:\nCrepes -- they're crayp. And overpriced. Overpriced crap? No, thanks.\n\n\nI wasn't sure where to file the dog treat stand. The products are super cute, but none of our three dogs would touch them after a brief sniff. For how much they cost (Yelp: $$$$), that hurt.\n\nParking is by Bonefish Grill, and I also love seeing how many people come up to Bonefish's doors and try to open them to have lunch.. haha. Never fails to make me smile inside.",
            "author": "Nic Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-02-25",
            "description": "This little piggy really enjoys Schaumburg's farmer's market. There's a mix of farmers with fresh produce, flowers, cheese, olives, meats/eggs, bakeries, and specialty canned fruits and honey. Additionally, there are numerous stands that sell food made to order at the market. A lot of characters there that, if they're not too busy, are fun to engage. Oh, and the French nuns from the Abbey are there with their baked goods too! It's an experience, not just a great place to get farm fresh produce and artisanal foods. What more could anyone ask for?",
            "author": "Tasty K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-09-11",
            "description": "I've been to the Farmer's Market a few times now. It's a bit strange that it's on Friday mornings which I'm sure is a bit inconvenient to most Schaumburg residents. However, for me, it's right on my way to tanning on Fridays during my lunch hour. :)\n\nThey have some great crepes for about $7 at one stand with a super outgoing and friendly fellow manning the stand. Most stands have very friendly workers willing to tell you all about their products. I picked up some cheese curds and have to note they weren't the best I've ever had. Wah wah. I'm a huge cheese fan and cheese curds are a weakness for me. The ones sold here just didn't do it for me. The farmer's market has a good variety of stands but not as vast a selection as most other markets I've been to.\n\nThe parking lot can be a bit crazy but I never have an issue finding a spot. It's located in the Trickster Gallery parking lot.",
            "author": "Sarah S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-05-06",
            "description": "Sad to hear that Tony the Knife Sharpener Guy has passed away! Such a sweet man. Tony you will b missed! \nFrom the Daly Herald 4/16/16\nDid you know that Tony the knife sharpener man from Schaumburg Farmer's Market passed away? \nANTONIO \"TONY\" DURANTE\nSCHAUMBURG - Antonio \"Tony\" Durante, 71, of Schaumburg for 25 years. Born in Pietracupa (Campobasso) Italy, he peacefully passed away at his home on April 13, with his family by his side. Tony was the owner of Tony's Sharpening Service. He was the beloved husband of Christine F. (nee Bavolek) for 22 years; loving father of Zara Durante (Derek Maass), Laura (Mark) Kojak, and Bernardo (Angela) Durante; devoted brother of Maria (Ralph), the late Domenico, Pasqualino, Armando, and Giulio; dear grandfather of Tina (Michael) Consentino, Nicky Rogers, Julian Maass, Allison, Lizza, Caden, Lexi Kojak, and Massimo Durante; and cherished great-grandfather of Mia. A memorial service will be held on May 21, at 9:30 a.m. at Church of the Holy Spirit, 1451 Bode Rd., Schaumburg. For information, 847-640-0566 or grovememorialchapel.com.",
            "author": "Eileen M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-24",
            "description": "Five stars. Good food. There's more to eat there now. No option for people on Link. I try to go every Friday and it is one of the best things in Schaumburg.",
            "author": "John H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-21",
            "description": "I've been going to this farmers market for a few years now. It's a highlight of my Fridays, because it's the closest market that Nichols Farm & Orchard attends. Love, love, LOVE going to their booth and finding all sorts of things you don't find anywhere else. They grow a wide variety of heirloom tomatoes, apples, and pears (obviously available seasonally) that you can't find anywhere else. Other fruits and vegetables, too. All their produce is top quality as well. Last year, there were these heirloom French cantaloupes that were seriously some of the most ridiculously delicious fruit ever. I bought three -- one for me, one for the people at work, and one for a friend who was having a party. Everyone raved about them. \n\nThere's other great stuff about this market, too -- Tony's Knife Sharpening Service is fantastic, and I love watching the man sharpen my knives. If you have lawnmower blades, he'll sharpen those, too -- but he has to take them back to the shop with him so he can balance them, so you'll have to wait a week to get them back. Plan ahead with your mowing!\n\nThere are pickles, cheeses, local meat, poultry, and eggs, honey -- all sorts of good things to be found at this small market. What I really love is that it's not one of those markets that has all sorts of crafts and Tupperware and such, like many \"farmers markets\" have become. Nothing against crafts and Tupperware, but that's not why I go to a farmers market, you know? The Schaumburg Farmers Market is the real deal, and I'm happy I live so close to it.",
            "author": "Janni V."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-09-12",
            "description": "I stumbled upon this market by accident on a lunch break, but the variety of vendors has brought me back a few more times.  You can find everything here, such as fresh fruits & produce, meats, cheese, pastries, olives, organic dog treats, and even knife sharpening.\n\nIf you're hungry, there's a stand serving made-to-order sweet and savory crepes.  I've tried the Hawaiian (ham, cheese, pinneapple, bbq sauce) and Nutella crepes - both were tasty.  There's also stands selling snow cones, cookies, and pretzels, so not a bad place to shop and eat.\n\nThe market's located right in front of Bonefish Grill and parking can get a bit crowded, but it's not that big of a deal.",
            "author": "Phill C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-13",
            "description": "First time here and it was a blast.  I was overwhelmed by the amount of fruits, veggies, and fresh baked goods.  \n\nAll of the vendors are very helpful and friendly.  There are a lot of samples which is great because you get to try it first and this led to me buying some salsa and bread.  \n\nMake sure you stop by Gotta Bee Crepes for an amazing treat!\n\nThere is some great coffee available right in the farmer's market for a little pick me up.\n\nI just wish it happened more than once a week!",
            "author": "Joe P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-08-13",
            "description": "Two Words: Nichol's Farm. \n\nThe bf and I pick up our weekly CSA from Nichol's at the Schaumburg Farmers Market every Friday. Their booth has the biggest and freshest selection of fruits and veggies I've seen. The variety is endless and I always leave with more than just our CSA box. I could literally rave about Nichol's for pages and pages. But I won't. Let's just say this, if restaurants like Publican and Girl & the Goat trust in them - so do I.\n\nThe rest of the vendors are equally as great. Each week I pick up a 5 pound box of the best blueberries around.  And yes, I kill the box within a week. I'm a blueberry-aholic. They also have a great mushroom farmer who brings several varieties of mushrooms each week. Her booth is also a regular stop. The olive booth is also a must stop for fresh olives and capers. \n\nThe farmer's market offers a great variety of fresh veggies, meats, eggs, flowers, mushrooms, fruit, and homemade jams, jellies, dressings, pickles, and teas.\n\nThe downfall is that it's only open on Friday mornings, which sucks for us 9-5ers. So unfortunately I only get to go on my days off. However, if you work in the nearby area and can break away from work for a few minutes, it's definitely worth heading to the Schaumburg Farmer's Market to pick up some local, fresh, and tasty goods.",
            "author": "Cristie F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-09-19",
            "description": "Great little Farmers Market on Friday mornings \n\nso I need to go deposit some money at Wells Fargo (my bank) and I see that there is a farmers market going on in the lot next door, so after doing my banking I walk over to see what I can find\n\nand what a land mind of goodies all kinds of potatoes and around 20 different types of Apples, and a guy with sweet corn the last weekend for that he said (for this year) honey and a guy that will sharpen your dull kitchen knifes, an scissors, plus my coworker called to let me know my truck was loaded early if I wanted to get a early start on the night I could, so I told her I was at the market and she asked for some Garlic so I got her a couple heads \n\nI am gonna try to go every Friday morning till they end for the winter near the end of September",
            "author": "Robert S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-06-30",
            "description": "Summer Friday mornings are the best when you start out your day at the Farmer's Market. \n\nI have driven past this Farmer's Market every Friday for the last 3 years, not stopping once, and not remembering until Saturday morning that they are even there. Its set in off the South-West corner of Roselle and Schaumburg Road. Head for Bonefish and you will find it. In fact, I parked in Bonefish Grills' parking lot last Friday. \n\nI wandered in here with too much cash on me burning a hole in my pocket!! I headed right for the \"Pasta by Sue\" tent. Pricing of their products is confusing and a little misleading, so beware. Ask before you pick something up. I was alone, it was 7:30 am, and I didn't want to be rude...I picked up two bags of Raspberry pasta out of a tub marked \"2\".  Thinking these bags were \"2\" dollars each, I walked up to pay. I said \"So, it's $4?\" He said, \"No! those bags are $5 each.\" Had I but known, I would have only picked up one. I didn't want to be rude, so I paid my ten bucks for two 8oz packages of pasta. My grandmother would kill me if she knew I just spent $10 on one frickin' pound of pasta! :)\n\nI saw a gentleman walk away from another tent with 2 large grocery bags of food and a smile on his face---whaddya know? It's the foccacia guy!! Of course, I wandered in here. [Can you tell I'm Italian yet?] \"Here, you have to smell this!\" (as he shoves the fresh foccacia to your face!)\nThe large foccacia's are $10 each and seeing as I just spent ten bucks at the pasta tent, I graciously asked how much the small foccacias were. $3 each! Excellent. I'll take two. He also had some gorgeous lemon cookies I will be back to try soon.\n\nI didn't really see any produce that I wanted. I just don't think it's in season yet. A lot of plants, condiments, jellies and jams. There was a cookie tent. Jaci's cookies. The cookies look fantastic. I bought 3 for $6.00. A good deal, for this place, but the cookies really weren't anything special. Damn it!!! I really wanted to enjoy these cookies. I as a baker, myself, I was mighty disappointed.  They were fine. A bit overpriced if you ask me. \n\nThey even had a tent of people making crepes!!! See, had I not already eaten breakfast, I may have ventured to try that. \n\nAs I was walking out, I found the pita guy!!! I had just had some of his pitas and hummus last weekend at a friends house. She had picked up some of him pitas at the Wheaton farmer's market. I was out of the house a lot last weekend and wasn't able to get my hands on my pitas until Monday morning. There was mold spores growing on the pitas :*( I guess this is what happens when there is no preservatives. I didn't even get to eat one! Grrrrr. $3 in the garbage. But at least it was only three dollars.\n\nAgain, trying to leave, the guy with popcorn samples \"holds a gun to my head\" and insists I sample his popcorn. Well, like a sucker, I buy a bag for $6.00. It was good, but not $6.00 good. \n\nThis a lot like a craft fair or vendor fair with some produce.\n\nMan, I'm a sucker for the Farmer's Market. I look forward to attending again soon when the fruits and veggies I want are more in season.",
            "author": "Catherine P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-07-27",
            "description": "*Photo shot\n\nI haven't been to many farmer's markets in Chicagoland to make a reasonable assessment, but for those wondering if this one held on Fridays from 7 to 1, June 15 to Oct. 12, 2007, at the Olde Schaumburg Center (near the beautiful Arts & Craft-style Schaumburg library) is worth it, then I say \"yes\".\n\nI counted about 10 - 12 booths, mostly veges. I'm not sure what the criteria is to sell at the market -- must they be pesticide-free? Anyway, I bought a nice raspberry-filled paczki and lemon bars from Delightful Pastries, based out of W. Lawrence Ave in Chicago. Spent about 90 cents on 2 ears of fresh corn, and 40 cents on a small handful of yellow beans. And I was so enamored by the multi-colored potatoes from Nichols market (the biggest produce booth) that I had to buy a couple of all-blue and blood-red potatoes from them. It helps that the guy is awfully ruggedly cute. \n\nI would certainly return to scout out more produce, and maybe even get a few knives sharpened. Yes, there's even a dude on some antique manual sharpening machine there.",
            "author": "Ling L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-16",
            "description": "I have recently starting to go to this farmer's market and love going there when I can.  Unfortunately, it is only on Fridays and I have to work most Fridays.  But, when I do have Friday off, I try to get there.  There are stands for:\n  That Pickle Guy\n  veggies - multiple stands\n  tea\n  dog treats\n  meat\n  cherry products\n  crepes\n  apples/misc fruit\n  berries\n  kninfe sharpening\n  olives/pita\n  cheese\n  and more I can't remember\n\nMy main stop is That Pickle Guy - yeah, that's the name of business.  I love the spicy pickles.  Just a little bit of heat that just about anyone can handle.  The garlic pickles are good too.  My next trip will include a jar of the hot pickles to see what those are like.\n\nThe end of the year will get you the best deals, but also the least selection.  I got 10 lbs of potatoes, 5 lbs red, 5 lbs of yukons for $5.  The jars of pickles are a little more prices at $7/jar or 2 jars for $12, but I think they are much better than the big name brands.\n\nJust bummed out that there are only 2 weeks left in this season, but I think I'll be able to get to both!  These 2 weeks are considered the \"extended season\" so I'm not sure what that means as far as participation.  There may not be many stands there, but I'll find out this coming Friday!",
            "author": "John M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-04",
            "description": "Schaumburg farmer's market has some really great farmers. I absolutely love the salsa stand. Love their hot salsa and their mango salsa, mixing them together is divine. All the different farm stands are also great. I bought my daughter a butter croissant at one of the bread stands and it was so delicious and buttery (wish I remembered the name!)",
            "author": "Lois C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-31",
            "description": "This was our first visit and all the booths were great. We do have to give special mention to TONY'S SHARPENING SERVICE and TAILWAGGER'S PET TREATS.  My kitchen chef's knife had several years of hard use.  Regular steeling has helped it, but it now needed serious, professional help to bring it back to life.  With good sharpening services a dying breed, we had visited another Farmer's Market a few weeks ago, but the sharpener service that was there had left early in the season.  Fortunately, we kept the knife safely wrapped in the car trunk. We stopped at the Schaumburg Farmer's Market on a family trip and just inside the entrance, lo and behold, was Tony's Sharpening Service.  A quick dash to the car and back, and 20 minutes later, we had a nicely sharpened kitchen knife.  He even \"retipped\" the knife at no extra charge - (the very tip had been knicked off a few years ago.)  I gave it the \"paper slice\" test and it passed with flying colors.\nOur dog was similarly impressed with her beef and peanut butter treats from Tailwaggers, right next to Tony's booth at the Market.  She was one happy camper as she ate her way through these special treats. \nOur thanks for having these and all the other fine vendors- keep up the great work!",
            "author": "Ross V."
        }
    ],
    "priceRange": "$$",
    "name": "Olde Schaumburg Centre Farmers Market",
    "address": {
        "addressLocality": "Schaumburg",
        "addressRegion": "IL",
        "streetAddress": "190 S Roselle Rd",
        "postalCode": "60193",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IMuCWz7MOniJKb5HLrXJyg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}