{
    "aggregateRating": {
        "reviewCount": 11,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-22",
            "description": "Good mix of sellers, dog-friendly.\n\nIt's in the Palatine Metra station parking lot, free weekend parking across the tracks, near the park with a gazebo.\n\nDowntown Palatine has some nice stuff within walking distance of the market, I could see myself taking some guests to Palatine on the Metra, wandering around for a bit, then take the train back with a few drinks in us \n\nI'll be back!",
            "author": "Marie S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-23",
            "description": "Small but nice selection of vendors selling quality products. They have a taco and tamale stand this year. The food is very good. I typically pick up a few organic chicken tamales for home. The grilled cheese sandwich from Katic Breads is also outstanding. Easy parking at the Palatine train station.  I like to eat healthy and organic when possible -  I frequent Katic Breads (beware this bread is sinfully good you will become addicted), Arlington Crest Farms, Hasselman Farm but all of the vendors are good and sell quality products.",
            "author": "Nancy A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-10-29",
            "description": "You have to have a mindset that the Palatine Farmers market is a small FM serving mainly Palatine/NW suburban peeps.  I admit I was disappointed at the size the 1st time I came here; but, my previous experiences with a FM was during my college years at UW Madison where I frequented the Dane County FM which is the largest in the US.\n\nThe Palatine FM has something for everyone! Artesian breads, cheeses (try the blue cheese/brie combo!), several local and nearby states produce vendors, coffee (not just the Starbucks nearby), dog treats, bakeries, spices, jarred pickled treats, grass fed meats, eggs, flowers, popcorn, knife sharpening guy/girl, nut free granola, mini donuts (my kids always love this stand!), arts/crafts and even a musician.\n\nThe FM is located by the Palatine Metra station; there is always plenty of parking nearby.  Since it's a smaller FM, it doesn't take long to go through everything, so it's nice to spend that extra time exploring downtown Palatine.  Lots of great places to eat and check out the small shops.  It's always great to support local!!",
            "author": "Carla M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-05-18",
            "description": "If you're already in the area, the Palatine Farmers Market is a decent place to spend 5-7 minutes perusing the stands, but it's not something I'd say you should drive out of your way for. \n\nIt deserves mention that this market has come a long way since my first few visits in 2012 where they had maybe 5 vendors and one of them were girl scouts that weren't selling girl scout cookies. Kinda weird. \n\nNowadays they have more vendors and variety - they even had a guy singing and playing guitar here last weekend that really made it seem like more of an event. \n\nThe presentation at most of tables isn't much to write home about. In fact, a lot of the tents just look like they're storing an extra folding table - not really having any goods or services to sell, but there are a quite a few that spice up Saturday mornings in downtown Palatine. \n\nI really like the bread vendors and the spice vendors and I'm always tempted to purchase plants and herbs to grow even though I know the reality of it would be me just buying them to watch them die. \n\nThere's one vendor that sells a variety of meats that's usually pretty hoppin' and I think the knife sharpening/survival bracelet making guy is pretty popular as well. \n\nAgain, not really worth going out of your way for, but there's enough stuff happening in downtown Palatine on any given Saturday morning into afternoon that you could make a half day out of coming here.",
            "author": "Candice G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-07",
            "description": "This market is tucked in the parking lot of the Palatine Metra Station with convenient free parking. What it lacks in size, it makes up with quality vendors. \n\nMy fiance and I get up early ever Saturday to not miss the Farm Fresh Eggs from Hasselmann Family Farms. Definitely try their sausages or bacon. (Or anything else from them.) We are excited about their pasture raised turkeys for this year's Thanksgiving dinner!  \n\nWe had every knife in our kitchen sharpened by Knife Sharpener Kris Southard. He even made a house call for our remaining blades and scissors. Excellent work.\n\nWe just discovered High Rise Bakery's Artisan Garlic Loaf - it hardly made it 2 days before we finished it all. The gal asked if we like garlic as it had whole cloves inside - she wasn't kidding! \n\nFinish the trip off with a look at La Spiceria and the cheese booth (so help me I cannot say no to the raspberry ale cheddar).\n\nTHE PRODUCE - top notch: heirloom varieties, the sweetest cantaloupe, radishes, garlic, kale, berries and fruits, herbs, greens, peppers, potatoes, onions, mushrooms, on and on. Did I mention heirloom varieties of carrots, tomatoes, and more? So amazing for yourself or entertaining guests. CSA's are available early in the season and for the following year at the end.\n\nVery relaxed environment and extremely friendly and helpful vendors. Great for those looking for local organic produce as well as families with small children and those who want to bring their dog. \n\nEnjoy!",
            "author": "Susan R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-05-02",
            "description": "A nice farmers market with lots of quality vendors. I would give it 5 stars but it's a little smaller than I would like. There's something for everyone though and having Starbucks nearby and live music makes for a relaxing, fun outdoor shopping experience.",
            "author": "Kelly B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-12",
            "description": "One of the better Farmers Markets in the NW Burbs.  There is a lady here that sells the most phenomenal foccacia bread and almond croissants.  They have a wide variety of produce from several vendors... spinach, rhubarb, green beans, mushrooms..you name it, if it's in season, they will have it!  They also have vendors that sell jams, fresh noodles, peppers, dog treats, fresh donuts, flowers, knick knacks ... seriously there is something here for everyone!  AND there is a guy that sharpens knives here for a decent price!  I got 4 knives and a pair of scissors sharpened for less than 25, plus a free sharpening for one knife for future use.  My knives are insanely sharp now.  There is always live music, plenty of parking, and a bathroom at the train station about 5 steps up from a porta potty.  Plus a Starbucks for the caffeine/tea needy.  Seriously you can't go wrong here on a Saturday morning especially with ample street parking.  I'll see you there!!",
            "author": "Robyn C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-12",
            "description": "The market has it all, or almost all anyway! \nThere is live music, plenty of parking. There is quite a few farmers that come from Indiana, Michigan, and Wisconsin. There are booths with Pastas, Pickles, Teas, Eggs and Bacon, Dog Treats, Ceramics, Breads, and freshly made mini donuts!! \nThe Market is Dog friendly and some shoppers even bring cats! \nIf you like shopping and helping your community this is the place to visit!",
            "author": "Sofia M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-12-22",
            "description": "I love the farmers market....love all thr fresh produce....i just wish it was warm all year round so we could have it all year round!",
            "author": "Ashley W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-29",
            "description": "I'm a full fledged supporter of the local growers and business that are fixtures at Farmer's Market in Palatine. My family and I will miss the Farmer's Market when it shuts down for the season.",
            "author": "Shannon S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-22",
            "description": "The Palatine French Farmer's Market is on Saturday mornings near the train station.   I like that I can get sustainably farmed buffalo meat and produce.   I've been picking up my herbs from there in the spring.  The nut and fruit loaded pumpernickel bread from High Rise Bakery in Chicago has become a staple.  And there's music!  If I'm home on a Saturday, I'm there!",
            "author": "Danielle K."
        }
    ],
    "priceRange": "$",
    "name": "Palatine Farmers Market",
    "address": {
        "addressLocality": "Palatine",
        "addressRegion": "IL",
        "streetAddress": "Palatine Metra Station\nSmith St and Wood St",
        "postalCode": "60067",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1mCajeVqc6AwL5YBIlm6VA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}