{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-19",
            "description": "A family farm with very tasty produce, fresh eggs, and great prices. \n\nJust 3 miles west of Route 12 on Route 173. They're open 7 days a week 8:30am to 6pm.",
            "author": "Holly J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-02-07",
            "description": "Run by Myra and John - couldn't find two nicer people who run such a great little operation.  We get farm fresh milk there year-round and purchase fresh produce in the summer months.  Also purchased this year's free-range turkey for Thanksgiving - best turkey ever! So stop by come springtime and find out what they've got!",
            "author": "Wen D K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-23",
            "description": "The best family farm around.  Great flowers, produce, eggs, and decorative gourds and pumpkins for fall.  It is always fun to visit the farm animals as well.  Myra and John are always super helpful and it is nice to see where your produce is coming from.  Highly recommend!",
            "author": "Lisa O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-10",
            "description": "Go to Patyk farms if you want the whole farm experience.  They have a wide variety of great produce to choose from at their very own market.  The best experience was that I could actually pick my own tomatoes.  Bring your children with so they can visit with the cats, chickens, turkeys and goats.  Overall, I highly recommend making the trip out to Patyk Farms in Richmond, IL.  You won't be disappointed.",
            "author": "Janet C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-09-15",
            "description": "Wonderful family farm with great variety of produce and eggs.  You may want to call ahead to order some eggs because their eggs are very popular.  Very fair prices.  Highly recommend!",
            "author": "D B."
        }
    ],
    "priceRange": "$",
    "name": "Patyk Farms",
    "address": {
        "addressLocality": "Richmond",
        "addressRegion": "IL",
        "streetAddress": "8519 E Illinois Rte 173",
        "postalCode": "60071",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/fhzs2NOukt5v3tTsr4spjA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18156484065"
}