{
    "aggregateRating": {
        "reviewCount": 20,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-27",
            "description": "I live in Pilsen, so a small, local market I can reach easily and browse around is exactly what I was looking for. Reasonably priced produce (best rainbow chard I've ever seen/eaten from here for only $2 a bunch!), and several local artisan booths as well - cheese, tamales, eggs/meat, honey, jams, BBQ/hot sauces, jewelry, breads, etc. Really love the lady selling the lemon curd this summer, that stuff is excellent on English muffins! \n\nThere are usually some community groups or businesses there as well - saw a dog groomer once, the Go Pilsen Initiative, local music, and so on. I visited several times this summer and always found something to enjoy. Yesterday (10/26) was the last outdoor market for the season, and there was a bluegrass band playing in the morning while kids painted pumpkins at another booth. It may not be worth a long haul from across the city, but if you're in the area I think it adds something very cool to the neighborhood vibe.",
            "author": "Rachel R."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-07-10",
            "description": "Do not waste your time. Worst farmers market ever. There are 11 tents and only 3 had produce. The rest are crafts and jewelry.The double coupon for LINK is not available here. Since the prices are high that fact was very important to me. I was disappointed. I won't return.",
            "author": "Marla S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-08",
            "description": "Agreed, it's a small Farmer's Market but still worth a visit.  I always feel great about supporting local farmers and merchants and the bonus is I get good treats to eat.  Today we stopped there after grabbing some coffee on 18th and Carpenter ;-).  \n\nWe picked up some juicy tomatoes, corn, onions, grape tomatoes, potatoes and garlic.  I also grabbed some chicken and mole and ground beef and potatoes empanadas on the way out for our lunch.  We reheated them on the panini grill at lunch time. I also scored some fun peach jam.  \n\nCan't wait to go back next week and try the fresh bread, pastries,  vegetarian tamales and tarts.  I figure we will take our own \"carry out\" bags to do good for the environment and take a blanket with so we can turn our Farmer's Market walk into a Sunday picnic. \n\nFarmer's Market ends Oct. 28 for 2013.  I'm sad I didn't start going sooner but I plan on grabbing some treats from now til then.",
            "author": "Claudia M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-10-28",
            "description": "Now Yelpers, listen up, do you SUFFER from Hayfever like I do??\nHere's a secret to save you money and make you less miserable:\n\nBuy local honey at this market (a bottle is $10--way cheaper than OTC Zertec or Claritin) and eat a tablespoon a day.  Before you know it, your allergies will be gone.  Why?!  Because the bees roam around the city and pollinate from the same plants that give your that runny nose and those itchy eyes.  Think of it as a painless immunization.  The beekeeper has her beehives right behind at her Carpenter Street house.  If you really get into it, you can work a deal with the caring beekeeper to purchase a huge bucket for several months.  And the honey is BEE-LICIOUS! (yes, that was lame).\n\nMore Good News: \nGosh, what a cute cultural market!  The salespeople are so sweet and friendly.  The love for what they specialize in or do shines through in their smiles.  The market is like none of the others in the city due to its Latin American cultural roots and flavors.\n\nThey have private, original art for sale (meet the artisans themselves), fresh vegetables, breakfast items, coffee/tea/mate, delicious-looking pastries, dog treats, and my favorite...local honey products.\n\nThey even have a great looking website (listed above).\n\nThe Bad News: \nWhile it is VERY small (10 tents possibly), they have a great variety of local products.\n\nBring cash! :)\n\nThe VERY Bad News:\nYou'll have to wait until next year ;(.  The market only runs (well this past year) on Sundays from July 27th until October 26th 9 am to 2 pm.\n----\nFeatured in the Weekly Yelp-Chicago \"Farmers Market Almanac\" on June 2, 2009: http://www.yelp.com/weekly?editorial_id=W8Z6vofGex0KswvVq8Uxhw",
            "author": "Richie D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-17",
            "description": "A small market but it really makes a Sunday afternoon very pleasant,  if your just lounging around the house and don't want to drive anywhere to get local organic homemade food and pastries.  We usually get the quiche from Beurrage Bakery, and homemade Chili pepper jam with fresh bread.  They even have a little band that plays every now and then.",
            "author": "T T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-27",
            "description": "All of the reviews complain that it's small, well it is.  But It's a solid market and I'm very happy with what's available.  The botanic gardens have a great stand with the most delicious sweet chard and kale that money can buy, for 2/3 of the price that you pay at whole foods.  The eggs that you buy on Sunday were laid on Thursday or Friday, and there is a rather decent selection of cheeses from grass fed animals as well.  Great tamales at the tamale stand too.  And wheatgrass shots!",
            "author": "Christina P."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-08-08",
            "description": "A cute farmers market if you are in the area.  I wouldn't make a special trip to this market if not in the area though.  It is very small (like 5 booths).  I thought the prices were pretty reasonable for a Chicago farmers.  In the end, I really wanted to like this market, but it did not succeed.  Hopefully, it will continue to grow.",
            "author": "Christina E."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-06-13",
            "description": "It was a bit smaller than I expected and there wasn't much variety but I still snagged some good items. To be fair I went  about an hour before closing so I don't know if there were more vendors before I arrived.",
            "author": "Nicole H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-22",
            "description": "Small market, but worth the trip. They have a little bit of everything and you won't be fighting for things like eggs. Seriously, I love larger markets too, but they sell out of eggs in a matter of minutes! This market is small and quiet and just what I need.",
            "author": "Bea M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-26",
            "description": "This is not a huge market nor particularly cheap, but they have venders selling fresh fruits, jams, and tamales and other stuff alongside tables with used books, DVDs, and key chains. Sometimes I wish it were a little more packed with people so it didn't feel like every vendor was watching anxiously as I round the parking lot checking others out. But it does kinda' feel like it's my own market, like I'm a king with everyone waiting to serve me ;) And luckily the booths are run by super nice people so I always leave with goodies knowing I'll be back too. Not sure if I would make trips from across town for such a market, but if you're like me and live in the hood, it's well worth walking out your back door in pajamas to pickup Sunday morning brunch items and a used DVD of [insert 80s movie here].",
            "author": "M. N."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-08-08",
            "description": "This is by no means a bad review.  Being a young market, not even 3 years old, it's very grassroots at this point.  You'll see things here that you wouldn't see at a larger market such as used books for sale and people literally selling produce out the back of their truck.  I was surprised to see a vendor selling grass fed beef so I bought some hot dogs, skirt steak, and a chicken.  I also found some very dark honey which made me think of Guiness beer so I had to have some.\n\nI hate to admit this but the variety isn't quite there to convert me as a regular.  I feel great supporting this market in it's early stages but I would love for it to grow into something larger that offers up much more options.  For now, I'll do my best to attend every so often during the warm summer Sundays.",
            "author": "Dusty K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-10-02",
            "description": "The Pilsen Market was launched in July '08 and I am one happy little customer.  Every Sunday brings an assortment of arts and crafts, fresh produce, tasty coffees, and flowers to the Pilsen neighborhood.  I picked up some delicious honey made by a beekeeper that lives down the block.  Soy Organic market is there with delicious teas and local bakers present an assortment of cookies, cakes and breads.  Thinking about it is making me hungry!  You can find a great mix of local businesses and artisans, including a clothing designer and my pal Tiffany, who makes silkscreened tea towels and napkins.  \n\nIt runs every Sunday through October in the bank parking lot at 18th Street and Halsted.  Get there early for the best produce selection and don't forget your reusable bag!",
            "author": "Chella G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-12",
            "description": "I really enjoy going to the farmers market every sunday with my boyfriend and dogs. Although we are in walking distance, there is tons of free street parking. Dogs are welcome and the vendors rock. We really like the amish cheeses, grass fed beef and next week I will probably try apple butter. I wish that it was a little bit bigger because I love being able to support local and small businesses. I think more people should come on out and enjoy the market!",
            "author": "Sarah E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-09",
            "description": "I'm proud of this lil market. Great veggies/fruits, nice folks/organizers, soy tamales, jewelry, and music. pls volunteer if you could, i did last year.  this is just the beginning, they will grow fo sho.",
            "author": "Sophia T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-03-03",
            "description": "As a committee member and vendor, I would like to invite everyone to our 2009 Opening Day on June 14. Visit our new website for more details.\npilsencommunitymarket.org",
            "author": "elsie d."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-06-15",
            "description": "This is a beautiful, wonderful thing to have so close to home. \n\nI bought some honey, cheese, raspberry jam, a variety pack of mushrooms, some green beans and green peppers. Happy to support local folks and super-glad to have this available so conveniently. \n\nLots of folks will give out samples, too. Cheese, fudge, honey, jams, salsas. Yum.",
            "author": "Anne P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-30",
            "description": "We love coming over for the excellent produce. The other vendors have great offerings but the veggie truck in the back is our main shopping destination.",
            "author": "Eric F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-08-16",
            "description": "Yes, I know.  Tiny.  But solid.  There is now a booth selling produce from Michigan as well as one from Illinois.  Michigan is cheaper, but, call me biased, but the IL one has some better produce.  I love the IL tomatoes.  I am permanently turned off of grocery store tomatoes.  Once fall hits, I'm only doing organic tomatoes, as those are the closest ones to IL's awesome ones.  They also have green tomatoes, which I have been hard-pressed to find in Chicago.    The IL peaches are awesome too.  The blueberries from Michigan are a better deal.\n\nSometimes, people who sell vegan baked goods come.  I like the choco bars and the vegan teacakes.  I can't recall the names of the businesses, but there were only two who had any Vegan baked goods, so you'll know them when you see them. The mushroom people have good salsa (but it doesn't taste \"Mexican\").  The Indiana tent had some cheap cilantro, but their cherries were from Washington (WTF?).\n\nOther places come to sell their wares, jewelry and whatnot, but I always come for the produce.  A man selling used books was there for awhile too, which was neat (75% off list price).  It might be a little pricier than Dominicks, Pete's, Cermak Produce, etc, but for certain foods, it's worth it.",
            "author": "Christine H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-09-26",
            "description": "It's a tiny speck, like this...   (   .    )  More please.  Close to home though.  You can do it!  Grow big!",
            "author": "Joe S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-16",
            "description": "I'm so happy there is now a farmers market that I can walk to!  Just a two minute walk and I am greeted with several produce stands as well as a few other food vendors.\n\nI know this is a growing market - if you know vendors, get them to sign up and sell here!  It's a great location!  \n\nI love that the produce is all fresh and in season items. I bought a giant onion today for $1.  I hope that some meat vendors will come out and sell some naturally raised products before summer ends.",
            "author": "James K."
        }
    ],
    "priceRange": "$",
    "name": "Pilsen Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "18TH St And Halsted St",
        "postalCode": "60686",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/_Vo9a30jvIUmoaM2Z778Wg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}