{
    "aggregateRating": {
        "reviewCount": 1,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-02-10",
            "description": "I began my relationship with PrairiErth Farm at the Downtown Bloomington Farmer's Market.  From the start, I could tell that they really care about the food they produce and their customers' well being.  Hans, Katie, and Dave are experienced and well read farmers.  They are what the modern farmer should be...a good steward of the land and not a factory operation.\n\nWhat brought me to PrairiErth Farm was my desire to buy and eat lean, organic, grass-fed beef...which they have and it is awesome.  You can taste the difference in quality compared to the \"big-box\" stores.  I know what is, and more importantly, what is not in the beef that I buy from PrairiErth Farm.  I like to tell people that you can take a drive out to Atlanta and practically meet the cow you're going to eat.\n\nIf you want to save some money in the long run, buying in bulk is the way to go.  We chose to buy a quarter cow to fill our deep freeze and that was a good volume of meat for a family of 2 adults and one toddler.  If you've never done anything like that before (like us), Dave makes the process easy.\n\nI was part of their first Crop Share Association and was very pleased with the selection and quality of the veggies that I received every week.  I'm happy to be back for year two.\n\nThe bottom line: Awesome people, high quality meat and veggies.  I highly recommend them.",
            "author": "Matt S."
        }
    ],
    "priceRange": null,
    "name": "PrairiErth Farm",
    "address": {
        "addressLocality": "Atlanta",
        "addressRegion": "IL",
        "streetAddress": "2047 County Rd 2100th St",
        "postalCode": "61723",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/H2G0kLOvy3Qd9YOHSHbuaA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13098240484"
}