{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-07-25",
            "description": "A few good vendors as far as the fresh produce goes.  However, we would consider this more to be a festival than a farmers' market, or a merger of both.  \n\nOn the plus side:  local farmers, local businesses, live band, kids' activities, on the premises of The Promenade Bolingbrook mall - so plenty of parking plus if you need to shop at the mall you can do both.  Lots of people, which is great!\n\nOn the not negative side:  in our eyes, a farmers' market should promote local, family-owned, small businesses, not huge corporate chains.  We were disappointed to see there were a lot of chain restaurants in their own booths, promoting/serving their food.  Yes, there should be hot food served at the farmers' market, but it should come from local restaurants.  \n\nWe probably won't come back.  We decided to stop in and check it out mostly because we saw the signs coming out of IKEA.  Overall, not a bad experience, but not fabulous either.",
            "author": "Amelie and Dan B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-07-18",
            "description": "Bands and music setup is great for a Thursday night. Bring some chairs and browse all of the amazing food and crafts. Great hot sauce stand and an excellent jelly maker at least this week. I wish it was bigger though.",
            "author": "Grant J."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-06-12",
            "description": "Just got back from it, opening day this year. There were 2 stalls selling veggies, one selling meat and eggs, one selling flower baskets, a few selling home made goods, one selling decent looking bread and Costco and a few other larger companies. The honey vendor had local honey, but also honey from Florida and Pennsylvania.  There was one guy selling French artisan bread. We got one at $5. Cherry tomatoes  were $3.50 and $4 respectively at the two vendors.\n\nThere were around 20ish stalls in all, and I thought a lot of it seemed over priced for what it was. And the choice was small.",
            "author": "Charlotte H."
        }
    ],
    "priceRange": "$$$",
    "name": "Promenade Bolingbrook Farmer’s Market",
    "address": {
        "addressLocality": "Bolingbrook",
        "addressRegion": "IL",
        "streetAddress": "631 E Boughton Rd",
        "postalCode": "60440",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+16302351376"
}