{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-25",
            "description": "Ah summer! The time to get fresh food and shop local! I am extremely surprised that no one has reviewed this farmer's market. It is one of my favorite ones. It is only open one day a week on Wednesdays from 7am-1pm in the downtown Ravinia area. In this market they have a wonderful selection of vendors who sell fresh produce and baked goods. My personal favorites are the French Nuns from the West side of Chicago. They make amazing chocolate croissants and French bread. In addition, I also love the company My Tea Paradise. They sell individual organic teas that make a gallon of ice tea or 15 cups of hot tea. If you love farmer's markets like I do, this is one you must go and check out for yourself.",
            "author": "Cheryl G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-23",
            "description": "Delighted to have a farmers market behind my home but selection is very limited and ready to food is just OK and pricey.\n\nThe Ravinia farmers market is just a few steps from my home, and I love going to it with my family on Wed mornings. However, it is very limited in its selection, and although we typically are disappointed in the pricing, we always get roped into buying something unplanned every week... If it's not cheese, then it's berries, or green leafys, or even crepes for brunch.\n\nWhile the produce is fresh, it isn't any better than whole foods and certainly not in the same league as our organic farm share boxes from Angelic Organics.\n\nThe cheese section is small and the cheddar was just OK - bit on the pricier side too.\n\nThe Magic Crepe stand is fun, with great service but the crepes themselves are just OK. The batter is a little on the bland (safe) side, and the crepes need to be a bit more crispy to be serious eats. The fresh fruit crepes are better than the ham and cheese, but hey do tend to add mediocre quality chocolate or caramel sauces on top that do it a huge disservice.\n\nNeedless to say, since it's my neighborhood farmers market - which I am grateful for - I will continue to patronize it, but carefully and in small quantities :)",
            "author": "AJ K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-25",
            "description": "When it comes to farmer's markets I'm like Goldilocks. Some like Daley and Green City are great but too big...a human ant farm. Some are like Lincoln Square and Muscatine are too small. This one, however, is just right!\n\nCozy, welcoming, never crowded. And with a tidy collection of much needed selections. \n\nDuhviously there's the produce and flowers- the staples of every FM. And those are good. The variety of apples, tomatoes, and potatoes are stupendous. All the other seasonal stuff is the usual jive but the myriad Michigan berries are big and juicy. The flowers though not very plentiful in kinds, are very good quality and priced well. By that competitive for a FM on the NS and most the same price Sonora simple. Some tasty WI cheeses are sold. They also sell fresh and natural dog bones (bones for dogs) of different sizes (alas G is too small for the smallest) so you can get fido a treat.\n\nThe highlights to this reviewer are the the soup and salad guy who only uses super high quality ingredients and employees people in need ( those in transition or differently abled) also the knife and blade sharpening guy! So warm, charming, and great prices. They know their stuff too! \n\nIt's open from 7am to 1pm Wed from spring to fall. Don't be a grumpy old bear and stop on by!",
            "author": "Adriane P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-14",
            "description": "Well, I knew it would be picked over by the time I could make it here, and it was. Regardless it's a cute market with lots of organic finds like...gulp...4 hot dogs for $8! My kids wanted to each pick out a fruit. Unfortunately they wanted apples but there were only Goldens. To a kid, that's just too unusual to try. One of the vendors let them sample a peach. I loved it, but they weren't into it. Tip...now is the time to get your peaches, because they are in season. I ended up with a yummy bunch of beets for $3.50, and I can't wait to throw them in my salad tonight. At this market you get what you pay for. Huge blackberries, tomato varieties, olive oils, beautiful flowers, and a cheese vendor too! I believe if you come at lunch time you can pick up a prepared sandwich, but they were gone when we got there. Sure you can get things cheaper at Whole Foods, but there's something good about supporting your local farmer. My grandfather was one. \n\nTip: Get there early to get the goods!",
            "author": "Angela S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-23",
            "description": "This Farmer's market is small, but has a nice variety of products.  The cheese people have fantastic cheese if you don't mind paying a bit more for cheese.  I'm hooked on the fresh blackberries from Coloma MI.  The croissants that the nuns make are heavenly(Even my children can tell the difference between these and the ones from Costco.).",
            "author": "Ronni G."
        }
    ],
    "priceRange": "$$",
    "name": "Ravinia Farmers Market",
    "address": {
        "addressLocality": "Highland Park",
        "addressRegion": "IL",
        "streetAddress": "Dean Avenue Between Roger Williams Avenue And St Johns Ave\nNils Jensen Park",
        "postalCode": "60035",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0KTWVB53BIRYCMuVHE6xUA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18474325570"
}