{
    "aggregateRating": {
        "reviewCount": 6,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-18",
            "description": "A small family run farm with great customer service.\nI stumbled upon Sahs Farm this afternoon, and I can't wait to stop by again.\nKathy and her family couldn't have been nicer.  While Kathy went and cut some fresh flowers for me, I picked up some garlic, onions, a few spuds and two pie pumpkins.  While I was there, a couple walked up, took a look around and turned to go.  Kathy's husband asked if he could help.  They were looking for green tomatoes.  Kathy's husband took a quick walk to the field, and back he came with some green tomatoes.  It doesn't get much fresher than that.\nIf you are in the Lockport/Homer area, this is the place to go.",
            "author": "Smar S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-01",
            "description": "It does not get more fresh than Sahs Farm.  I never knew that potatoes could taste as good as they do until I started buying from Sahs.  The prices are very reasonable.  Once you start buying from Sahs the food from a grocery store seems like a pale comparison to real food.",
            "author": "Emily G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-30",
            "description": "Stop here! We happened across this place, it's huge family farm/garden, with a wide variety of seasonal vegetables. We live in Chicago, but will make it a point to come back this way just for the fresh food and good conversation.",
            "author": "Antony A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-28",
            "description": "Great small farm! Delicious snap peas garlic scapes etc changes with the season every week",
            "author": "Sophia P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-06",
            "description": "If you are a \"foody\", and  interested in local food or buying from local farmers, this is the real thing.\nA beautifully tended farm tucked away just off of I 355 near Rte 6. The Farmer is a knowledgeable woman, who know her crops, and brings out  a wheelbarrow, bags, and baskets chock full of some of the freshest veggies around. You pick it, she weights it and pops it in a bag, and you are on you way. Shallots, garlic, wax and green beans, tiny little creamer red potatoes, or larger reds, lettuce, what ever is seasonally ripe. The pricing is very reasonable, slightly more than the usually faded and tasteless grocery store selection, but far less than most farmers markets.\nHigh quality fresh and  tasty produce at a very affordable price...this kind of place is what the local foods movement is all about...",
            "author": "claire p."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-11-22",
            "description": "Fresh farm picked vegetables and more.  Each time I've visited the Sahs Farm, Kathy Sahs has been in the fields working and saw us pull up and came over to help us.  She picks everything fresh and she has good prices.  What's better than fresh, local produce, good prices and helpful service.  I think it might be cash only.",
            "author": "Christian D."
        }
    ],
    "priceRange": null,
    "name": "The Sahs Farm",
    "address": {
        "addressLocality": "Homer Glen",
        "addressRegion": "IL",
        "streetAddress": "17729 S Cedar Rd",
        "postalCode": "60491",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+17083010379"
}