{
    "aggregateRating": {
        "reviewCount": 14,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-04",
            "description": "I just happened to stumble upon this CSA while perusing Yelp. I'm so glad I found it!! \n\nFirst of all - home delivery. That is awesome! They deliver to a pretty big area (the father out the more you have to pay for delivery, but it is worth it). I get a nice portion of fresh, organic veggies every Thursday night. Everything is there before I leave for work on Friday morning, so I can put it away. All I have to do it set a cooler outside and the next day it is full!\n\nThe produce is really great. Awesome quality and seasonal. I get something new each week. And it is year-round! In the winter they deliver every other week, but the portions are bigger. They have different portions depending on how many people will be eating it in your household (I get the solo share). They also have different payment plans (monthly, bi-annual, and annual). If you pay bi-annually or annually you get a week or two free. If you are not able to get your share one week, they will donate your share to a shelter in Evanston, which is awesome.\n\nThey also send out a weekly email letting you know what you will be getting, ideas on how to prepare the veggies, a sneak peek of the next week's goodies. \n\nIf you are looking for quality, organic, local veggies, this is the way to go.",
            "author": "Danielle S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2019-02-21",
            "description": "Fabulous veggies, but here's the struggle. We've been getting veggies from the Tomato Mountain Farm for a little over a year now. Veggies were good quality and tasty every single time, deliveries were on time, we've had absolutely no issues with them. Communication was great, proactive and clear, especially when issues would arise. In 2018 the review would be 5 stars, no questions asked. Then, something changed in November / December 2018. Issues with orders started to occur. While veggies are still good, simple things like missing deliveries started happening. One time driver apparently left the box of veggies in front of the business next door to our residential building in downtown Chicago. Look, there is no way you can be confused with addresses, absolutely no way. Tomato Mountain said they'd re-deliver, well that didn't occur even after multiple messages back and forth. Then, again, just this week no delivery. Driver apparently left it at a wrong building. They said they will correct but.. I was sort of going to cook with the stuff this morning. Oh well. I will wait. \n\nWe got both small and medium shares, depending on how many of us were in the household at a time. The small was perfect for the 2 adults; the medium is great for more home cooking for 2 adults + kid or 3 adults, and can also be stretched to 4 adults - but not all of your meals will have these veggies in them then.",
            "author": "Sonja P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-05-16",
            "description": "Echoing others, I love being part of this CSA! While I was disappointed when Door-to-Door Organics stopped their delivery service, I am so glad that I was given the opportunity to find Tomato Mountain. I love Tomato Mountain's philosophy, informative emails, inspiring recipe suggestions, and food/food options. I am a foodie at heart, and Tomato Mountain has further increased my joy in my daily food experience. I highly recommend Tomato Mountain 1000 times over!",
            "author": "Netta G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-03-10",
            "description": "They had a booth at my farmer's market this past summer. I was excited to find a CSA that 1) delivers to the home and 2) offers a Winter subscription, so I signed up. \n\nThe winter subscription has been less than overwhelming. It gets delivered every two weeks, and since the first delivery in January (it's mid-March as I write this), 90% is *the same stuff*.  Every time! A big bag of carrots (like 3 lbs). A jar of homemade tomato sauce. A bag of spinach. A couple times, some frozen cooked squash. Okay, once they added a few turnips, once some roasted peppers. Today's delivery they threw in a jar of jam. But honestly. Enough with the carrots, spinach, and tomato sauce! Jeez! I guess this is why CSAs don't offer winter subscriptions. ;-) \n\nOtherwise they've been fine. They deliver in the middle of the night like Santa Claus, right to my front porch, in a sturdy box, but request that you leave out a cooler so they can reuse the boxes. That's fine, I try to remember to put it out the night before. \n\nAlso they have an optional eggs subscription, which I get. A dozen eggs. They look and taste just like the Organic Valley eggs I get from the grocery store though. I was expecting something similar to the eggs my chicken-raising neighbors sometimes share, a more intensely-flavored egg, with a deep yellow, almost orange yolk. Nope. Just regular eggs.",
            "author": "AM C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-23",
            "description": "I love this CSA! Organic. Home delivery. And I absolutely love that I can add on extra items each week, including stuff from other small farms that they partner with. The veggies are really nicely varied and include a variety of greens. You can tell by the smell and taste that the veggies are freshly harvested. Their customer service and delivery staff is friendly and responsive. I get a Small Share for a 2-person household (vegan/vegetarian), plus I typically add on a couple of extra things every week. And I love that if you're out of town, they will send your box to a foster home that they partner with. I did a lot of comparison shopping and the price with the home delivery is really just a couple of dollars more than other CSAs. Even still, I thought about this for a long time. But I had another CSA before, and in my opinion, the weekly pick up works if it's already on your way. If you have to go too far out of your way, you'll start to resent your CSA. The home delivery makes this easy to incorporate into our busy lives. I love getting produce fresh while it still has all it's nutrients. And I really love giving this money right to the farmers and not to some big grocery chain.",
            "author": "A J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-24",
            "description": "We've been Tomato Mountain members since they restarted their CSA a few years ago and it's always been great.  Way more food than we know what to do with, and it comes right to the house!  The produce is super fresh and varied enough that we don't get tired of anything during the season.  They have a year-round option (which we've been doing since it started) and it keeps us in veggies all through the winter.\n\nOver the years we have suggested them to a number of friends who have signed up, and all of those folks have also been thrilled.",
            "author": "Bill W."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-04-02",
            "description": "I ordered their winter subscription for my husband because he had asked for a smoothie blender for Christmas and I though this would be a great addition to keep him on track.  I realize it is winter subscription so you can't be too picky, but it has been awful.  It really should be called a winter carrot abundance.  Seriously. STOP WITH THE CARROTS!  Please, I'm begging you.  I used to love carrots.  Now I loathe them.  NO ONE can eat that many carrots. No one. Basically I paid a couple hundred dollars for carrots.  \n\nI'll admit the spinach is really good.  Sometimes we get a jar of seriously tin-tasting tomato sauce.  Once we got frozen sweet peppers that were great.  Every now and again we get a beet or a small jar of jam.  But every time, without out fail, 3-4 pounds of whole carrots.  It's insane.  Not even an occasional potato or leek.  No kale or brussel spouts.  Just carrots.  Every two weeks, in the middle of the night a large box of carrots dropped on our door step.  At first it was funny, now I can't even give them away because even all our friends are sick of them!\n\nThe other small complaint is that I signed up on their website and purchased the subscription as a gift for my husband, they even have a gift purchase option.  However it immediately emailed him a confirmation, therefore ruining the surprise.  So that was kind of a bummer.\n\nBut here's the bottom line.  I thought this would be fun and interesting.  I was hoping it would be fab enough that we would become year-round subscribers.  I can go to Stanley's any day and by carrots.  I wanted to try new things and get new recipes and be inspired.  No such luck with this one.  I hope the summer one is better but I am not willing to take my chances.",
            "author": "Melissa K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-08-20",
            "description": "We have been members since May 2015, and I couldn't be happier with Tomato Mountain Farm. The produce is high quality, the value is good, and the delivery is completely hassle-free. The variety has also been great -- we're not getting the same vegetables over and over again. My husband and I get the small share, and it is plenty for two people, with a little to spare for our one-year-old to try all the new veggies too!",
            "author": "Mallery I."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-29",
            "description": "We've only been members for a month but we love it! We signed up for the solo share (1-2 people) and for $75 a month we get weekly boxes of fresh organic seasonal veggies delivered right to our doorstep. In the past 4 weeks we've gotten: beautiful tomatoes of many varieties, bok choy, rainbow chard, Swiss chard, collard greens, lettuce, sweet peppers, jalapeños, garlic, scallions, acorn squash and various fresh herbs (just to name a few). We also opted to add a dozen fresh organic eggs per box for an extra $10/mo. With organic eggs going for $4/dozen it's so worth it! \n\nFresh organic and RIPE veggies are so much more  full of vitamins, minerals and nutrients than the supermarket stuff. \n\nAll of our veggies come from one small organic sustainable farm. I love knowing where my food comes from AND that I'm supporting local agriculture and dreams.",
            "author": "R S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-11-09",
            "description": "We receive our CSA box every week from them. We've been members since September 2014 and after a few hiccups with the delivery, everything seems to be going smoothly. The produce we receive is top-quality (but not super-cheap) and the variety helped us explore new ways with cooking veggies. Their eggs are pricey but... oh, so good! Customer service is personable and helpful. What can I say? If you look for affordability, I suppose there are cheaper options. But this is not about the bang for the buck. This is about knowing where your food comes from and being able to enjoy your carrots without worrying how much pesticide has been sprayed on them. Or discover you actually love kale, because it tastes so different than the store-bought one. And supporting real people. In short, I think it's totally worth it. For us, the community and the planet.",
            "author": "Claudia M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-10",
            "description": "I've had a membership with TMF for about a year, and I have nothing but good things to say.The produce is affordable, delicious, varied, and beautiful - and the emailed newsletters/recipes are lovely too. The convenience of having fresh, organic produce delivered to my door can't be overstated, and Chris spells out the exact value of each box so you always know how it stacks up to what the produce is worth individually. In every interaction I've had, I've found TMF staff to be exceptionally organized and incredibly warm and friendly. Highly recommended if you're looking for a Chicago CSA!",
            "author": "Bria B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-04",
            "description": "We've been members now for a few months and have only wonderful things to say. I agree with another reviewer that they're professional and easy to communicate with, provide gorgeous produce, with excellent variety, and most importantly, at a price that always feels affordable. I would suggest anyone wanting to get into a CSA go to Tomato Mountain. The newsletters are fantastic too. I love that they include updates from the farm and recipe suggestions.",
            "author": "Aleksa H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-17",
            "description": "My family has been a CSA member for four years, and we have never regretted it.  The vegetables have been consistently beautiful and abundant.  We love the weekly newsletters, which give us a window into the immense effort that goes into sustainable organic farming.  It feels really good to support such a high-integrity operation.  Some shy away from the challenge of cooking what comes each week, but I have found it inspires me to try new things and keep growing as a cook.",
            "author": "Lela B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-28",
            "description": "Amazing fresh produce delivered to your door - and the team is so helpful and thoughtful! Highly recommend.",
            "author": "Penny W."
        }
    ],
    "priceRange": "$$",
    "name": "Tomato Mountain Farm",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "",
        "postalCode": "60647",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Z32RzE0dJacbIgpZEgKggg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16083351198"
}