{
    "aggregateRating": {
        "reviewCount": 2,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-01-05",
            "description": "Adorable, adorable, adorable!!! I love little farmer's markets. I can't get enough of them. It's almost an addiction. I love to support the local entrepreneurs and farmers from any area. I stop at every single farmer's market I come across. \n\nWhile down in Quincy visiting my baby brother at college, we headed to Thyme Square Café for lunch before hitting the road to come home. When we arrived on 5th street, we parked and saw the farmers market taking place. I immediately asked my sister and brother if we could walk it before we ate and they both agreed. Thanks, guys!\n\nIts a small market but they had plenty of options of fresh fruits and veggies, baked goods, crafty items, homemade artsy stuff, plants and much more. I split a crate of peaches with my sister for $10 ($5 ea.), picked up some HEATLESS jalapenos which I later that week sliced and put on a homemade pizza back at home and even grabbed a small peach pie for $3. I was very impressed with the heatless jalapenos...I had never seen anything like them before and was blown away that these exist and more so, that I liked them as much as I did. In fact, I am actually going to see if I can find some seeds and grow some at home this summer. \n\nWe'll be back down in the area in May and I'm very hopeful that this market is open while we're there because I know my hubby would love it, too! Final thought...the people here were SUPER friendly. Totally loved them to pieces!",
            "author": "Catherine P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-12",
            "description": "I would love to know more or talk to somebody I have a lot of produce that is ready to be sold and I was interested in setting up over at you know the Washington Square Quincy Farmers Market I was wondering if somebody could maybe even call me and let me know what I need to do to set up over there my name is Paula Whitaker and my number is 573-2316129 thank you!",
            "author": "Paula W."
        }
    ],
    "priceRange": null,
    "name": "Washington Park Farmer’s Market",
    "address": {
        "addressLocality": "Quincy",
        "addressRegion": "IL",
        "streetAddress": "101-199 N 5th St",
        "postalCode": "62301",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/QakZSiGUaRbJ2FQcYiatYQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}