{
    "aggregateRating": {
        "reviewCount": 15,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2019-02-10",
            "description": "Literally if I looked at my paycheck to figure out where my money was going it would be the fruit store. I love their fruit and they are so knowledgeable and helpful!!! They have the best fruit salads ever. They have the best dried apricots ever. They have the best nestle caramel apples. I literally bounce between hinsdale and Western Springs Fruit Store - both are incredible! Western springs is open Sundays but if I'm hopping around after work I try to come in on my way home. I love getting and giving fruit baskets for special occasions. And on Valentine's Day they will have chocolate covered strawberries\nThe employees are the nicest I love going in there!",
            "author": "Al L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-12-17",
            "description": "Fantastic little fruit store. Great selection and quality. Prices are borderline absurd when compared to any other grocery store (including Whole Paycheck), but convenience and quality surely come with a mark-up. Cash only.",
            "author": "Mike D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-11-12",
            "description": "This is one of the best kept secrets in the Chicagoland area.  The fruit and vegetables are fresh, perfect and ready to eat.  They have freshly made items such as their guacamole, salsa, caramel apples, etc.  The service is also exceptional.  Prices might be higher than the local supermarkets but you won't get any bowling ball hard fruit here.  \n\nI formerly lived in Western Springs and was a regular at the Fruit Store.  Since moving to the Wisconsin border the Fruit Store is a must visit when I'm in the area.",
            "author": "Kevin H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-26",
            "description": "Nothing like fruit salad from The Fruit Store of Western Springs, IL-bought it Friday afternoon and it taste awesome, how come my fruit salad doesn't taste like this?\n\nMy only complaints are cash only (who carries cash?), prices are high but so is service and quality.",
            "author": "Mary W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-02",
            "description": "No way can you get better produce anywhere; even from farmers markets. The customer service is the best I've ever seen. They have a nice variety of produce and other items. Family owned for years",
            "author": "Carolyn S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-07-29",
            "description": "Super cute gem.....  My mother was recovering from heart surgery, and I was taking her on a drive.  It was a lovely, sunny day, and what would make things perfect?  A fresh, healthy smoothie!  I stopped off at this fruit market to grab some healthy snacks for my mom (all the fruit and veggie offerings were beautiful and colorful), and we were thrilled to find smoothies offered.  My mom loved her mango smoothie.  \n\nThe staff was happy and friendly, and my experience was great.  If ever in the area again, I will stop in.....",
            "author": "Mary Ann C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-03-15",
            "description": "I live about a mile and half away form the Western Springs Fruit Store and yet I have never ventured inside. I needed a nice little something for an associate (an associate who told me she started a certain fad diet as of January 1st), I was in downtown WS, so I thought it was a perfect opportunity to check it out. It was very, very mom-and-pop, so that charmed me right from the get-go. I live for places like this. It reminds me that maybe there's a glimmer of hope for normalcy now and then. The shop is small, organized, and very impressive. The produce is too perfect and beautiful to describe. It makes the stuff you see at Whole Foods look like the offerings in the \"produce\" case at 7-11. \nI selected a fruit tray and took it to the counter, and the very pleasant gentleman there rang it up for me. I handed him my debit card. He politely informed me they take cash or checks only. I took my wallet out again, \"Oh, um.....uhhhhh....\". I never have cash! Even the spare change that used to roll around my car has dissipated to nothing. It was only a few seconds, but he was reading my mind, I'm sure. He then says, \"Just give me your name, I'll write it down, and you can come in some other time to pay.\" I was too busy being embarassed, so I didn't really absorb what he had said, but I do remember giving a nervous little laugh. Meanwhile - SCORE! Tucked in between my 387 different preferred customer, frequent shopper, and whatever cards was a $20! I look up and present it to him as he is still pointing to this little board they have next to the counter. It had slips of paper tacked to it with people's names written on them. No phone number, address, or next of kin - just names. As my mind is putting this all together I blurt out, \"You were SERIOUS about that?!?\" He says, \"Sure! We do it all the time.\" You absolutely do not see places like this anymore. These kinds of things happened to my grandparents, not me! I was in love.\nBuzzkill alert: it was really pricey, though.",
            "author": "Stacey K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-14",
            "description": "The place makes you want to eat healthy. And I need a store like that in my life. Display is beautiful, product all fresh, but the prices kill me! Even for a food obsessed lunatic like myself, its pricey. But owner is a doll, everything is good, and salad bar is oddly to die for.\n\nI go for convenience, display, staff and taste. Some things have been so-so lately, and I'm not the best at complaining, but they're great.",
            "author": "D T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-08-05",
            "description": "Convenient, not cheap, and old timey. I love this place. The staff is very helpful, the produce is terrific, and they often have specialty items one cannot resist like special hybrid grapes or giant caramel apples. Yum!",
            "author": "rachel w."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-05-15",
            "description": "If only you were in La Grange, Fruit Store :-) Take cash, they do not accept plastic. Nicest people ever and fruit like you see in western Michigan all summer.  But they have it year round and yes, very much worth the price. A treasure.",
            "author": "Rebecca H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-28",
            "description": "The fruit here is much better than the stuff at the grocery store.  Fresh, ripe, and delicious.  The proprietors are also a joy to interact with - so friendly and personable - it makes me feel like I live in a small town, in the best way.  They also have some specialty items - dried fruit, tortilla chips, guacamole, that are very good.  All in all a great place to shop.",
            "author": "Jessica M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-26",
            "description": "I first learned about this place when, at one point in my life, I worked just down the street from the Fruit Store.  That was 20+ years ago. I live 90 minutes from there but when I need \"Perfect\" fruit I still call them.  I have not been in such a place since I was a child  (many years ago).  They are very friendly, have fruit and vegetables they look like they came from a magazine layout, and have ALWAYS been able to provide what I need with a simple phone call a couple of days in advance of some party or wedding reception. It is wonderful to see the clerk write the prices on a paper sack with a pencil and add them up in his head. In addition to fruit and vegetables they have nuts, dried fruit, milk, juices and some candy.  I usually end up buying 2 or 3 things that I did not order just because everything is so fresh and wonderful displayed.  You pay a bit extra but when the blackberries look like they were hand picked one by one and the size is colossal (think of ripe olives in the can) who can resist.  If I buy a lot--one time 3 cases of stem strawberries for the retirement party of a colleague they even carry my purchases to the car for me--try to get that kind of service anywhere else.  They get 7 stars on the 5 star scale--absolutely wonderful place and well worth a trip just to see what a Mom and Pop store used to be like (and in this case still is)",
            "author": "Maurie C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-04",
            "description": "This place is very expensive, but worth every penny!  I have never had anything bad from here. The best produce in the state. the watermelon is great year-round,  freshly  made fruit salad every day. \n\nIf you have extra money..... spoil yourself once in a while and remember it's cash only!",
            "author": "Anton P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-02-14",
            "description": "Along the tracks, a few doors down from Casey's Meat Market. Little fruit store, good for picking up some very fresh tasty fruit (though a bit pricey).\nJust ran to Casey's to grab meat for dinner tonight (It's about 2 blocks from Charlotte's school) and then stopped by the fruit store to grab potatoes. I had both girls in tow, and the guy says, \"We don't take credit/debit cards. Cash only. Or we can take a personal check. I'm so sorry!\" Now 9 times out of 10, I have my wallet and ergo would have the $2.50 I needed on me, but in an effort to carry less with me to the stores while toting the carseat, I just grabbed my debit card and ID. I said, \"No biggie, I can run to the car and grab cash, just one second.\" and then he said, \"Oh, no, I'm sorry, don't drag the girls out to the car, I'll just put your amount on a house account and you can pay it next time you come in..\"\n\nSay whaa?\n\nIs it 2008? Is this Mayberry? How nice is that? I don't go there often enough to think I'd remember to head back to pay it, so I just ran to the car anyway, but thought what a great gesture and a nice place. Now, I could just be clueless and many places could offer this and I'm just in the dark about it. But he indicated that the house accounts/tabs were handwritten on a clipboard attached to the wall.\n\nIt also likely helped quite a bit that the guy vaguely resembled Aidan Quinn, which added to the store's appeal.\n\nWe've always liked the place in the summer when we'd pick up meat from Casey's and then just needed to grab a veggie or something without running to Jewel, and this sealed the deal. Pricey? Yes. Delicious? Incredibly. Convenient? Yes. Awesomely nice? Apparently so.\n\nDouble thumbs up. Lower prices would give higher stars.",
            "author": "amy t."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-07-25",
            "description": "I LOVE THIS PLACE! Everything in the store is more fresh than Whole Foods. They make awesome fruit smoothies for $4.95 and they have a great salad bar Monday thru Friday. For a heaping salad I pay around $6.00. The people that work there are friendly and know you by name. Can't say enough good stuff about this awesome find!",
            "author": "Jena S."
        }
    ],
    "priceRange": "$$$",
    "name": "Western Springs Fruit Store",
    "address": {
        "addressLocality": "Western Springs",
        "addressRegion": "IL",
        "streetAddress": "925 Burlington Ave",
        "postalCode": "60558",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hMouk1ovzxe8wj9mlcVtJA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17082460893"
}