{
    "aggregateRating": {
        "reviewCount": 16,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-01",
            "description": "Come here every summer on Saturdays. Recently discovered Miraia corn, a sweeter corn than any I've ever tasted, developed and sold at Twin Gardens, Inc (Harvard) a vendor also selling wonderful heirloom tomatoes. \n\nYou can get to the Woodstock Farmers Market also by Metra train, which stops a block from the market square.\n\nPlenty of food, confection, and an antique store or two on the Woodstock Square, along with music in the gazebo.",
            "author": "Jeff O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-07-29",
            "description": "Lovely farmers market with a little bit of everything. Dog and kid friendly. Bought some.lovely produce, jam, and even a bone for my dog! My favorite booth was the 'make your own bouquet' booth. It was so fun!",
            "author": "Melissa W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-02-10",
            "description": "The winter market was a nice place to get some homemade food. We got some soaps as well. One of the tables was unattended for a long time so we had to wait around for them to take our money which is backwards.\n\nWhen walking in it's not clear what forms of payments are accepted as a first timer but we figured it out from the vendor.",
            "author": "Monica G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-07-08",
            "description": "A great little farmers market. What the Woodstock market lacks in size is balanced out by the high quality of the vendors, who are all local. It would be nice to see maybe one or two more vegetable/fruit vendors, but the selection is good. Set in the scenic Woodstock square, on Saturday mornings in the summer.",
            "author": "Brian F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-13",
            "description": "This is such a great location for a Farmer's Market, right on the Woodstock Square!  They always have a live band to provide some background music and the vendors are top notch.  You can find organic and/or non-organic veggies/beef, outstanding pork and eggs.  Just delicious stuff.\n\nSoap, stringed instruments, plants (flowers, bushes and even trees).  \n\nBreads, local honey, blueberries, pastries...I'm making myself hungry.  \n\nIts a very good time, my wife and I travel specifically to it as we've gotten to know a few of the vendors and they're good people.",
            "author": "Brett W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-04-07",
            "description": "This is an amazing farmers market year round, but I specifically wanted to post about how amazing Soap of the Earth is. They are a vendor there and I used them this month to buy favors for a wedding shower I am hosting. First of all Lori Anne was super sweet each time we conversed and she seemed genuinely excited about the order and how to costumize the soaps. She called me the week before pickup just to see if there was any last detail she could possibly add to the product and packaging. It was extremely thoughtful and great service. The price of soap could be tailored to our budget and I walked out of their gleaming with excitment over the product and cute display case she gave me for them!!!",
            "author": "Hannah P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-07-15",
            "description": "I remember going to this Market only a couple of years ago and the quality has surely gone downhill.  \n\nA lot of veggies/fruits are available for purchase, as well as baked goods.  Some are very well priced, others are ridiculous.  I somehow got wormed into buying an $8 loaf of bread, now it was pretty good, but I am pretty sure I could've got something just as nice at Whole Foods/Jewel or, hell, even a bakery for a cheaper price.\n\nI don't know if we got there at a bad time, but it was really picked over and not that many vendors.\n\nMy favorite part, however, was the lady that made homemade peanut butters... omg I can't wait to have some Honey Roasted Crunchy butter once I get home :)\n\nAND, I will say the Square has definitely had a face-lift in the past couple of years, all new kinds of shops and eateries.",
            "author": "Donna R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-30",
            "description": "One of the nicer Markets in the suburbs. They have a nice variety and a beautiful setting in historic WoodStock Square. A a great way to relax and spend a Saturday morning.",
            "author": "Dan N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-10",
            "description": "We specifically came here just to check out the farmers' market.  They had a good selection of veggies, meats, and baked goods.  Also, there were a lot of vendors with flowers and plants.  We wish there were more vendors, though!  Such a beautiful setting, it would have been nice to see a lot more people shop/visit and more vendors......\n\nThe Downtown Woodstock Square is beautiful, especially if you want to get away from a big city and just enjoy a quieter and slower-paced town.  Just lovely!",
            "author": "Amelie and Dan B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-17",
            "description": "I live in Barrington, and we have a Farmer's Market here.  There's also one in just about every nearby town.  However, I still choose to drive all the way to Woodstock for their farmers market instead.  It is THAT MUCH BETTER.  I think a big part of the reason is because it's so parent and kid friendly.  The Moms just hang out in the grass with their young children, listening to the live music and munching on fresh veggies and fruits.  The vendors are really nice people too, and there is such a big selection of food from bread and cheese to soaps and fresh produce.  Since it's a long drive, we make a trip out of it and hang out for a while.",
            "author": "Kate H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-06-25",
            "description": "I went to this Farmer's Market last weekend with high hopes of buying bushels of fresh produce to bring home to Chicago.  We arrived around 10:30am and it was already fairly picked over.  There were a lot of plants for sale, as well as baked goods, honey, jam, etc, but only a handful of vegetable sellers.  \n\nI was able to buy fresh onions, leeks, snap peas, and lettuce. I was hoping for corn, fresh peas, and tomatoes, but I guess it was too early in the season.... We also picked up a delicious foccacia bread.  If I had though to bring a cooler I would have purchased some meat; there were a couple of people selling grass-fed beef and other meats.  \n\nThere were folk singers performing in the gazebo in the center of the square, and we had donuts while we sat on the grass and enjoyed being outside in the sun.  \n\nNot really worth the love drive from Chicago just for this, but a good place to stop in if you're in Woodstock or Hurley for something else.",
            "author": "Ashley K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-01-19",
            "description": "Not too shabby midwest, not too shabby. \n\nI enjoyed walking around the scenic town square and visiting the stands of local farmers. There was a lot of corn. A LOT. But that's okay, because Illinois has the best corn in the world. \n\nVeggies, meats, and baked goods galore. I wish there were some more ready to eat food-stand that had gluten free items! I miss out on all the good food.\n\nWoodstock is a fun place to take a day trip, and even better on a farmer's market day!",
            "author": "Caroline P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-09",
            "description": "I haven't been to many farmers markets (even though every year I say I'm going to), but this was impressive! They had everything from Polish pierogis to your usual veggies, wild flowers, gluten free bread, soaps, kettle corn, and grass fed beef. If you're looking for some different, local, healthy items this is the place to come! They had probably 25 different vendors to check out. And of course, it was fairly priced for what you are getting. It is in the historic square, so when you are done with the farmers market you can check out the local shops near by. I only wish it was closer to me!",
            "author": "Danielle S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-16",
            "description": "Cute farmer's market with a lot of local options. Definitely get some kettle corn, I bought a small bag and it is already gone! There were a lot of veggies, fresh flowers, potted plants/trees, cookies, soaps/lotions, knife sharpening, baked goodies, treats for dogs...the list goes on. \n\nOnly runs until 1 pm so if you want prime selection, I suggest you get there early.",
            "author": "Susan B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-01-27",
            "description": "The Woodstock Farmers Market is one of the reasons the square is so special. It is the perfect location for local producers. The town square is very special an so are the people that make this market. There's a good reason it is voted number one in the state year after year.",
            "author": "Naté G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-06-30",
            "description": "Yes, I made the hour drive due to the raving reviews from Farmer's (at other markets) and the fact that this FM was rated #1 in IL for the past 3 (?) years. Providence Farms, by far has the best veggies I have been able to purchase from ANY FM, ever. These guys are REAL farmers. These guys are also usually at the Morton Grove FM as well. (Another reason I went to Woodstock; no FM in Morton Grove this week) Prices are much more reasonable. Fruit has not really come to this market yet. Apparently, the farmer's have to come to them, and our Michigan Fruit Belters haven't made it out yet. I guess too early for fruit here.They have so much variety at this FM and the feel is nice because it's in the town square. Being a small town New England girl, this was nice for the ambiance. A lot of farm fresh meat selections from this place. I noticed the first reviewer said this place was picked over by 10:30. It's the Farmer's Market, there is a reason they start early and are done usually by 12 or 1. I find with ANY FM, it's always best to get there early. We were out of there by 10:30 and I felt there was still A LOT of good stuff to choose from. Also, local honey here for a MUCH better price than out my way. They have lots of treat stands, check out Jaci's Cookies. She offers gluten free items for the same price as her other stuff and it's YUMMY! On the way out, I saw a stand for all natural soaps and also an all natural cleaning spray! Overall, worth the drive if you want to make a nice morning of it. Town green is a good place for the kiddies to run around. Also, once you're finished, lots of cute local businesses to check out.",
            "author": "Katy L."
        }
    ],
    "priceRange": "$$",
    "name": "Woodstock Farmers Market",
    "address": {
        "addressLocality": "Woodstock",
        "addressRegion": "IL",
        "streetAddress": "Historic Woodstock Sq",
        "postalCode": "60098",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Pnw6PJJRQdQBDFfLLHfHQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18153385164"
}