{
    "aggregateRating": {
        "reviewCount": 2,
        "@type": "AggregateRating",
        "ratingValue": 2.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-07-22",
            "description": "Im on a mission to bring out the more hidden places around Lake county and put them on the map for the whole world to see..\n\nToday i went to the Farmer's Market in Zion Illinois(BOYHOOD HOME OF THE LATE ACTOR GARY COLEMAN THAT RECENTLY PASSED) that they have every Thursday between the hours of 2 to 7 pm.If you ask me the hours are perfect since i find it next to imposible to wake up extra early just to pick up some fruits vegetables.\n\n\nMy impression of this FM is that it's really plain and has only a handful of things to offer..I dont think anyone that had been to several different ones would find this one to be the best, but you might like the peacefulness of the atmosphere here. Not to mention the smalltown appeal of Zion.\n\nThey offer fruits vegetables a few  Arts and Crafts and people giving massages like they give over at the mall.I only came for green tomatoes since they're like next to impossible to find anywhere.This statement holds true even in California where i now live at in Los Angeles!They had only 2 stands that sold them and i choose the stand that Farmer Mike had.\n\nFarmer Mike is a nice old blackman that lets you sample his produce before you buy if you'd like.All of his items are organic and he proudly states that when you meet him..I didnt ask if i could take a picture of him because i thought that would be rude but i told him that i would mention his stand on Yelp..\n\nTo end this review ill just give an overview of the surroundings.Its on the corner of Sheridan road and Shiloh.Its across the street from a Marathon gas station and from a Dollar general Store..\n\nIt was nice going there and i recommend this location if you're in the Zion Illinois area..Just please dont think this is the best FM out there .It's just a good location to pickup fresh fruits and vegetables and enjoy the day out and about .\n\nNothing more can be said other than that..Zion Illinois is kind of Hillbilly like, and i mean that with the most respect.If you want more excitement try going to one in Chicago..Thats where everyone goes when they're tired of the slow life around here!",
            "author": "Tishawn F."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2013-10-04",
            "description": "Not really a big fan of this farmer market at all. It's kind of cute very small. I guess it's enough for Zion. You can be done within less the. Not even 2mins going around. There's like literally 8 both that's how dinky it is. produce that they sell is very expensive.\nI don't understand there's a lot of local farmers in town I would think they sell their produce for a bit cheaper. I understand it's organic and fresh. Maybe it's not like Minnesota or Seattle where there's a lot of locals you are competing with.",
            "author": "Kelly P."
        }
    ],
    "priceRange": null,
    "name": "Zion Farmer’s Market",
    "address": {
        "addressLocality": "Zion",
        "addressRegion": "IL",
        "streetAddress": "",
        "postalCode": "60099",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QTP6pGpqQKg3Tm3wAcMKIg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}