{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-17",
            "description": "This is a really nice market, and is held on the second Saturday of the month, from May thru October.   It is located on a lovely park along the I& M canal.  The items for sale include, antiques, handmade items, baked goods, and produce, vintage items.\nIt makes for a nice, relaxing day trip to spend time browsing the market.  Downtown Morris is within walking distance of the market, and has some interesting shops, and restaurants.",
            "author": "Sue R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-05-15",
            "description": "This market does have something for everyone. The canal that runs next to it has green algae floating on the top. It is a nice place to walk around and see the myriad of vendors.  I do visit this market a few times between May and October.\nSOME of the craft vendors are mighty proud of their wares as evidenced by their high prices. Being a crafter myself, I know how much things cost to make. I do understand that it is hard to put a price on your time but some of the prices being charged are ridiculous. Yes and I know that if you don't want to pay that much, don't buy it. You can't even make a deal with them. They will not haggle. If they really want to sell their wares, they should have some leeway.",
            "author": "Debbie A."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-08-14",
            "description": "The market is exactly as advertised - a bit of everything: antiques, vintage, crafts, produce & baked goods with emphasis on the antiques & crafts.  We learned about it from the farm bureau magazine and this seemed like something different to explore. It is obviously popular with the locals and people were buying.  We were disappointed by the lack of produce options (There were only two vendors selling produce.) but enjoyed the bakery booth.  \n\nThe event is held in a city park that is right next to a standing water offshoot of the Illinois canal that was covered in bright green algae. Thank goodness it was drizzling or the mosquitoes would have been unbearable.",
            "author": "Linda M."
        }
    ],
    "priceRange": "$$",
    "name": "3 French Hens French Country Market",
    "address": {
        "addressLocality": "Morris",
        "addressRegion": "IL",
        "streetAddress": "123 West Illinois Ave",
        "postalCode": "60450",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+18159410752"
}