{
    "aggregateRating": {
        "reviewCount": 22,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-16",
            "description": "I really really like this Farmer's Market.  \n\nFirst - it opens earlier than a lot of the others and stays open later into the fall.  Of course there isn't as much there during the early spring and late fall (given where we live and growing seasons in the region) but they still have the local meat and cheeses and breads.  \n\nSecond - it's more than just berries and flowers.  So many of the markets are really limited.  This market has all sorts of seasonal goodies (fruits and veggies) plus, as mentioned above, meats, cheeses, herbs and other local products.  Definitely a Community Market in the truest sense.\n\nFinally - it may be hidden, but it's really easy to get to.  On  a nice day, it's a great bike ride.  And if I'm lazy, there's always plenty of parking nearby.   And whether I bike or drive, I get to head home through nearby Jackson Park which always puts a smile on my face.",
            "author": "Cassie S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-09-20",
            "description": "I live down the street from this market, and I enjoy the healthy hustle-bustle it brings to our Woodlawn neighborhood every Saturday morning. \n\nThings sold here include: Fruit (cherries, blueberries etc.) oils, vegetables, meats (pork chops, roast bratwurst, etc.) tea blends, frozen yogurt, bread (sourdough, ciabatta etc.), jelly & jam, pies, salsa, nuts, and cheese. Fairly pricy, but you get what you pay for, I suppose.\n\nPARKING TIP: There is a UChicago parking lot at 61st and Kenwood,  behind the AT&T building, that does NOT require a parking permit on weekends. Probably not the brightest idea to share this, given that I sometimes have to park there myself due to the chaos, but there you go. Please save me a space! :)",
            "author": "Tyrone J."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-06-04",
            "description": "The vendors were pleasant and friendly, if a bit fewer in number than I anticipated. The goods are a bit pricier than I expected, but it is the closest one to me since the South Shore one closed up shop. I think it might expand a bit as the season goes on, but I got some nice asparagus for the grill, farm fresh eggs, and my mom enjoyed the apple cider.\n\nI loved all the pastured meat options and free range eggs. There was even artisan sourdough and cheeses. Quite a few of the offerings were available to order and have delivered, rather than being on hand. There were goodies ranging from handmade ice cream, to rhubarb, to apple cider donuts, to king trumpet mushrooms. And, at the back end was a wood-fired pizza oven, cranking out all manner of tasty pies. I'll definitely return!",
            "author": "Loretta P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-05-26",
            "description": "As I enjoy local Farmer's Markets, it was a pleasant surprise to find this one near my employer, the University of Chicago (its located a block from the Midway Plaisence)..  \n\nI went one recent Saturday and found a small number of vendors selling items from their vegetables (asparagus is in season this time of year) to breads as well as a few folks who were selling menu items.  I ended up getting a crepe from one of these folks which was made with fresh greens, mushrooms, pinto beans, and cheese.  I topped it off with a cup of coffee (serve yourself, honor system) from another vendor.  On the way out I bought a loaf of Oatmeal bread from another local vendor.\n\nAll in all it was a pleasant way to spend a bit of time on a Saturday morning.  I'll have to come back from time to time to see what else they have to offer.  In addition, they also have cooking classes here which might be helpful to some.",
            "author": "Mike P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-07",
            "description": "this is one of the best farmer's markets in Chicago. They have a good selection of produce and a wonderful atmosphere. There's cheese, bread, and fresh flowers. parking is good and it is not crowded.",
            "author": "Trandy W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-18",
            "description": "This farmer's market is so cute and friendly.  It's in a nice peaceful spot right behind a community garden.  It was so nice to be outside enjoying the weather Saturday.  And there was a nice assortment of goods available.  I didn't even know people sold meat at farmer's markets, but there were 2 different tents with different cuts of organic meats.\nI can't wait to see what kinds of produce are available during the summer!",
            "author": "Anne S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2011-07-31",
            "description": "I guess I'm a spoiled Californian, too.  \n\nIt's really small and there isn't as much variety as I'm used to.  It's also more expensive than I'm used to.  However, the produce is still really fresh and of good quality.  I guess I'll go again if there are no better alternatives",
            "author": "Jaclyn W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-24",
            "description": "I LOVE this location.  They have a great selection and atmosphere.  Easy to find parking!  SO glad we have such a great market on the south side!!!!\n\nIt says on this page that they don't accept credit cards, but that's not true.  There's a station where you can give your credit card and get farmers market cash in return.  You can use them at any point during the market season.",
            "author": "Sasha F."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-11-24",
            "description": "It's small but there are some great people and great finds here! I racked up at River Valley Farms. I really enjoyed the spinach artichoke dip, apricot- chile sauce, veggie burgers, butternut squash ravioli and blueberry lemon compote. My favorite items from River Valley were the cranberry chutney and wild mushroom burgundy pasta sauce-deelish!!!!!! The lady selling the goods was very nice as well.  Pleasant House Bakery was there the day I went. I grabbed a couple of pies and some arugula. I don't know if this will be a regular thing for them. Anyway, those are some of the goodies that I got but there were also pastries, breads, fruits, veggies and demos as well. Why not head on over ?",
            "author": "Nicole H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-24",
            "description": "Great intimate community Farmer's Market. Excellent Variety of Vendors incl produce, Cheese, floral, Made to order omlettes & tacos using market produce, Cooking Demos, Market School education. Accepts link & will double your value. $1 Coffee, raffles. Well organized, fun place to spend Saturday morning.",
            "author": "Sarah B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-05-16",
            "description": "I really enjoyed stopping by this farmers market today.  Its still early in the growing season and I am excited to see the selection expand as more fruits and veggies become available. I totally dig that they also offer meat, eggs, and dairy, also produced locally and organically. And the community garden is fantastic. \n\nWhat a amazing little secret tucked in a little corner in Woodlawn. I will be stopping by here throughout the growing season. \n\nI also recommend stopping by the backstory cafe which is just around the corner.",
            "author": "Allison E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-22",
            "description": "It has been at least a couple of years since I last tried this market, and in that time the folks at Experimental Station have nurtured it into a fantastic venue!  Fresh fruits and veggies, breads, pastries, eggs, flowers, cheese, meat products, a taco stand and a crepe stand.  The number and quality of offerings is outstanding, especially for the south side. They even have a market dollars service, where you can purchase coupons with a debit or credit card, a great service for someone like me who rarely has much cash in his pocket.",
            "author": "Richard B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-07-28",
            "description": "The Experimental Station on 61st and Blackstone has really blossomed over the past few years. I would like to think that my bringing the Bread and Puppet Theater from Glover, VT, to their space in 2006 helped launch this new era, but whatever it is, the recent developments are making me happy! \n\nWhile it took a few weeks for this market to get on its feet, the result is pretty darn good. It's on its way to becoming a smaller version of the organic mecca Green City Market in Lincoln Park, but it has that close-knit Hyde Park community feel that really warms my heart. Because it's not as crowded as other markets, you really get a chance to talk to the farmers, which is great. \n\nMy top picks: the much coveted tomato jelly from Tomato Mountain Farm, triple cream brie with apricots, almonds, and honey from Brett Stamper Cheese, 8-grain bread and eggs from Bruno's organics, veggies from the oh-so-local Windy City Harvest in North Lawndale, and the trail mix scones from the Bleeding Heart Bakery. The last time I was there, Bruno's was selling shares for its raw milk. While I'm still on the fence about the product for myself personally, I strongly believe that subversive farming practices are what is going to save the world. \n\nAfter shopping at the market, be sure to pop into the Backstory Cafe for coffee-it's delicious! Another bonus is that you can buy some groceries and get a minor bicycle problem fixed around the back at the Blackstone Bike Shop.",
            "author": "Meg O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-05-04",
            "description": "A super great place to get fresh fruits & veggies and other items as well. Friendly people and a great way to support a small business",
            "author": "Yohance T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-12-05",
            "description": "The Farmer's Market has moved indoors for the winter!\nSaturdays, 9am-noon.\nNovember 8-December 13.\n\nDetails here: http://www.experimentalstation.org/node/118",
            "author": "G. S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-06-03",
            "description": "Great farmers market to have in the neighborhood.  It's small enough to keep busy but not to a point of anxiety.   It has a great selection of produce, mushrooms and greens especially.  The Michigan Honeycrisp apples are 1) outrageously priced 2) totally worth it.  If all I had was twenty bucks for a week of groceries there's a 100% chance I would spend it all on a dozen of those apples....cos that's all it would get me.  Moving on, there are a couple vendors selling crepes and breakfast burritos which is a welcomed bonus on a Saturday morning.  AND they have a raffle each month and after each purchase you make you're supplied with a ticket to enter.  I'm a fan.  Even if you don't need groceries; crepes, coffee and a raffle, are you kidding me?  That's a killer way to spend a Saturday morning.",
            "author": "Anna H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-30",
            "description": "This was one of the few things I liked when I lived in Hyde Park.  Good selection of produce - great apple cider in the fall!  Also, the crepe guy rocks - the cheese and herb crepe, super yum, for a nice lunch post shopping.",
            "author": "Haley S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-05-18",
            "description": "The 61st Street Farmer's Market is a mere toddler in the realm of Chicago's Farmer's Markets.  In just its second year, this has quickly become one of my favorites though.\n\nTucked away in a small section where Woodlawn meets the U of C campus, and therefore my 'hood Hyde Park, it is a location that is meant to be kept fairly small.  Essentially this market has been placed along 61st, just east of Dorchester.  It is a very short block and as a result has a small amount of space for stalls- but the organizers of this market (Experimental Station- also located right here) have done a terrific job of ensuring great variety of products and representation in such a small, yet comfortable space.\n\nThis past week, from what I saw, there were: \n-two different stalls specializing in cheese (funny side story: when a fellow Yelper asked about the differences in the range of blue cheeses being sold- one of them was described as \"tasting like your basement... but in the most delicious way possible!\"  Guess which blue cheese I bought?!?!?); \n-a farmer who sold free-range chicken eggs (and had the chickens there on display for the children to see) and all cuts of pork raised on her farm; -someone selling lamb, goat, and mutton; \n-a very popular crepe stand with a busy man cranking out crepes seemingly through the day; \n-the local bike shop had a space to fix bikes on the spot (I know what I will be doing next Saturday- drop my bike off for an annual \"checkup\" while I shop away); \n-a stall with fresh herbs, greens and other vegetables (still early in the season for a lot of variety at this point); \n-another stall selling veg;\n-two different stalls selling their own salsas, sauces, and salad dressings;\n-a community organizer spreading the word about the upcoming \"Real Men Can Cook\" event\n\nI am sure I am forgetting at least a couple of things- but the point is, there is a great amount of variety.  They accept LINK, WIC, and food stamps- making it a market for everyone to enjoy!  They are supposedly working on getting a POS credit card terminal too, which would be awesome.\n\nWhile you are there, might as well stop in to Backstory Cafe- a really nice coffee shop which is a part of Experimental Station and open for anyone to attend during the market.  Just north there is a community garden center filled with all sorts of gorgeous flowers, produce, and the occasional garter snake.\n\nExtremely easy to get to (just off of LSD near the Museum of Science and Industry) with unlimited street parking and tucked away in a really lovely part of town- with a lot to do and see after.  I suggest everyone give it a try at least once this summer- besides, it is one of the few farmer's markets that is actually on a Saturday in the city.",
            "author": "Reuben H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-09-29",
            "description": "I know I'm northern California spoiled, but I found pretty slim-pickings. Will give it another try, though.",
            "author": "Luke S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-05-16",
            "description": "I really love this market. Not only did I get some great asparagus, cheese and crepe this weekend, I got to visit with neighbors new and old. They accept LINK and will double it up to $25 which is great for a neighborhood in a food desert. Most of the farms are MI and WI, all are probably within 100 miles of the market. Good stuff.",
            "author": "Eliza B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-15",
            "description": "This place is amazing.  Shows what a neighborhood collective can accomplish even if you find yourself on the less desirable side of town.  I will be back again and again!",
            "author": "Laviyah I."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-04",
            "description": "Finally stopped back, after a two year hiatus.  The 61st Street Framers Market has really grown and improved!  There are many more vendors than its first year, and the prices, while still high, are within reason.  I am glad I took a chance while there is still time to return this season.  All of the vendors were friendly and helpful and the produce and baked goods looked fresh-as-can-be.  Can't wait for next Saturday's return visit!",
            "author": "Melissa W."
        }
    ],
    "priceRange": "$$",
    "name": "61st Street Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "6100 S Blackstone Ave",
        "postalCode": "60637",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JmgVTAXb8GqGZBgEohg6Cg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17732416044"
}