{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-01",
            "description": "Awwww Yea!!!  Pumpkin Season in Morton, IL is THE BEST!  I wouldn't expect anything less from the Pumpkin Capital of the World!\n\nAckerman Farms is a top notch local family (pumpkin) farm. They have a wide range of \"fancy\" pumpkins (various colors and shapes), blue ribbon pumpkins, and a plethora of pumpkins and gourds in all sizes!  They also have great deals and farm activities like hay rides, petting zoo, and a corn maze. \n\nI've visited Morton plenty of times with the past seven years but I can't believe my husband didn't share this gem!  I can't wait to go back next season! :)",
            "author": "Bernice R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-03",
            "description": "I love this little farm! There are mums, pumpkins and other gourds for sale. There is an animal area where you can see llamas, peacocks, chickens, goats and a donkey. There is also a small children's area where kids can play with trucks or with blocks, baby strollers and other toys. It's the perfect family outing to kill an hour or so.",
            "author": "Jennifer T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-01-08",
            "description": "Morton is literally the pumpkin capital and Ackermans is the crown jewel! In a previous comment someone said they thought the owner was creepy, but I personally know him and my church's preschool class goes there every year. Far better variety and quality of pumpkins than Walmart. Recommend coming here for not only the pumpkins but the animals as well. There's a peacock!",
            "author": "Lena O."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-10-19",
            "description": "We had a horrible experience because of what I assume was the owner who was super creepy and rude to us, don't go here unless you want to feel harrassed. The pumpkins are nice but you can get the same quality pumpkins and better customer service at a Walmart.",
            "author": "Briana M."
        }
    ],
    "priceRange": "$",
    "name": "Ackerman Farms",
    "address": {
        "addressLocality": "Morton",
        "addressRegion": "IL",
        "streetAddress": "27158 US Hwy 150",
        "postalCode": "61550",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ktieyJ4LG997WG7EMRDxNQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13092667459"
}