{
    "aggregateRating": {
        "reviewCount": 1,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-28",
            "description": "First, I don't even like cranberries very much so this whole experience surprised me. I'm at the Farmers market and I see this really sweet couple. I had spent a lot of money and pretty much checked out each booth there. By the time, I made it to the Cranberry Candy booth I had kind of decided I'd grab a sample and leave. The owners insisted I try their Cranberry and jalapeno spread that is suggested for cooking beef, pork, fish or chicken. Okay, I thought they look so sweet who could tell them no. I'm not going to like it I thought to myself because 1 - I don't like sweets and 2 - I don't really like cranberry. So, I sampled the spread and honestly, I didn't like it too much, but I figured why not try and cook with it? I bought one jar and they thanked me and told me how much I would love it on my food. I'm like yeah, yeah, okay. \n\nSo, I cooked it on some chicken. It was super difficult to get out of the jar and of course being a solid it was nearly impossible to spread evenly. I cooked a few chunks of it on various places of my chicken and poured a little grapeseed oil on top to keep it from burning. When my food was done - WOOOOOOOOOAH. My random Saturday chicken dinner was transformed into your best holiday meal. All of the flavors of this spread came BLASTING out when it was heated. Even though it wasn't spread throughout my chicken it baked evenly inside of it. Every single juicy bite had a chicken cranberry taste that you'd only have if you put your hot slices of turkey next to your cranberry on the holidays. It was actually better than that though! I was so surprised that I enjoyed this so much. I served it to my dinner guest and they all agreed that it made the flavor of the chicken taste exotic. It wasn't a holiday. My food didn't take all day to cook, but it tasted just like it did. :) \n\nI am so impressed with this spread. I did not try any of their jelly's, but when I went to their website I noticed they do not sell the cranberry jalapeno spread they only sell their jelly's. I'm sitting here worried.... what will I do when that one jar runs out? *shakes head* NOOOOOOO, I cannot imagine it. \n\nThey are at the Farmers Market's in Chicago especially the one at the Daly's Plaza, so try it while it's still there! I promise you won't be disappointed.",
            "author": "Kimmie R."
        }
    ],
    "priceRange": null,
    "name": "Amy’s Cranberry Candy",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "922 W Washington Blvd",
        "postalCode": "60607",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+13123512575"
}