{
    "aggregateRating": {
        "reviewCount": 42,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-12",
            "description": "I am starting to be a bit of a meat/veggies snob. I don't get to Farmer's markets as often as I would like. Although this market is not the most conveniently located to where we live, I would go out of the way to do my shopping here. \n\nThey have a good variety of vendors here. One can find almost every kind of perishable and it is all local! All of the vendors are friendly and more than happy to tell you about their wares. \n\nNot only are the vendors awesome, the crowd is also really cool. Started up a few conversations with folks just standing in line or browsing.. This is going to be on my rotating schedule of farmer's markets to attend!",
            "author": "Dave S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-12-18",
            "description": "My favorite local farmers market I've visited, by far. I've always wished the season would start a little sooner than the first week of June, though. Maybe they'll finally heed that advice, and start a few weeks earlier for 2014? I can understand the season ending in mid-October, due to the fact it starts to turn very cool enough right around that part of the fall. I still really wish their farmers market season would begin at least by mid-May, though.\n\nThough some of the vendors are a tad expensive, I always find something to enjoy about this farmers market every time I go. If you have a chance and a Wednesday afternoon/early evening to come by, check it out.",
            "author": "Allan M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-06-30",
            "description": "This was my first time at the Andersonville Farmer's Market. It had most of the items that I was looking for.  Typical farmers market.\n\n The market is compact since it's only couple of blocks long.  There are plenty of options for veggies and fruits, but organic and non-organic.  The only item that I didn't find was corn.  The red and black berries are delicious.    The Bruni-Uusto cheese stand is incredible which you can taste before you buy a packet or two.\n\nIt's great to have this market during the week to replenish your fruits and veggies that you have bought over the weekend.  The evening hours is a plus.\n\nLooking to return.",
            "author": "Ken O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-10",
            "description": "Sometimes, I forget that I live in the nation's third-largest city... and that sometimes usually happens when I'm perusing the Andersonville Farmers Market.\n\nAs expected at a farmers market, there's free samples for the taking. I'm talking in-season jams, glorious cheeses grilled on the spot, handmade tofu, cardamom blueberry granola, banana foster-flavored popcorn, quickly-snapped-up ears of Iowa corn and juicy apricots. But, bet you didn't know real smiles were up for grabs, too! I'm wearing my ear-to-ear Sunday grin on a Wednesday... hump day, my dears, has never rocked this hard. Where's that apron?\n\nAnd when I awake tomorrow, I'll have my way with organic eggs, sweet gypsy peppers, oranges juiced by the hands of yours truly and a slice of zucchini bread. I believe this is what we Americans call \"stopping to smell the roses\" though more accurately, I'll be stopping to smell the heady fragrance of fresh-cut lilies (also purchased at the AFM).\n\nIf you forget your cash, don't despair - you can buy tokens on your credit/debit card and they basically work like cash (you'll get hard change back). This small, easy-to-navigate open air market is open 'til 8pm every summer Wednesday, and they keep it going into the borrowed days of Indian summer, too.\n\nLOVE. That is all.",
            "author": "Jelena Z."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-09-23",
            "description": "I stopped by last week.  The Andersonville Farmers Market is a decent size with lots of samples to taste, and is far bigger than the tiny one in Edgewater and the so-so one by the Loyola el.  It might be around the same size as the Rogers Park one by the Morse el.  \n\nLike other Farmers Markets, they offer a LINK matching program.  In Andersonville's case, this means that they'll charge your LINK card a certain amount (say $10), and then give you $20 in cardboard tokens.  You then use the cardboard tokens to buy goods.  While this of course doesn't let you spend in denominations smaller than $1, so you can't buy taste portions, it avoids the nonsense I saw last night in the Rogers Park Farmers Market.  There, the two women operating the LINK machine couldn't figure out how to correctly bill the customer, and kept overcharging her.  In the end, I'm pretty sure they underpaid the vendor by $1.50.",
            "author": "Angela T."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-06-05",
            "description": "This was the 2nd Farmers Market I've gone to in Chicago and again wasn't very impressed. Had less vendors than the Logan Square Farmers Market. I went on 6/4/14 and just felt the display by the vendors was thin overall. I arrived around 6:30p so with an hour and a half left I'm sure it's not uncommon to be out of product. I did take note that one vendor (Twin Garden Farms) wasn't present as they are advertised on the website. I was hoping they would be there because of their unique corn on the cob. I did not see any signs of them there. \nIt was also a rather cool night and it had been raining most of the day so that could have impacted the overall sad feel to the market. I will give it a go again in a few weeks or so as I want to support local busniess.\nI was again disapointed with the lack of fresh cut flowers and one vendor with just potted ones for gardening.",
            "author": "Megan D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-02",
            "description": "This is one of my favorite things in the neighborhood, and there are a lot of things I like in the neighborhood. There's a solid variety of vendors (many of whom have free samples... just saying) and prices are fair.  If you know what's in season, you can probably get a deal. The focus is definitely on produce, which works for me.\n\nI also really like that it's in the evening, which helps me avoid the less-than-preferable scenario of hanging around with 3 pounds of apples and/or tomatoes after my lunch break/until I go home.",
            "author": "Christina C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-14",
            "description": "The Andersonville Farmers' Market is just like the neighborhood (quaint, cozy and friendly). There's great selection for produce and other items (breads, meats, eggs, treats, etc.).\n\nThe prices from vendors could be cheaper, but I guess the standard prices for Chicago farmers markets are marked up in general. Another recommendation would be if they had more vendors with made-to-order food. \n\nI love the market and it's a staple to my Wednesday evenings throughout the summer.",
            "author": "Tim H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-01-18",
            "description": "You can't help but love classics like Goldfinger, and Secret Agent Man on an accordion.  That was the live music selection at today's winter farmer's market.  The market is small with maybe around 20 vendors.  They had homemade candies, pastries, soups, bread, and salsas.  I ended up with some great  organic winter spinach and winter radishes, and also some ciabatta bread.  (I think I see a sandwich in my near future.) I was also intrigued by the never-ending knowledge of the black garlic vendor, and ended up with some of that, too.  Though the market is  small it's a good place to pick up some fresh goods, and commune with your neighbors.  And, it gives you just a taste of summer when all the outdoor farmers markets are in full swing.",
            "author": "Debra L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-09-08",
            "description": "I appreciate the fact that this market is open into the early evening hours. This is really wonderful especially for people who work full-time during the week. This market features a myriad of produce items, many kinds of breads and excellent meat vendors. This Farmer's Market features a rotation of vendors (merchants), which s a great way to give new vendors an opportunity to participate every other week. You will see items, such as, baked goodies and fresh real fruit jams. Due to the \"rotation\" of vendors (merchants) you may not see a specific vendor the following week. One vendor that I was very happy to see this year was \"Black Garlic North America\" which offers aged, fermented garlic which has a sweet, delicate taste and balances most dishes perfectly. I love using this garlic in different meats as well as using it sparingly in salads, grilled salmon or broiled Talapia. I also purchased some organic vegetables and fruits. I even found corn, which is very hard to find at a Farmer's Market. Picked up a few ears for my husband who loves corn on the cob. This Farmer's Market is open through October 15, 2014 and every Wednesday from 3 to 7 pm. Gotta love it!\n\nDue to \"space\" this is not a huge Farmer's Market, however, it has some wonderful items. I like the size of this market, because it doesn't take long to get through the entire market and hit up most of the vendors here. I have been to many, many Farmer's Market over the years and most close by early afternoon. On the other hand, this Farmer's Market is open until 7 or 8 pm (depending upon the day of the week and time of month). This year the market opened two-weeks early, which was very exciting for those of us who enjoy a great Farmer's Market. \n\nThere are nearly 30 vendors offering everything from fresh-cut flowers, wonderful bottles of wine to a myriad of cheese to honey and including fresh lamb, delicious ripe fruits and unique vegetables. If you enjoy tea in the fall and winter time (or year round) you must check out the gourmet tea vendors. There are pies, gourmet pasta sauce and unique salsas that you may not find any where else. I noticed some people brought their knives (yes, you heard correctly) -- knives -- and someone will sharpen your knives for FREE while you walk around the Farmer's Market and shop till you drop!\n\nI met Brady Bradine at the Farmer's Market. This is his fourth year being a vendor at the market. He sells all-natural, whole grain baked goods, which I can appreciate but can no longer eat. For example, Brady sells cookies, cupcakes, muffins and brownies from his bakery located in Oak Park, IL (it is called \"B True Bakery\"). I didn't purchase any items from the \"B True Bakery\" but my friend purchased a cupcake and cookie for her husband. I gave up sweets and anything that contains sugar, but I do admit my mouth was watering and everything looked fantastic and smelled super fresh. My friend rated the cupcake with 4-stars (as she ate it while we were walking around the market). Her husband enjoyed the cookie and said it was \"very, very good.\" He didn't rate the cookie. However, he inhaled the cookie very quickly so I will take this to mean that maybe the cookie was/is 4 or 5-star worthy.\n\nIf you have not been to a Farmer's Market this Summer, get your ass over to Berwyn Avenue (between Clark and Ashland Avenue) and treat yourself. This is their sixth year. I love a good Farmer's Market, and appreciate that they also offer organic products that will not break your budget. I also appreciate that they accept credit cards, debit and LINK cards which makes it very convenient for everyone to shop at this Farmer's Market. Some of the other Farmer's Market that I have shopped at this Summer are \"cash only\" but not the Andersonville Farmer's Market. Out of all the Farmer's Market that I have been to this Summer this is one of my favorite markets. It is such a great community of people and the vendors are fantastic and sell quality top-notch products. It is affordable so I can purchase healthy organic items for a lot less than I would pay at Whole Foods! Check out this market before it ends. You will not be disappointed!\n\nHhhhm, I am not sure why someone voted this review as \"Funny.\" Strange.",
            "author": "Lauren D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-09-23",
            "description": "I really like this farmers market. I don't feel overwhelmed with selection as I do at other farmers markets (not that I'm knocking you Daley Plaza, but sometimes I just leave with an apple because there are too many varieties of all produce) and there is a neighborhood feel to this farmers market. I've been here 4 weeks in a row and several tents know who I am as they start reaching for the honey crisps and the sun burst tomatoes. \n\nThe prices are reasonable---I purchased slightly beat up honey crisps for $5 (I chose the second hand looking ones as they were $2 cheaper) and 1/2 pint of organic sunburst tomatoes for $2.50. \n\nIt can get crowded as it's on a narrow strip of Berwyn and many people bring strollers and/or dogs, so be aware of that before heading in. \n\nAlso, they have a token system in case you forget to bring cash (like me).",
            "author": "Kathryn F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-10",
            "description": "My apartment smells fabulous right now, because I'm slow roasting tomatoes from the farmers market. Because they were \"seconds\" -- some overripe, some bruised, none perfect -- I got a 10 lb bag for 5 bucks. That's cheaper than The Jewels.\n\nI've fallen hard for my local farmers market. It's not big, and there isn't the variety of some markets, but to quote Spencer Tracy in \"Pat and Mike,\" what's there is cherce.\n\nWhat is there? Well, the usual rundown of fruits and veggies, of course. Apples are coming in, and the beloved honey crisps are everywhere. ($5/qt, which in my case was 7 apples, which is much better than The Jewels.) Though I'm a little put off by the winter squash. Too soon! \n\nBut it's the non F&V stuff I tend to buy here. Great breads - if a little pricey - from Bennison's. Amazing fresh and aged cheeses from Brunkow Cheese in Wisconsin. They have a raw milk white cheddar and horseradish spread that is amazing. And an aged cheddar that is one of the best things I've ever put in my mouth. And you know there's a lot of competition there. Preserves from Rare Bird which include - are you sitting down? - strawberry chocolate. And so much more. Infused vinegars, herb rubs, fresh eggs, fresh pasta. Goat meat! Krsna, are you listening?\n\nOf course, most of this stuff isn't cheap. Sure, there are bargains like the tomatoes and apples, but the eggs are $4.50 a dozen. But a half pound of 6 year aged cheddar for 12 bucks is more satisfying than a pound and a half from Kraft for the same price. Go for it.\n\nThe market must be doing well, because it has been extended until Oct. 7. (Originally, Sept 9 was going to be the last day.) Hours are now 3 to 7. I assume this means they'll be back next year. Which is good news for all of us.",
            "author": "John B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-09-07",
            "description": "This farmer's market is friendly, convenient, and has so many wonderful local and organic options.  The only downside is that it is very small.  If you can find whatever it is that you are looking for on the block between Clark and Ashland, then this is an excellent option.\n\nMore so than other Farmers Markets that I have been to, this one hosts many vendors who do more than just raw goods.  You can usually find artisan bread, cheeses, tofu, pastries, and other local creations.  This is nice if you're trying to put together an entire meal from the market without rounding out your shopping list at a large supermarket.\n\nSome of the vendors can be a bit pricey... that's the cost of quality products.  Fortunately many are becoming credit-card friendly and if you should need cash there is a US Bank with an ATM just up the street.",
            "author": "Alex B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-10-08",
            "description": "Fantastic! Any time I want to spend $5 for a small jar of cheese spread, no scratch that . . . . any time I want to spend $5 for a small jar of SPREADABLE CRACK COCAINE, I'm coming to the AFM and Brunkow Cheese of Wisconsin (of course). Ohmyfreakinggawd. This stuff is so good, and they have a small hibachi on site, for grilled cheese curds. This cheesehead rejoiced. I was powerless, my wallet sprung open beyond my control.\n\nAlso great Concord grapes, and apple cider. What was priceless was procuring really healthy, delicious snacks (grapes and free samples) for a hungryish \"I want a snack!\" kid.\n\nGreat, small market in the best 'hood in Chicago. Pricey, but eh - every once in awhile, you have to indulge. Oh, and running into My Favorite Yelpers at the market? Priceless as well.",
            "author": "Erika G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-08-23",
            "description": "This is a great little farmers market that is being spoiled by inconsiderate patrons.\n\nPeople, please, it's a small area.  No, it's not OK if you run into me with your bike.  It's not OK if your dog gets startled in a small area and goes crazy.  It's not OK for yuppie mommy to assume that they have the right of way just because they're pushing around their little darling.\n\nGoing to have to agree with the previous poster in regards to the hassle created by inconsiderate people that don't have the common sense to a) lock bike on uncrowded street b) leave fido at home or c) be considerate and not use their stroller as a battering ram (it's just plain rude to use a stroller to nudge someone out of the way!).\n\nAs for the food, there is some great produce by a few vendors. It's nice to see Phoenix Bean have a stall.  There is meat/eggs available, however some vendors don't bring certain items because, as one vendor said tongue in cheek \"the Green City Market is the best and that's where they sell most of it\".\n\nPrices are a little high and you can tell that the vendors are setting prices together.  Coincidence that all vendors have the raspberries priced exactly the same?  I think not.  The convenience, in spite of the bad behavior demonstrated by selfish people, makes it worth the trip on Wednesdays.",
            "author": "Joe F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-18",
            "description": "Ok...Admittedly, maybe I'm just easy (when it comes to Farmers Markets), but I love this one.  Andersonville is a great area, the vendors are always super friendly, I meet fun people there, and they have go\n\nParking:  Street (meter) on Clark, but there are plenty of other options around (Ashland, Rascher, etc.) with free street parking in the neighborhood.\n\nGluten Free Friends:  They have yummy GF options too.  Side Note:  Right nearby is Andie's.  They now have GF Pita to go with the hummus!  ;)",
            "author": "Josh G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-11-17",
            "description": "Ah, the midweek highlight that is the farmers market! I miss it already. I only moved to the neighborhood in the late summer, so I can speak more to the fall offerings than spring or early summer. My favorites: Apple cider from Michigan. The beautiful name-your-price flower arrangements, run by the friendliest young women. Homemade caramels in the most delicious flavor combinations, like honey vanilla or rose. Halloumi cheese and tofu. Squid ink pasta. Samples GALORE. \n\nTake a few laps to compare prices, then dive in. Enjoy the live music, the dog friendliness, cheerful vendors, and best of all, the late operating hours.",
            "author": "Laura S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-09-19",
            "description": "I finally made it the whole 7 blocks away to this farmers market. \n\nAndersonville is technically a part of Edgewater, but let me tell you, this farmers market rips the pants off of the Edgewater market! It is no jealous sibling, but a hulking behemoth of wonder! \n\nWhat a slacker I have been for not making it here sooner!! Oh. My. GOD! \n\nThere must have been 7 or 8 stalls of fresh veggies. I have been craving tomatoes like a heroin/crack whore and supermarket tomatoes will not do it. I had to get my fix. And let me tell you, I have been nodding in tomato glory all week! They were not horridly expensive, and super wonderful!!! \n\nTHE CHEESE, oh, the CHEESE is to die for. I came home with some fresh mozzarella and a wonderful horseradish cheddar spread. Spread? you may be thinking- Yes, add a dab of this to noodles and you have the best darn Mac-n-Cheese that you can imagine! Add some mixed mushrooms from the vendor (10$ for a really full bag) and you are set for some of the best Mac and Cheese that you can imagine! \n\nMy mouth is watering just thinking about it again. I am going back this week, and next week, and every week until they close. \n\nYes, they do sell bakery items, ice cream, meats, you name it. But between the cheese, shrooms, and tomatoes, I am the happiest person you can find! \n\nI wish they would teach the Edgewater people how to do it. This is two blocks worth of stands, delicious, wonderful stands!",
            "author": "Danielle C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-09-19",
            "description": "The Andersonville Farmer's Market is great for your dosage of local-produce-warm-fuzzies for the week. It's conveniently located (right off Clark), which is nice, but it's a little small (no parking lot for these guys, they have to make do with the side street).\n\nI feel it's friendlier and more intimate than other farmers markets I've been to in the city. They have a nice selection of produce, and you can certainly get a lot of your weekly (healthy) grocery shopping here with fruits, vegetables, eggs, cheeses, tofu, pastries and more!",
            "author": "Caitlin B."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2011-09-03",
            "description": "I expect fresh produce at a farmers market not canned or jarred salsa. \nwhere's the fresh produce? Corn in a mesh bag? Get a clue, shop locally and buy the same stuff with out the outrageous mark up.",
            "author": "Allen R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-03-05",
            "description": "Great way to spend a summer evening! Andersonville is such a great neighborhood so you can venture out to shop or dine when you are finished shopping.  Great produce from local farmers is the perfect match.  From farm to your table is a great feeling.",
            "author": "Kathleen E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-05",
            "description": "I'm only able to make it here near the tail end of the market, which is unfortunate. They are open on Wednesdays from 3-7. \n\nObviously, it's a farmers market, so all the food there is generally what's available AT THIS TIME. It's all local-ish vendors, as well. \n\nIt's a nice market with nice vendors, but it's pricey. It's great supporting local farmers, but honestly, I wouldn't be here every week just because I can't afford to spend $30 on a few fruits and vegetables on a regular basis. \n\nGood quality stuff though. There were some SERIOUS blueberries last time I went. Super serious. And tomatoes. The tomatoes were superb.",
            "author": "Xenu M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-08",
            "description": "Hump Day only gets better during Andersonville summers. \n\nI adore this farmer's market most of all for the focaccia, berries & cherries, purple carrots, mushrooms, cave-aged cheeses, seasoned tofu, free samples. There is no need to buy your produce anywhere else during these months. \n\nYou can make a single twenty-dollar bill stretch for you, OR trade many more bills than that for some of the finest delicacies wo/man can naturally grow or produce.\n\nPlus they accept credit cards. Plus the vendors love dogs.",
            "author": "Laura W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-26",
            "description": "This is a nice addition to the neighborhood.  The vendors are friendly and there's a decent variety of organic meat, produce, and breads to purchase.  They even have knife sharpening while you shop!",
            "author": "Diana B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-24",
            "description": "Bread: $5\n\nCheese samples: $0\n\nTofu samples: $0\n\nAppreciating bright, colorful berries in the sun: $0\n\nSeeing lots of fine products, friendly people, and supporting local businesses and my neighborhood: priceless\n\nWhen you can give up a Saturday morning and take at least one or two legs of public transportation to get to a decent farmers market, knock yourself out.  For me and everyone else, this is my market.",
            "author": "KELLIE K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-11",
            "description": "I am in love with this market!! The bread and cheese people are sooo talented. I like that it's actually large and not deserted like the one in edgewater.",
            "author": "Jeanette S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-11",
            "description": "Is it Wednesday yet? Is it Wednesday YET (pants like a dog in anticipation)?!?!?! My tummy longs for the abundance of free samples and my eyes wish to feast on the all the super fresh veggies & fruit these farms have to offer. Oh and my wallet wishes to ache (yup ache) at being emptied at said farmers stands. You cannot see it, but I am doing the \"raising the roof\" gesture in my eagerness. \n\nOh boy, oh boy do I get excited about Farmers markets--I absolutely LOVE them. To me it is a treat to talk to the farmers who are ever so proud of their wares & they should be. Nothing like fresh, local and in most cases organic produce. Plus, (HELLO!) you get to try all the stuff. The extrovert that resides in this body loves the crowd as well, they all seem pretty happy to be there & there is nothing I love more than things that foster community. This one does not fail in that department. \n\nI have to give it up for the A-ville farmers market, each week it gets better & better (I do agree with Nick--John B needs to give this bad boy another chance). For their 1st year in operation, they are running a very swell market. More farms get added & the organizers are getting a wee bit better with their spacing of the booths. Plus, now some of the farmers take credit card (phew!) which is a nice plus since I do not like carrying lots of cash. \n\nNow, there are some bad things about the market as well: \n*it gets massively crowded (especially after 5pm since the after work crowd starts arriving). \n*You could possibly get run over by a child or run on over in your rush to get to a booth. The kids are everywhere--so watch out. \n*The booths cannot be on the sidewalk, so it can be tough to maneuver around the market. Prepared to be jostled--that is the way it goes folks. \n\nI do look forward to this every week & highly recommend you check it out if you need some produce midweek and like Kelli said--especially if getting up early on a Saturday morning is not your thing.",
            "author": "Unity O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-10-08",
            "description": "I was walking down Clark St. on the hunt for post-work beer and not wanting to venture from my hood, and I happened across the farmers market. \n\nDid I NEED salsa? Nope. Did I NEED two types of grapes? Nope! Did I need bread? Nuh-unh! Did I NEED corn or apples? Well, I'm sure they're productive to a healthy diet....but no! And no, I didn't know what Kombucha even was before yesterday. \n\nAnd yet, there I was, 30 minutes later, hobbling back to my apartment with my hands full of bags of random produce. \n\nNever even got my beer. Had Kombucha instead.",
            "author": "Iman W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-06",
            "description": "Uh....YUM!  \n\nThere were samples everywhere!  And they worked because we left with bags and bags of goods, that's for sure!  \n\nTofu, tea, cheese, and fruit samples galore! \n\nWe were serenaded by some kiddos sing-a-long much to my ears disgust....but guess you have to make it a family affair!\n\nThis is a great little market that is perfect for the after work crowd.  For that mid-week time where the produce you purchased on Saturday is no longer looking to pretty, or just gone altogether!\n\nThe cheese man will be my new best friend and I love John B. for pointing him out in particular.  \n\nEveryone was so nice in explaining their products.  It was a great neighborhood market.  Although a bit cramped, especially with strollers and dogs everywhere.  If only all the booths could move back a foot, then I wouldn't feel like I was running into everyone with my backpack.\n\nWill be back again that's for sure.  And the fact that I have farm fresh produce in my fridge on a Thursday is wonderful!  What a great ending to a work hump-day!",
            "author": "Lindsay S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-05",
            "description": "Breads and jams and veggies and cheese oh my!!\n\nAndersonville Farmers Market is great. I love how many tents have food samples to try. Seriously, because of this I probably bought more than I should...well played! It's smaller than some markets, but has most everything you need. You could def make a meal with everything here, plus a few extras. \n\nIt's Wednesdays from 3-8 so it's nice that I can go over after work. They even have live music! This will now be my go-to market for the summer!",
            "author": "Rachel D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-24",
            "description": "I think Mr John B. should give this Market another chance!! Though I do agree with him on the idiots that think bringing their double wide (but have only one kid) strollers is a good idea. \n\nEven at 6pm the tables were full of all kinds of delicious treats. Fresh fruits and vegetables, cheese (which I couldn't get enough of the samples... sorry), even some unique items like soap, dried herbs, and infused vinegars. Jarred goods galore, meats, and breads filled my eyes... note to self don't go hungry. All in all I walked away with a bottle of dill infused vinegar, a Santa Fe herb rub, zucchini and some squash. The best part is that it only cost me $12 dollars.\n\nI like to also mention that each and every both had the nicest people selling their product. This would normally give it five stars but it really was a pain to get in and out. If you have the time check it out for yourself.\n\n*** They also selling potted herbs so you can grow your own at home, well worth it for someone who cooks a lot.",
            "author": "Nick M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-08",
            "description": "You can't beat the hours at this farmer's market - 3-9 for the working man.  Add in Phoenix Tofu w/the amazing tofu noodles for a few bucks, the stand that sells garlic dip to die for, lots of fresh produce, and music to accompany your buying frenzy = best way to spend an hour on a Wednesday.  I look forward to it every week!",
            "author": "MarBear F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-14",
            "description": "My neighborhood farmer's market.  Not only is there a great selection of produce, but you can also find delicious fresh baked bread, artisan cheeses, meats, fresh eggs, and tons of other goodies.",
            "author": "Jesselyn E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-16",
            "description": "I've vowed to go to this wonderful farmer's market every Wednesday from now on.  I love it!!  The fruit is so sweet, juicy, and amazing that we finish it within 2 days.  The cheese spreads and breads are also delicious!  I've recently purchased an asiago-garlic loaf from Bennison's and it was soooo good....melted asiago cheese and chunks of garlic!  I'm so tempted to buy so many things from this market, but I'll just do it little by little and try something new every week.",
            "author": "iddells E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-10-27",
            "description": "I am new to Farmers Markets, but I Love the one in Andersonville on Wednesdays! There is a great selection of Vendors with all sorts of produce, fresh bakery items ect... They also have live musicians playing which really enhances the experience as well. I will definitely be a regular here.",
            "author": "Lara M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-09-17",
            "description": "as i write this, i'm eating a breakfast of cherry vanilla bean granola, fresh red raspberries, perfectly ripe peaches, and vanilla yogurt.  i know you're jealous, but don't worry!  you can have it all too!  all you have to do is go to the andersonville farmers market.\n\nit really rocked my world.  tons of amazing produce and handmade concoctions.  i loved the balance of fruits, veggies, breads, meat, cheeses, desserts, and even kombucha and ice cream!  also, they have a spot set up for local musician groups to play music, and a puppet show across the street.  i realize the puppet show is for kiddies, but i was thoroughly entertained.\n\ni thought i'd died and gone to heaven, until i checked my empty wallet.  it's a leetle pricey, but the quality is far above and beyond the store that it's worth it.  the only thing i didn't like was that i just found out about it a week ago!  ack!  must make up an entire summer's worth of farmers-marketing in the next couple weeks!  which should be simple, given that it runs from 3pm-8pm on wednesdays.  nice!",
            "author": "Sarah M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-07",
            "description": "Love the hours, love the produce, jams, breads, ice cream, meats, juices, granolas...",
            "author": "Dina I."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-11-08",
            "description": "One of the best farmers markets in the city. Great variety of vendors from veggies and fruit to tofu and grass-fed beef. It's nice that this market is in the evening and more relaxed than crowded Saturday farmers markets.",
            "author": "Jennifer W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-21",
            "description": "Andersonvill'es Farmers Market is back on Wednesdays from 3pm - 6pm, but get there before 5 or things will be sold out.   Today's haul:  green beans, ginger rhubarb preserves, pork polish sausage, chocolate basil ice cream, blueberries, raspberries, tomatoes, cucumber, a loaf of challah and corn.  All produce comes from nearby small family farms, and other goods are all local (within 90 miles).  \nYes, you may be able to get it a little cheaper at the Jewel, but you won't match the taste of fresh local produce.  Bring lots of singles (dollar bills), your own bag for your haul and have a blast.",
            "author": "joe d."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-09-28",
            "description": "Great place.  The staff works hard to make it very enjoyable and I love the samples.",
            "author": "George B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-22",
            "description": "This review is specifically for one of the Andersonville Farmer's Market vendors, Videnovich Farms. I just moved to the neighborhood this winter, and I'd really been looking forward to the farmers' market. It's been a busy summer, so I don't get to go as much as I'd like to, but the 2 times I've been so far, I've stopped at the Videnovich Farms stand, and both times it was my favorite vendor to stop at. I believe the person at the stand is Vera, and she's just awesome. She's a very personable person, she's quick with a smile, and she seems to really enjoy letting people know about her farm, the vegetables, and, the most interesting part, the yarn. Her farm has sheep and she creates skein's of wool that she hand-spins. She leaves the wool in its natural shades, and it's amazing the variety of shades the wool naturally comes in. She also dyes some of them using flowers, plants, etc, creating beautiful colors. Another great thing about Vera's stand are the smells! She's got cinnamon basil, lavender, and other things that smell so good. I felt like I was transported to the farm in Michigan. Part of what I enjoy about going to my local farmers' market is the opportunity to socialize and to interact with vendors. Vera, of Videnovich Farms, really seems to have quite a flair for talking with market goers with a friendly demeanor and a knack for providing information about her wares. I'm definitely thinking about buying some beautiful yarn from Vera and making a scarf, or giving a skein of yarn to a knitter-friend. I definitely recommend checking out her stand, at least to experience the evocative scents, or even a little chat, and, who knows, maybe you'll even end up taking home some lavender, yarn, or a pepper.",
            "author": "Jason S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-08-19",
            "description": "I love the farmers market! I would highly recommend Videnovich Farms.  We have purchased their CSA box which we pick up each week at the market and have not been disappointed.",
            "author": "Candace S."
        }
    ],
    "priceRange": "$$",
    "name": "Andersonville Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "Clark St And Berwyn Ave",
        "postalCode": "60640",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RSBZgfu4peqyxu_Bh95V-Q/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17737282995"
}