{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 2.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-14",
            "description": "I love the Arlington Heights Farmers Market! It gets better year after year. Our whole family goes together and even our 5 year old has his staples! He always get his giant chocolate chip cookie from one of the bakers. I head over to another stand and get my homemade poptart. Oh. My. Goodness. So good! I saw other reviews saying things were expensive but they weren't at all. That's not what I found. The vendor selection has increased every year too. Oh and we get farm fresh eggs, pork chops, grass fed beef and for a lot less than the grocery store. Every week I leave with something extra, whether it's a jelly from, or essential oils related, or just some extra veggies, I am always happy. We look forward to our Saturday mornings and even better, the nights because we get to make what we bought. Thumbs up from us!",
            "author": "K B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-07-02",
            "description": "I was pretty bummed this last weekend when I went to check out the AH Farmers Market with a gal-pal.  It was really small, and really expensive!\n\nThere were a few vendors that had a wide array of produce, but the prices were just astronomical... I couldn't see myself shelling out between $4-6 per pound for tomatoes that I could go over to Mariano's and get, just as local, for half the price.  Sweet corn too, holy cow, I think it was $3 for 5?  No thanks.\n\nWe did a walk through and neither of us decided to purchase anything, due to the high prices.  Maybe later in the season things will be better, or maybe this just isn't the right farmers market to hit.  I'm not quite sure.\n\nBummer.",
            "author": "Valerie D."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-06-09",
            "description": "You would think that Arlington Heights would have more offerings at the local farmers market, however the two times I went there were not very good produce options and People selling other things, but not competitively priced with any store or fresh market. I dont go to the farmers market to buy Soap bars or lip balm or spaghetti sauce... I asked two farmers if they have anything organic or free of chemicals and one basically laughed at me while he said no and the other one rudely said \"You wont find ANY organic food around here.\" Come on arlington heights, you have idle free zones and brag about trying to better the environment and yet you dont have any organic or chemical free produce at your dinky farmers market?! Very disappointing.",
            "author": "Katie Z."
        }
    ],
    "priceRange": "$",
    "name": "Arlington Heights Farmers Market",
    "address": {
        "addressLocality": "Arlington Heights",
        "addressRegion": "IL",
        "streetAddress": "110 W Fremont",
        "postalCode": "60004",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/uyhjSThUEXtgspUwBRXQtA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18472551225"
}