{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-18",
            "description": "Excellent farmers market on Saturday mornings. Variety of shops including breads, bakeries, fresh fruits and veggies from farm stands, soap and home goods, live music, balsamic vinegar and olive oil stand, and more. The icing on the cake: live cooking demonstration from Gaetano's restaurant in Batavia. \n\nWe picked up a bottle of fig balsamic, fresh made sausage from Gaetano's and some other goodies!!",
            "author": "Olivia B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-07-28",
            "description": "Yelp has the wrong location. See the website Market has tons of vendors, but few farmers. There are smoothies and vita drinks, essential oils and soaps, meat and bread. For produce I 'll go somewhere else.",
            "author": "Karen B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-02-01",
            "description": "A fun place to spend a Saturday morning! While you can park downtown, I like to go for a morning run or walk with the dog and poke through on our way. From breakfast tacos to smoothies to fresh breads and more, there is always something tasty to treat yourself with.",
            "author": "Jocelyn R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-11-20",
            "description": "Batfest, Art in Your Eye, Batavia Farmers Market, Cocktails in the Park, Batavia Block Party, Artisan Collective, Community Garder, Project Mosaic - over 50 events each year that helps make our community special.",
            "author": "Rob H."
        }
    ],
    "priceRange": "$",
    "name": "Batavia Farmers Market",
    "address": {
        "addressLocality": "Batavia",
        "addressRegion": "IL",
        "streetAddress": "4 1/2 W Wilson St",
        "postalCode": "60510",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Dm_8pfDpT-8fKVWZy59WQg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16307613528"
}