{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-13",
            "description": "Went to Boggios for the first time yesterday, with five kids (4, 12 and three 9 year olds).  We were very impressed - very clean and lots of things to do for all the kids. They loved the jumping pillow and the Ye Olde Mine Shaft, pedal cars and the tree house slide. The little one really enjoyed the \"corn\" box. \n\nWe took a hay rack ride out to the pumpkin fields and found a great variety of pumpkins and gourds. The prices were fantastic. We bought three good sizes pumpkins and a few small plus a few gourds for just $10. \n\nWe also had hot apple cider, kettle corn and some of the best apple cider donuts (still warm!). \n\nBoggios was a great value!",
            "author": "Nikki K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-12",
            "description": "Great little orchard! Workers are very friendly. Good selection of produce and baked goods. Lots of animals for the kids to feed. Nice park to play on.",
            "author": "Emily B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-05",
            "description": "Great little orchard with petting zoo and farm fresh vegetables and food. People are very nice, friendly and helpful. \n\nThe corn maze is fun and there's a huge playground for kids. \n\nA good time. You'll love it here. I will return if ever in the area again. \n\nDon't miss their apple cider donuts. They're amazing.",
            "author": "Arthur M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-10-22",
            "description": "This is a happening place! Bus loads of kids, pumpkins, gourds, corn, apples - very nice! The inside of the main building has a fudgery and bakery in the back, which makes some awesome looking apple cider donuts (which my mother in law loves). The husband and I wanted some pumpkins to take home back to Indiana so we braved the freezing cold quickly picked out a few big, nice pumpkins. The prices are really reasonable for an orchard type place. Each of our big pumpkins was $6 - and they all had prices written on the tops (no weighing by the pound). The inside of the main building also is full of canned goods - preserves, pickled items, BBQ, and sauces. Be a great place to pick up some holiday gifts! Grandma got a big bag of apples for baking, so she was pleased.  Boggios is super fun - just wish the weather hadn't been so cold when we went!",
            "author": "Ronee B."
        }
    ],
    "priceRange": "$$",
    "name": "Boggio Little Mountain Orchard",
    "address": {
        "addressLocality": "Granville",
        "addressRegion": "IL",
        "streetAddress": "12087 Hwy 71",
        "postalCode": "61326",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y-EegLm11cKOyXISbC5DTw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18153392245"
}