{
    "aggregateRating": {
        "reviewCount": 7,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-01",
            "description": "I was excited to read about this in the Bridgeport newspaper. So I came here on Sunday. I woke up kinda late, so I got here at like 12ish, and they close around 1pm. I didnt see many vendors there, but that could've been cuz I went so late. I did see plenty of fresh fruits, veggies, salsa, tomato sauce, honey, pastries and cheese for sale. I bought some cheese from Brunkow Cheese out of Wisconsin. It was the best cheese ever. I got a bag of cheese curds, oven baked cheese, horseradish chedder cheese spread, and Morel Mushroom cheese all for about 20 bucks. \n\nThey will be back again the last Sunday of September and October. So I will definitely go again, but earlier this time.",
            "author": "kiley w."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-07-16",
            "description": "Few stalls, expensive pickled vegetables in a jar selling for $10.00 and jar has barely any vegetables in it! I ended up buying tomatoes and avocado.",
            "author": "Bonnie G."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-07-05",
            "description": "What the heck happened?  Last year, they ran the farmers market with no farmer.  This year, there's no market at all.",
            "author": "maurice s."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2011-04-03",
            "description": "I am a bit surprised about the 4-5 star reviews for the Bridgeport Farmers Market. There is (LITERALLY) like 5 stalls! Not the kind of Farmers Market you would walk away from not needing to go to the Supermarket and get the rest of the things you need. I supported the market this year, as I will again if they set up this year. However, there was not much to choose from and it was frustrating. \n\nIts nice that Bridgeport is starting to move forward and work towards having a functioning Farmers Market. I hope as the Market grows, I can come and edit this review in the future.",
            "author": "Nida K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-22",
            "description": "On September 28, 2013 7:00 a.m. to 1:00 p.m. the Bridgeport Farmer's Market located on the southwest corner of 35th and Wallace is \"Going to the Dogs\"!! Check out who is coming!! Microchip your pet, get a pet caricature, meet pups who are looking for a forever home, goody bags, coupon for free nail trim, raffles and more!! Stop by with your pup!!",
            "author": "Kitty O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-27",
            "description": "I was so thrilled to see the sign for the Bridgeport Farmers Market on my walk from the train. Naturally I was there bright and early Sunday to support. Looked like a decent amount of people were going. This beats lugging heavy produce home on the red line from the downtown markets.  Bought some fennel, zucchinis and salsa.",
            "author": "jim m."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-03-12",
            "description": "It was great to have somewhere close by to get farmers market basics.  I can't wait till they open again in the summer I definately plan to go more this year.",
            "author": "Julia K."
        }
    ],
    "priceRange": "$$",
    "name": "Bridgeport Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "35TH And Wallace",
        "postalCode": "60616",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/cJzgXVNLA2-R0JXq660nog/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}