{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-01",
            "description": "Over 40 years of feeding the community. The diversity of the food here is absolutely amazing from Scratch sodas to bread to green beans to peaches to pork to mint tea to tomatoes to Coffee to mushrooms to grass-fed beef to homemade noodles to chicken to eggs to an all gluten free bakery.  although only a couple Farmers are organic it is all local and you can talk to the person who grows it. If you are a people Watcher this is the place to be on Saturday mornings as there's a huge crowd",
            "author": "Aj B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-10-24",
            "description": "It seems to lack competition. I like what I have seen at larger markets for this reason (e.g., San Fran, Berkeley, etc.). I like being able to choose between several folks that sell the same stuff rather than having only one or two options. There are other farmers in the area, not sure why there is not more variety. \n\nIt makes sense why they use Farmer's Market rather than Farmers' Market. It really is a market of one \"farmer\" per particular fare.",
            "author": "Fritter M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-08-14",
            "description": "Opens at 8am (go early to get the best stuff!), I love to shop the local selection of fresh fruits and veggies.  The selection varies to what's in season - I just got some great peaches, corn and tomatoes.  I highly recommend heading out there - it's definitely worth waking up early for!",
            "author": "Melissa H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-10-01",
            "description": "Open every Saturday morning from April to November.  Great fruits, vegetables, as well as arts and crafts.  My fave thing  there is the sour dough bread made by some local Amish folks!!!",
            "author": "Marcy D."
        }
    ],
    "priceRange": "$",
    "name": "Carbondale Farmer’s Market",
    "address": {
        "addressLocality": "Carbondale",
        "addressRegion": "IL",
        "streetAddress": "Westen Mall Parking Lot\noff Route 13",
        "postalCode": "62901",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/M0kg7b_rEY6fup7nhUgf7Q/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}