{
    "aggregateRating": {
        "reviewCount": 6,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-08",
            "description": "Every year my wife, son and I go to pick apples here, and every year we have a blast.  \n\nIt is usually rainy, cold and wonderful as we slog through the dirt road along the rows of apple trees to the back of the orchard where we start to work our way back.  We have a system because by the time we get through a couple of rows, our half peck bag is almost full and heavy.\n\nThis is a great experience with your family and can lead to many a pie and baked apple treats in the following weeks.  \n\nThey have a little petting zoo for the kids, a hay maze and the worlds coolest idea, an apple sling where you launch over-ripe giant apples into a field to watch them explode with super-grossness.\n\nThe gift shop is chock full of treats, and there is a counter where you can get fresh baked apple items and cider donuts.\n\nIf you are looking for a family bonding experience, this is a great place to do it.",
            "author": "Kevin K."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-09-30",
            "description": "Once a year I enjoy taking my kids to get donuts at the orchard. This year we went back to Curran's. I requested a dozen warm donuts. The middle aged cashier looked at me as if I asked for an organ transplant on the spot. She went on about how they are 425 degrees and she can't serve them that hot. \n\nClearly, she wasn't listening to my request. Having worked a cash register in my first job years ago I'm always polite to folks dealing with the public. She said the next batch would be out in 20-30 minutes. \n\nI waited. Upon coming back to register she said the ones they had were as warm as they will get. They were room temperature. As I have a gluten issue, I don't eat flour. However, Apple donuts once a year are my guilt pleasure. It shouldn't be too much to get warm donuts (not 425 or 225 or even 125 degrees). Warm. \n\nIn summary I wasted a half hour for the same thing I wound up with anyways. Had my kids not been with me I would have left.  I guess I go to Edwards West next year.",
            "author": "Rockford R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-10-17",
            "description": "Great orchard, awesome picking selection. Cute pumpkin patch, some animals. Smaller than other places, but perfect for a nice afternoon trip. The best cider donuts around! You won't be disappointed!",
            "author": "Lea W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-10-05",
            "description": "Took a day trip out to rockford to visit the boyfriend's mom and I made him take me to this apple orchard.\n\nIt was a rainy day so we couldn't pick apples but we sure did buy stuff.\n\nThe shop is pretty small but definitely had plenty of apples for sale.\nI purchased a bag of honey crisp apples because their website stated they were delicious this season and it was true. Also grabbed a gallon of cider, some apple butter and a fresh made donut! Donuts are made fresh there. I actually watched the donuts being made. \n\nThe staff was pretty friendly and the shop was clean. They also had a mini animal farm and some other attractions but I did not take part in anything else because of the rain. \n\nIf I was in the area I would definitely go back to check out more of the farm.",
            "author": "rebecca s."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-29",
            "description": "The Cortland apples here are greeaaat for apple pies. Tasty and crisp! I also took some cider and fresh apple doughnuts to go.",
            "author": "Vanessa R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-28",
            "description": "This is A really nice Orchard it cost way less then the other orchard and it seems better quality the apples were huge I couldnt believe how big they were. I loved all the animals they had outside goats, chicken,pigs, sheep and 2 white turkeys. Inside it smells so good from the cider donuts  Upstairs they had some homemake soaps in soy candles. They even have A house for the bees you can really see the bees going down a pipe into this glass house it was worth the trip out here.",
            "author": "Mike A."
        }
    ],
    "priceRange": "$$",
    "name": "Curran’s Orchard",
    "address": {
        "addressLocality": "Rockford",
        "addressRegion": "IL",
        "streetAddress": "6385 Kilburn Ave",
        "postalCode": "61101",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/-280UCzwcWFVZ_Ax3CPoiA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18159637848"
}