{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-20",
            "description": "A great little place for little odd and ends that I need. Ok...eggs. I recently started buying \"nice\" eggs. I had been paying $4 for organic, cage-free eggs from Target, but found out there were 2 places nearby that sold eggs for a similar price. So why not get them from somewhere closer to my house?\n\nReasons to like this farm:\n1. They are guaranteed cage free...I mean, sure they're fenced in on the 1-2 acre lot, but I'd consider that cage-free. They're caged for their safety, not to take away their livelihood.\n2. It's very organized. Medium eggs are $2 per dozen, large eggs $3 per dozen, XL eggs $4 per dozen. I've seen other places where medium eggs, small eggs, and XL eggs are all in the same dozen and they charge $5. Not so at this place.\n3. You WILL be greeted by someone, whether it is Judy, Ed, or one of the two doggies. A big one and a little one. They are all very friendly (humans and dogs alike).\n4. The eggs are delicious! Once you start eating fresh eggs, it's really hard to go back to store-bought eggs. The yolks are richer and the eggs just taste better, in general.\n5. It's really easy. Pick up your eggs from the white fridge on the porch, put money in the box. Sure, it's on the honor system...but I'm guessing the types that get farm fresh eggs are most likely not the egg-robbing type.\n\nWe like this farm much more than that other \"local egg place\" in the area. Just because it's a little bit more price-graded, and the people are friendly. And they always have an abundance of eggs at Ed & Judie's. Very close to where I live, so I will continue to go to Ed & Judie's.",
            "author": "Caroline M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-12",
            "description": "Adorable and local, I really enjoyed my daughter being able to see the chickens! When we showed up Ed had just gotten back so w got to see him collect eggs from the hen houses! There were kittens there to play with everyone was sweet and helpful! Would definitely go back !",
            "author": "Lara S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-16",
            "description": "Best eggs in the area.  You really cant beat farm fresh eggs.  They sell all chicken egg types from small to jumbo.  I get the jumbo all the time and at $5.00 a dozen really good deal and real jumbo eggs.  They also sell duck eggs and locally produced honey from Sugar Grove. Cash only.",
            "author": "Dan T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-19",
            "description": "Love farm fresh eggs so I was willing to drive out here to get great eggs. It's all on the honor system so have cash with you. They also sell duck eggs and honey. Take a chance and try some duck eggs, great for baking!",
            "author": "M D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-29",
            "description": "We love Ed & Judie's. It's a great place to take the kids. They can experience a real farm with lots of chickens roaming around. Two friendly dogs are on the premises; one is quite large, but very friendly. We love the eggs! \nThe eggs are self-serve. Just open the side door to the house and pick out eggs from the refrigerator. \nIt's great! What a treasure for those in Aurora, Sugar Grove, etc. \nP.S. The eggs are quite affordable for being farm fresh and free range. A dozen eggs starts at $2.50.",
            "author": "Marissa A."
        }
    ],
    "priceRange": "$",
    "name": "Ed & Judie’s Egg Farm",
    "address": {
        "addressLocality": "Aurora",
        "addressRegion": "IL",
        "streetAddress": "6 S 2nd 60 Hankes Rd",
        "postalCode": "60506",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/iKIr8BpdYDX8QGE12DYWNQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16309070775"
}