{
    "aggregateRating": {
        "reviewCount": 10,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-10-11",
            "description": "All the same great stuff of the main Edward's Apple Orchard with only a fraction of the people. Please keep going to the other one so it's less crowded for me :)\n\nThe route there was under construction and had to detour around, but signs were well marked.",
            "author": "Keith W."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-11-11",
            "description": "Old lady in the store can use a lesson in customer service. My family came after harvest and first frost.  Since there were no apples on the trees we picked some up off the ground that weren't too brown and took a picture holding them. My son decided to continue eating his.  \n\nWe went into the store and walked around fo a while. I noticed the old lady eye balling my son as he walked around the store. Where ever he went her eyes went with a dirty look on her face. I thought it was strange but didn't think much of it.  They weren't busy so she didn't have much else to do I guess.  \n\nWe had about $140 worth of things from the store to buy when we went up to the registers.  There was on other customer behind us.  As we are walking up there was one other customer behind us. The young cashier that the old lady was talking to was very quick to ask us (before saying hello or anything else) was \"we noticed the little guy was snacking on an apple where did he get that from\".  Before I could even get my story out of my mouth the angry old lady was quick to reply (even though the customer behind me was at her counter) \"well then that will cost you $1 bc if everyone here did that we would have a huge problem!!! \".  It was in a very rude tone that she couldn't wait to get out all while she ignored the customers at her register.  \n\nIt wasn't the $1 she was wanting to charge me that was the issue.  I get what she was trying to say, although she could have used a different tone. If it was that big of an issue she could have addressed it when she first noticed it quietly not in front of other customers.  What bothers me here is how she eyeballed my son and my family the entire time and then waited until we got to the registers and says it very loudly in front of other customers that she was ignoring.  \n\nWe decided we didn't want to spend our money at a business that would employ such a poor employee and told them they can put back the $140 worth of items we would have bought had the old lady acted in a more professional manner about the issue.  Had she handled it correctly I would have happily handed over the $1 for the post harvest apple and completed my purchase.  \n\nIt's too bad this employee that needs a lesson in customer service has reunited my family's perception of all Edwards Apple Orchard locations and brands.  I have grown up going there and up until this day brought my kids there multiple times per year.",
            "author": "Alex R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-11",
            "description": "This is our absolute favorite orchard.  Always stock up on honeycrisp apples, the homemade honey and of course apple cider donuts.  Great family outing with many things to do for the kids.",
            "author": "Kevin W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-18",
            "description": "You can still get the same delicious apple cider donuts as the other location, so we were happy! Our three year old loved playing on the wooden train and school bus. It's a less crowded location and we enjoy going every year!",
            "author": "Alissa K."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2013-10-21",
            "description": "Not much here!  A couple of goats, lambs, chickens and turkeys.  That's the little farm.  The orchard is small.  When we arrived we saw that only one variety of apple was available for picking. Ok.  It's late in the season.  They have other varieties for sale in the barn.  We decided to check out the barn first.  Not much there either.  They do make fresh donuts which were great but besides that there were only a few overpriced items for sale.  We walked outside to see that they had closed the apple picking.  When we asked we were told they closed for the season.  It was only 4pm and there were plenty of apples on the trees but no luck.  I think the guy wanted to go home.  \n\nIn a half hour we saw everything and couldn't pick apples.  Also, no pets are allowed.  Not even leashed.  They have a picture of a dog standing in front of the barn on their website.  When you are actually standing there in front of the barn, there  are several signs that say \"No pets.\"  \n\nWith all the options available in the area, Edwards West is one to skip.",
            "author": "Edward W."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-05-30",
            "description": "This place is awful. They're all rude and they get mad over nothing. I'm only giving it 2 for there being Applejack plushes. Also, not worth the price. The slushies were tiny, and they were $3.00. Its ridiculous.",
            "author": "Ai C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-22",
            "description": "Smaller version of Poplar Grove but much less busy. I LOVE the apple cider slushes and the other location does not have them. They also have corn kernel sensory areas and a cool little school house and tractors to sit on.",
            "author": "Lindsey G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-04",
            "description": "Have been here a few years in a row and always have a great time.  Apples are delicious as are the donuts!  Love the animals on the property.  Only problem is you have to buy a huge bag of apples in order to pick- you aren't allowed to pick in smaller quantities.",
            "author": "Michelle O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-10-23",
            "description": "I took my children here when the season first started and it was our first time visiting West - They did not have any animals but a few goats - but i understood that they were just get ready for the season. Great donuts as usually and cute gift shop. My children enjoyed playing with the corn in the silos. Only bad thing that happened was one of their dogs ate my sons donut out of his hands",
            "author": "Jennifer E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-10-21",
            "description": "This family Fall day trip never disapoints.  Even my college aged girls love the day out and there are always lots of young families running around enjoying themselves.",
            "author": "Doug K."
        }
    ],
    "priceRange": "$$",
    "name": "Edwards Apple Orchard West",
    "address": {
        "addressLocality": "Winnebago",
        "addressRegion": "IL",
        "streetAddress": "8218 Cemetery Rd",
        "postalCode": "61088",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/bHShC0h3pdYyppZRYUanRw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18159632261"
}