{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-08-24",
            "description": "Ok, I've been living in this city for over 3 years now...why have I not come here until now?! Mistakes have been made.\n\nLocated right by the library, this farmers market is open Saturday mornings June-October. They have all different vendors, mostly food, some are not. They have fresh fruits and veggies, plants, baked goods, olive oil, pasta/sauces, and much more! The vendors are very nice (some take only cash, some take credit as well). Everything is fairly priced. \n\nThey also have a DJ playing music in the background - nice touch! I loved it and I can't wait to go back.",
            "author": "Danielle S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-24",
            "description": "come and support your local farmers and local organizations --- and eat fresh fruits and vegetables --- different vendors each week, the group that made it are the ones who woke up early and were responsible enough to set up...the ones not present, are the ones who partied a little too much on Friday night!",
            "author": "Odranre B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-11-11",
            "description": "This is a great farmers market!  Tons of fun activities for children and families and everyone is very friendly. Quite a few great vendors, including vegetables, meat, and food producers.  They even have different events and themes each week, often times with an accompanied children's activity.  Looking forward to going back to this market in the spring with the family.",
            "author": "Jeremy A."
        }
    ],
    "priceRange": "$",
    "name": "Elk Grove Farmers Market",
    "address": {
        "addressLocality": "Elk Grove Village",
        "addressRegion": "IL",
        "streetAddress": "901 Wellington Ave",
        "postalCode": "60007",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/dszEfwhqiwx6xWlkV69dsQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16308787627"
}