{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-01-02",
            "description": "Great selection of fruit and vegetables. Always has a deal, if you buy  $5 you get free bananas every time I have been there.  The selection of flowers and plants for planting in the spring and early summer  is wide and varied. Has a small selection of wooden decor,  planters and yard swings.  Very friendly staff, like that they hire local youth to work there.",
            "author": "Wendy K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-08-06",
            "description": "This place was great. They were super super nice and they offered to let us sample anything we wanted. Fruit was decently priced. No complaints. I would come back in a heart beat.",
            "author": "Tony G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-02-18",
            "description": "My shopping buddy and I stopped by here on Friday because the sign said Asparagus $1.99.  I love thin asparagus---hate big old fat asparagus.  We were pleasantly surprised not only was the asparagus a great price but they had several other deals which could not be beat.  I bought romaine and red leaf lettuce for 99¢/lb!!  Amazing.  They had several orange like fruits which I had not tried before- one was a tangelo, another began with M--both were very good.  They also carried some local products- greek yogurt from a nearby dairy, sausagesand processed meats  from atleast two different processors- Wennemann's(St Libory) and Wessel's (Mascoutah).  I bought the greek yogurt for tsatsiki and garlic sausage from Wessel's to use with red cabbage.\nMy friend bought fruits, veggies and cherry juice.  Apparently cherry juice is touted to help arthritis.  There were two women working behind the counter.  They were both helpful and happy to offer samples of anything.  We will definitely be back.",
            "author": "Lyn C."
        }
    ],
    "priceRange": "$$",
    "name": "Farmers Market",
    "address": {
        "addressLocality": "Belleville",
        "addressRegion": "IL",
        "streetAddress": "500 N Illinois St",
        "postalCode": "62220",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kAYN3JAZPyvm6GxGNkmKNw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16182352445"
}