{
    "aggregateRating": {
        "reviewCount": 16,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2019-01-16",
            "description": "Great little local shop! They don't have everything, but I enjoy supporting local businesses.",
            "author": "Liz B."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2019-02-13",
            "description": "Let me start off by saying I was a customer of Farmer Pride Producers for over three years. I loved being able to have a local shop for amazingly fresh and organic produce. They also had a nicely run and affordable butchers section.\n\n A few months ago, the store was purchased by new owners and well, I would suggest never shopping there. The first time I went there after the transition I noticed a gnarly, almost kiddy litter like smell. The whole store smelled like it. I went to the freezer section to grab a pizza and noticed it was off. They owners were putting bags of ice at the bottom. The food was not even close to frozen. I asked the young woman who works the register where the owner was and she told me it was under new management.\n\nI then went to the butcher section and decided to see what was going on. I asked for a pre-packaged pack of chicken thighs and as soon as it was handed to me and I could smell it. The same thing happened to my roommate days after. I truly think its only a matter of time before someone gets sick eating their meat here.\n\nBut that wasn't all that changed. After passing on the chicken thighs, I decided to grab a can of Amy's soup since I didn't trust anything that was cooled or frozen in the store. I went to the register and she told me it was $3.99 plus tax for the can of soup. I laughed and walked out. \n\nThe old owners were as kind as could be and maintained an immaculate  store with the freshest of produce and meat. The new owners have turned the place into a horrible smelling, overpriced and an unfriendly store. It's a shame for us Logan Square residents. I really don't see this store lasting much longer.\n\nAvoid. Avoid. Avoid.",
            "author": "Seamus R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-08",
            "description": "Great little grocery store that has almost everything our family could need on a weekly basis. The wine and beer selection is amazing given their size, but that is certainly not the only good thing about Farmer's Pride. Fresh herbs, locally sourced fresh breads and coffee beans, kombucha, Kashi cereal, Ben and Jerry's ice cream, organic milk, free range eggs, multiple kinds of tortillas and sometimes even fresh tamales or baked goods by checkout. And the LaCroix variety is really top notch .  \nI've compared the prices to Mariano's with no noticeable difference so I try to come here whenever I can and support local.",
            "author": "Rachel M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-03-13",
            "description": "Farmer's Pride on Milwaukee is a gem of a grocery-far beyond any bodega or convenience store. I come here to do my weekly shopping for my family. Memo and his family and staff have done an exceptional job tailoring the inventory to the trends of the neighborhood. Riced cauliflower? Three kinds of kale? Organic and vegetarian options? It's all here, delivered by the most genial merchants in town. I feel good shopping locally, and supporting the business of a proprietor who truly listens to his customers and strives to exceed their expectations. If you live in Logan Square and still shop at the big chains give Farmer's Pride a second look.",
            "author": "Alex K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-02",
            "description": "First off, this place absolutely wins in the customer service department. We came one time looking for some vegetables and fresh bread. When I looked at the baguettes they carried, I noticed that they were all hard, and continued shopping deciding to get the fresh bread elsewhere. After we'd gotten most of the produce, the clerk came and asked if I was still looking for fresh bread as they'd just gotten a delivery from the bakery that makes their bread. I said yes, and he got a huge and lovely baguette. It smelled so good it was all I could do to not simply start gnawing on it right in the store (Because I'm really classy like that). He's also asked if there are specific things we'd like them to stock to let us know so that they can carry them. We're literally always greeted with a warm smile and a genuine hello.\n\nNow onto the selection... They have their own butcher onsite so the meat selection and quality is always top notch. For a relatively small grocer, the selection is really impressive. Bonus points that they generally always have cheap chicken along with excellent pork cuts and fish. We really like their salmon, which make gigantic fillets for us to Sous Vide. Their vegetable and herb selection are also pretty wide while still managing to be fresh. We didn't expect them to have fresh fennel for a fennel / apple salad, but they did. I've stopped going to Marianos for a lot of the cheeses as most of the nice sharp cheddars, mozzarella, or gouda they keep in stock for less money. It just doesn't make sense for me to shop anywhere else when Farmer's Pride Produce has everything we want, plus the things we don't even know we want for a reasonable price.\n\nLastly, this is a family owned place. I've met the owner, his wife, and at least one of his young daughters. I'm all about supporting local businesses vs big corporate stores so the money stays in the local economy. It just happens that the quality here trounces pretty much anything within a mile or two for a massive plus.\n\nCliff Notes: Shutup and take my money!",
            "author": "Jeff S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-01-18",
            "description": "My wife and I just moved to the neighborhood and this is the closest grocery store. Not the most attractive place on the outside, but we decided to give it a try. What a disaster. Filthy floors (rat droppings!!) and old rotten produce. We would have just left right then and there, but it we needed some basic things like eggs and milk and it was too cold outside to go somewhere else. All of their dairy items are way overpriced and a lot of it is expired. We won't be back.",
            "author": "Richard S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-12-07",
            "description": "I normally wouldn't write a review for what is essentially a bodega (not that there's anything wrong with that), but the staff here is so insanely pleasant and helpful that I often leave with a literal smile on my face. Beyond the great customer service, they have a great selection of food and drink, and make sure to pay attention to the small refrigerator right by the door when you walk in. They make their own salsas, and on the weekends they sell fresh homemade tamales as well. Long story short, this place massively overdelivers on the general concept of corner store. Go here if you live in the hood.",
            "author": "Adam S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-02-03",
            "description": "The owners/employees here are wonderful!  After only going in like twice, they told me to let them know if there was anything I'd like them to order. They are always super friendly, and quick to serve. Their prices might be a tiny bit higher than the regular grocery store, but certainly not by much, especially considering all the organic and high end products they offer. They always keep an eye on their produce to make sure it's fresh. The one time a product I purchased was unsatisfactory, they accepted the return with no trouble at all. I really hope they stay in the neighborhood .",
            "author": "Amanda O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-11",
            "description": "Very handy to the neighborhood.  Great selection of groceries, meats, and produce.  Good selection of organics.",
            "author": "Cynthia s."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-14",
            "description": "Couldn't love this place more! Excellent customer service and they have a remarkable selection. It's so well organized too. They always ask us if we found everything we needed and if we need them to order anything in. We go so often they greet us with smiles and \"good to see you again\". It's so nice to have a place that feels familiar and small town like that. I believe this is family run too. \n\nI also one time thought they had charged me the wrong amount, but had forgotten I had been in earlier that week and that was the amount posted to my cc. They called me back promptly and explained that they had charged me the right amount. Truly couldn't ask for a better little neighborhood market!",
            "author": "Joni W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-05",
            "description": "Fell in love with this place.  Great selection of meatless meats.  Staff always very friendly and eager to know if you find anything you need and if you are having a great day.  Vegetables are very fresh too.  I am very happy this grocer is only a few mins walk from my place.",
            "author": "Steve L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-14",
            "description": "I'm a huge fan of Memo's store. Has all of the essentials at a good price, and if they don't have it, Memo offers to get it for you. It's a great little grocery store with a surprisingly extensive beer section.",
            "author": "Alex M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-02",
            "description": "This place is a Godsend to the neighborhood. Quality produce, decent selection of meat, great coffee, all the fun ethnic things that come in jars and cans (for real, it's almost shocking how they seem to always have that one ingredient you need), D'amato's bread, organic items and now they have beer and wine too! Basically, I don't have to go to Mariano's or anywhere else unless I need a particular piece of meat, but they do have chicken and steaks (and boar's head stuff). Everyone go here so we make sure they stay in business please.",
            "author": "dan s."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-04-04",
            "description": "I live half a block away and have come here several times now looking for a single item or two to complete a meal. They have had everything I've ever needed-- from macaroni pasta to specific produce to lime juice. It's reasonably priced considering it's a small, independent store, and I love supporting them when I can. They also have a great selection of local beers and gluten free options. I'm always greeted and asked if I am looking for anything specific, and on top of all that, there's free parking in their small lot. Thank you-- I'll be back again and again :)",
            "author": "Anna Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-12",
            "description": "Impressed by the level of selection and low prices for a store that size.  Bought fresh chicken breast for $3.50 a pound.  The meat and the produce was great.  Definitely easier to go here than having to go all the way out to Mariano's or Whole Foods.",
            "author": "Andrew L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-01",
            "description": "Great addition to the neighborhood... used to shop at the Western Ave location.. Good prices and made to order butcher meat cuts and Boarshead deli meats at affordable prices ...",
            "author": "niko v."
        }
    ],
    "priceRange": "$",
    "name": "Farmer Pride Producers",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "2110 N Milwaukee Ave",
        "postalCode": "60647",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JIkcjAXMCGP8dLetOnhA1A/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17732524455"
}