{
    "aggregateRating": {
        "reviewCount": 11,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-01",
            "description": "Did you know they had a very cool Farmers Market in Belleville, IL? I didn't either. This place was fabulous. Awesome and extremely courteous staff. \n\nI love the setup at this Farmer's Market. It reminded me of an old country store (I'm not even old enough to remember a old country store). Product is setup on the back wall and you point to what you want and the wonderful courteous staff bags it up for you. \n\nThere was numerous miscellaneous items but the concentration at this Farmers Market was the produce.  The place was also very neat and clean. \n\nBottom Line: If you haven't been here, go! I loved it.",
            "author": "Jason R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-04-06",
            "description": "This farmers market is the best place to get fresh fruits and vegetables! It's more fresh than other grocery stores around the area including schnucks, diebergs, and fresh tyme! Whenever it's in season, the strawberries are so delicious and pineapple is super sweet.",
            "author": "Kimmy S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-12-09",
            "description": "The customer service here is great! I really don't think you could ask for better!\nThe even offer samples! I really appreciated that they let me taste test a few things that I wasn't sure about before I bought them. I thought their produce selection was high quality and the store was immaculately clean.\n\n My only disappointment is that they don't carry organic produce, except apples. Perhaps there isn't enough demand for it. If they ever do carry organic produce I will be there every week.",
            "author": "Lisa S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-26",
            "description": "Great place for fresh and inexpensive fruits and veggies. Additionally they have local products, like honey which is great for allergies. I tried their Gooey Butter cookies, they're amazing! So moist, they crumble in your hands. On top of all that, they're great with kids, they have a spin the banana which everyone is a winner and they get a free apple, banana or orange! You can really taste the difference from other store produce! They have the market crate too, but my family is too picky to eat all the veggies it comes with, but for $20 it's a great deal.",
            "author": "Amber K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-12-19",
            "description": "I love this place. I drive an hour every two weeks just to buy my produce here.  Everything is so fresh.",
            "author": "Abby S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-01-15",
            "description": "This review is for the* Fruit My Cube* and the* Market Crate*  A Farmer's Market in Belleville that delivers to your workplace.\n\nMy husband ordered these from his work place. They were delivered to his desk.\n\nThe Market Crate contained: 1 pint of strawberries\n                                               4 Clementines\n                                                1 Celery\n                                                1 Eggplant\n                                                1 Butternut Squash\n                                                2 Yams\n                                                1 head of Cauliflower\n                                                1 head of Iceberg Lettuce\n                                                4 Roma Tomatoes\n                                                1 pint of Mushrooms\n                                                1 package of Baby Carrots\n                                                1 large Sweet White Onion\n                                                1 bundle (3 spears) Broccoli\n                                                1 small bag Red Potatoes\n\nAll this packaged in a box and delivered to his work for $20. It even came with a recipe sheet for the Eggplant and the Squash. All the items were fresh and in great condition.\n\nHe also ordered the Fruit My Cube for only $5. He did not bring that home but reported that the fruit was excellent. \n\nThis produce comes from Belleville to your workplace. Check and see if your company is on the list. If so, I highly recommend you place an order. \n\nNow this is \"shopping local\" at it's finest!    http://www.fruitmycube.c....",
            "author": "Margo C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-12-15",
            "description": "IN SHORT: If you're buying produce in Belleville, you should be buying it here. They're also a great source for some other locally-produced items, and they give up to 10% of your purchase back to local schools or animal shelters.\n\nTHE WHOLE STORY: Most people in Belleville know about the greatness of the Farmer's Market (which has two locations - the main one on N Belt and the smaller one on Illinois Street and Lebanon Ave). It's quite simply a wonderful place to get fresh produce, run by people who are really passionate about selling it to you.\n\nThe layout of the store is a bit old-fashioned; most of the cold produce is behind the counter and you have to take a number and order what you want from the helpful staff. I've found it's important to specify what you want (size, color, condition, etc) to ensure you get the best choices available, but the staff is generally quite attentive to detail and will ensure you don't wind up with rotten fruit or veggies. They also are quite happy to make an exchange if something goes awry - I've taken slightly moldy fruit back in within a day or two of purchase and had no trouble getting a replacement item.\n\nThe selection isn't quite as vast as what you'll find at the supermarket, but the items available are top-notch. The name \"Farmer's Market\" is a bit of a misnomer if you're expecting this to be a store run by local farmers selling their own wares - they're definitely one step removed from production. But at the same time, the stores have multiple sources for their produce and often are buying direct from farmers for the best items. They also seem to have some priority in getting the best of the best from the distributors who are serving the supermarkets.\n\nThe Farmer's Market also operates two side businesses called FRUIT MY CUBE and MARKET CRATE, both of which offer astounding values. FRUIT MY CUBE is a delivery business where you can get fresh fruit delivered to your office or workplace, and the MARKET CRATE is a weekly value box that costs $20 but which often has $30-40 worth of produce inside.\n\nAside from the great service, wonderful product and excellent pricing, we really enjoy the fact that the Farmer's Market gives up to 10% of the proceeds from each sale to local schools and charities, including the Belleville Area Humane Society. All you have to do is sign up for their program and select the school or charity you want to have your proceeds go to. I'd recommend the Humane Society (#37, the most popular choice) unless you have a specific school to give back to. (Signing up gets you a card, but all you have to do is say, \"#37\" and they'll code your purchase towards the Humane Society.)\n\nIf I have one complaint, it's that the Farmer's Market has lousy weekday hours. I wish they were open a little bit later, because I often am just getting home from work as they're closing and have to save my runs to their store for the weekends. Still, they're worth the trouble; we love both of their stores and visit one or the other every week.",
            "author": "Sean J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-12",
            "description": "Love this place...they always are friendly and treat you well.  They have wonderful plants and great fresh produce!",
            "author": "April W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-10-09",
            "description": "What a great place to get fruit and vegetables. They even have some other products, like Bobby's Custard, baked goods, and other misc. things. A friendly staff. They even make it fun for the kids, have them ask to \"Spin the banana\". My wife's favorite is the Bobby's apples.",
            "author": "Scotty B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-02-15",
            "description": "My review is based on the Fruit My Cube service operated out of the Belleville Farmer's Market.  Check it out at www.fruitmycube.com.  \n\nBasically, it's a fruit delivery service.  You can sign up to receive a \"cube\" every week or just go one week at a time.  You get 16-18 pieces of fruit (or veggie chips which freaking rock!) delivered to your place of employ for $9.99.\n\nRight now, your business has to be signed up for delivery, but a lot of major St. Louis businesses are.  My employer has been signed up for a little over a month now, and I've order cubes 3 times now.  You get a ton of fruit for the price, and it's great to have the variety of healthy snacks at your disposal without having to lug them into the office on your own.  \n\nI did receive a bad orange in my first cube, but Rick was quick to get back to my concern and replaced the bad fruit the next week I ordered.  \n\nI love that you can preview the upcoming cube at the end of the week before, so you can decide if you want to order.  The special offer for chocolate covered strawberries for Valentine's Day were also divine!",
            "author": "Jean P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-30",
            "description": "Great local farmer's market!! I have been going here for years for all of my fresh fruits and vegetables. Just recently they started offering a Market Crate full of vegetables and fruits delivered to my door.  How cool is that!! Just like when my parents were kids.  When we go to the store, the kids love to place Spin the Banana. And some how they always win!  Great atmosphere, great service!  A throwback to the days of the past.",
            "author": "Melissa H."
        }
    ],
    "priceRange": "$",
    "name": "Farmer’s Market",
    "address": {
        "addressLocality": "Belleville",
        "addressRegion": "IL",
        "streetAddress": "1901 N Belt W",
        "postalCode": "62226",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/NeFBtUPpZiANhCPV0TTsjw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16182359500"
}