{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 2.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-06-18",
            "description": "The fresh cut watermelon was amazingly good!\n\nCrisp, fresh, sweet - hard to find in seedless watermelon but here it was. \n\nOther stuff they sell here like snacks and drinks seemed like ordinary selection except for a few things like chocolate.",
            "author": "Philip L."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-11-17",
            "description": "In an airport pinch you might think this is the place for an organic stop and healthy eatery but at closer look, it carries the same salads, sandwiches and chips as all the other airport places. I was disappointed. \n\nI got the chicken wrap and the hubby got the turkey Swiss sandwich. Both were past their prime and offered no relief from our hunger after a 2 hour delay. \n\nThe brownies, peppermint chocolate bark and other sweets looked amazing--and we planned to come back after the sandwiches--but we didn't since it was such a fail. \n\nI'd advise you try to something else when hanging around gate G1.",
            "author": "Nando R."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-12-21",
            "description": "The lady, sorry, woman, working here at 9:15pm on 12/20/15 was incredibly rude and disrespectful.  I walked up and she said \"We're closed.\" I said \"Oh okay.\" and before I had a chance to walk away she says \"Helloooooo.  We're CLOSED.\" People with this amount of contempt for strangers and potential customers should not be allowed to work in a setting requiring people skills.",
            "author": "Thijs D."
        }
    ],
    "priceRange": "$$",
    "name": "Farmers Market O’hare Urban Garden",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "10000 W O'Hare Ave\nO'Hare International Airport Terminal 2",
        "postalCode": "60666",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/9zjPdOEPtIv476Nuh--0OA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}