{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-24",
            "description": "I've purchased farm-fresh eggs from Frillman's Farm twice, and they are as good as it gets. They were laid that day, and are as good as any I've ever tasted. They also have fresh vegetables, which Tim takes to the Farmer's Market, and Honey from his own hives right there on the farm. You can't get any fresher produce or eggs than this.\nOn a side note, Tim and his family live right on the farm, and they are the nicest people. They were kind enough to show me the farm, and the bees (I'm a beekeeper myself), and all they had growing. All in all, I was very impressed with them.",
            "author": "Paul P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-08-06",
            "description": "Tim's fresh eggs are really great as is every other thing I've bought from him. Only three stars because the ability to actually purchase anything seems to be dependent on Tim's whim. Sometimes he will let you come over - must always call; no set hours - many times no answer or, \"No, not now.\"\n\nIt's a curious way to run a business and it's certainly his to run anyway he sees fit but I find it difficult to deal with this unreliable source of items I want to buy but often cannot.",
            "author": "Debra L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-02-27",
            "description": "The eggs are as good as I can get. I bake and breakfast on eggs. I know about eggs and have made a living on breakfast These don't get any fresher.",
            "author": "Alan S."
        }
    ],
    "priceRange": "$",
    "name": "Frillman’s Farm",
    "address": {
        "addressLocality": "Prairie View",
        "addressRegion": "IL",
        "streetAddress": "16737 W Aptakisic Rd",
        "postalCode": "60069",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qV6-g_j7gHp97RlegrrrTA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18472879950"
}