{
    "aggregateRating": {
        "reviewCount": 6,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-06",
            "description": "I've always been a cookie, candy, ice cream kinda girl until I recently discovered that I'm actually a closeted veggie lover. I actually had to google \"vegetable addiction\" to in fact make sure that I'm not in need of VA (and yes, Vegetable Addiction is a real thing.) Happy to report that I'm NOT an addict, just a lover of all things green. Ever since discovering my love for vegetables, I've been itching to make it to a farmers market. I was delighted when I discovered that there's one a few miles from me.\n\nNow as a disclosure, I've been to a Farmers Market in LA and Pittsburgh and those are 5 star destinations where you could find every single item imaginable. This market isn't even in the same caliber as you would find in a big city but for our small town, I think it's amazing! Here's what we ended up with:\n\n-2 zucchini and a squash (3 for $2.00.)\n-Hydroponic lettuce: My interest was piqued and I had to learn all about it upon hearing of hydroponic lettuce. Apparently, it's chemical free and grown in water. It comes attached to the bulb to ensure freshness. The gentleman at the booth said a customer told him it lasted 2 weeks in her fridge. (One head of Buttercrunch and one head of Romaine for $5.00 total.)\n-Two dozen farm-fresh eggs. My husband is the one that has to have the premium eggs. I like chickens and all but I don't have the same passion for eggs. He talked to the gentleman about the eggs and they are cage-free and as natural as eggs can get (Price was around $4.00/dozen for extra-large eggs.)\n-From the 'egg' vendor, we also bought some apricot butter. She had tons of different flavors of jams, jellies and butters so I know I'll be back. This was around $3.00 and I thought that was a steal.\n-Gluten-free baked goods from Four Flowers. I recently found out about FF -- she is a local baker that's passionate about making gluten-free goodies. I was skeptical, but dang they are absolutely AMAZING. The chocolate chip cookies were as soft as you'd expect from a baker using regular ingredients. The raspberry cheesecake bar was just as good.\n-Homemade olives from Olives 4 U. The guy was fantastic and let us try 3-4 different varieties. We ended up with the garlic tasting kind, but were equally impressed with the spicy olives. ($5 for small/$8.50 for large)\n\nI'd say that we had a pretty good run at the Market this morning and spent about $30. \n\nOther vendors that we saw but didn't buy anything from:\n\n-Homemade soap\n-Bull's BBQ\n-Nana's 2 Cakery\n-Martinez Tacos serving up tortas\n-Kettle Corn\n-A few other farms selling berries and veggies\n-Knife sharpener\n-Coffee/breakfast\n-Cheese guy (who I'm assured is amaaazing)\n-Pie lady selling full pies\n\nSome items were a little pricier than you would expect to pay at a mass grocery store but you're also supporting our community as well as a local farmer!\n\n(Also, sorry about my pictures. I deleted and fixed them to face the right way and they're still all upside down.)",
            "author": "Courtney C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-25",
            "description": "The Kankakee Farmers Market is a great surprise to downtown Kankakee.  I could not believe how many vendors were there!  I not only saw fruits and vegetables but also coffee, baked goods, honey, cheese, bread, pesto, flowers, artwork, and--my favorite--American egg rolls!  If you're looking for a lovely place to take a stroll, shop local, and try something new, then the Kankakee Farmers Market is just for you!",
            "author": "Allison F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-21",
            "description": "The Farmer's Market is a wonderful addition to our downtown. There is always live entertainment and plenty of vendors to choose from. Lots of vegetables and flowers, as well as baked goods, cheese, fresh honey, homemade pet treats, and spice mixtures. There is also a variety of prepared food of a good variety (Filipino, American egg rolls, Mexican, and the Creme of the Crop food truck). The market has a decent amount of seating, as well as carts for convenience. There is also a large lot as well as street parking, so parking isn't usually a huge problem. There's also an indoor bathroom courtesy of Grapes and Hops, which alleviates the worry of having to use a port-a-potty. All in all, the Farmer's Market is an excellent event and should definitely be checked out at least once, if not many times.",
            "author": "Samantha E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-12-08",
            "description": "This farmers market rocks.  I love it here.  I have been to probably 6 markets and this is the best by far.  It is a well run operation that has shopping carts which most markets are missing.  The choice of all the local products is amazing.   Always a crowd but not crowded.",
            "author": "Mat S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-14",
            "description": "Good market! Gets a little bigger every year. Special events and entertainment each week. The selection gets pretty good once the season is underway. The beginning of the season is full of the same stuff you'd find in any grocery store. I would love to see more organic offerings. Prices get better once the home grown items make their way to the stands. There are several prepared foods vendors with some unique and delicious options. The best part is talking to the farmers. Some of these folks have a real passion for what they do. It's always a good thing to know where your food comes from.",
            "author": "Brian B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2015-07-18",
            "description": "Not much produce here at all, at any time of year. Mostly just fair type foods. I check it out a few times each year but I don't think I'll go back anymore.",
            "author": "Nick S."
        }
    ],
    "priceRange": null,
    "name": "Kankakee Farmer’s Market",
    "address": {
        "addressLocality": "Kankakee",
        "addressRegion": "IL",
        "streetAddress": "Schuyler Ave",
        "postalCode": "60901",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/bblYNRjoXWxzxQuOWEqV6g/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18159330462"
}