{
    "aggregateRating": {
        "reviewCount": 1,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-08-31",
            "description": "During the summer, there's this produce truck that parks on the east side of Kedzie, just south of Ainslie Street. Damn, let me tell you...\n\nThey carry some of the best fruits and vegetables you can find in the city, and charge far less for them than your typical farmer's market. I'm guessing the produce is not organic but I just bought some peaches that were orgasmic, so...\n\nThese Michigan peaches were:\n1) Huge\nIf you're of normal proportions, make a fist. Now slightly relax your fingers...yup, that big.\n\n2) Firm\n3) Juicy\n4) Fragrant\n5) Sweet\n6) Beautiful\n\nThe prices aren't rock bottom like at Stanley's, for example, but the value for your money is very high. The peaches were $1.50/lb. but I ate every single one of them within a couple of days, a record for me. And to the very end they were nowhere close to being rotten, unlike 2-day-old fruit from You Know Where.\n\nThere's also an assortment of apples, grapes, watermelons, yellow and purple plums, all looking very healthy. Then there are vegetables like green beans without a speck of blight, peppers so brilliantly orange they could be used to direct air traffic, and aubergines that could suck you into their deep purple vastnesses.\n\nThey can't match most supermarkets in variety and volume, but they trump most of them in quality. They also set out a bucket of flowers so you can pick up a spray to surprise your honey.\n\nI used to swear by the produce truck down by Little Clown Pizza in Avondale, but this one beats them with slaps to spare.\n\nSummer's not over yet. You know where to find them.",
            "author": "Paul W."
        }
    ],
    "priceRange": "$",
    "name": "Kedzie/Ainslie Produce Truck",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "Corner of Kedzie & Ainslie",
        "postalCode": "60625",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3JzJ6-oQY5DUbmqcnkTjfQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}