{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-04",
            "description": "I was driving by and saw the sign out for fresh sweetcorn, so I decided to check it out!  There was a big pile of corn ears on a table.  There were also plenty of bags available to put my corn into.  They also had a large bin near by where you could remove the outer leaves and corn silk.  (The Jewel doesn't do that for you!)  I liked this because I never really knew what to do with the outer covering when I clean corn at home. It's always such a messy job.  As an added plus, when you clean your corn there, you can examine the ears to make sure you don't get any that are either underdeveloped or have corn bores.  (None of my ears had anything wrong with them!) They also had fresh tomatoes, squash (yellow and Zucchini), string beans, large melons  and other fresh vegetables and fruit.   The girls at the checkout counter were friendly and quickly rang up my order.  \nThey also had a large assortment of jams, local honey and canned vegetable available along with olive oils and other condiments.  (I didn't need any of those so I can't comment on their quality, but they looked good!\nThis is definitely a local gem that I will be stopping at again as the summer progresses.",
            "author": "R F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-08",
            "description": "They have the best sweet corn, hands down! I only buy my corn here and go frequently to purchase it, fresh out of the fields. I also buy a lot of their fresh produce, and started buying the jars of cherry pie mix which made the best cherry pie I've ever had. I buy my flower and vegetable plants here every spring. They have a big variety, and it's so easy to shop in their greenhouse. Very friendly employees. This is a must-try if only for the sweet corn!",
            "author": "Susan E."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-08-25",
            "description": "I'm not sure what I had expected coming into this place.  For some reason I had grandious visions of fresh fruits and vegetables piled to the eaves.  For that I was let down.  However, the small amounts of produce that they did have looked so fresh and delicious.  They carry tables and tables of vine ripe tomatoes of many varieties.  They have an enormous table full of sweet corn that you can shuck right there in the stand.  They have a vast variety of canned items such as pumpkin butters and salsas and the like.  Buckets of onions.  Baskets of green beans, bell peppers, jalapenos, squash and zucchinis and more.  I was just expecting more quantity of each.  Granted I arrived around noon on a Sunday and I'm sure most of the product had been picked through and purchased already.  I was not too impressed with the prices either.  I purchased 8 green peppers, 3 cucumbers and 2 red onions and it was right around $11.  I'll be back.  I've heard phenomenal things about their sweet corn.  I'll be sure to get some next time.",
            "author": "Kerry B."
        }
    ],
    "priceRange": "$$",
    "name": "Keller’s Farmstand",
    "address": {
        "addressLocality": "Plainfield",
        "addressRegion": "IL",
        "streetAddress": "15066 S Wallin Dr",
        "postalCode": "60544",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nr0LmAJ353juVuSVSRCzUA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18154390420"
}