{
    "aggregateRating": {
        "reviewCount": 9,
        "@type": "AggregateRating",
        "ratingValue": 2.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-24",
            "description": "You have to PHONE FIRST or check Knuston's FB page for berry, apple and peach availability. They grow their strawberries hydroponically so you don't have to dig around dirt, bugs and bushes BUT they do run out especially when they get a lot of people picking over the weekend and it takes a few days for more berries to grow and be available for picking. Strawberries are available thru early Sept. \n\nWe've been going to Knutson's for several years now. The strawberries are delicious and it's easier for the kids to pick there than at other places where you have to pick off the vines. Their preserves, produce and honey are wonderful and well priced. We've only picked peaches once - it seems to trees are newish and maybe not fully mature. Also only got to pick apples once but IL has had poor Spring weather these past years and apple harvests have suffered.\n\nThis is a very small family farm, not a huge corporate enterprise. The family is very nice. Their boys are friendly and hard working - shows my sons what they are missing out on! Sometimes there are barn kitties to play with which delights my daughter.",
            "author": "Laura M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-09-03",
            "description": "I was here a couple years ago.  Back then it was ok...nothing memorable.  This year was a bad experience.  We went for the u pick apples.  Called ahead and they said there was a good selection....especially the red delicious.  However, after entering the rows of apples we were so disappointed.  The apples looked diseased.  There was spots all over and we were not able to find one good apple.  There were also flies everywhere.  Very disappointing to say the least.  We will drive the extra 15 minutes to kuipers in Maple Park next time.",
            "author": "Christine C."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-08-09",
            "description": "This place is a joke. \n\nWe live 70 miles away and I emailed them on a Thursday to make sure they would have blueberries available for picking that Saturday. They assured me they would (Facebook page said it also).\n\nWe showed up about a half hour after opening. One other family is there. We came into the shop and said we wanted to pick blueberries and the kid working said they didn't have any to pick. I was very upset and then his mom came and said no, they had plenty.\n\nWe went out to the \"garden\".... Maybe 30 blueberry plants? All totally picked over. We were there for almost an hour and got a quarter pound of teeny tiny super sour blueberries. They kept offering their Acadia berries (very healthy but not tasty) and pointing out the tomatoes (I have my own).\n\nWhat's really sad is while we were trying to find berries, at least 5 more families showed up. What a bummer for everyone.\n\nWe went to the shop to pay for our berries. I bought a \"fresh baked cinnamon roll\" that was dry and frozen in the middle. Also bought a bag of frozen blueberries. \n\n\nOn the way out, I stepped on some kind of dead rodent, a present from one of the many cats wandering around.\n\nAnd to top all of it off?? The frozen blueberries were so sour, I had to throw them out.\n\nSo I wasted 4 hours and a half tank of gas. Disappointed little girl and pissed off husband. Never again. Don't advertise a product you don't have!!",
            "author": "Katie M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2013-07-21",
            "description": "My principle disappointment was that I had expected that they didn't use pesticides (based upon another website ... not theirs).  I fully expect they are more responsible than the vast majority of commercial farmers selling to supermarkets.\n\nThe staff was nice and quite helpful.  The honeybee display in the country store was excellent.  The blueberries, cucumber, peas, and green beans looked very good.  The blueberries and honey were good (and we were there the week after their annual blueberry festival).  The only other thing we tried were the blackberries.  They were OK but weren't at the peak of their season.",
            "author": "James W."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-08-23",
            "description": "We checked online before heading out to this orchard. It sounded promising - for the weekend, they had peaches, sweet corn, berries and such. We made the long drive and pulled up to an unassuming store with some fields nearby. It was pretty bare. Not much for sale. Maybe it was because we arrived on a Sunday, but when we inquired about peaches, we were directed to the tables where there were 3 small containers of peaches - that was it! No corn. We bought peaches ($2.50 a pound, pricey) and hoped they were good because there weren't any available to taste. There were some jams in squeeze bottles and some saltines. I tried the blueberry jam and it was tasty, but we didn't buy any. This orchard also has a U-pick option but we were only interested in Them-pick so I can't speak to that. I've been to other orchards and had a better in-store experience. My peaches aren't soft enough to eat 2 days later so I don't even know if they are any good. I'd suggest skipping this place and stopping instead at some roadside stands near Yorkville. Much better prices and quality.",
            "author": "Paula F."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2011-08-21",
            "description": "Very disappointed.  After looking for a u-pick farm somewhere close to the Chicago area to pick peaches, the website for this farm seemed perfect- highlighting that they offer u-pick rain/shine for fruit/herbs, a variety of vegetables, and different types of berries, pears and peaches.  After a 90 minute drive- my girlfriend and I arrived to the Knutson orchard and road/side store- our entire visit was managed by a young boy who explained the pricing, what was available for picking....a few herbs and slim pickings from various rows of vegetables- We asked about berries or peaches and he said they had none.  \n\nWe left after picking less than a pint of strawberries that we scraped together, obviously disappointed by our find.  What was equally discouraging was how little attention we were paid during our visit, as what I can only assume to be the farm owners sat chatting at a table as we entered remained seated as the young boy helped us.  \n\nIf this is supposed to be a family-owned and operated farm I saw no pride in it and would not return.\n\nNot to let the trip go to waste we found a fully \"stocked\" u-pick farm:\nhttp://www.gardenpatchfarms.com/",
            "author": "Sterling C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-05-28",
            "description": "I am a big consumer of raw honey and I recently got some of Knutson's honey from a friend. It was so delicious that I had her bring me a 5lb. tub, and after that  another. The honey is obviously not microfiltered, as I have seen bee debris in it and this tells me that the pollen and nutrients are not filtered out. This is exactly what I look for in honey, other than being local, tasty, and the tendency to become solid at cooler temperatures, indicating that it's raw. I will buy, as long as my friend will fly! Trying to find out if they will ship it, to make it when easier to get my paws on.",
            "author": "William B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2013-09-22",
            "description": "I took my 2 grandkids ages 5 and 7 to knutson's September 23 2013.  I thought what a great activity, the children get to see how apples grow, take them home make applesauce together.   \n\nThe staff was friendly, not too crowded.  The dwarf trees were a good height for the kids to pick from.  The apples were ok.  Hard to find apples that did not have scarring on them.  I don't know what the scars were from and doubt they effected the flavor, nutrition etc of the apples.  \n\nMy issue at the farm is sticker shock.  For 2 small buckets of apples (about 25 apples)  I was charged $34.00.   Definitely will not come back.",
            "author": "Nancy Y."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2013-09-22",
            "description": "DO NOT GO HERE!!!  I sure do hope people read my review before making the trip to Knutson's for Apples or peaches!  I was at first just going to pass the peaches off as being the end close to the end of the season, but after this experience, I feel this is probably the norm for this place.  I went there with a friend first off thinking there was a store there, which is the image that is portrayed in the website and FB page.  It is basically a u pick.  I am handicapped so I had the young man there pick me some peaches because the apples I wanted weren't going to be released until this weekend.  (I got home and the peaches were hard and the size of apricots, I let them ripen and they were very sour)  I asked if I could order some and she told me they would only be available for u pick and the only way they would pick them would be if I prepaid.  When I asked if I could prepay, I felt as if I was putting her out and she went and checked and said that I could but it would be 4.00/#.  I said OK and I really don't think she expected that response.  I wrote my name and number on a piece sf paper and asked for a receipt.  She told me I didn't need one that she would remember me and had my name written down. (What kind of business doesn't give a receipt?)  So the night before I went to pick up I read the FB page and it said they were available in their \"store\" only and NOT u pick and if you preordered, you would get them for 3.00/#.  So when I went into the store, They had bags of really nice looking apples all around, but when I asked for Chris, instead of her giving me 20.00 of the available apples, she grabbed a plastic bag and left the store.  When she came back in she put the bag on the table and the bag was tied in a tight knot so I didn't open it.  When I got home, I opened the bag and to my shock and dismay, the apples looked NOTHING like those in the store, in fact they looked like the throwaways!  There were 15 apples in the bag and 13 of the 15 were rotten with black holes and bruises with rotten spots.  I wish I could attach the picture I took of them!  My husband took the apples back the next day and they were very rude to him in front of all the other customers.  They accused us of taking out some apples, which why would we want them?  And told him the peaches were a week old (yes he took the peaches too because we were so upset)  They threw the peaches in the garbage and told him the apples were fine they were that way because they don't use pesticides.  Come on, how stupid do they think we are??  I SAW WHAT WAS IN THE BAGS IN THE STORE!  They refused to give him back the 20 and instead gave him back 15.20 after much resistance.  I guess this is our $5 lesson I learned.  Nice thing though, my husband said several people left empty handed after hearing this transpire.  People this crooked and rude should not be allowed to remain in business!   So please head my warning and STAY AWAY!!!  There are plenty of other orchards which are within a half an hour like Honey Hill Orchards of Kuiper's.  Take the drive and go there instead!  They both have stores with lots of item to be purchased and gorgeous apples as well!  And guess what, they DON'T use pesticides either!",
            "author": "Luvto T."
        }
    ],
    "priceRange": "$$",
    "name": "Knutson’s Country Harvest",
    "address": {
        "addressLocality": "Newark",
        "addressRegion": "IL",
        "streetAddress": "13550 Townhouse Rd",
        "postalCode": "60541",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/6syWFqgWJW5VOsIWIf2CLQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18156951491"
}