{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-03",
            "description": "The produce I've been getting here this summer has been better than anything I've found in the stores.  I love the longhorn tenderloin and cage-free chicken and eggs that I've gotten from the vendors.  The Market also has artisans peddling jewelry, chopping boards, dog treats, etc. that you won't find elsewhere.  \n\nIt seems like everyone who owns a dog comes to the Market with their dog(s).  So if you have a dog that likes shopping and being pet by strangers, bring it along.  Lots of the vendors have bowls of water set out for the four-legged Market patrons.",
            "author": "Mel G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-09-17",
            "description": "This market is perfect. They've got beautiful produce. Locally grown meat. And artists abound. Fresh pastry. Jams. Even resale items!  If you have a dog bring it here !!  Plenty of socializing opportunities. Be here. Saturday's.",
            "author": "Martin N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-23",
            "description": "I really love that Edwardsville has a weekly Farmer's Market from May to October.  There is such a variety of local products and services at the market and everybody is friendly.  I have gotten everything from delicious chocolates to homemade jewelry from the market.  It is a great place.  The only downfall is that I wish it could happen year around and they had an indoor place like the Soulard Market.",
            "author": "Emily H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-21",
            "description": "If you are an E'villian, this is a place to see and be seen on Saturday morn (we ran into EIGHT sets of friends); if you want to shop incognito, then wear sunglasses, pull down a ballcap real low, and walk briskly. But seriously, how can you NOT be a fan? There's fresh local produce, just-out-of-the oven baked goods, organic low-fat meats from area farms, convenient free parking, live music, and plenty of options for good coffee and/or a meal on Main St. before or after shopping. Today, in addition to produce, we picked up some smoky links and artisan cheese from Backyard Beef (http://www.backyardbeef.com/), and brats and beef from Wenneman Meat Co. (http://www.wenneman.com/). \"Queen's Scones\" was out of gluten-free by 9:30 a.m., but we were able to get on an e-mail list for the next batch. We even saw a local restaurateur picking out veggies. If it's good enough for the best dining establishment in town, then I want to shop there, too.",
            "author": "John H."
        }
    ],
    "priceRange": "$$",
    "name": "Land of Goshen Community Market",
    "address": {
        "addressLocality": "Edwardsville",
        "addressRegion": "IL",
        "streetAddress": "N. Main St. & St. Louis St.",
        "postalCode": "62025",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/vngmy6itjNRMT5itnTHChA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16183076045"
}