{
    "aggregateRating": {
        "reviewCount": 9,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-25",
            "description": "This is a great farmers market with a large selection of produce from several vendors, as well as some meat and dairy, and non-food items like bird seed and gift items.\n\nIt can get crowded and the location doesn't have a lot of great parking nearby - but the selection and prices are worth it.",
            "author": "Valerie D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-06-25",
            "description": "Whatever you do, if you bring your dog, look out for idiots who don't watch their dogs and use retractable leashes.  Some stupid polish chick and her idiot boyfriend on Sunday had a little rat looking dog that they let come over by my dog and tangle the leash all up and of course my dog was annoyed and growled at their stupid dog and they blamed me.  Be aware.....I will not be taking my nice dog there anymore because of stupid dog owners.",
            "author": "Joe S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-12",
            "description": "While I was in town a couple weeks ago, my parents invited us to tag along with them on a Sunday morning trip to the Lions Farmer's Market. The market wasn't really around (or it was small) while I lived in town years ago, so I was pretty shocked to find out how large and diverse it was (I also commend my parents for shopping here).\n\nThe entire [long] parking lot of the train station is occupied for this market -- with a good crowd of people and dogs. It's bigger than the Schaumburg Farmer's Market, which is usually my favorite in the 'burbs. All your food bases are covered: veggies (soooo many delicious veggies at different booths), breads, sauces, fruits, meat, eggs, etc. Several craft booths were present, including one with stunning dried & decorated gourds. It fascinated me. At one end of the market was a taco booth, with fresh tacos for people to enjoy while they look around. I don't know if the booths I saw are the same that show up every week, but man, I was impressed. Definitely check out this market if you're in the area and looking for ways to support local farmers & businesses.",
            "author": "Laura N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-26",
            "description": "This is one of the few farmer's markets on the weekend, so us M-F working stiffs in the 'burbs can enjoy it!  It's every Sunday June through October.\n\nIt's not huge like the French Market in Wheaton, but it has just enough of everything to have most of the bases covered.  There were plenty of fresh fruit & veggies, an olive vendor who also had fresh pita bread, a cheese vendor, a couple of bread & pastry booths, a fresh meat market vendor, kettle corn, frozen yogurt, a taco vendor & a variety of craft-type booths offering jewelry, purses, dried & decorated gourds (gorgeous) & lawn ornaments.\n\nWhile their location is idea for visibility, it is not ideal for parking.  We only had to walk a block from where we parked, which isn't bad, but having to cross the railroad tracks can be a bit tricky for the elderly crowd (one, they are trying to hurry, which always makes me nervous, and two, they have to keep looking down to make sure they walk over the tracks so they can't keep looking up to see where they are actually going...I'm just glad I was there to hold Busia's arm & direct her while she looked down to watch her step).",
            "author": "Rose D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-24",
            "description": "When I saw that I couldn't check in at the Farmer's Market because it wasn't on Yelp yet, I was shocked! This busy farmer's market appeared to have numerous satisfied customers, a regular clientele, and tons of great produce. \n\nFrom the standard organic veggies you expect to see at a farmer's market to harder to find market goods like Farmer Nick's naturally-raised meats and free-range chicken eggs, you can get most of your fresh food shopping done here on Sundays between 8am and 1pm from June to October. Everything is seasonal, so I say \"most\" because if you're like me, you want a couple of bananas every week to put in your Cheerios. Beyond that, though, this market has such excellent variety that you can plan any number of meals without leaving this block-long stretch of stands. I snapped up some sweet corn, brussels sprouts, and apples after waffling over whether to take home the season's last strawberries.\n\nThere are also a few unexpected things, like the guy sharpening knives on an old-school wheel (I love when markets have this!), the smoothie stand, the pizza-while-you-shop guys, and the fresh hummus stall, which has at least a dozen kinds of hummus plus packed olives and cornichons. You can even buy pastries from nuns.\n\nThere were a couple of vendors that caused me to raise an eyebrow. I expect to see marble wine bottle toppers at WineStyles, not at a farmer's market. I would have liked to see something more fitting with the idea of local, sustainable products there instead, like Chicago rooftop honey.\n\nThe Lion's Club sponsors the market, and they are always accepting donations of used glasses, plus they accept used ink cartridges for recycling. They also have themed market days from time to time, like the Fitness Fair and French Market Sunday.\n\nOverall, this is a great Farmer's Market with more parking than the Park Ridge market that takes place on Saturday and just as many cute dogs being walked between the stalls. I'll be back again, and I can't wait for fall produce to appear!",
            "author": "Elizabeth W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-10",
            "description": "I agree with everything Elizabeth W. said in 2011. 2013 continues with an excellent variety of fresh produce. Sometimes I splurge on the unusual mushrooms (crimini are my favorite). Herbs, onions, gourds, corn, peaches, blueberries, all different kinds of raspberries, yum! There are a couple of artists, too. You can get almost your entire meal here, for what I think are reasonable prices (and I'm a German-bred stingy person!). Most booths require cash, but some will accept credit cards now, thanks to smart phone technology. Keep up the good work, MP Lions Club!",
            "author": "Barbara W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-02-24",
            "description": "Love this farmer's market. Plenty of wonderful produce from Illinois, also Indiana and Michigan, too; Fresh baked pastries from an Oak Park convent; Artisanal cheeses and olives; Homemade doggie treats; Lovely handmade table linens, etc. Great way to meet neighbors and it is a very dog-friendly crowd. A nice way to start your Sunday morning....can't wait for it to return in late spring.",
            "author": "CL M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-11",
            "description": "A great farmers market with an excellent selection of products.  This one is by far better than the one in Arlington Heights.  Walk down to the vegetable stands on the very end.  They usually have the best prices.",
            "author": "Erin B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-08-19",
            "description": "My first time at a farmer's market here in the city (I lived in Michigan for 8 years and actually shopped at stands outside farms - so this is new to me!) Lots of people and good range of goods. No bad experiences except that sometimes the nuns run out of pain-au-chocolate! Boo! Lesson learned: come earlier than later.",
            "author": "Chris S."
        }
    ],
    "priceRange": "$$",
    "name": "Lions Farmer’s Market",
    "address": {
        "addressLocality": "Mount Prospect",
        "addressRegion": "IL",
        "streetAddress": "NW Hwy Rt 14 & Main St Rt 83",
        "postalCode": "60056",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/mbO-iGsm7S2A5_FZDsAVfg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}