{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-26",
            "description": "Remember my rant about cheap and abundant Devon Market's produce?  That was all before I got on this organic kick.  Loyola U's Farmer's Market is tiny, plentiful, and kind to my tiny budget.\n\nLet's start with the actual Loyola U tent.  Their produce always looks hecka' fresh and is competitive with Devon Market ($2/ bunch of greens).  Some of the kids running the table seem spaced out (maybe it was the heat), but no one is rude, and the guy with brown curly hair is cordial.\n\nMy next stop is down the center where Arthur and another guy are selling peaches $5/ pint, $6/pint raspberries, and $5/pint blueberries -- warm, sweet, and organic also.  These guys are chatty and just as sweet as their peaches.  Love them! \n\nThe guy selling on the left side of the market has THE BEST corn on the cob -- not sure if it's organic though. $0.50/ear.\n\nLast but certainly not least is my guy, Michael.  He's the most approachable cheese connoisseur  I've ever met -- not snobby at all.  I bought cheese from him today even though I have plenty at home -- he's just that cool.  When you go, try AND buy the cheese that tastes like roast beef (perfection!) and the strong gouda (I literally got goosebumps after tasting it!)\n\nIf you're looking for tons of every kind of produce stacked wall to wall like Whole Foods, this is not that.  If you like the challenge of purchasing what's in season at reasonable prices and cooking meals accordingly, go here. $40 will take you a long way.",
            "author": "Te D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-09",
            "description": "Below is the whole blurb from their website.\n\nHere's my take: Michael the cheese guy gets one of the stars all for himself- a cheese guru & stand up comedian/philosopher. Go for him alone.\nthe rest of it= limited but a good place to get salad and berries and organic coffee and little snacks.\nSmall but cute. \n\nI Love that LU is so committed to teaching it's students practical application of skills- one of the stands sells produce from the University's student run garden.\n\n\nWHEN:  June 10 to October 14, 2013\n\nWHERE:  Southwest Corner of Albion and Sheridan Roads, Chicago\n\nMARKET HOURS:\n\nSummer Hours:  3 p.m. to 7 p.m.\n\nFall Hours:  2:30 p.m. to 6:30 p.m. (September 30 to October 14)\n\nLink Card Accepted\n\nWe look forward to the upcoming outdoor farmers market season and seeing you. \n\nThe Loyola University Chicago Farmer's Market seeks to increase access to healthy and sustainably grown fruits, vegetables, dairy, meat and prepared foods.\n\nWe bring you a relaxing atmosphere where you can purchase fresh local food.\n\nThe Market is a direct result of a student project in the Loyola's Solutions To Environmental Problems (STEP) Food Systems course. Conceptualized and planned by the students, the Market's goals are to:\n\nIncrease access to fresh nutritious locally grown and produced foods to community members in a densely populated urban setting\nTo contribute to Loyola's mission to serve those in need by providing a community gathering place where fresh, nutritious foods are affordable\nTo support small growers that apply sustainable agriculture and land conservation practices\nTo support small producers with entrepreneurial spirit\nProvide a place where all can purchase local and seasonal foods to support the \"farm to plate\" lifestyle\nFarmers' Market Prices Competitive With Grocery Store Chains\n\nAre you interested in purchasing vine-ripened tomatoes directly from the farmer that grew them but worry that they'll stretch your budget just a little too uncomfortably? Think again. Emerging investigations are beginning to challenge the notion that produce purchased from Farmers' Markets is more expensive than their supermarket counterparts.  Sometimes, consumers can even purchase better quality food for less at their local Farmers' Market. For more on the affordability of local food, check out a compelling blog post by New York Times and Washington Post writer, Barry Estabrook.\n\nIs Local Food More Expensive? A Consumer Price Perspective on Local and Non-Local Foods Purchased in Iowa\nVermont Farmers' Markets and Grocery Stores: A Price Comparison\nLearn more about farmers' markets and how they are shaping our local food movement. Check out the Farmers' Market Coalition. The Coalition offers a variety of educational opportunities, support, and news about farmers markets across the nation.\n\nFor more information on the market and how to get involved, please contact Gina Lettiere at glettie@luc.edu or 773.508.8255.",
            "author": "Judith M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-27",
            "description": "It's pretty small but what did you expect for a farmers market in a mall community? There are maybe 8 booths but they all sell different foods like bread, cheese, coffee, fruit, or veggies. This time I bought jam and cheese but next time I will definitely try to remember to bring more money. \n\nMichael the cheese guy is the cheese. He has little sampling presentations that are to die for. I was left with so many choices I didn't know what to buy. I was offended for him when 5 girls came, sampled everything, then just walked off. This isn't Costco... \n\nThe guys who sell jam and pesto and guac are really nice but I honestly think its overpriced. The jam is great and tastes really homemade but the other foods, while also delicious, are not worth the hefty price stickers.",
            "author": "Tiffany Y."
        }
    ],
    "priceRange": "$",
    "name": "Loyola University Farmer’s Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "SW Corner Of Albion And Sheridan Rd",
        "postalCode": "60626",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3Bm8hoxEH0D_HXU2AIGhpw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}