{
    "aggregateRating": {
        "reviewCount": 1,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-25",
            "description": "This brand new Farmer's Market is a replacement for the old one that used to be at the Village Hall (see https://www.yelp.com/biz/orland-park-farmers-market-orland-park?osq=farmers+market). This new Market has longer hours and a more expansive location to make it easier for people to attend. It is now located at the 143rd METRA Station in Orland Park...roughly one block west of LaGrange Road at 142nd Street. \n\nThe Market is held on Thursdays only...from May 25 to August 31. Hours are from 4pm to 8pm. If you happened to be a METRA rider, you will find the Market as soon as you jump off the train at night. Besides adding some live entertainment at this location, the number of vendors is expected to grow substantially as customers find the site. Right now there are about two dozen vendors. \n\nThe vendors are much like those that were visiting the old Farmer's Market, but this location will eventually attract many additional vendors. Food and food trucks, notions, candles, honey, fresh fruit and vegetables, and many Orland Park businesses are here. For example, the University of Chicago medical people are represented ... even more so because they have a new four story facility just a couple hundred feet away. \n\nThis new Market is worth trying...it is just one more example of the Village trying to upgrade its offerings to the public. Recommended.",
            "author": "Rick B."
        }
    ],
    "priceRange": "$$",
    "name": "Market at the Park",
    "address": {
        "addressLocality": "Orland Park",
        "addressRegion": "IL",
        "streetAddress": "9705 W 142nd St\n(143rd Steet METRA Station)",
        "postalCode": "60462",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/UPU670CteY01r3Ucpr-jjg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}