{
    "aggregateRating": {
        "reviewCount": 1,
        "@type": "AggregateRating",
        "ratingValue": 2.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-09-30",
            "description": "I really wish I could give this market more stars.  It is more conveniently located for me than most farmers markets.\nIt has improved since it opened a couple of years ago, but it still has a way to go.\n\nIt is located near the northwest corner of McKinley Park near Archer Avenue and Western Blvd.  Finding a parking spot can be difficult--good luck finding a spot on the south side of 37th St. - - residential parking on the north side of 37th St.  In the past, I have parked on Archer Ave., \n\nI was here on a nice day a couple of months ago. There was entertainment that day and the music was quite nice, however, they were wrapping up because it was near closing time. \n\nThe main reason I like farmers markets is to get fresh produce.  I have actually found one market that has excellent produce at a reasonable price.  This is NOT the one.  At this one, on the July visit, I bought 2 apricots, 2 peaches and 2 tomatoes for $6.  It was more than I would usually pay, but they did look beautiful.  Unfortunately, the peaches didn't have much taste and the apricots and tomatoes had even less taste! \n\nThe highlight of the July visit:  Sputnik coffee.  They only serve cold brewed coffee at the market.  It is $4 for a decent size cup. \n\nI decided to go earlier today and try to give this place another chance.  It was before noon and a cooler, cloudy day and not very many other people there. Entertainment is not the reason I go to Farmers markets usually, but at this one, I figured I would get a cup of Sputnik coffee and enjoy some entertainment  I was able to get my coffee, but there was no entertainment.  I \nguess the entertainment is hit or miss.  Today was a miss. \n\nI checked out more of the booths today.  There were two produce stands - - the large one that cost too much money for beautiful but bland produce in July and a smaller stand--the radishes looked nice, but not so nice that I was willing to pay $2 for 4 radishes!  \n\nTwo bakery stands today   I know one is a regular that sells loaves of fruit breads for $5, however, the loaves look more like large slices.  The other one sold packages of 6 decent sized cookies ($5) and small fruit pies.($5).  I bought a cherry pie.  Cherry filling was very good, but crust was kind of tough and not the least bit flakey. I don't believe this vendor is here every week.  I have heard that some are there every week and that others seem to change from week to week.  (Not sure if this is true, but did seem to be the case today) \n\nOther vendors :  honey, tamales, beef/chicken/eggs. \n\nOnly a few more Sundays for this season.  Hopefully I can bump up the stars next year :)",
            "author": "Christine B."
        }
    ],
    "priceRange": null,
    "name": "McKinley Park Fair Trade Farmers’ Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "3705 South Archer Ave",
        "postalCode": "60609",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/AKRSYH-rosoutHqtpu0vnQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}