{
    "aggregateRating": {
        "reviewCount": 11,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-13",
            "description": "Such a great event! \n\nSo kid friendly!! and so much variety. \nIts quite a bummer you cant bring your dog to this event, but other than that...NO complaints!",
            "author": "Erica B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-02-27",
            "description": "The Morton Grove Farmers' Market is run by a volunteer organization through the MG Chamber of Commerce and Industry/the Village of MG/MG Park District.  Only opened on Saturdays from 8AM - 12PM, there are a variety of vendors.  Just note that these vendors change or rotate on an annual basis, so when you see a vendor that you absolutely love, make sure you get their business card/contact information and/or stock up on their items!  Some vendors that have made appearances in the past were: Blankenship Farms, Treasure Breads, Maier's Bakery, Distinct Bath and Body, The Cheese People, Bee in Beezyness with God, and Jilly Bean Jar.  I really like the Cheese People, as they have a variety of yummy cheeses, like the Creamy Amish Swiss, Aged Asiago, Applewood Smoked Cheddar, and the Pistachio Log.  My parents love getting fresh produce from the Farmers' Market, especially apples and potatoes.  As these are small, local businesses, the prices may be a little higher, but note that you're generally paying for higher quality and supporting such! :D  There's plenty of street parking and limited in the small lot.\n\n+Saturdays, from 8AM-12PM\n+changing/rotating vendors\n+across from Mb Financial bank",
            "author": "Hannah H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-09-03",
            "description": "I love the Morton Grove Farmers Market for the Tamale Express! Great service, quick, yummy tacos, yummy tamales, and especially yummy elotes!",
            "author": "Christy M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-03-26",
            "description": "I constantly want to try new things, but rarely make the time.  This time was different!\n\nMorton Grove kicked off the season with an Indoor Spring Market.  I saw an event listing on Yelp and decided to make the drive out there from Bartlett.  There was a check-in offer (that was old & didn't have an expiration date), but they still found a way to honor the listing and provide a little treat which was certainly appreciated!  The staff/volunteers greeting us were so nice and made sure to make us feel welcomed.  They had t-shirts for sale (but I didn't check those out very closely).  I think they are entering into their fourth year.\n\nThe indoor market consisted of approximately 20 different vendors selling their wares.  Upstairs there was face painting and some bites to eat on site.  We met a local gentleman who sells birdhouses that were just too cute (I may have purchased one of these on the sly for a gift for someone later this year).  He paints each house and uses license plates on the roof.  Too cute!  There was a woman who had scones, varieties of chocolate, muffins, biscotti, etc.  I picked up some pistachio and dried cherry biscotti drizzled with white chocolate - It was completely out of my go-to's, but it was delicious!  There was a gentleman who had a wide variety of spices and dip mixes.  We met a woman who had soups for sale.  Everything was already in the bag and all you needed to do was add water.  She made my heart smile because her company \"employs\" individuals with special needs to put the ingredients in each bag and tie the bows.  There was a woman nearby with home décor - honestly it reminded me of things that someone's Great Aunt Ethel would have all over her home - not my taste, but it might be a good gift for someone's Great Aunt. ;-)  There was a woman with handmade bows, pencil pouches, travel crayon sets and other items that were very cute.  Perfect gifts for my littlest nieces!  Someone had Whoopie Pies!!! (But they were busy and we never went back...)  A traditional bakery was onsite with giant coffee cakes and other fresh looking items.  There was a gluten-free product table, but they appeared to be pretty cleared out by the time I got over there.  I saw a table where you could place orders for meat - like a butcher, but I don't think the meat was onsite that day.  I met a husband and wife team who had the most lovely jam (I bought one!) and honey.  One of my sisters harvest honey, so I skipped that, but did love the jam.  Next to them, was another husband and wife team with jewelry and some sort of diet (I think) product.  The jewelry was very pretty and he said they were regulars, so I will look for them again.  Finally, I saw a woman with varieties of hummus.  Upstairs, the chicken and mole tamale knocked my socks off!!  And that pretty much concluded my trip.  There was a nice variety of items, but I am looking forward to going once they are outside in the hope of getting fresh fruit & veggies!",
            "author": "Jennifer S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-05-29",
            "description": "It finally happened! Morton Grove has its own farmer's market. Instead of going to Park Ridge or Evanston, there's a place in-between. I came out there with my wife and kids on the grand opening weekend. Located in the lot behind Illinois Bone & Joint Institute, there's no shortage of parking and it doesn't require any crazy maneuvering to get into the lot either.\n\nFor the grand opening, Congresswoman Jan Schakowsky, Morton Grove's mayor and trustees were present for the ribbon-cutting ceremony. So were photo and video people to document the event. But formalities aside, I think we got the making of a community destination for the summer and fall.\n\nThey have covered Radio Flyer wagons for the kids to sit in and get towed around through the place. I don't know if it will be a regular feature or not, but there was a face painter and storyteller. My kids got to plant beans in cups and we'll watch them sprout and grow, then transplant them to our garden.\n\nIn terms of food, I spent a lot of time by the Lehman's Orchard stand, where they sell freshly made, natural peanut butter, almond butter and cashew butter, in addition to dried fruits. I bought a cashew butter package to try. Pretty awesome on a cracker or by itself! I resisted buying the honey roasted peanut butter in case it's too sweet and be out $5 for it. Hint to the vendor: I would have tried it and possibly bought more if there was a sample available.\n\nTibet Farms did not have much to offer but there was fresh bok choy and mustard greens. Since I grow some of my own greens at home, I talked to the guy about his growing methods to share ideas.\n\nA well-known name in drinkable yogurt, Lifeway Kefir has a booth too. They let us try their strawberry kefir, which my older son loves. Locally, there's Maier's Bakery with a selection of baked goods to offer. There was also a cheese vendor and a sharpening service for scissors and knives on site, while you shop.\n\nWhile I won't stop going to my local Park Ridge Farmers' Market, the one in Morton Grove has enough unique qualities to hold its own and attract a loyal following of locals. And I will be back for more cashew or peanut butter.",
            "author": "Mike O."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-06-20",
            "description": "I love markets, fresh produce, and being out and about on Saturdays.  Needless to say, I was uber excited to visit Morton Grove's own farmers' market.\n\nSeveral vendors boasted their berries, cherries, arugula, radishes, baked goods, flowers, and more.  I walked home with a pint of cherries, a pair of madelines, and a brownie.  I expected the cherries to be sweeter and the madelines to taste light, fluffy, and fresh vs. tasting like they had been made 2 days ago.\n\nI will be back though.  There is easy, breezy parking.  Amy's stand had some chocolatey treats to offer, and the frozen, chocolate covered key lime pie is calling my name.",
            "author": "Tricia D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-25",
            "description": "This is hands down the best Farmer's Market to bring kids, too.  They have brand spankin' new, FREE radio flyer wagons to pull your kids and produce around in.  Every week the library is there reading stories, leading dances and parachute time..and even giving away books!  Face painting and great music are also regular features.  The kids are always raring to go, unlike other markets I kind of had to drag them to.\n\nI also love the setup of this market...nice and enclosed in a parking lot behind a building...easy to keep an eye on kids and kind of a party atmosphere.\n\nTibet Farms is my favorite booth because of their delicious baby bok choy, peppers and other veggies I'd have to make a separate trip to an ethnic food store to buy. They are all organic, too, and have delicious lemonade and iced tea.\n\nLast week, I was able to do my grocery shopping, entertain the kids, AND even buy birthday presents all in one stop (some super hot salsa and locally made chocolates!).  Love it :)",
            "author": "ccy L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-01-31",
            "description": "I had to update this review...two years later, and I loved this market so much I started to volunteer and now I am on the Market Committee. It is such a great group of people to share ideas and work with. If anyone is interested they should contact us at AllManagersMGFarmersMarket.com",
            "author": "Laura F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-06-16",
            "description": "Went here for the first time because of the crappy reviews that Glenview Farmer's Market got. Was expecting it to be bigger, it wasn't, which is good for me. Local farms from IL here and the prices, well farmers have to live too. Farmer's markets are not known for being inexpensive, so if you want cheap produce go to a produce store in the area. Quality is just fabulous. I was able to taste 3 different types of strawberries and pick which ones I wanted to buy. What most people don't know about farmer's market produce is that it is truly organic but most small farms can't afford to pay for the inspection and label that goes along with organic. No pesticides used here on these foods. You can always tell quality when it looks like the fruits and veggies look a little dirty and oddly shaped. If you see someone at a farmer's market claiming to be certified organic, question it and their prices. Nice to be able to talk with the farmer's who grew the produce and ask questions without them trying to scam or cheat you.  I will DEFINITELY be going back to this market!",
            "author": "Katy L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-10",
            "description": "I love coming here every Saturday! The vendors are great, as is the musical entertainment. Since this market just started this year, that means that there are more vendors to come in the future.\n\nI do have stalls that I frequent: El Gringo Loco (Key Lime and Garlic salsa, Pineapple Salsa, and Burn Uranus sauce), The Cheese People (Dante aged sheep's milk, Pistachio Log, Jack with fresh basil), Lehman's Orchard (dried vegetable chips), Lifeway Foods (kefirs), a vendor who's name that I can only remember has something with \"Provence\" in it (sea salt ciabatta bread, baguettes, chocolate and raspberry croissants).",
            "author": "A. T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-19",
            "description": "Love this farmers market!  I have 4 others to choose from on the NW side, but this one might be my favorite.  It starts at 8am, which to me is preferable to 10am.  Parking is easy.  There are wagons available to haul your stuff (and kids) around in.  There are crafts for the kids, face painting...  music was about to start, but we got there on the early side; oh, and great produce available too!",
            "author": "L T."
        }
    ],
    "priceRange": "$",
    "name": "Morton Grove Farmers’ Market",
    "address": {
        "addressLocality": "Morton Grove",
        "addressRegion": "IL",
        "streetAddress": "6140 Dempster St",
        "postalCode": "60053",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3ZZFIpeoI-IA1BuBybI4OQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18477506436"
}