{
    "aggregateRating": {
        "reviewCount": 15,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-08-26",
            "description": "Hadn't been here in a number of years because I usually trek over to the Downers Grove Farmers Market. But this is closer, and for convenience I stopped by here this morning. \n\nIt's bigger than I remember, and unlike DG there are not as many prepared foods etc; the focus does seem to be on the produce, though there are some booths selling olive oil, salsa, jelly, flowers, baked goods and the like. \n\nI got some delicious raspberry jam from JellyKicks, salsa from Hair of the Ferret, and a croissant cup for breakfast from DeEtta's Bakery, as well as some sweet corn. Ran into some friends too, which is the benefit of coming to the hometown location! \n\nOverall, worth a stop on Saturday morning!",
            "author": "Shannon M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-07-27",
            "description": "I hadn't been to the Farmer's Market for a couple of years.  I had some specific items that I wanted for a recipe and wanted the freshest corn possible.  The corn selection was great and the prices were what I expected to pay.  Now for the other items I was really disappointed.  The cilantro was wilting and going bad, the jalapenos were starting to wrinkle and go soft so I didn't purchase those items.  The flower vendor had a very nice selection and one again the prices were what I would expect.  The blueberries, apricots and peaches are overpriced as are the red peppers and green beans. I like to support local growers but the product has to be fresh. \n\nFor the size of Naperville I would expect a larger Farmer's Market.",
            "author": "Jillian H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-02-12",
            "description": "Theres something so relaxing about the Naperville farmers market. Walking around outside with the summer air on my face, to me its also as relaxing as a trip to the spa. The market is in front the the 5th ave train station. Its always pretty busy, but not uncomfortably busy, its a nice spot to people watch too.\n\nTheres a nice variety of goods for sale. From fresh fruit and veggies, to bread, pasta, eggs, local honey, jams, flowers, seafood, chicken and Ive even seen game meat. \n\nI can not wait for summer to start, I will definitely be here when it opens up again.",
            "author": "Mayra Z."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-01-05",
            "description": "We are pretty avid farmer's market attendees.  Naperville has a decent location, but we often choose to go to Wheaton (also Saturday mornings) because Naperville's  is one of the smaller markets.  \nEven though it does have fewer vendors, the their vendors offer some great products. In my opinion, it also has a nice, laid back atmoshere.\nLook for some delicious gluten-free granola, tart cider, fresh veggies, spicy hot sauces, and homemade treats for Fido. \nSometimes we swing by Naperville before or after Wheaton, or when we don't feel like dealing with the big crowds and narrow aisles.",
            "author": "Lauren F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-09-24",
            "description": "A great farmers market with an abundance of selections.  The location at 5th Avenue Station is perfect.  My only complaint is that they should have a coffee/tea place nearby.  \n\nI've been totally impressed by the selection of just about everything here.  The prices are very reasonable for produce this fresh and delicious.  They also have flowers, meat, soap, and bread.  You can pretty much do your grocery shopping here, if you want to :)  The selection changes based on what's in season (obviously) but you can pretty much guarantee that everything is going to be very high quality.\n\nDefinitely one of the nicest farmers markets in DuPage County.  The people are really friendly, and I love giving my money directly to the people that grow my food.  We've been regulars here for years, and we will continue to come back for the high-quality merchandise and friendly vendors.",
            "author": "Matt G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-25",
            "description": "They have a variety of local fruits and veggies, baked breads/pastries, meats and cheeses, pickles, jams and preserves, fresh spices, soaps, and fresh bouquets of flowers.  You can also enjoy freshly made lemonade and freshly popped popcorn.  There was a knife/scissors sharpener and a pet charity booth. There were a couple of vendors with women's accesories and jewelry, clothing and purses.  \n\nIt tends to get a bit crowded, depending on what time you arrive.  \n\nA definitive PLUS:  no pets allowed!  Yes!  :)\n\nNegative:  some of the fresh produce we purchased went bad in 2 days.  :(\n\nWe will be back, though.  It was great seeing smiling faces just enjoying purchasing fresh ingredients and other items.  \n\nSome vendors accept cash only others cash, checks and credit cards.",
            "author": "Amelie and Dan B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-03",
            "description": "I have been in terrible denial about the fact that, not only is it summer, but it's August. So even though I've been meaning to go to the farmers market since spring, this is the first time I finally dropped by. Parking wasn't bad, I parked on a nearby street, and the selection of produce was excellent. Coming from Boston, I'll also say that the prices are outstanding. None of that marked-up city pricing nonsense. :)",
            "author": "Alyssa J P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-02",
            "description": "We love to stop by the Farmers Markets around the area and have purchase some killer fruits, veges and canned goods. Always fresh and tastey. My only complaint is that I need to double my income to be able to shop here weekly.\n\nWe tend to find some pretty good produce at affordable prices at our local H-Mart. I'm all for buying local, but I just wish the items were more affordable.\n\nThe venders are always friendly and happy to let you sample and they love to talk about their wares.\n\nYou will be delighted by the down-home feel and the array of amazing in season produce,",
            "author": "Tina H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-07-19",
            "description": "Openly admitting this....like coffee...I am a farmers market snob.\n\nHeading into the Naperville Farmers Market I knew to expect a couple of vendors...Wisconsin Cheese and of course flowers. Two of the majors that I keep an open eye out for. \n\nThe 5th Street Station opens a small section up for the market which is nice but a piece of me thinks that they...the city...could really go all out for this to bring in more local merchants. \n\nThe produce is very limited, while the weekend that I visited had a bunch of fresh blueberries the actual produce was cut down to snap peas, wax beans and cauliflower. I was hoping to see Purple cauliflower, different types of eggplant and what not but saw the typical. Many of the vendors keep a small placement on their tables and replenish once sold out.\n\nI found this strange, but that could just be me.\n\nI ended up only purchasing a couple of gorgeous cheeses: Tomato/Basil Muenster and Merlot Cheddar which both go well either crumbled in a salad or served with wine.\n\nI'll keep going to the market, because maybe I went on an off weekend but would like to see more 'umph' with the vendors and merchants. This really could be a great market if there were more to choose from.",
            "author": "Morgan M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-09-10",
            "description": "My only regret when it comes to the Naperville Farmers Market is that it is a hefty drive (30+ minutes with the current construction) away. That, and it's not the cheapest market ever.\n\nLots of space between and around stands, not crowded/squeezed/trampled like Wheaton; reasonable amounts of parking within easy walking distance. Reasonable variety of fruit and veggies. Great flower stand; the $10 bouquet is a tough squeeze into our fairly-wide vase. Certain flowers wilted rather quickly; possibly because they were squeezed into the vase to begin with. (Yes they got a fresh angled cut first.)\n\nHave picked up tomatoes, squashes, peppers, berries, honey, pasta, flowers here; other than one bad cantaloupe, every purchase has been excellent.\n\nAlways seem to spend too much money here, and always leave feeling like I could have spent more. Does, as others have noted, seem a bit small for the space, making it a tough call between this and the Wheaton French Market on Saturday's.",
            "author": "Andrew B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-06-29",
            "description": "I went to the Naperville farmer's market with my mom pretty regularly on sweltering summer mornings growing up.  There's quite a variety of local fruits and veggies to be enjoyed, which changes week-to-week based on what's in season.  (Last weekend I picked up a few pints of raspberries and blueberries, and they were uh-freakin'-mazing!)  There's also plenty of fresh breads, meats, salsas, pickles, jams and preserves, fresh spices, soaps, flowers, etc. to make a delicious meal or just perk up your home.\n\nHint: the earlier you come, the better!  Less crowded, less picked over, and definitely less hot!",
            "author": "Michelle K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-20",
            "description": "I like the Naperville Market. It has a few vendors I can't find at other markets.\nThe mushrooms are great and reasonably priced. They used to have an organic vendor with lettuces, washed and ready to go, but now I have to grow my own. Also I miss the lady who made reasonably priced, gorgeous dried flower arrangements.\nThe fruits and veggies are top notch, and best of all there is room to walk and enjoy.\nI wish they allowed dogs. I suppose some are badly behaved, but just as many people are, and we allow them in.\nI also love the smaller vendors. Nicely done.",
            "author": "Rita G."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2011-07-15",
            "description": "I originally frequented the market every week but I have stopped going altogether. The reason is simple, I'm tired of overpaying for the non-organic products and consider the organic product pricing a blatant rip-off. Do a simple experiment. Buy a pint container of a product, say potatoes, or beans. Go home and weigh it. I guarantee you will be shocked by how much you paid per pound.\n\nI also discovered that the city of Naperville does not regulate the scales used by the farmers. I have a letter from the city verifying that fact. The reason I asked was that I was repeatedly surprised by how much I was being charged based on what I thought the quantity was. I got to the point where I would take my purchases back home, weigh them on a very high quality, accurate scale and discovered that my suspicion was correct; I was being consistently overcharged.\n\n In fairness, I will admit that the fruit can be very good but as I indicated you will overpay for it and always check the wieghts when purchasing bulk produce. However, since I know how to pick friut I found I can match the quality by visiting some local ethnic markets. \n\nIf money is not an issue, and there are obviously enough people in Naperville for whom that is a true statement, and you don't care what you pay for your food then this is the market for you.",
            "author": "Ted N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-07-23",
            "description": "This is a lot of fun on Saturday mornings. There's a lot of produce (fresh and local!) as well as a bread tent, dried flowers tent, local honey guy, fresh flowers tent, mushroom tent, cheese specialties, corn-fed meat, and fish/seafood (from Houston). There's also a knife/scissors sharpener and a pet charity booth.\n\nOur typical purchase frenzy may result in any combination of the following: peaches, nectarines, plums, cherries, raspberries, blackberries, local honey, broccoli, onions, cucumber, a basil plant, and preserves! PHEW!\n\nEveryone's' very friendly and in recent years it has become much more crowded, depending at what time you come over.",
            "author": "Jessica D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-05-02",
            "description": "We've shopped here for years. Yes it can be pricey and no it doesn't have 'everything'.  However, the offerings are top notch and more than reasonable comparing taste and freshness. For folks like us who love fresh veggies and flowers it can't be beat.",
            "author": "E C."
        }
    ],
    "priceRange": "$$",
    "name": "Naperville’s Farmers Market",
    "address": {
        "addressLocality": "Naperville",
        "addressRegion": "IL",
        "streetAddress": "200 E 5th Ave",
        "postalCode": "60563",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/NCkraXi2wfBCEVzqznhhCw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16303695638"
}