{
    "aggregateRating": {
        "reviewCount": 21,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-02",
            "description": "Luckily I live just around the corner from this great farmer's market. \n\nWith live entertainment, an assortment of fruits, vegetables, flowers and baked goods you have everything you need. \n\nI like the local family farms that are represented and the helpful vendors that really care. \n\nThe star of the market is the crepe guy. Always a line with anticipation and bright smiles as they sit down at the picnic table to feast on their tasty crepes. \n\nI look forward to Saturday mornings to do the market and then brunch at Butch McGuires!!",
            "author": "Rhonda F."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-05-25",
            "description": "I love going to farmers markets! I can only give this one 3 stars because the ones I usually go to (Daley Center, Green City, Logan Square) have a bigger selection to choose from.\n\nYesterday I grabbed a sausage egg and cheese sandwich from Farm Fresh Foodstuffs and it was pretty good. I liked that all the ingredients were fresh, served on a waffle, and I was just in an all around good mood enjoying this beautiful weather :)",
            "author": "Tavi J."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-06-20",
            "description": "BAD: Not enough organic choices, only 2 stands, not enough variety, closes early, very basic with too many homeless hanging around it.\nGood: Close to my house, close to a Starbucks and other places to eat, good street music, nice vendors. Cheaper then the Wholefoods or Plum.",
            "author": "A M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-10-22",
            "description": "I'm sad and happy about this market.\n\nSad, because I found out about it almost too late; its last week is next Saturday, Oct 27, then it closes for the winter. \n\nHappy, because I have an accessible local farmers market, well, once it starts up again.  I believe the hours are from 7-1 or 2PM. A section of Division is closed off, between Clark and Dearborn. \n\nThis market, when I wandered upon it, was festive, friendly, and chock full of fresh veggies. Beautiful, reasonably priced, organic veggies.  There was also an excellent cheese vendor, artisanal breads, desserts, pickled fruits, veggies, jams, salsas, eggs, ice cream!, and meat.  There was a crepe stand, a soap vendor, the honey and beeswax vendors are just nice as can be(e). \n\nIf you live nearby, come on out this Saturday and support your local Farmers Markets!",
            "author": "Linh N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-18",
            "description": "What a farmers market is supposed to be.  Fresh, seasonal produce from several vendors mixed with flowers, herbs, cheese, eggs, and breads. Live music and a tasty, authentic crepe booth that doesn't overcharge tops it off. No fussy $10 juices and homemade crafts here! (Except for a couple soap stalls.)\n\nYes it's only two blocks long, but you can get in and out with what you need quickly. The point is to have a place for locals to buy fresh produce and mingle with your neighbors. If you want crafts and fancy snacks go to one of the many local festivals. I live between this one and the Green City Market and this is by far my first choice.",
            "author": "Heather M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-12-19",
            "description": "Great farmer's market with a pretty good selection of vendors. Some of the vendors have less than perfect fruit and vegetables (i.e. Oddly shaped potatoes that can't be sold in stores) for a dirt cheap prices! Mary's fresh farm eggs are a stable in my house. In the summer they have a huge flower stand and a fantastic cherry and heirloom tomatoes. Nearly every vendor sells peaches in the summer and honey crisp apples in the fall. There is 1 very small vendor that sells organic herbs but other than that there are zero organic options which is unfortunate.",
            "author": "Nicole B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-02-15",
            "description": "I usually don't go out of my way to come here but occasionally stumble upon it when making my Saturday errands; always a nice surprise.  As most of the city markets go it seems a little overpriced but some of the produce is about supermarket price and there is always a warmer feeling buying from a market than a store.  Some speciality bakery goods as well.  The streets are closed off and you can wander amongst the yuppies and retired folks :)",
            "author": "Brandon B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-10-08",
            "description": "I've been buying fruit all summer long at this farmer market so I'm not sure where I'll be getting my produce when it closes next month.  It's not as good as the farmer's market in the daley plaza, but I still got some delicious, fresh fruit here. \n\nSome of my favorite purchases this summer include peaches, blueberries, grapes, strawberries, and cherries. My boyfriend is a big fan of their banana bread as well.  This market closes the last weekend in October so you still have 3 weekends to experience it! I may just have to try those fragrant honey crisp apples Danielle B raves about!",
            "author": "Andrea R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-10-09",
            "description": "I don't understand why farmer's markets (this one is no exception) generally charge a lot more (50% or higher) than you'll pay at Jewel.  By selling direct to the public, they cut out the middle man, right?\n\nFor whatever reason, you pay a premium over the supermarket, even higher than organics.\n\nAnyway, the market has a good selection of vegetables, fruits, flowers, and pastries every Saturday from May through October.  Atmosphere is lively and fun.",
            "author": "Tommy M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-08-14",
            "description": "This is a great, simple, little farmer's market if you're looking to quickly pick up your basic fresh produce, pretty flowers, and a couple of baked goods.\n\nHowever, if you're looking to casually stroll around and browse a wide array of goods while stopping to eat brunch, this isn't your kind of place. It's only about 2 blocks long - When I went for the first time, I was hoping there would have been more vendors. Also, there were only 2 vendors offering brunch options (crepes and breakfast sandwiches). \n\nOn the plus side, the streets are closed so you can walk freely amongst the vendors without worrying about traffic.",
            "author": "Leah C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-11-16",
            "description": "Great memories of walking off hangovers in the hot Chicago summer while learning about long-stem garlic, having different cheeses recommended weekly by the cheese stand, buying too many mushrooms because I'm still learning what to do with them, and stocking my fridge with fresh greens.  The usual farmer's market crowd: yuppies, old people, tons of dogs on leashes (yesss), people with guitars and/or violins playing on and on.\n\nNow that it's gone, all I'm left with is Potash.  (kidding, hello Trader Joes)",
            "author": "Al C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-06",
            "description": "It's a nice place to buy fresh produce or just pass by. You also can find beautiful flowers, honey, home made pastries, cheese, fresh pasta or spicy sauces.",
            "author": "Helena G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-28",
            "description": "Living in NYC I'd say this is not as good as the Union Square Greenmarket.  The Santa Monica Promenade Farmer's Market is not far behind that, and this is a very respectable third tier.  Lot's and lot's of vendors.",
            "author": "Jonathan B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-06-11",
            "description": "Must say I've been up with the chickens 2 Saturdays in a row and I'm a little disappointed in the # of vendors this year here. June 11 - stalls should be full yet there is still room. \n\nI'm happy to have my honey guy & my Canadian  bacon fix taken care of now that these terrific farmers are back - this was their first week. \n\nIn the past I've always purchased my flowers for the week here yet once again I found myself walking down to a flower shop ($$$ - and goodness knows where these blossoms have been trucked in from ) to pick up something other than Lilies. My friend lives near the Bucktown market and she has a regular horticulturally inclined farmer that grows amazing flowers in his greenhouse. Hopefully the vendors are coming back to Division & Clark - the people are.",
            "author": "patrice c."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-01-05",
            "description": "Two words: cheese curds.  \n\nCalifornia farmer's markets do their best to satisfy my curd needs, but they cannot compare to the kinds of curds I would get at the Near North FM. Such quality curds.  Yum.",
            "author": "Annie G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-13",
            "description": "Of course it stops raining after I braved the weather to check out this Farmers' Market earlier today. I was already drenched from an early hair appointment, so I thought, might as well stop by since my bus was heading in this direction. Plus, I wanted to pick up some veggies and see what kind of plants were available. See, after reading a recent Yelp thread about what people grew in their gardens, I was a little intimidated, rather impressed, and inspired. I wanted to see what I could start with this summer. We'll see how that goes...\n\nI think this Farmers Market ends at 2 PM on Saturdays, and I made it just in time. In the past, I'd go during lunch breaks to the FMs in the loop. If I didn't get a chance then, I went to some of the weekend FMs around the city, like this one. Anyway...I skimmed around the different tents as much as I could, but the damn rain kept coming down harder making it hard to really focus on what I came to do. (I swear it poured 10 times harder each time I stopped to look at something.)  I kind of got an idea on what plants I wanted to try but on this trip, I didn't purchase anything. I'm going to sound lazy, but I really wasn't in the mood today to haul plants in the rain. Next time though! My visit wasn't unsuccessful. Despite the rain, soaked feet and pants, I managed to score a deal on apple cinnamon bread and fresh zucchini. Damn you, rain! \n\nPS: Watch out when crossing Dearborn and Division (I think?). That particular section isn't blocked off. You still have to wait for the light before crossing. Oops.",
            "author": "Mickey A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-09-30",
            "description": "Love love love this farmers market. It's just big enough to go through in less than an hour and grab a few things like:\n\nHoney Crisp Apples from Michigan\nGladiolas\nHeirloom Tomatoes\nBaked goods\nHerbs\n\nIt is so nice to get a taste of my home town just a few blocks down from my place. Prices are very reasonable and the venders are all super friendly and really knowledgeable about their produce.",
            "author": "Emily C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-30",
            "description": "Love this farmer's market.  Got some awesome white peaches, and some really yummy looking homemade pasta this past weekend.  They're also really generous with the samples - I could have sat there eating the grill cheese all day long.  There's also a guy making grilled pizzas that look awesome, we didn't make it in time for the slices, but there's always next weekend!",
            "author": "Haley S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-01",
            "description": "On our last day in Chicago, we wanted to check out the farmer's market.  After we got there, we wished we'd come the first day so we could have bought a bunch of stuff and kept it in the hotel for our trip.  Produce smelled so good, and many varieties of things I had not been exposed to before.  Was nice, even though we didn't buy too much.",
            "author": "Shana S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-10-11",
            "description": "Andrea and Danielle, you guys are absolutely right about this.  I am too going to miss this go since it's getting cold.  I go here every Saturday morning to buy apples and occasionally flowers.  There is this one guy who does some sort of experiment with growing flowers.  It's really interesting to see what he does, shows progress, and making posts about what works and what doesn't.  He sounds so much like Bill Nye The Science Guy with biology and botany.   Mixing flower seeds and what not.  But his flowers are super expensive when other sellers are going for like $2-$5. So do browse around before you buy.\nYou can also get pumpkins!!  All shape and sizes!  If you want, you can even buy tiny ones that are already been decorated.  Pretty cool I think.  \nLooking for produce? I suggest you get there super early like 7-9am when not as many people around.  You can take your time picking out ones that you want and talk to these hard working farmers. oh watch out for that guy selling coffee beans, he talks and haggles so much.  But do say hello to that nice old lady selling baked goodies she's super nice.  She complains that it's getting cold and her hands don't work as good as it use to.   I hope she wears a glove this weekend, it's got to be freezing standing outside all day.",
            "author": "George K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-10-07",
            "description": "I am so sad to think that this market will soon be closed until next summer. Every Saturday from 7:00 am until 2:00 pm, I cherish strolling along the various stalls. Depending on the growing season, you may see bright raspberries or autumnal squash offerings, but the selection always inspires a weekend dinner. Though there are a few non-produce stands (offering breads/pastries, the giant spice van, the guy who sells raspberry vinegar) the majority of the stalls are reserved for local growers from Illinois and Michigan, and you don't have the annoying arts-and-crafts distractions that you find at other markets (no offense). Today's selections included freshly-picked chestnuts, beautiful oyster mushrooms, and fragrant honey crisp apples. I would opt for this market rather than the Lincoln Park market farther north. There is something that seems more genuinely local about this one. My only complaint is that the produce isn't necessarily cheap, but it is nearly always delicious. If buying items that have already been bagged, be sure to search through. I have learned that rotting apples often lurk at the bottom of some of those baskets. Be certain to visit soon, the market closes October 23.",
            "author": "Danielle A."
        }
    ],
    "priceRange": "$",
    "name": "Near North Chicago Farmer’s Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "Division And Dearborn",
        "postalCode": "60611",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/lZkp-cdNfhxqBkZO4UC14Q/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}