{
    "aggregateRating": {
        "reviewCount": 7,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-26",
            "description": "This is the best, most local farmer's market you'll find. If it's not in season, you likely won't find it here. Also, if you're not an early riser (8/9am at the latest) you'll miss out on everything that's good and be left picking through the leftover scraps.\n\nThere are a bunch of a meat vendors. The guy from Ashland, IL has every kind of pork product known...if he's there!\n\nYou can also count on getting almost any sort of Midwestern baked good you might want (if it involves a fruit, you'd be better off buying that baked good when that fruit is in season.)\n\nThey have a table at the main intersection where you can buy tokens with a credit card so that you don't need to hit an ATM before heading to this market.",
            "author": "Walker H."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-05-30",
            "description": "I know it's early in the growing season but really nothing offered was worth the trip. Garden plants looked like they came from Lowes...marked up and pathetic. One food truck but not appealing. I know that you cannot compare this to San Diego farmers markets but really...I couldn't race out of there fast enough. Repackaged produce from Sams...no fresh strawberries...no fresh lettuce greens or flowers in season. Parking problems and closed roads...crazy. How about jams flowers food trucks and holistic goodies like candles scented oils herbs and jewelry, baked goods...bread brownies cookies. Don't even bother.",
            "author": "Steve B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-05-29",
            "description": "We were in town to see all the Lincoln sites, but it was Saturday morning, so we made a special trip to see the local farmers market.  Super nice vendors and great variety of local veggies, baked goods, flowers, cheeses, potted plants, meats, etc., etc. in a three block area downtown adjacent to the Old Capital.\n\nEven if you're a visitor, there's much to be had.  We had some wonderful blueberry coffee, and purchased a homemade brownie, cookies and bread, popcorn, and cheese to take with us for lunch and snacking.  The made to order omlets smelled marvelous, but we'd already had breakfast at the hotel.  In spite of the rain it was a worthwhile stop.\n\nSupport your local farmers market - even in you're in town site seeing!!",
            "author": "Chris K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-17",
            "description": "My family and I happened upon this farmers market a couple Saturdays ago when we were driving through Springfield.  It was GREAT!  3 blocks, lots of fresh produce (greens, tomatoes, cherries, mushrooms), delicious cheese, flowers, omelets, coffee, and the day we were there, there was pizza too (it was mobile pizza oven with super fresh pizza ingredients ... not sure if it's there all the time though).  \n\nIt was a bit crowded, but I was glad of that - there was plenty of good fresh produce to go around!",
            "author": "Elizabeth T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-05-28",
            "description": "Old Capitol Farmer's Market.. What to say? What to say? This was a great start to my Saturday morning! The farmers market was not that big but each vender brought something unique to the market. It was very conveniently located down from the Old State Capitol. This was nice as I was a tourist and could easily venture to the Old State Capitol as well as the New State Capitol after visiting the market. The reason why I gave Old Capitol Farmer's Market 4 out of 5 stars is because it is a smaller farmers market but it was worth the visit and I would go back.",
            "author": "Matthew T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-07",
            "description": "Terrific produce, baked goods, and cheese!",
            "author": "Sabha G."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-05-16",
            "description": "I have been waiting for this Farmer's Market to open for months.  Today it finally opened and I have to say that it is truly a dismal failure.  By 11:00 they ran out of strawberries (the only fruit present).  Most of the fare was lettuces and raddishes.  The lettuce looked limp for the most part.  The radish looked good and so did the zucchini, yellow squash and green onions.  I bought a tomato and some zucchini.  The tomato is pretty good, haven't cut the zucchini yet.  I also bought some lemonade - save your money, it wasn't that great.  Honestly, this is the absolute worst farmer's market I've ever seen.  There was no corn on the cob roasting, no smoke fish and no fruit or vendors selling soy candles.  The lady who sold me the lemonade, explained that they were all \"local\" growers.  That's fine but they should really consider expanding and letting some other farmers come in and add some variety.  They can always put a special sign up on the stands that are in fact \"locally\" grown produce.  What they have now is a complete waste of time and not worth patronizing.  Just sayin...",
            "author": "Sonia D."
        }
    ],
    "priceRange": "$",
    "name": "Old Capitol Farmers Market",
    "address": {
        "addressLocality": "Springfield",
        "addressRegion": "IL",
        "streetAddress": "Fourth &  Adams St",
        "postalCode": "62704",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Bl-9IvtQnU4FzQ-ERzZJag/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+12175441723"
}