{
    "aggregateRating": {
        "reviewCount": 12,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-10-27",
            "description": "We got to the Portage Park Farmers Market just as they were about to close on a dreary day. There were perhaps 18 booths still going, some of which has just started to close for the day.\n\nThere were merchants selling produce, meat, dairy, pastries, and more. There was also a few selling ready to eat foods - tacos, coffee, and I think a few more. Since the day wasn't so nice and it was late, there were only a few patrons.\n\nEvery one of the merchants we talked to was nice. We ended up buying some fresh produce from farms. The one thing I wish we'd gotten fresh eggs. At the time, comparing $6 a dozen to what we pay at Aldi seemed to be ridiculous. Now, the thought of having fresh eggs makes we wish I had not thought about money. Next time...",
            "author": "Bob R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-05",
            "description": "I enjoy Farmers Markets that accentuate the local communities culture and businesses. \n\nThe Portage Park Farmers Market is smaller than your Logan Square and Fulton Market varieties. What it lacks in size it makes up for it with the quality. Find local vendors, veterinary shops, dental offices, and other local businesses. You will get a few of the larger farmers market vendors, but I appreciate the character of this market.\n\nPortage Park for the win.",
            "author": "Rawlins R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-06-30",
            "description": "This is one of my favorite markets in the city.  It is so nice to stroll through a beautiful park on a Sunday and munch on delicious, local products and take home local produce.  And listen to music!  And adopt a dog if that's on your wish list!  The presence of Fannie Schmoe's Bakery is enough to get me out of bed and down to the park.  \n\nTo the reviews complaining that there is no produce-notice the dates on those reviews.  Early June.  The growing season is barely started and they are acting like they expected to be bringing home a full summer's harvest!  These are small, local farms and they grow seasonally.  Many don't have the big greenhouses or the ability to travel from further south to get to market.  Sheesh!  \n\nEat locally.  Eat seasonally.  And have fun doing it!",
            "author": "Laurie V."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-07-27",
            "description": "Three stars for the Portage Park Farmers Market. Why only three? \n\nThis is a nice little market to stroll around on Sunday mornings. There's usually live music, vendors with fresh baked goods, tamales, crepes, local honey, jam, cheese, knife sharpening. All that's missing is, well, farmers. \n\nWhile there is *some* fresh produce available, the selection is very limited. Even in late July the majority of the sellers weren't there with produce, but with prepared goods. That's all fine and well, but what I'm looking for in a farmer's market is a good selection of fresh fruit and vegetables. There's definitely a place for the prepared items and freshly cooked stuff (you will never hear me complain about a fresh, warm, crepe) at a farmer's market, but I think the majority of the market should be about produce. \n\nEven though Portage Park is only a five minute walk from my house (yay!) I make the trek to the Oak Park farmers market throughout the summer for fresh, local or nearby fruits and veggies. Early in the season there's not as much there--that's the growing season for ya--but that market is still much more produce-centered than Portage Park is. I still stop by the Portage Park market on the days it's running (keep one of their magnets on their fridge to check the dates, since it doesn't happen every week), but I've learned not to expect too much in the way of fruit and veggies.",
            "author": "Carolyn P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-19",
            "description": "This market is very good.  And there's a lot of potential for this market to hit 5 stars.\n\nThere's what I consider an average selection of vendors, although the number of options is improving.\n\nFirst thing.  THANK YOU! THANK YOU! THANK YOU! to the vendor (Faith's Farm?) that sold us the hamburger brats this past weekend!  You now have a new, loyal customer.  So very delicious.\n\nAdditional shout-outs to Regulus Coffee and Fannie Schmoe's Bakery!  Your products are always on my list.   \n\nThe honey vendor is outstanding as well!  We buy various products from this guy, which are always amazing.  http://www.patzmapleandhoney.com/\n\nI also appreciate that they have regular dog adoption events.  \n\nFinally, this market usually has very talented musicians.  My favorite regular is Kent Rose (http://www.kentrose.com).  A voice like butter.",
            "author": "Lady D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-06-05",
            "description": "As another reviewer mentioned, this is more a MARKET versus a farmers market. There was only one tent set up with actual produce and while the prices were pretty cheap, I felt like the produce wasn't very fresh. A lot of it looked really dried out and not the best quality, especially compared to other markets in the city, which was disappointing. Hopefully it was just a bad week for them, I will check them out again next time to see if the quality looks better. \n\nOtherwise, the stands with local cheese, coffee, baked goods, etc. all looked really good. In a neighborhood where you do not always see a lot of the locals out socializing together, it was nice seeing so many people come out for this market. \n\nI think this location has a lot of potential. It is within walking distance for me, so I would really like to see this little market grow. There is obviously community interest in it, we just need the people in the area to continue supporting it so that more produce vendors will buy in!",
            "author": "Melissa S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-27",
            "description": "This is a great farmers market! Lots of local support, local businesses, and best of all, IT IS LOCAL! I have been to several other farmers markets, and this is a great one. Very friendly and knowledgeable vendors with a great selection. There is always live music and it is the perfect setting to lay a blanket down with your family or dog, eat some delicious crepes and drink coffee. Highly recommended.",
            "author": "Elizabeth M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-18",
            "description": "Portage Park Farmers Market you get another star!\n\nTen mini pumpkins and gourds for $2.00...be still my Autumn decorating heart.\n\nHuge bag of the freshest spinach I ever bought for $2.00...recipes scrolled through the brain as I paid!\n\nSign the petition for Portage Park to get an enclosed Doggie-Park, please!\n\nStill small. Still plenty of parking. Still not crowded.\nStill on every other Sunday, but the season is coming to an end...sniff-sniff, pass me a kleenex please.",
            "author": "Liz M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-07-27",
            "description": "I live close to the park, so proximity is a factor in my review. I love Portage Park, and the farmers market makes for a nice walk on summer Sundays. It's a bit small and is lacking somewhat in variety of fresh produce, but the produce that is there is always quality. The prepared foods are always excellent. The live music is a nice touch, too. They also frequently have let adoptions going on. I would love to see more local farms, and I hope the market continues to grow.",
            "author": "Julie J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-28",
            "description": "This market is in a beautiful setting and the vendors a great mix of food and goods and the list of both has and continues to grow. Have heard some excellent music here too. Bring your dog with you and take a break in the nearby dog park.  Come and spend the day and enjoy!",
            "author": "Gretchen G."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2011-06-05",
            "description": "This is a market - but NOT a farmers market.  I waited 2 weeks for this and it only had 1 farm participating.......and not much to offer, and not the best prices.....\n\nThere were booths with nut, coffee, t-shirt, cheese, meat, bread, hot dogs, olives etc.....everything seemed overpriced and overhyped.  Not much produce at all.  Now I have to scope out where a real farmers market in the area might be.",
            "author": "tbird M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-06-05",
            "description": "What a fine little market.  I think they are doing a splendid job for being fairly new and are a terrific addition to the community.  @Tbird Any regular market goer knows that fresh produce can be sparse at the start of the season due to weather conditions. You can't fault the market for something they have no control over. Now, if only more local folks would get involved so that the market can continue to grow and flourish. It would be a win/win!",
            "author": "J O."
        }
    ],
    "priceRange": "$$",
    "name": "Portage Park Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "4100 N Long Ave",
        "postalCode": "60601",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/QU7DwafSUAf20u30cUuO8Q/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17737205381"
}