{
    "aggregateRating": {
        "reviewCount": 21,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-16",
            "description": "Love this place! Tons of apples (especially Honeycrisp), none of the poor animals sitting out in the sun that so many other places have, and the people who work here are very kind. It's not terribly crowded, either, and they have a cute shop for lunch with hot dogs and pulled pork sandwiches. Note about September 2018: the mosquitoes are INSANE. BRING INDUSTRIAL STRENGTH BUG SPRAY, and you'll be fine.",
            "author": "Meagan F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-09-30",
            "description": "It's so cute!!! Who doesn't love an orchard?!!!! \n\nI so didn't plan on doing this while I was in town but I am so glad that I did. Their apples are delicious and it's not expensive. And there's something about picking them fresh yourself! \n\nAlso, you must try their apple donuts!!! They are so soft and delicious and not very sweet. Also try their apple cider and a slice of apple pie. \n\nThere's a little store with other fresh goodies that you can take home with you. \n\nThe take cash or card.",
            "author": "Brandi I."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-02-15",
            "description": "An entire peck of honey crisp apples was only 24.50! \nGreat staff, well maintained orchard and amazing prices. Kids had a great time minus all the frills!(no wagon rides/bounce houses, etc.) I would have given 5 stars if the little country shop offered more. I would have liked to grab pack of cider donuts and maybe caramel apples to go but no such luck.",
            "author": "Kathy H."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-09-16",
            "description": "Swarms of mosquitoes! Apples were good but we had to pick them in about 15 minutes because we were being eaten alive! No fun at all.\nWon't go next year without checking. Also that 1-4 people for $19 only gets you ONE bag, so children can't even carry a small bag. Disappointing.",
            "author": "Eve N."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-09-18",
            "description": "As others have mentioned, there were a lot of mosquitoes which bit everyone in our party including our 2 year old. The apples were fine, but would not come back unless they resolve this issue.",
            "author": "Pepsi M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-07",
            "description": "Wonderful apple picking experience!! Charming, personable, natural, and engaging. Can buy 1 peck bags to fill, given picking instructions and able to pick as many apples that will fit into the bag. If not interested in picking apples, there is a cute shop to purchase already picked apples. Reasonably priced and great tasting apples. Will definitely return next season.",
            "author": "Jessica A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-30",
            "description": "My husband and I were looking for a no-frills farm for apple picking, and this place is exactly that! Parking is free, there's no admission price and U-Pick apples are $19/peck. The orchard is well-organized so it's easy to find which types to pick. We picked a little of everything that was available (Golden Delicious, Fuji, Gala and Jonathan). I think Honeycrisp season is over, but they have them in the barn to purchase, along with various jams, butters and other local goods. Staff is super friendly and we enjoyed our visit! We'll definitely be back next year for more apples!",
            "author": "Bri A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-10-26",
            "description": "Not too far from Chicago, a more minimal u-pick orchard without the frills, which worked out for us. We went on the last day of their season, and it was $1/lb, 25% off everything in the store. Besides apples, they also had some pears. Even though there weren't too many types of apples available, totally understandable since it was their last day. The apples were delicious, friendly owner, and we all genuinely enjoyed our time.",
            "author": "Jen J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-09-16",
            "description": "A no frills u-pick place that was more low key than some of the other apple orchards around. This is a plus. A peck of honey crisp apples was $25 while the other apples were $19/peck.",
            "author": "Weifei Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-05",
            "description": "Love this place , we are a local family and come here multi times a year! Unlike the too big too expensive farm down road. Great everything here. Can't wait for more donuts!!!",
            "author": "T B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-09",
            "description": "Absolutely a perfect orchard if you want to focus on picking apples! Easy to get to from the Chicago suburbs and reasonably priced. You may want to pair this trip with a visit to somewhere else in the area because it is a compact orchard that you will spend an hour at.",
            "author": "Jeff K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-10-09",
            "description": "I love this place! For $17 a peck it's the best deal around. There is no need to pay the big bucks at other places for bounce houses & utter chaos. The apples were so tasty and juicy. They have a lot of Honeycrisp trees too, which turns out to be a great deal overall! I will definitely be back!",
            "author": "Michelle D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-21",
            "description": "Just what we were looking for!  Just apple picking, varieties to choose from, plenty of great looking and tasting apples.  Good price for a peck of apples.  They had a cute store with cider donuts, honey, etc. and a pile of hay for the kids to jump in.  We will definitely come here again!",
            "author": "Katie T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-10-01",
            "description": "No frills orchard for apple picking. Organized in nice sections- one for just honey crisp, the other was general. You can get a bag and fill it up. They have a nice store with various pies, butter, jam and salsa. The donuts for sale were fresh. The cold apple cider was refreshing on the hot day that we visited. There is a huge chair to get photos of your kiddies with:)! The staff is friendly and helpful. There is a parking area outside for visitors.",
            "author": "Varun N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-27",
            "description": "Really nice apple orchard. It's not super fancy but it's fairly cheap and it's all fresh. They don't have a huge variety of apples to pick but it's not busy and it's clean. I also recommend getting the apple pie. It's to die for.",
            "author": "Ryan H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-11",
            "description": "Picked some wonderful Honeycrisp here today. We loved the small quaint orchard with friendly staff. So glad we only had to pay for what we picked. No overpriced entrance fees. Splurge on a slice of the strawberry rhubarb pie a la mode. It was heavenly!",
            "author": "Erin H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-06",
            "description": "What a beautiful orchard, friendly people. Reasonable prices. Not a circus like most Orchards",
            "author": "SueEllen A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-09-18",
            "description": "Great apples and pumpkins.  My kids love the apple donuts.  The harvest wasn't great this year so no apple picking this year, but last year was great and so will next year.  Great people that run this orchard.  The dwarf apple trees are really great for kids to pick apples because they are so low to the ground.  I really like this place and we will be back for pumpkins later this fall.  \n\nThe produce is expensive just like you would expect for organic high end vegetables and fruit, however, there is no admission fee or other circus gimmicks which makes this a family friendly place to go on a budget.",
            "author": "David N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-05-12",
            "description": "When my wife (then girlfriend) and I met, we started a tradition of picking fresh apples in the fall so that she can bake delicious homemade pies.  We've tried a few places along the way, all in the outskirts of the suburbs, but Prairie Sky Orchard is BY FAR our favorite.\n\nWhat separates Prairie Sky is its lack of gimmicks.  Here, you won't be charged admission to enter; there's no carnival rides, no tourist traps, no overpriced concession stands.  Here, it's all about the apples and the pumpkins - everything you need to get your fall festivities going!\n\nHere's the trick to really enjoy it: pay attention to the weather and to their website.  Even though the farm has expanded the orchard and their pumpkin patch, this place has become so popular that they tend to run out!  \n\nIt's nothing but pure simplicity.  You get your bag, and you pick your apples off the tree.  They have several different varieties.  In the barn, they have cider, doughnuts, pies, jams, and other items.  All fairly priced, I think (at least, compared to other orchards we've been to), and, again, not too flashy.\n\nDon't get the wrong idea about there being a lack of entertainment: this place is perfect for kids, too!  They don't need to be overstimulated by displays and sugar.  Here they can pick their own pumpkin and tote in in a Radio Flyer to the pumpkin wash (to clean off the dirt n mud).\n\nIt might be a bit of a drive for some, but it's well worth it.  Make a day out of it, if you can - after this visit, head a little further into Union to visit the Illinois Railway Museum!",
            "author": "Tom H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-08",
            "description": "We drove here from Chicago with our 5 month old son.  I was intent on apple picking and getting pumpkins not at the local Jewel, but also not dealing with outrageous fees and huge crowds.  This little orchard was just the ticket.\n\nWe strolled around in the orchard and picked a peck which I think came out to like $12.  It was gorgeous, and there were still plenty of apples left, although my husband is freakishly tall so we were able to reach up for the good apples all those average size people left behind. Lots of families but not too crowded.  We sampled our loot while walking around which was cool.\n\nAfter we got our fill of apples, we got 2 pumpkins and bought a bunch of stuff in the shop including salsas, apple butter, cider, doughnuts, a bunch of other jars of stuff that looked tasty.  The damage?  $95.  We realized we'd been had when on the way home we passed a pumpkin patch that said \"2 pumpkins for $3\" (We paid $9 a piece for ours).  However, there was no entrance fee and no parking fee, and the people running this joint were really nice.  Definitely recommended for a day out of the city.\n\nIf picking apples and buying canned goods sounds too boring, All Seasons Orchard is nearby, but it looked massively crowded so we stayed clear.",
            "author": "JJ Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-02",
            "description": "This is a great, family run orchard. If you want to experience what nature has to offer in the fall and avoid bouncy houses, admission fees, overpriced concessions and commotion, this is the place for you! Beautiful apples and pumpkins, yummy apple cider donuts and fresh cider, a small hay mound for playtime and a super-cute oversized chair for pictures make this the perfect place for a stress-free family outing! The apples are delicious! We have taken our preschool children here on field trips for many years and we get rave reviews from our parents...it truly is a special place!",
            "author": "Jackie D."
        }
    ],
    "priceRange": "$",
    "name": "Prairie Sky Orchard",
    "address": {
        "addressLocality": "Union",
        "addressRegion": "IL",
        "streetAddress": "4914 N Union Rd",
        "postalCode": "60180",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/EOvu7AnRg9_P6dqEEk9Dyw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18159234834"
}