{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-19",
            "description": "Went here for the first time today. This place is awesome. My 4 year old had an endless list of fun activities to choose from. Great food options as well. We will definitely be back.",
            "author": "John P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-20",
            "description": "It's nice, but the price is outrageous. Try to avoid going on weekends. It's very crowded and people will steal your place in line etc. However it has enjoyable activities for kids but lines are long and don't be shocked if big older kids run rampant and try to knock your toddlers over. A place to go once a year, not more than that.",
            "author": "Katie C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-24",
            "description": "Corn is ready now!  This place is awesome for sweet corn! $5/dozen.  It's super fresh - usually picked same day.  It literally almost jumps off the cob into your mouth.\n\nYUMYUMYUMYUMYUM",
            "author": "Kelly M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-09-25",
            "description": "The new layout is much nicer this year. They've added someone's new things for the kids to play on, like tire horse swings and a see-saw.  They've also updated the kids corn maze to include a \"who dun it\" clues finding game. This kept my 5 & 2 year old excited while navigating the maze.",
            "author": "Randy N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-19",
            "description": "We used to drive over an hour to another pumpkin patch for the kids until we discovered Rader's in our town!!!  It has so much to do!  It is the perfect place to spend the afternoon with the kids in the fall!  Can't wait for pumpkin season this year!",
            "author": "Tiffany B."
        }
    ],
    "priceRange": "$$",
    "name": "Rader Family Farms",
    "address": {
        "addressLocality": "Normal",
        "addressRegion": "IL",
        "streetAddress": "1312 Ropp Rd",
        "postalCode": "61705",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/bSiy6aZ0z61KF_zerjjc7Q/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13092758765"
}