{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-30",
            "description": "Fun place to shop for pumpkins. They have a wicked selection to choose from. They were $7-10 per pumpkin. We got there when the guy was bringing them straight from the field! Fresh ones last longer.  ;-)\n\nRandy's also sells apple cider, frosted cookies, pumpkin carving tools, decorations, and a few root vegetables. It looked like they have a little more going on during the weekend with hot food and hayrack rides.\n\nBe sure to take your picture with one of the wooden pop-ups they have built. Super cute! Randy's is a fun place to visit during the Halloween season, just be sure to pack your wallet.",
            "author": "MELEK L."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-10-19",
            "description": "I have been very disappointed.  We went there the first time a few months ago.  There hours said open.  Even the sign stated their opening time.  We waited 20 minutes in the parking lot and they never opened.  Then I took my son there to have a fun day to find out the rides are only available during the weekend.  Okay I understand it because school is in session but there are still moms that have preschoolers and while the weather is nice is looking for some fun things to do.  I am sure a group of moms looking for a play date would agree.  But it wasn't just the fact that the rides were not available but the lady at the desk was so rude.    She was not personable or anything.  Almost like she tried to be belittling.  But honey your no better then the next.  \n\nI don't think Ill ever waste my time going there again.  I'd rather pay a little bit more and know that I wont be stressed by people showing up late and people being ignorant.",
            "author": "Kelly M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-01",
            "description": "We go here every year for pumpkins but on top of that they have rides for the kids and a little vegetable stand inside. We love coming here because it is so interactive for the whole family.",
            "author": "Morgan M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-08-02",
            "description": "I'm giving them a 3, I only bought corn but I wouldn't go back for it, wasn't very good or fresh. I gave an extra star because the employees are friendly.",
            "author": "Kirsten R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-08-11",
            "description": "I feel as though this place is waiting for the land price to increase to the point where they can sell. It's very expensive to buy things here.",
            "author": "Marc B."
        }
    ],
    "priceRange": "$$$",
    "name": "Randy’s Vegetables",
    "address": {
        "addressLocality": "Sleepy Hollow",
        "addressRegion": "IL",
        "streetAddress": "15N440 Randall Rd",
        "postalCode": "60118",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KiC7p_qHk05eWEcMNyxXng/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18474285244"
}