{
    "aggregateRating": {
        "reviewCount": 13,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-11-01",
            "description": "I've been to a number of Farmers Markets throughout Chicago and the surrounding suburbs. From the market in Daley Center to markets on the near west side, Lombard, Brookfield, Skokie, and now Riverside. While parking can be questionable at some locations the regular and handicap parking here seems plentiful within the the square and the entire area has both a true small town feel and also a big local park feel with trees and flowers. \n\nFor an afternoon Farmers Market there was a full supply of vendors during each of my visits. Many have mentioned the knife sharpening and after I had a pair of scissors sharpened I'm also a believer. With many vendors offering multiple types of veggies and plants there is a lot to look at. While I didn't buy raw honey (not super processed or pasteurized so most people say it has better health benefits and and fuller flavor) here at Riverside yet, I expect to need some at the start of the next season. \n\nThere are multiple Amish vendors and I was lucky to spend a while talking to one of the Amish families about their farm and some of their core values. I've worked directly with a few different Amish families in Illinois and Indiana and have found each to be an unique experience. If you have time to talk to some of them or buy your veggies or baked goods from them you'll love the experience. \n\nSome people I've spoken to treat a Farmers Market like a bartering flea market but I find the quality to be high and prices reasonable and don't think that it's appropriate to ask a farmer or baker to lower their price when they have put some high labor in to their products. Hard work should be rewarded.",
            "author": "Anthony U."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-12-29",
            "description": "This Farmer's market is small but cute. There's a booth that sells wood fire pizza 12\" for 10 bucks!  I didn't see any flower bouquets when I went in October but I did see an abundance of pumpkins and gourds.  I like that they have evening hours - open until 7:30pm.",
            "author": "Irene G."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2015-07-22",
            "description": "The smoothies were great!  Very small market, some baked goods, vegetables, etc.  \nGot a strawberry rhubarb pie from Yoder bakery, mostly gel with a bit of fruit in it, not what\nI expected at all....\nItems a bit pricy...",
            "author": "Kat L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-04-16",
            "description": "Love the Riverside Farmer's Market, can't wait to get back to it this year!  My kids are always excited to see which fruits and vegetables are in season.  We LOVE the pizza and fruit smoothies too.  The eggs are amazingly fresh.  I also love the variety of vendors that participate; it is definitely worth checking out!\nMy husband loves the knife sharpener, thought I should add that too!",
            "author": "Gretchen L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-14",
            "description": "Unbeknownst to me, because I am, at times, rather absentminded, I dropped my phone at the market, somewhere between the tomatoes, the pickles, and the SENSATIONAL PEAR MELON. (Haven't cracked that baby open yet, so can't comment on the sensation.) I still didn't know this about two hours later (see previous comment re: mind; absent) until my husband received a text regarding a phone someone found. (Me: \"Phone?\" Digging through purse...\"Uh...NOPE! Phone done gone!\") Turns out the market manager's daughter was all tech savvy and was able to discern and contact my main peeps (or peep, as it were.) I got my phone back right quick. My husband did not get the manager's name, so I hope she reads this! Thank you and your daughter so much!",
            "author": "Victoria O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-28",
            "description": "Selection of fresh veggies and fruit, plants and flowers, fish & meat, gluten free baked goods, eggs, tasty pastries and breads, pickles and jams, pizza, fresh fruit smoothies, artisanal honey, locally made pottery, dips & salsas, and beeswax candles!  Worth checking-out on Wednesdays from 2:30pm - 7pm.",
            "author": "Amelie and Dan B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-14",
            "description": "A great market. Intimate setting, local foods, even pizza while you wait. Loved it.",
            "author": "Abigail R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-07",
            "description": "The first week for the market was amazing.  We joined the CSA so we picked up our first box of fresh veggies and eggs.  We also came home with gluten free pizzas cooked right there in a wood-fired oven, raw honey from a local beekeeper, a beeswax candle, a gluten free poppyseed loaf, gluten free chocolate chip cookies, and fresh fruit smoothies.  Next week we plan to bring our knives for sharpening (and lawn mower blade), and pick up some jam, mushrooms and herbed vinegar.  Can't wait - it's going to be a great season!",
            "author": "Christine L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-27",
            "description": "Riverside's farmers' market rates high in my book.  Why even go to Oak Park and try and find parking, we have it all right here.",
            "author": "Mary K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-14",
            "description": "Good mix of farmers vs. non farmers.  Love the homemade dog treat lady.  Really beautiful location.  Great programs every week.",
            "author": "Jake S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-09-11",
            "description": "We are loving the Riverside Farmer's Market this year.  I've been able to purchase almost all my fresh produce this summer at this market. We especially love the Amish farmer's produce - the best broccoli, beautiful little brussle sprouts, and perfect tomatoes. I liked his tomatoes so much that I purchased a whole box and canned pasta sauce to keep this taste going through winter. The Raw kale chips, and toxin-free bug spray is a nice addition. There is enough variety to spend the evening and feed your family dinner at the market with pizza, fruit smoothies, and plenty of baked goods and hand crafted chocolates.  This has become a regular fun Wednesday afternoon stop for us.",
            "author": "Elaine R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-17",
            "description": "Great location for taking a hike along the river and getting great local foods.  Farm fresh eggs are a perfect addition!",
            "author": "Diane S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-09-14",
            "description": "Great, friendly vendors and surprises every week!  My only issue is that I can;t get there until 5:30 or so and sometimes it seems like some of the vendors have already left.  Well worth a visit however!",
            "author": "Rachel G."
        }
    ],
    "priceRange": "$$",
    "name": "Riverside Farmers Market",
    "address": {
        "addressLocality": "Riverside",
        "addressRegion": "IL",
        "streetAddress": "10 Pine Ave",
        "postalCode": "60546",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/WzMIIc2R1bmu-X99sPN4rA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17086558408"
}