{
    "aggregateRating": {
        "reviewCount": 8,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-08",
            "description": "Rockford City Market is a fun twist on a Farmer's Market that is in Downtown Rockford on Water Street between State and Market. \n\nThere are people selling homemade crafts, produce, meats and cheeses, beer (yes, beer! Carlyle's brewing company has a table there and some local distributor as well), food and entertainment! From what I gathered, the booths change through out the season; some are only there for certain days while others for the entire show. That can be good or bad. If you find a place you like they may not be there the next week, but there may be something you like more! Plus the entertainment changes every week. \n\nThis week while there we bought beer, a necklace and earrings for my wife, candied nuts, beer, peaches, pet odor eliminate candles, beer, sweet corn, Bleu cheese, a 5 gallon bucket, beer (not a 5 gallon bucket of beer!) some food and just had a good time. We even were able to take our son over to the permanent cooling off fountain the city has where he and the other kids can play in it while the parents watched. \n\nIt was a good time. We killed 2 hours here just hanging out. Parking is a little difficult. There is a lot of public parking, but it was full by the time we arrived and ended up having to park in the public lot over by the Metro Center. This isn't a bad walk, nice scenic view crossing the State Street bridge over the mighty Rock River. \n\nIf you go, bring cash. Some places might take cards or checks, but it seemed mostly to be a cash only arrangement.",
            "author": "James R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-20",
            "description": "I've been here a few times and I think this is the best kept secret in RFD.  Plenty of options of places to eat, either at the market or surrounding areas.  My suggestion is to get there as early as possible.  I've varied the times I've gone and the later it is, vendors might run out.  There are maybe two or three places to actually buy produce etc,so don't get your hopes up on cleaning house on veggies.  However, food and beer are abundant, as well as live music.  Great local artists selling their items as well.  \nPlenty of parking near by.  Don't be afraid to hang by the river!",
            "author": "Erin D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-07",
            "description": "Had a great time, very good to take a family to. We ate Zammuto's Italian Ice from their booth, which was 5.00 for 2 small. We also rode the trolley.",
            "author": "Laurie H."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2013-07-22",
            "description": "There were a few good tents. Thats the only good thing i have to say about it.\n\nThe crowd at the city market seems to not realize that their are other people there besides them. To even think about getting a sample of something or asking any questions about the products of a booth, you would literally have to push through the 8-12 people who decide to over run the tent so they can continue to snack. \n\nI've seen too many people stand around the same tent for hours to keep getting samples. buy a damn jar or bucket or what the f*** ever and get out of the way so other people can enjoy these booths too.\n\nIf it weren't for the crowd of disrespectful rockfordians, i'm sure it'd be a great place to visit.",
            "author": "Jazmin M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-14",
            "description": "I have been going to this market since it first opened since it was walking distance from my past employer. I loved he local specialty shops and produce that were there. They have added more over the years as well as a pavilion for shade which is great! Only negative thing I could say more seating",
            "author": "Jennifer E."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-04-13",
            "description": "This is a great idea and I would love to spend every Friday here...but the downside is that it's too crowded. Needs to be more spread out",
            "author": "Tricia H."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-08-29",
            "description": "I loved city market when it originally started, but as the event became more popular and overcrowded, it lost a lot of it's appeal. When the event banned dogs, it became even more of a downer. From what I hear said ban on dogs was due to irresponsible owners, which again is a pity, but no less than I would expect. The vendors are great individually and I still love going to the market for the fun products and delightful foods, but it's not as great as some of the markets in Beloit, Madison, and Chicago.",
            "author": "Rachel H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-10-09",
            "description": "We have enjoyed the City Market a number of times on a Summer evening.  As it becomes more popular, which is seems to be, it needs to grow in space and in vendors.  Last time we were there it appeared there were more people there than the vendors and venue could handle.  Worth a try and I wish them success if/when they grow!",
            "author": "Doug K."
        }
    ],
    "priceRange": "$$",
    "name": "Rockford City Market",
    "address": {
        "addressLocality": "Rockford",
        "addressRegion": "IL",
        "streetAddress": "124 N Water St",
        "postalCode": "61107",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/8uufQa8ylUppVVBBKSLh3Q/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18159775124"
}