{
    "aggregateRating": {
        "reviewCount": 9,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-25",
            "description": "I've been a fan of the honey from Rustic Road for a long time. I happened to be in the area and was very excited to stop in. While it's early in the season they had lots of delicious greens available and a few of the early crops like strawberries and rhubarb. Everything was delicious and high quality. It's definitely the kind of place you'd want to stop in regularly to visit as they always have different seasonal fruit and veg ready. \n\nThey also have a late variety of different meat products in freezer chests if that's your thing. I didn't partake but the sausage they were cooking up while there smelled amazing. \n\nCredit cards are accepted!",
            "author": "Marie B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-10",
            "description": "***Bacon lovers alert***\n\nI love this farm! My kids adore this farm! The animals are so cute and sweet and come right up to say hello. I had no idea goats were so darn funny and so goofy! I could sit there all day hanging with those baby goats and the coo of the hens. If you are lucky the roster will announce himself.\n\nAlso the cottage bacon is hands down the best bacon I've ever had. No nitrates or nitrites! (Let's be real for a minute... If you think you are getting high end, great quality bacon from your local chain grocery store, you aren't! It's overly salty and some well known brands taste like chemicals to me...)\n\nIt's a family run farm and it's well worth the drive! They have other products too you should really check out. But seriously, Stock up on that cottage bacon. Trust me you will eat it and enjoy it so much you can't wait to find an excuse to cook it again.",
            "author": "H D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-02-02",
            "description": "Eggs are great. Everything I have tried is great. And, the owners are super sweet. \n\nPlus you you can watch the goats and chickens roam.",
            "author": "Shilpi H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-26",
            "description": "The best thing about Rustic Road: The farmers are chefs!  I love to experiment and try new recipes, so I was pleased to find some unique vegetables in our CSA box.  The farmers send out detailed emails, which include recipes and special items available, such as French chickens and their delicious bacon.\n\nMy sons LOVE going to the farm.  There are chickens all over the place, two sweet dogs, and lots of sheep and goats.  The kids are welcome to interact with the animals, ask questions of Farmers Mark and Luis, and explore the farm.  They also have u-pick berries at the end of the summer for a great price.  \n\nWe are lucky to have Rustic Road Farm in our community!",
            "author": "Ruth Ann M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-02-06",
            "description": "What a great farm.  Went for the first time with my siblings and friend.  Marc & Luis were so nice.  Loved learning about the farm.  Came home with fresh eggs (never had a fresh egg before), honey, cocoa honey, garlic, pork loin roast and newly signed up for a 20 weeks csa starting in june.  Visited the baby goats, pigs, chickens and puppies.  Highly recommend a visit.",
            "author": "Bridget S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-11-24",
            "description": "Love this place. Fresh, local produce. We belong to their CSA in the summer and pick-up our veggies at the Wheaton Farmer's Market. Great deal for organic produce. The farm is great as you can see the chickens, goats, pigs and produce for yourself. Owners are very friendly and car about what they are doing. It shows in the quality of their food. They also sell meat, eggs, honey, and prepared items (they are chefs). Highly recommend!",
            "author": "Miki L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-01-16",
            "description": "They are the nicest people! So accommodating. Explain everything so thoroughly. And so love that they open everything up to me and my family!  My daughter loves it there.",
            "author": "Kim K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-02-27",
            "description": "We went for the baby goats but will return for the food! I didn't think a farm would have much to offer in February, but I was wrong. My toddler had a great time chasing chickens and petting baby goats with my husband while I was able to peruse the store. They offered free samples of some of their provisions, including the best hot chocolate I have ever had (this may seem like an exaggeration, but as a non-coffee drinker, I've had my fair share of hot chocolate). I picked up a few soups and will definitely be back for more. Try the harvest chowder!",
            "author": "Amy P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-12",
            "description": "The real deal.  A Farmer's Market that is at the farm.   I have been waiting for years for a farm / farmer's market. like this.  To start,  one half of the duo that own this farm is a top Chef/Partner for Lettuce Entertain You.  A major part of what is grown on this farm is served up at Big Bowl or other spots.  One of his Chefs Patricia Yeo makes chutney's  and jams that are to die for.  I have gone to this market a couple of Saturday's and have bought the most amazing stuff.  They sell fresh eggs, gorgeous produce, ciders, grains, pork, chicken - a one stop shop.  Best of all these two guys who own and operate this farm are just about the nicest guys around.  Know your food, know your farmer.  I am soooo happy that there is place like this out here!!! This market is open on Saturdays only.  Really worth a trip out to the \"country\". I must admit I knew this farm was opening - and know the guys who run it - but I think it is really the best thing in the Fox Valley area.",
            "author": "Jane B."
        }
    ],
    "priceRange": "$$",
    "name": "Rustic Road Farm",
    "address": {
        "addressLocality": "Elburn",
        "addressRegion": "IL",
        "streetAddress": "1N292 Brundige Rd",
        "postalCode": "60119",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/UjB-Wyisi1_lVq7Hz6dJXA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17736820490"
}