{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-21",
            "description": "Great prices and fresh produce!  Sign up for their emails and you will get special discounts.",
            "author": "Allison R."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-04-12",
            "description": "I feel its important for consumers to know the business practices of those they are buying from.  My husband and I owned two Breadsmith stores and provided bread to Seasons Produce.  My husband had two emergency surgeries back to back and we had to close the stores.  Seasons Market owes me 1200.00 and refuses to answer my calls or emails.  I will make it my business to let all their customers know how they treat their vendors until I am paid.  They have taken advantage of me and my husband during our most vulnerable time.  Is that really who you want to give your money to?",
            "author": "Tiffany K."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-09-23",
            "description": "Season's Produce and Specialty Market should not be listed as a farmers market on Yelp. It is not a farmers market. The majority of the produce is the same brand that you can purchase in any grocery store. All Season's receives a truckload of produce. Then the employees take the produce out of its plastic wrapper or containers and puts the produce in cardboard cartons which gives it a fresh from the farm feel. On my most recent trip to All Season's, the employees were taking plastic wrap off of the lettuce that came out of a large box. They were also taking Driscoll strawberries out of their plastic containers that came from a box with a California origin label. Only a few truly \"local\" items can be found here. For the most part, you are not supporting local agriculture when you shop here.",
            "author": "Jessica A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-05",
            "description": "Great price, Friendly staff, but I always feel like the location at 59 has more selection than the Bartlett Plaza.",
            "author": "Gina S."
        }
    ],
    "priceRange": "$$",
    "name": "Seasons Produce & Specialty Market",
    "address": {
        "addressLocality": "Bartlett",
        "addressRegion": "IL",
        "streetAddress": "1100 W Stearns Rd",
        "postalCode": "60103",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/-fyxgASpu1cZwajDHaiLzA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13122210648"
}