{
    "aggregateRating": {
        "reviewCount": 13,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-09",
            "description": "Decent farmer's market, modest in size with a serviceable array of goods.  It would rate as merely satisfactory, but I have to bump half a star just for being open on Sundays.  There are numerous Saturday markets but the Sunday roster is thin.  \n\nSome of the produce vendors are quite robust, some strangely meager.  Some offer samples; some don't even post prices.  You should find quality examples of pretty much anything you seek.  The better booths will be obvious after a quick survey.\n\nNon-produce:  two bakeries, one focused on sweets and one on high-end breads; That Pickle Guy (seriously, some of the best pickles anywhere); a salsa vendor; a cheese vendor; a brown egg vendor.  The ubiquitous River Valley Ranch is on hand for all of your mushroom needs.\n\nPrepared foods:  tamales, crepes, and that Amazing Kale Burger outfit.",
            "author": "David R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-06-20",
            "description": "Well, it's important to support your locals...I wish this market opened earlier in the season. Usually I do this market and 2 others weekly.  But Skokie's is convenient, has easy parking and, such friendly vendors. It's a good reason to wake up early on Sunday morning and head on out.",
            "author": "Renee R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-07-16",
            "description": "Skokie's Farmers Market is conveniently located in the parking lot and on the east lawn of the library, and the real draw is that it's open on Sundays.\n\nThey're not as big as Evanston's, yet they have a good selection of flowers, produce, miscellaneous spices, salsas, hand made soaps and clothing and jewelry vendors, although the prices are a bit high.\n\nWe went today hoping for made to order crepes due to it being French themed in honor of Bastille Day, but the line was far too long. We also wanted to try the kale burgers, but we'll do that another time. \n\nIt's a fun place to walk around and I love that it's open into the fall.",
            "author": "Joani O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-16",
            "description": "Yeah it is pretty small but prices are reasonable, it's right outside my back door practically, and ur supporting local businesses. You can do a huge portion of ur grocery shopping here. There is one lady that makes the best apple strudel. Find her. You won't regret it.",
            "author": "Taylor A."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-10-09",
            "description": "Small market & NOT ONE organic vendor. Oh, excuse me. Organic bread. Whoop de doo. That can be purchased anywhere besides, I'm interested in produce. One vendor said they're non GMO....\nI won't be back. Why? Shoot down to the Evanston Farmer's Market. It's definitely worth it & it doesn't disappoint. I'll never come back here. No reason to return. I'm sadly disappointed.",
            "author": "Annette Q."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-10",
            "description": "Market is smaller than most in the area, but you can find pretty much everything you need. The have several different fruit and vegetable stands that offer a wide variety of local fruits and veggies. The prices are a little high but comparable to what you would see at other markets.  There is one larger veggie stand that has pretty good deals compared to the others,  not sure the name of it but it is one of the first tents if you enter from oakton.  I like buying a box of jalapeños for only a dollar you get 5/6 good for cooking or freezing and using later. They also offer a wide variety of prepared foods to eat while there such as a kale burger place, Mexican and crepes. I have tried something from each of them and they are all very tasty. I enjoy going there Sunday to have a freshly prepared breakfast!  Aside from the prepared food and fruit and vegetable stands they also have a good salsa stand, several bakeries a meat and cheese place and a few others as well. Nice market",
            "author": "Janie F."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-09-18",
            "description": "Wow what an unfriendly markets. Kids are allowed but no dogs. My dog is my kid. Such a sad place",
            "author": "Karen B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-19",
            "description": "Great small farmers market and one of the few open on Sunday. We purchased a potted tomato and cucumber plant for our patio, sampled and bought delicious strawberries and enjoyed a lemon, berry and ricotta crepe along with fresh mango on a stick with spices. Delicious!  There were some young men playing stringed instruments, it was a gorgeous morning and everyone we met was very friendly.",
            "author": "Carrie F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-10",
            "description": "This is a great farmers market. And when I say \"great\" I mean it is filled with characters. I swear there should be a circular about all the behind the tables things that are talked about and done there. The guys at M&D are always joking with their customers and yelling \"DON\"T SHUCK THE CORN!\" and Tony the knife sharpener is a force of nature. The Pickle Guy says the word \"muffalata\" about 77,000 times a day and it never gets old. There's plenty to choose from produce-wise and the best extras are the saffron at the spice truck, the jalapeno honey from the Honey guy that comes a few times a year and Katic breads are unreal and always sell out. The cheese girl is always up to something hilarious as well and has delicious cheese.  Come to Skokie!",
            "author": "B G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-27",
            "description": "This is a relatively small farmers market, but the selection is very good. Flowers, bread, honey, cheese, a knife sharpener that uses pedals his own grinding stone and fresh produce. I come every Sunday and find delicious items to bring back home. If the parking lot is full, you can park in bank lot right next door. It's convenient and worth waking up early.",
            "author": "Jay B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-08-02",
            "description": "This farmers market has gone downhill for me in the last few years.  Where it originally focused on fresh produce, cheese, and one or two \"specialty\" booths, now its mostly people selling salsa, or pastry, or jam.  Eh, that stuff is OK, but it shouldnt be the main attraction.  \n\nThe one cool thing is the knife guy.  He sharpens everything, from scissors to knives to lawn mower blades, right there and god save me is it cheap.  Its something like $3.50 for a knife.  I have a 10\" chef's knife and man is that a good deal.  \n\nPrices here are decent, but you arent going to find any exotic produce here.  The most unusual thing you will see is maybe a pattypan squash.  I like the cheese booth but they tend to be irritating by not labeling anything or putting out prices.  So you are forced to stand there and say \"so whats this?  what kind is this?  and how much is this?\"  Gah!\n\nSomeone would make a killing if they opened a booth selling coffee or some other drinks there.  You have to wait about a half hour for the knife guy and there is NOTHING open in downtown Skokie on a Sunday morning.  It probably would help the sales in all those pastry booths too.",
            "author": "Carolynne M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-28",
            "description": "This is a really great farmer's market. Lots of great produce stands. Farmers from all over Michigan, Illinois, and Wisconsin come to this farmer's market. One of my personal favorite stands at this farmer's market is the knife guy name Tony. If you have any dull knifes that need to be sharpened Tony does a great job at a fairly good price. The only reason why this market lost a star is the parking situation. The parking lot is very small and it is hard to find places. My suggestion is to get here early, because late in the afternoon the market fills up.",
            "author": "Cheryl G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-08-21",
            "description": "I checked this out yesterday for the first time after the Glenview one did not have the stand selling spinach there yesterday.  Wow!!! was I pleasantly surprised.  Its much bigger than the other farmers markets I have been to in the 'burbs.  We loaded up on peaches (and I really mean loaded up, we bought a 1/4 bushel), spinach and cheese.  Beware of the cheese though, my wife bought a big slice, but it was about $7.  They also have vendors selling mushrooms, fresh flowers, a couple of bakeries and a knife sharpener.  The atmosphere is great.  As you would suspect in Skokie, they had a great cross section of attendees. \n\nSkokie's Farmer's Market is open every Sunday from late June to October. Conveniently located in the parking lot between the Village Hall and Skokie Public Library, the Market features produce of all descriptions, bread and cheese, flowers, crafts, and more.",
            "author": "Alan R."
        }
    ],
    "priceRange": "$$",
    "name": "Skokie Farmers Market",
    "address": {
        "addressLocality": "Skokie",
        "addressRegion": "IL",
        "streetAddress": "5127 Oakton St",
        "postalCode": "60077",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/WqH8Sx0u5HywA4uPKRPokQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18479338257"
}