{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-06",
            "description": "Smits Farms Greenhouses is an amazing place to visit during planting season with so many colorful and unusual varieties of outdoor garden plants can be purchased here.  Top quality and great selection at very reasonable prices for items not found in the chain big box stores.\n\nHaving worked in a couple of greenhouses in the 1970's as a teenager, I can appreciate the operation of a family run, independent business that has put in many long hours to make Smits Farms Greenhouses a success.  It is a very refreshing and welcome change to find a wonderful greenhouse operation that is totally awesome.  I loved the many outdoor garden flowers I bought for my home!\n\nThe staff is friendly, knowledgeable and most accommodating.\n\nGreat find!\nHighly recommended!",
            "author": "John Y."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-07-30",
            "description": "Brought some turnip greens from them and it smelled like it was sprayed by a skunk. So mad",
            "author": "Gabrielle G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-04",
            "description": "Love this place! I've tried a few other farmstands in the area and none beat Smits. They are friendly and knowledgeable, and have great produce + plants. They are conveniently located near me. But, you can also find them at several farmer's markets in downtown Chicago. They have great herbs and they are always fresh and last. One of my favorite things to purchase is corn--once in season it is perfect. The prices are extremely reasonable. Their farmstand to purchase produce opens in July!",
            "author": "Sarah O."
        }
    ],
    "priceRange": null,
    "name": "Smits Farms",
    "address": {
        "addressLocality": "Chicago Heights",
        "addressRegion": "IL",
        "streetAddress": "3437 E Sauk Trl",
        "postalCode": "60411",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/p9y81oK0Oph12XZeKg7pFg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17087581244"
}