{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-03-07",
            "description": "I LOVE the South Loop Farmers Market! I have lived in the South Loop for over 30 years and was so happy once I heard we would have a market in the South Loop. We thought the day would never come!\nIt's amazing to buy fresh fruit and vegetables along with fresh bread and come home and cook a real meal with such fresh produce. I try and go every week they are there. Also love supporting local farmers and other interesting things for sale.\nThank you South Loop Farmers Market!",
            "author": "Marcy B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-24",
            "description": "Great addition to SLoop. Small, but has everything you'd expect from a farmers market",
            "author": "Michael P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-17",
            "description": "Holy Moly!!!   This farmers market was awesome!  I was invited to photograph it and had a blast!  It's a beautiful spot tucked away next to The Second Presbyterian Church which is stunning!  I learned that the church is having one of their large Tiffany Glass windows restored soon.  And they give tours of the gothic gemstone.  \n   The Market itself was as diverse in goods as the neighborhood.  I got some amazing coffee from a new roaster Sputnik  $10/pound coffee that is on par with all the other great roasters this city has.  Beautiful flowers from Larkspur Flowers, whom actually grow their own flowers in  Michigan I learned.  HOW LOCAL IS THAT!!!!  I feel like all the vendors were hand picked to fill the market with the best of the best who all had smiles on their faces.  Don't even get me started on the fruits and cheeses!!!! ; )   I plan on being there every Thursday!  For Sean S.  who didn't enjoy his last visit, I urge you to come back, I'll buy you an Ice cream from Yoberri I promise you wont be disappointed.",
            "author": "Kendall K."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-09-30",
            "description": "I went on September 29th, the last day of the market.  Only one vendor was there, Bread from Heaven.  There was a banner across the street saying the Farmers Market happens rain or shine.  I checked their website and nothing was mentioned about it being closed due to weather.\n\nI asked the vendor, who said they were told 'today was the last day and the market was closing early because it was windy.'  They could still be there if they wanted.  No signs from the manager of the market stating that was the case.  The South Loop Farmers Market lost a potential customer for next year because of lack of communications.",
            "author": "Sean S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-03-07",
            "description": "This market serves as a much needed addition to the neighborhood.  It's a small market with great vendors and they're growing all the time.  I'm excited for the upcoming 2017 season!",
            "author": "Kati J."
        }
    ],
    "priceRange": null,
    "name": "South Loop Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "1936 S Michigan Ave",
        "postalCode": "60616",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3XnCoKVxadH2ISwiOIxAlw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17735873800"
}