{
    "aggregateRating": {
        "reviewCount": 53,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-28",
            "description": "My family and I love this farm!  We make it a point to go multiple times a year not only for their farm stand but we love the Apple picking,  strawberry and pumpkin!!  During the fall they have amazing little stand s with great corn and the best cheese curds!  They even have a section for kids with activity to do!  The prices are excellent as well for their vegetables just a great local place!",
            "author": "Amanda D."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-10-08",
            "description": "So many places to get better corn. \nHalloween amusement is a complete waste of money and why charge adults is loony toons.\nMarket price is high but Apple Donuts are quite good",
            "author": "Mark I."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-09-16",
            "description": "Everyone is so nice at Stades , customer service is impeccable. There are tractor rides that take you to and from the apple orchard there are virtually no outrageous wait times which I was anticipating , especially being there on the weekend. \n\nThe apple  donuts are FANTASTIC ! The variations of apples are limited and the honey crisp apples that I absolutely love were not as sweet as I have had from other apple picking farms and this is the only reason why I gave them 4 stars. I surely still would be back in the future , they are closer to my home than the other farm I normally go to.",
            "author": "JT T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-27",
            "description": "We had a great experience during peak 2018 strawberry season.  Follow them on Facebook to know when the optimal time to visit for U-pick.  It took us about an hour to fill two 4-quart buckets between 1.5 adults.  Came here on a hot Sunday before noon, and the parking wasn't too bad (on a grassy lot) or too far from the strawberry field (bring a stroller for toddlers or younger).  \n\nTo enter the U-pick fields, you purchase your buckets first ($4 for 1 quart, $7 for 2 quarts, $13 for 4 quarts), then there's someone instructing you where to go and how to pick.  Strawberries grow on low bushes, so you'll need to be prepared to squat and bend down for long periods of time.  You'll need to brush away leaves in order to find strawberries hiding by the ground away from the sun.  You want them to be fully red and firm (not partially white or soft), and pluck them with the cap & stem still on.  \n\nThere's a gravel path leading to the field, and then you're off!  I suggest hopping in a few rows because the main aisles are usually picked over.  They line the rows with straw, but there's still mud underneath.  It had rained a lot days leading up to the weekend we went, so we could feel the soft mud underneath our feet, and our shoes got a little muddy still.  Bring water to drink and wear loose or stretchy clothing, sunscreen, and washable shoes.  For toddlers or younger who might get worn out and want to sit down or fall a lot, I suggest dressing them in long pants and washable shoes, and bring a change of clothes for the car ride home.  Our LO's pants was stained in mud and strawberry juices by the end. \n\nOn your way out, they check your bags and such so that you're not sneaking anything out that you didn't pay for.  Then you'll pass by a concession stand selling brats, hotdogs, and refreshments, and a large tented area with picnic tables.  Great for grabbing lunch before you leave.  Right by the parking lot, there's an indoor market that sells produce, jams, doughnuts, and slushees.  Lastly, there are portable toilets outside, and most likely bathrooms inside the market.\n\nAs for how they taste, I've only gone strawberry picking one other time near Portland, OR, and those strawberries were MUCH sweeter.  These are sweeter than the grocery store but not as sweet as I had hoped.  However, they are all surprisingly nicely shaped and look picture-perfect, unlike the ones at the grocery store.",
            "author": "Nancy Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2019-02-22",
            "description": "My family goes here every year. I love all of the different activities that they have for the kids. It is a great family oriented place!",
            "author": "Katie S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-10-14",
            "description": "Always a good time at Stade's farm. Yes a little pricey but worth it because you can spend hours enjoying all the rides and games. You can spend an entire day with rides, meals, pumpkins, everything. Good job.",
            "author": "Chris H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-06-26",
            "description": "I came here strawberry picking Father's Day weekend and overall we had a very nice. The ladies collecting your money up front were very nice. $13 for a larger basket of strawberries is a little pricy but it's fine because it's all about the experience here. We picked like 3 of the large baskets full of strawberries in about an hour and then took them\nHome. I must say that they aren't as sweet as I would have liked them to be so I made strawberry jam with them. I feel like the ones we usually pick at Thompson strawberry farm are a little smaller but also sweeter as a breed. But I'm willing to give them\nAnother shot in the future and maybe come back in the fall months for the pumpkin patch type of activities. \n\nStade's you definitely had a lot of strawberries and they were tasty but not one of the better ones we've had in Chicago.",
            "author": "Elina S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-13",
            "description": "Stopped here for fresh produce on way from Lake Geneva to Chicago. Bought peppers, lettuce, tomatoes, sweet corn, zucchini, onion, and blueberries. Also got some pickles, 'beer can' chicken rub, a cherry pie, apricot preserves, and  cheese. Had a wonderful salad for lunch and mixed grill with dinner using the fresh veggies purchased. Would stop here again for sure",
            "author": "M. G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-09-16",
            "description": "Overall, I had a great experience because of who I spent it with... but customer service was extremely lacking by the apple picking portion of our trip. Excuse my French, but the lady manning down that station is a bizzzznatch. She rolled her eyes, spoke under her breath a couple times (I think I heard her say... these people are idiots), and made some smart remarks. Maybe she had a tough day? Constipated? Or maybe had diarrhea?? Who knows. But whatever was up her ass was coming out with awful customer service. The corn stand people were nice though and the raspberries were sweet. Had it been for that rude ladies remarks, I'd have given a much higher review.",
            "author": "MARIA L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-08",
            "description": "Took the family here to pick some pumpkins and take the kiddos to the \"theme park.\" You have the option of taking a tractor ride out to the field to pick your pumpkins for $7 or $6 each if you buy 4 or more no matter the size (according to the website) or they have already picked ones that are priced to sell based off of size. We bought nice large ones for $8 and $9 each, along with some smaller ones. I really wanted to pick apples, but the kids had their eyes set on going into the theme park. For $15 a person, ages 3 and up, I say it was well worth it. We did almost all the activities they had available from the pillow jump, to pedal tractors, to zip lines, sand digging, trailer maze, along with a corn maze, to a carousel, corn bin, and a few more (too much to name). We manage to spend almost 5 hours there, which was definitely not the plan, but glad we did. I'm hoping to go back to pick some apples before the season ends. And the family and I will definitely visit again next fall. \n\nSide note- If you're hungry, you must get the corn, kettle corn, and cider donuts. You can also stop in the market to stock up on fresh produce and baked goods.",
            "author": "Rose P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-12-16",
            "description": "The BEST Apple cider donuts! We live just down the road and I started many of my mornings with a stop at Stade's in the fall. Also very easy to get into and out of.",
            "author": "Gianna T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-09",
            "description": "Hands down best kettle corn in the Chicagoland area! \nAlso tons of rides for small kids and you get to actually pick your pumpkin off the vine! \nAdditional things to love include a corn maze, petting zoo, bouncy houses, pumpkin and apple cannons, apple cider donuts, corn on the cob, giant tractors and so much more! There was also tons of pick your own fruits and veggies. You can't even begin to do it all in one day!",
            "author": "Courtney H."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-06-10",
            "description": "The thought starting a tradition of picking strawberries with the family, is what drove us to this farm.  The staff there was not friendly at all, we paid for our buckets and they didn't tell us where the strawberry patch was located. We just followed the people in front of us.  No big deal I thought at first, but after we were done picking.  We decided to go inside their store.  As soon as we came in, we had a shadow watching our every move, he made us feel very uncomfortable!  \nMaybe it's that we didn't look like the rest of the people there, or they have a high theft in there store. But all I know that he didn't stop watching us until we paid, and even then he was by the front door!! As he was waiting for us to leave to make sure we didn't steal anything as we left.  A terrible experience, we will not be going back!",
            "author": "Roxy T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-02",
            "description": "Who knew the suburbs can be so much fun?! We came to Stade's to pick strawberries on the last weekend of strawberry season, and despite the \"slim pickings\" warnings for strawberry availabilities, we still managed to fill up 2 quarts within half an hour! Then afterwards, we went to the Market, which had plenty of farm canned classics such as apple butter, pickles, etc. They also had a great variety of fresh produce, so our groceries are done for the week! Last but not least, they provide delicious apple cider donuts to refill your stamina. \n\nLooking to come back mid-July for raspberries!",
            "author": "Tina Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-28",
            "description": "I went here to pick strawberries and raspberries! I don't know if it was the amazing weather or that I loved this place but it was worth the trip! The berries were plentiful, the price was affordable and the donuts...the donuts...mouth still watering!\nUse the berries asap because that only lasted a day. Wear old shoes because it's messy. The port a potties were clean and fresh and better than most. Can't wait to go back to pick apples!",
            "author": "Amy V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-13",
            "description": "Really great produce and pickles and preserves!  The sweet corn was delicious!  I highly recommend visiting Stade's.",
            "author": "Erin G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-21",
            "description": "Okay, we have an ongoing tradition at Stade's (pronounced Sta-dees) for four years now. It used to be quaint and cheap, but give credit to the 'small' farmer, their business is growing and so are the prices. I'm done with this as Stade's puts out an amazing product. \n1. The strawberries are delicious and plentiful. Follow them on FB to get updates. 2. The farmtractions are really great. The land is huge and there is so much to do, it's worth the $10 price tag...I just wish there was an adult discount. \n3. The stand is cool; the donuts are delicious and this year we tried a strawberry lemonade slushie...man was it good. \n\nI drive an hour every year for this all day experience. It's very worth it, and I love supporting the local farmer.",
            "author": "Lindsay J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-12",
            "description": "Stade's Farm is a nice country store for seasonal produce,  selection can be limited due to everything offered being locally grown. \n\nOtherwise a very beautiful pick your own fruits and veggies farm",
            "author": "Stefan J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-27",
            "description": "So many fun actives, everything is kept so nice, and amazing berry and apple options! Can't want to go back!",
            "author": "sara I."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-10-05",
            "description": "This place is great!  My wife, 13 year old daughter and I brought my twin two-year-old niece and nephew along with their 7 year-old sister.  There were attractions and activities to satisfy all ages.  We arrived Sunday morning at opening (10:00).  We got in before the crowds and had no wait for any rides.  We all enjoyed some rides, including the carousel and train.  The older kids like the zip-line, and corn guns.  There is so much to see and do.  Bouncies, mazes, petting zoo.  Lots of good food too.  I enjoyed the cheese curds and sweet corn.  \n\nThe pumpkin cannon is a must!  It shoots a pumpkin every hour on the hour.  It looks crazy, but everyone loved it!  \n\nWe came here approximately 10 years ago when my children were young.  Wow has it grown.  I can't believe what it has morphed into!  Keep up the great work.",
            "author": "Fred M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-12-11",
            "description": "Great place to bring the family for all occasions. Depending on what's in season you can go several times a year. There is a great kids area and market too.",
            "author": "Jason C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-07",
            "description": "My daughter and I had a magical time at Stades, there is a LOT to do!  We picked apples, raspberries, green beans, tomatoes and our own pumpkins.... the whole experience is stellar, good fun and a learning experience.  Even with all the things we did in one day, there is much more to do and we plan on returning before Halloween.  Very friendly staff, they will direct and help you.  Apple cider donuts are delicious, warm and fresh.  We picked 5 pumpkins, each one was at least 30 pounds.  Stades is going to be a tradition for us from here forward.  The love and care that these folks have dedicated to the place is evident and something I value and respect.   Inside the market we purchased home grown beets and cucumbers, he beets were the size of a softball and amazingly sweet!  So happy to give them my business and refer friends and family alike.  Cheers Stades, you are top notch!!!",
            "author": "Vishal B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-11-10",
            "description": "Good times there every year. A little pricey, but the kids love it! I go to the market year round. Love the donuts and apple cider in the fall.",
            "author": "Ashley A."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-10-09",
            "description": "Really expensive for what you're getting.\n\nAdults have to pay too. There's hardly anywhere to sit with shade. Concession stands only take cash.\n\nWill not go back, total rip off",
            "author": "Esteen M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-04",
            "description": "Great place to go with thie family",
            "author": "Heather H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-12",
            "description": "We had a really good time here over the weekend.  We went on Sunday (6-11-2017) to pick strawberries.  When we pulled into the parking lot, I was discouraged.  I thought that the number of cars was an indication that the experience was going to be overcrowded and frustrating.  Surprisingly, that was not the case.  I also thought that the berries would be picked over...that too was not the case.  It was a little difficult finding areas where there were an abundance of berries, but we were able to find enough to fill up our baskets.  The prices were right and they don't have the over abundance of extra \"carnival\" type attractions.  They keep it simple and let you get a true farm experience and don't make you over pay for it.  We left with four baskets of strawberries, a dozen of donuts and a couple waters and spent around 30 bucks for a day of fun in sun.",
            "author": "Jason G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-08",
            "description": "u pick it, farm. Strawberries and Sugar snap peas in late June/July.  \n\nWhats to say about a u-pick farm this one is one I will return to!  \n\nParking is plentiful and free, but I felt bad about parking on the nice grass field.  \n\nSend the kids to the giant combine setup for pictures on one side and a neat modified tube slide down the other side.  This would help with just getting the kids to stretch after the quaint drive to the farm.  There is a for fee play area available as well.  \n\nLike them on FB as they update regularly on whats ripe for picking.   They also do raspberries which were later in the season, and corn as well I think.  \n\nAs all u-picks, they have a giant barn with the usual pie kits, apple / strawberry donuts, cider...but oh if its a hot day, treat yourself to a frozen slush strawberry lemonade flavor oh yum!  You will thank yourself!\n\nPricing is $3 min per person, and you have a number of choices for sizes of containers.  Tip:  don't just pick strawberries, no matter how sweet or good they were, I got sick of eating them.  Get variety if there is any other crops available at the time.  \n\nSugar snaps were quite nice, just remember to remove the string strands before cooking or prepping your salads.  \n\nQuality of the pick:\nThere were scant large strawberries left in the patch by the time I swung on by.   But the trick is to find super red ones, as those are the sweetest as well. \n\nSugar snaps were fantastic.  But super hard to find amongst the plant since the pods were camo'd.  \n\nApparently they have worship service in the outdoor shelter in the back, so its a great place to worship and then pick on a Sunday morning!  Looking forward to checking that out one day perhaps.",
            "author": "Monty W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-08-10",
            "description": "We usually go to the farm stand, but it's closed this year. This was our first trip to the farm. It's really quite remarkable. Plenty of quality produce and other goodies. We. Fought home some homemade donuts for the morning. Delicious! We'll definitely be back to the farm, maybe for a U-pick.",
            "author": "Elise W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-25",
            "description": "Have been going to Stade's for over a decade and it's definitely become a well-oiled machine. Everything about Stade's is flawless. The market, the vegetables, the fruits, the baked goods, the pumpkins, the Indian corn, the mums, the decor, the activities, the parking, etc. I don't have little kids anymore, so I didn't do the little-kid things, but they're amazing to watch. Everyone is having a ball here. One note, parents with little kids, Stade's is too big to fit everything in before nap time. Pick one thing like the tractor or train out to the pumpkin patch, trudge around in the dirt for a bit, get and pay for your pumpkins, get an apple donut and cider, and call it a day. As the kids get older, you can head over to the east side and checkout more and more. Their baked goods are on the dry side--zucchini bread, orange cranberry bread, and apple bread. They're expensive so it's worth pointing out to my many fellow yelpers!",
            "author": "Wen F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-03-08",
            "description": "So much to do all the time! The apple cider donuts, kettle corn, and fresh fruits and veggies are my FAVORITE! And the apple cider is literally to die for! Such a nice place to have so close to home in our little towns and such a popular attraction to be known for in our town! Great priced pumpkins and the the pumpkin shooters are great to watch! By far the best pumpkin farm anywhere!!!\n\nVisited October 2016",
            "author": "Kimmy C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-10-10",
            "description": "We were looking for a new pumpkin patch this year, and decided to give this place a try.  We absolutely loved it!  Plenty of things to do for the entire family, and the attractions were spread out over a very large area to help with crowding issues.  Customer service was great, and the facilities were clean.  The owner even stopped to chat with us, you could really tell he wanted to make sure everyone was having a good time.  \n\nWe will definitely be back soon!",
            "author": "Hammerhead L."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-07-13",
            "description": "I don't know what it is with small businesses mistreating they customers that drive 50 miles for u-pick. We went to gather peas,  green beans and raspberries. You pay upfront for the little plastic buckets before you pick. When we came back,  because green beans were sticking out of the bucket young man told us to pay extra. We paid,  and left...",
            "author": "Michael O."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-08-06",
            "description": "We drove 2 hours for them to tell us they don't have raspberries after we called yesterday and today morning to double check. Never will return!!! VERY ANGRY",
            "author": "Julia E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-10-16",
            "description": "We were recommended this pumpkin patch from my in-laws. I've also heard advertisements on the local radio for Stade's. We decided that for a family outing that Stade's would be a good place to try. It was very organized and great for our family. There are many activities for kids and lots of food if you get hungry. The apple cider donuts were fresh and delicious! Pumpkins are very reasonable and you pick yourself, which in and of itself is a very fun activity (great photo opportunity as well).",
            "author": "Lauren W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-10-13",
            "description": "Cute farm.\nWe went for the fall festival but got rained out most of the day. So we arrived about an hour before close. Parking was easy. They had a whole section that was $10 a person to enter. There was tons of great attractions & Halloween themed things to do & we wanted to do them but an hour wasn't enough, plus we asked if it was still full price for an hour & they said yes - disappointing. So we took the kids in the area were music was playing & the food was. We let the kids run around & took pictures. We bought a small bag of kettle corn for $5 & it feed 2 adults & 4 kids & it was delicious!!!!!!!\nWe walked to store but didn't really buy anything. Lots of great veggies to chose from. I thought I had read they were a dairy farm too so I was bummed to see no milk for sale. It's a cute little farm so I would check it out again, just not an hour before close.",
            "author": "Cori S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-07",
            "description": "beautiful grounds...\n\nstrawberries weren't the best (however, we did go towards the end of the season) but we were so happy to also have the chance to pick snap peas!\nthe fields are very well maintained and there was staff support all around. loved the little coffee/snack stand and the market was huge offering tons of veggies/fruits and lots of country kitchen items.\nwe didn't take our little one to the amusement park but my niece and nephew seemed to have enjoyed themselves - $8 a pop though even for adults.",
            "author": "Leah C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-10-09",
            "description": "I loved the place, been going here since I was 8 months old! Sad to see the prices raising a lot and no more hay rides, over all a fun place!",
            "author": "Nikolas P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-02",
            "description": "Love this place! We go every year for the market and my dad goes brings his car for the car shows. Awesome owner he's always sweet and caring for each and everyone of his his customers.",
            "author": "Michelle M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-09-29",
            "description": "Update - Based n the fact that the owner contacted me within 24 hours of my review in regards to his staff, I'm bumping Stade's up one star.  I will be back later this fall in hopes I have a better experience and can upgrade my review yet again.\n\nWay overpriced and the staff could use a course in learning how to be friendly and helpful.  Head up to Richardson Farm in Spring Grove, well worth your money there and the staff is very friendly and helpful",
            "author": "Justin G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-21",
            "description": "Went here for an impromptu family outing and just WOW!!! Had a great time. Picked raspberries, sugar snap peas and green beans!!!! Nibbled on them all\nThe way home... So fresh and tons of fun!!! Farmer came out to the fields and showed us how to find the best berries!!! There is a market area too- bought enough fresh veggies for the week for under 9.00!!!! We were told that they planted apples\nAnd in a couple years they will be ready too!!! We will be back very berry soon!!!",
            "author": "Tracy S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-06-30",
            "description": "Came here with my family and some friends for the first time. It was HOT but with no buildings around, there was an amazing breeze that kept us cool (which was unexpected). \n\n1quart = $3\nThere's one size here but I really can't remember :( \n4 quart = $11 (if you buy 5 or more, they're $10 each)\n10 quart box = $20\n\nI got the 10 quart box (you can pick strawberries or sugar snap peas that were in season at the time I went, all the same price). \n\nThe kids had a great time picking strawberries and eating a few as well. \n\nThe strawberry donuts were amazing ($4 for half a dozen, not bad at all for how amazing they were). Their strawberry lemonade was also very delicious. We ran out of time and weren't able to go to the children's play area where they have a petting zoo and some other fun things to keep the kids busy. Admission to this is $6. \n\nAll in all, I will definitely be going again and next time I'll have to plan a longer stay so we can check out the animals.",
            "author": "Lois C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-05",
            "description": "I have loved strawberry picking since I was a little girl. My mom and grandma started taking me when I first learned to walk. Needless to say, strawberry picking is rather nostalgic for me. \n\nStade's helped me relive my childhood strawberry picking days. Everything about the experience was 5 stars. The staff was over the top friendly and helpful, there were hundreds of rows of ripe strawberry plants, and the prices were right. For $1.99/lb you could pick your own and for $2.99/lb you could buy the pre-picked (which is no fun in my book). \n\nThere's also a quaint market where you can pick up other fresh vegetables, homemade jams and jellies, apple donuts, and a variety of other local farm stand goods. \n\nYes, McHenry is far for us Western 'burbs dwellers but you can guarantee I'll be back next year - and every year after. \n\n5 massive, solid stars.",
            "author": "Cristie F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-04",
            "description": "Strawberry Shortcake...Strawberry milkshakes...Strawberry infused vodka... \n\nJust a few thoughts running through my head regarding what I'd do with all the super fresh, super sweet strawberries we picked at Stade's Farm and Market. There were 3 large strawberry fields where we could wander around and pick berries. They were also offering you-pick-em sugar snap peas in fields a little further away. I thought the prices for the strawberries were pretty reasonable. (1.75 per lb for the you-pick-em strawberries) \n\nThe shop offers donuts, including the every popular cider donuts (YUM!), coffee, cold sodas and strawberry drinks. You can also purchase fresh pints of strawberries if you don't feel like picking--along with all the fixings for strawberry shortcake. There's also a play area for the kiddos--tractor toys, petting zoo, bubble trampoline, slides and other playground equipment with a barnyard twist \n\nThe staff is very helpful and friendly. The shop and farm was well-maintained. Picnic tables in the shade, clean bathroom trailers. \nI know in the fall, Stade's becomes more of a pumpkin patch. \nWell worth a visit up to McHenry!",
            "author": "Aimee M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-12",
            "description": "This place is awesome, beyond awesome, B-AWESOME!!!!!! There is a petting zoo, rides, bouncing things, huge slides, etc for the kids. U-pick area (strawberries while we were there). The farmers market area is limited but the specialty food items are unique and tasty. The apple cider donuts are warm and sssoooo yummy!",
            "author": "Rachel C."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-09-06",
            "description": "Stade's Farm and Market is an AWESOME place to go during fall except for one thing... The price.  They used to do the tickets which meant you pay for what you do. Recent years they switched to everyone is $10.  Which is great for the kids but a rip-off for the parents and grandparents who mostly chaperone their little ones.  Used to go for lunch and a couple quick attractions which would now cost us more than $50 !?   Ouch.  Wish they would have a better option for adults.",
            "author": "Steve G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-24",
            "description": "Great place to take the kids during halloween or a quick stop to pick up some fresh corn!",
            "author": "Kyle K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-10-26",
            "description": "My kids love this place.  We live near Chicago but this drive was definitely worth it.  We came here for a birthday party and will be coming back next fall.   Highly recommend you stop by.",
            "author": "G G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-20",
            "description": "Went pumpkin picking with my husband and 1 year old daughter and had a blast! Not too crowded, layed out nicely to avoid confusion. We took a hayride to the pumpkin patch and picked our pumpkins (only $5 no matter the size) TONS of great pumpkins! The market was great and reasonably priced, not to mention the delicious pumpkin donuts ;) We didn't do the rides or petting zoo but will definitely be back next year when the little one is older!",
            "author": "Joshua H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-06",
            "description": "It is a huge farm market with a variety of different options!  I am enjoying my fresh veggies.",
            "author": "Dorlisa M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-08-06",
            "description": "Kind of slim pickins when we stopped in here but very scenic and good spot for taking some pictures. There were some mid sized watermelons for $6, some peaches that looked like they might have already turned, some corn for 40 cents an ear. Also potatoes, onion, cucumbers, etc.\n\nThey had chickens running around in the yard, too funny. The kid working the farm stand took us around the barn to check out the horses.",
            "author": "Franklin D."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-10-18",
            "description": "$50 for a family of four.  Not the value I was hoping for.  Some fun activities, the kids enjoyed it, just to much $$ for what you get.",
            "author": "Tim L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-10-11",
            "description": "Stade's Farm is pretty amazing for small kids. It cost our family about $50 for unlimited play through most of the farm. Even though the prices have gone up, it's still a deal compared to places like Goebert's (Barrington)or Apple Holler in WI. We used to take my son to Apple Holler when he was small and we lived in WI. We returned to find they charge you close to $ 20 per person to get in. It used to be you could buy a bag and pick apples. Now you can't even pick apples unless you buy their crazy pass and pay for apples on top of it. My kids love the corn maze at Stade's. They also love the pumpkin cannon, slides and bounce pillows. There is also more than enough parking, and it's free.( I'm looking at you Apple Holler)The store has awesome donuts and pies.",
            "author": "A F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-02-10",
            "description": "Beautiful family run farm!  The market has local grown produce as well as produce from farms of their friends in different states.  Last summer I specifically remember tomatoes from Michigan.  They have THE BEST sweet corn and fantastic giant zuchinnis!  Everything is reasonably priced too!\nDuring the fall they have events going on every weekend - fun for the whole family.  We're in our 20's with no kids, and we found ourselves visiting almost every weekend for the different events and music. etc.  They also have Sunday worship services.\nLoev this place.  Love!",
            "author": "Nicole F."
        }
    ],
    "priceRange": "$$",
    "name": "Stade’s Farm & Market",
    "address": {
        "addressLocality": "McHenry",
        "addressRegion": "IL",
        "streetAddress": "3709 Miller Rd",
        "postalCode": "60051",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JU3s-NhlNa_DoEyUtdaxmQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18156756396"
}