{
    "aggregateRating": {
        "reviewCount": 11,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-13",
            "description": "I volunteered at this commerical kitchen incubator today for Open House Chicago and also learned about the businesses within The Plant. Pleasant House has started to make pizza and this can be happily paired with a Whiner Beer. There are two byproducts of Whiner Beer brewing that are used in the facility: CO2 funneled into the Phytoblu Algae Lab where the owner was sharing $5 Spirulina gelato made by The Plant's vegan gelato maker. I am going to come back with plenty of friends next time.",
            "author": "Deniz W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-02-25",
            "description": "I'm loving the direction that The Plant is going in. I was able to see some of the museum exhibition pieces in the early stages, and I'm excited to see how that progresses. \n\nBeing winter, the outdoor garden lacked charm (for now!) but I know it will be flourishing come summer. The winter garden on the top floor was a lovely sunny spot with some chairs to relax in. \n\nI wasn't able to see the aquaponics area, but I hope to take a tour of that in the future. I am definitely going to be visiting again to catch the farmers market that they do year round! It's monthly in winter and weekly in summer. \n\nEven if you just stop by for the Whiner Beer taproom, the visit is worth it to learn about their sustainability and the history of the building and neighborhood.",
            "author": "Danielle K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-12-12",
            "description": "This is a really cool space with a really incredible mission. If any tour is offered, take it! The beer is really good, the pizza is incredible (the spicy honey one is nuts), and it feels awesome to support something like this.",
            "author": "Sam M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-05-26",
            "description": "I came here to take a tour and hear about the building from a friend who volunteers here moving heavy bits of earth around. Apparently the meat locker rooms they used to cure the meat in have now all been converted to restrooms, so that sounds like a bathroom experience worth checking out. The highlight here is definitely the Pleasant House bakery operations. Finding the mothership of all that delicious bread. Eating an extremely reasonably priced and delicious prosciutto sandwich. \n\nOnly minus one star because if you take the bus here, you walk some sad looking streets and possibly pass the plant that's actually still operating as a plant and smells accordingly. It's a burdensome pilgrimage to make via CTA, but I guess such is South Side lyfe.",
            "author": "Will Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-14",
            "description": "Good amount of education.  Decent rate(s).  Mindful.  Bldg and tenants are still a work in progress.  Tour Guides are very knowledgeable, and seem to know every nooks and crannies that is going on, about and everything.\n\nNOTE:  Good amount of stairs up and down.\n\nPublic Tour -- highlighted event of the bldg.  It gives you an appreciation of the solidly build sturdy stairs with a perfect even shape.  I'm so glad the bldg is repurposed.  Great insulation.\n\nBehind the Scenes Mushroom Tour -- slight discount if you take both tours.  Minute overlap of information.  You get a free bag of mushrooms -- yahoo!  Will be increasing mushroom production.  Super!  I like mushrooms.  A high tech science lab meets recycled materials.\n\nFarmers Market -- every Saturday.  Since there are 2 bakeries at The Plant, breads are available as well.\n\nPlant Chicago CSA -- check website for info.\n\nStore -- to come.  Just raised $65k for decor/renovation.  Shall sell products from tenants in bldg.\n\nI look forward to the Build-Your-Own Home Aquaponics System!",
            "author": "Belle L."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-12-25",
            "description": "The bf wants to get into aquaponics so he wanted to check out the Plant. They offered tours so we ordered some tickets online. There was a time to which the tour was due to start but they delayed the start because they were waiting for another group. That group was part of some class that must have required participation. They all asked the same questions throughout the tour. Very annoying. \n\nThere was a lot of things in progress but there were two bakeries up and running. The staff were very friendly and clearly knowledgeable.",
            "author": "Nancy P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-12-25",
            "description": "Though they're still working on expanding, this place had a lot of tidbits of knowledge. the tour had a decent amount of knowledge and it was cool of the random employees here and there to answer any questions we had. \n\nI look forward to seeing how this place progresses as they seem to have a lot of big visions for this place.",
            "author": "Alexander L."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-03-15",
            "description": "Not much happening there now.  Great ideas, poor followthru.   Whiner Beer   is their successful business, but they reuse virtually none of Whiner 's. by products.",
            "author": "John P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-11-15",
            "description": "The people working here are doing amazing things for the city of Chicago and the community in which it sits. I must admit that I read another comment that said the tour price of $12 was too much money for what they got. I think the idea of paying the fee is to support the cause, not to really get your money's worth, but hey that's just my opinion. Also the neighborhood is in one of Chicago's most historic, the Back of the Yards. It might be sketchy for say, someone who hasn't had the privilege of experiencing the diversity of all the different people and classes throughout Chicago, and to someone who is used to exploring the suburbs, instead. \nWhen I made my visit, it was for their annual food truck rally. There was music playing, food trucks serving, and tours of their building happening. Not to mention, they had a demonstration of how their methane gas food compost machine will operate to supply energy for the entire building. That is right, they will produce energy from food! I also admire that instead making an effort to gentrify the community, the businesses that operate within the building are including community members to be involved. This place is great and definitely worth the stop.",
            "author": "Nic G."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-08-05",
            "description": "When I first caught wind of a sustainable, hydroponics based farm share inhabiting an old meat processing plant in an industrial park on the south side of Chicago I was THRILLED.  I immediately did some research, backed their kickstarter to help fund much needed building improvements, and signed up for the weekly CSA.\n\nWhile the CSA is considerably over-priced for the quantity and quality of what you get each week, I thought it worthwhile (if not noble) to help a budding business with such a seemingly altruistic approach to providing a community with good healthy food.  \n\nAlas, I was severely disappointed in the lack of flexibility and professionalism throughout my entire experience (which is going on 3+ months).  One andecodtal story - Recently I was not able to pick up my farm share on the scheduled Tuesday, and decided to instead come by the alternate time that Saturday.  Granted I was in the wrong here, and should have given them a heads up that I would be coming on a Saturday instead of the agreed upon Tuesday, but they gave you the choice as to which day you would want to pick up, so I figured switching days once during the session wouldn't be that big of a deal.  I was mistaken - after 30 minutes of scrambling and making phone calls while I sat waiting I was ultimately sent away empty handed (Which is incredible to me considering you are inside the building where ALL OF THE FOOD IS GROWN when you pick up your share). Even more frustrating, my pre-paid farm share was given away or disposed of when I did not pick it up on Tuesday without so much as phone-call from The Plant.  Not quite what I expected from an organisation which advertised as \"a small CSA we're able to provide exceptional customer service, so you are totally satisfied\" when I cut the first $243 check.\n\nAs result of the experience above, I decided not to pursue the remaining portion of the farm share, and asked to be reimbursed for the weeks ahead that I had already paid for but did not wish to receive.  The response I received was terse and condescending - I was informed that there would be no such refund, but they would be happy to stop making my box each week if that is what I wanted.  \n\nIt is unfortunate that a business would begin its life treating customers like this, and I felt it was important to share this story to help save people a similar frustration - not to mention lose out on a meaningful amount of money.",
            "author": "Michael T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-01-02",
            "description": "Great place to get away from the city life and stretch your green thumbs. One of the best places in Chicago to see aquaponics and indoor food growing. Volunteering is great fun.",
            "author": "Jason A."
        }
    ],
    "priceRange": "$$",
    "name": "The Plant",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "1400 W 46th St",
        "postalCode": "60609",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QtblUt_l3ddd-hKDmzLGCg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17738475523"
}