{
    "aggregateRating": {
        "reviewCount": 6,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-20",
            "description": "Stop by and see Mike from Churchhill Orchards for the greatest peaches, blueberries, plums, etc. around. \n\nThese are the juiciest peaches you will find and remind me of the juicy peaches I had as a kid growing up. There's nothing like eating a big juicy peach that was picked in the last day or so. \n\nI've been buying my fruit from Mike for about the last seven years and wouldn't even consider going anywhere else.\n\nIf you haven't tried Twin Garden Farms Mirai corn yet, you don't know what you're missing.\n\nStop by and see Adla for your Tupperware, Gail Hanks for your Pampered Chef items, Tyrone and Denise for the best priced, great quality T-shirts around",
            "author": "Colleen C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-18",
            "description": "Just came last weekend. I read other reviews that there wasn't any produce, but I went and there were tons of fresh vegetables and a huge table of strawberries. Along with the produce, there were baked goods, food trucks, dog treats, baseball hats, flowers, outdoor decor, and other random stuff. This one booth sells the most amazing homemade pesto and cheesy bread.  Parking was plentiful. I'll be back for sure.",
            "author": "Tina H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-10",
            "description": "Visiting the Tinley Park Farmer's Market is my new favorite Saturday morning activity! Today was my first time and I loved it! Although it is still too early for most fresh produce around here, I did see tomatoes and zucchinis and even purchased a quart of strawberries that are delicious! The guy from Churchill Orchards was so friendly and helpful. I can't wait to visit him more often. I bought items from Tupperware, Tastefully Simple, and Kernel Sweettooth! There are lots of booths with food like Parmesans as well. Gone are the days where the only product at the farmer's market is produce! I look forward to spending my summer Saturday mornings here.",
            "author": "Emily R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-08-30",
            "description": "Great vendors, great atmosphere, great produce. Definitely a fan, however, very put off by the JUICE PLUS vendor who had nothing nice to say about the produce and vendors. Said they would never eat \"those vegetables\". Horrible!",
            "author": "Genevieve M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-06-23",
            "description": "THIS IS NOT A FARMERS MARKET!!!!!!!!!\n\nThis is a Flea Market.  \n\nI was really really excited to ride my bike to this and to be able to buy local produce again.  Of all the things I have given up to move here, local produce and the farmers market is the one thing I miss the most.  \n\nSo, imagine my extreme disappointment when we arrived to find vendors selling garden stones, deep fried food, grilled bagels (?) hair bows, etc etc.  \n\nWhat is missing from this \"FARMERS MARKET?\"  Oh, that's right, the FARMERS.  And the local and sustainable grown FOOD.  Not vendors selling produce that come from the same boxes as the super market.  But vendors who actually grow the food on their land.  Locally.\n\nWhen I asked the folks behind the Tinley Park Farmers Market Facebook page about this, and asked if they planned on bringing vendors that would be selling such things, my first post was deleted without answered.  My second post was very rudely answered, and when others started liking and commenting on how incredibly rude they were to me, for no reason at all, it was also deleted.\n\nIn conclusion:  THIS IS NOT A FARMERS MARKET.  THIS IS A FLEA MARKET.  And furthermore, the people who run this operation are not nice people!  \n\nLike the lovely people behind the facebook page told me, and since you can no longer read it I will repeat it here:\n\n\"We DO NOT and WILL NOT be selling local or organic produce.  We never advertised that we do.  I suggest you look up other farmers markets in the area if you are looking for that.\"",
            "author": "C R."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-06-28",
            "description": "I heard great things about the Tinley Park Farmers Market. What I really liked about it was that it is held on Saturday mornings. So many suburban markets are on weekdays and I can't get to them because I work during the week. It is conveniently located in the Metra parking lot on Oak Park avenue, so it is easy to find and there was lots of parking on the side street. The Amish folks from Rise N Roll bakery are there and they have amazing cheese and donuts. \n\nWhat I did not like - it seemed like there were more goods than farm products. Lots and lots of American Girl doll clothing, outdoor decor, tupperware, pampered chef, etc. I saw only two produce stands and one was almost sold out of everything. Sadly, this was more flea market than farmers market.",
            "author": "Julie O."
        }
    ],
    "priceRange": "$$",
    "name": "Tinley Park Farmers’s Market",
    "address": {
        "addressLocality": "Tinley Park",
        "addressRegion": "IL",
        "streetAddress": "17116 Oak Park Ave",
        "postalCode": "60477",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+17085329260"
}