{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-02",
            "description": "If they made corn flavored candy it would not be as good as this. This stuff is unbelievable. \n\nGeorgia may have peaches, Michigan may have cherries, Washington may have Apples -- but Illinois has corn. And this corn is crazy good. I ate two ears in the car on the way home.",
            "author": "Marc B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-03",
            "description": "Had planned to make the trip to Harvard to pick up some corn, but then I saw how many local farmers markets sell it, but best of all I found it at Heinen's grocery store in Lake Bluff.  Corn is exceptional in flavor, but sweet corn I have had in a long time.",
            "author": "Marianne F."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-08-09",
            "description": "Prices seemed a bit higher than I'm used to seeing on some of the produce at local farmer's markets, but most of it looked fresh enough to be worth it. Maybe.\n\nOn my way home with some veggies & a bag of their corn, my parents swear by it & I'll give some to them for sure, the smallest amount of corn you can buy is 6, and as a singleton with little freezer space as it is, I'd appreciate being able to buy individually.",
            "author": "Marie S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-01-06",
            "description": "Enough with GMO products already! These companies produce corn seeds in the lab then plant them and sell the final \"product\" to us as fresh and amazing corn! It is a corn hybrid. Some sort of a nature freak that they created by mixing together genes from several plants as they state on their own website. Not okay, unless of course you want to get cancer!",
            "author": "Hossam E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-09-24",
            "description": "I may be a bit of a corn snob.   \n\nWhat can I say?  I'm from Iowa and I know corn.  In fact, I won't buy ears in the middle of the winter (from Florida?  Are you kidding?).  My annual mid/late summer routine finds me traveling to Iowa and stocking up on the genuine, local goods.  If I can't make the trip, I'll just suffer silently while I eat the second-rate yellow stuff that resembles flavored cardboard.\n\nUntil now.\n\nI stand before you now as a reformed corn snob and will allow Illinois corn to grace my table.  There, I said it.  \n\nI've never visited Twin Garden Farms farm or roadside markets.  I (hesitantly) first stopped by their booth at the Andersonville Farmer's Market a few weeks ago at a friend's recommendation.  Like a good drug pusher, the guy at the booth offered me taste of the raw stuff right off a freshly-husked ear.  Intrigued, I took a bite.  Wait, I'm in Illinois, right?  This place is in Illinois?  My senses grew confused and I found myself buying some of the bicolor corn.  It tasted like home, even, shall I dare say, incredible!  I'd even go as far as to put this up against some of the corn I had growing up that came from a relative's farm  (shhhh...don't tell).\n\nThe price tag may be a bit steep if you're planning on buying a lot of it.  Buying local good stuff from a family farm is so worth it, though.\n\nThere may still be time to get some before fall is completely upon us and the harvest is gone.  Get some now!",
            "author": "KELLIE K."
        }
    ],
    "priceRange": "$",
    "name": "Twin Garden Farms",
    "address": {
        "addressLocality": "Harvard",
        "addressRegion": "IL",
        "streetAddress": "23017 Il Route 173",
        "postalCode": "60033",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3htW0JHmlzzpNvGSQhjdlA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18159437448"
}