{
    "aggregateRating": {
        "reviewCount": 12,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-21",
            "description": "If your looking for a Sunday morning destination (or any day during the growing season), look no further, as I have the perfect option for you!\n\nWiltse's Farm is a family operation. The sweet corn is as good as it gets anywhere. It's field picked daily and available to you by 9:00 A.M. Fresh picked sweet corn everyday! \n\nThey do all the work so don't have to. No seed sowing, no cultivation, no irrigation, no harvesting and no worries...you just enjoy!\n\nBy the way, this is a limited time offer... so act now!",
            "author": "JP P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-18",
            "description": "I love stopping here on my way home to pick up some things to inspire dinner. Friendly, very affordable, many wonderful, seasonal options.",
            "author": "Marjorie A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-08-26",
            "description": "I stopped by this farm on my way out to visit family. Service was friendly and the place was well organized, with a wide selection of produce. I was able to get about 12 ears of corn for decent price as well. This was the first farm I have visited on my own, outside of visiting farmers markets, and it was interesting to see, and support a local farm. I will definitely be back in future.",
            "author": "Meghan G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-23",
            "description": "Best corn on the cob all season long. I would put this corn on any day up against any farm stands best day. It's that good. They must plant 60 days in a row and then pick 60 days so it's perfect every day. It's one of my favorite places in the summer. Used to live in Geneva and now I am about 50 miles away and I still make the trip frequently.",
            "author": "Bob G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-21",
            "description": "What can I say about wiltse's?  Fan-freakin-tastic. The sweet corn is always amazing and the candy apple red onions. I slice them in half, brush with oil and grill for a few minutes... then devour about 100 of them. Sure, I get a little gassy, but it's worth it, and I blame it on the dog.",
            "author": "Mike F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-08-06",
            "description": "Love their fresh produce! Feels good to eat items picked just this morning. Thank your for keeping farm fresh produce an option!",
            "author": "L W."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-10-12",
            "description": "Very, very sorry to write this review.  For probably about twenty years, I've stopped at Wiltse's Farm for vegetables.  The original owner was one of the nicest, friendliest people you could ever meet, the vegetables were fresh and great quality, and the prices were fair.  Now, I still can't fault the produce or the prices, but the friendly, nice atmosphere is gone.  Last year, I was overcharged several times, and wasn't given a receipt by a young man who worked there.  The last time it happened, I was polite and did straighten things out.  That employee was no longer there as of 2017 season.  So, this year, back to shopping as normal, I thought.  But for some reason, I'm being given the cold shoulder, not welcomed as I come in the door as other customers are, never given a receipt, and when I check out, there's some issue when they try to run my charge card.  Other customers get held up, I get held up, and one time when it happened, someone behind me said that I should have paid my credit card bill on time!  Talk about embarrassing! Yesterday,I was left to carry a massive pumpkin to my car without help, when there were many employees standing around.  It seems that the problem is all on the part of a woman who now appears to in charge.  Too bad good things can't stay that way!",
            "author": "Diane C."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-09-24",
            "description": "I tried to use this farm to purchase pumpkins for my wedding. I called the winter before so the farmer could plant additional white pumpkins and discussed the exact number I needed. I was assured that he had handled wedding pumpkins before and there wouldn't be a problem. When it came time to pick-up the pumpkins the farm owner could not commit to a plan. He couldn't give me a date to pick them up, a set price, and could not set aside a quantity for me. Instead, he told me to stop by his farm stand and pick them out. I drove over an hour to go to the stand and was severely disappointed. There were not nearly enough pumpkins for my needs and the workers could not guarantee me there would be more. Additionally, almost all of the pumpkins were beat up or damaged. When I explained my frustration the staff was completely unsympathetic and made it seem like there was no solution. Needless to say I found the pumpkins somewhere else and will never use them again. There are a lot of great farm stands in the area, but this isn't one of them.",
            "author": "M P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-23",
            "description": "Nearly every time we are out to visit our horses, we stop at Wiltse's to stock up on fruits and vegetables. Much of the produce is grown right there and the rest is local.\n\nToday was onions, leeks, tomatoes and peppers. Corn is over for the season, but the place is stocked with pumpkins, squash and gourds. So, if you are out of your gourd, this is the place to visit!!!",
            "author": "Pam D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-03",
            "description": "LOVE Wiltse's!  When I'm out that way, I love to swing by and get some fresh veggies - its a great family farm.  I love going in the spring, too and picking up some plants!",
            "author": "Julie A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-05-26",
            "description": "The BEST asparagus I have ever tasted! It was sweet and crisp. I will never buy any other asparagus! The flowers and plants we picked up were gorgeous too! People were extra friendly and willing to help out! \n\nI can't wait till later in the season to buy more produce!!",
            "author": "Kate B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-01",
            "description": "This is one of the regular stops I make in the summer when I'm on the 38.  They do herbs and other plants and flowers early in the season, and fruits and veggies (mostly veggies) for the rest of it.\n\nQuality and prices are good.",
            "author": "Ruth F."
        }
    ],
    "priceRange": "$",
    "name": "Wiltse’s Farm",
    "address": {
        "addressLocality": "Maple Park",
        "addressRegion": "IL",
        "streetAddress": "50W379 Rt 38",
        "postalCode": "60151",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/xbKhvRnGUXEeHw31fMgR5g/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18157396179"
}