{
    "aggregateRating": {
        "reviewCount": 28,
        "@type": "AggregateRating",
        "ratingValue": 2.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-10-28",
            "description": "The produce looked good though I didn't end up buying any. \nI was very disappointed in the apple cider donuts and apple cider both were not \"farm fresh.\" The donuts cooked on site were clearly made from a mix (not from scratch) and filled with chemicals and preservatives. We might as well have gone to Dunkin' Donuts. And the cider had artificial preservatives. I could have bought this a Jewel. I didn't need to go to the \"farm stand\" for either of these items. \nIf you're going to do the farm thing do it; don't just pretend.",
            "author": "Conor H."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-10-03",
            "description": "Over Priced.  I stopped here for caramel apples and apple cidar donuts.\n\nHow does a dozen donuts and two caramel apples cost 30.00.\n\nthe apples were not tart at all. they were mushy bland tasting.\n\ni rather drive further west for a better quality apple and save the extra $. i wouldn't go back.  I wasn't given a receipt either to see the cost break down.",
            "author": "Heather M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-29",
            "description": "My son's class comes here every single year and I love it better than the sonny acres. It's quiet and less people. The corn pit is always a hit! They add stuff every year. Mini golf, bounce house, tractor rides, corn maze, jumping pillow. My favorite part is the amount of people!",
            "author": "Rachel H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-11-30",
            "description": "Awesome place! Family Run! Always friendly & helpful! Our Grandkids love it! All their food is delicious! Their pickled sweet beets are amazing! I keep stocked up year round! They even just met with me during their off season so I could purchase some more honey & beets. Thank you Windy Acres!",
            "author": "Cherie M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-11-02",
            "description": "Terrible customer service. The people who work here are incredibly unfriendly. This place is way over priced. Won't be going again after the experience we had here.",
            "author": "Amanda J."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-10-14",
            "description": "Windy Acres is A-OK in my book! It was a beautiful (and unusually warm) Sunday so I wanted to spend it outside doing fall-like activities. With that being said, I had a window of less than 2 hours if I wanted my husband to come with since the Bears were playing that day.\n\nMy criteria for fun was easy: something outside that allowed dogs, an available tasty treat, and pumpkins. I found a handful of other local farms in the area that looked nice, but most of them either had a ton of activities going on, charged a hefty fee, or didn't allow dogs (and I try and bring Stella wherever I can). \n\nFor someone without kids, I wasn't really looking for the whole hayride, inflatable jumper, corn maze experience. I really just wanted to check out anything a farm stand would have to offer so I can find some fall decs for my porch! This led me to Windy Acres.\n\nThey do have an area for the kiddies that you have to pay to get into. From what I've read it's a tad pricey for what you get. This area has an actual pumpkin patch though where you can pick your own. The farm stand area however is totally free and they have pumpkins too!\n\nThey have all different types of pumpkins and gourds, hay stacks, flowers, corn stalks, salsas, jams, veggies, and most importantly... apple cider donuts! You can buy them by the case or individually. They also have a small food stand that offers things like coffee, cider, hot dogs, pizza, etc. I made my way up there and ordered an apple cider coffee, apple cider donut (tis the season right?), and a black coffee for my husband. Cost me about $6.\n\nTo be honest, the apple cider coffee wasn't my fave, but that's not Windy Acres fault. I believe they use k-cups. I thought I'd try this flavor because I've never had it, but it just wasn't for me. That donut on the other hand... OH. MAN. Absolutely delicious. Sugary, sweet, and melts in your mouth. Plus, it's only $1 for one! I later saw a sign that said if you mention Windy Acres on Facebook you get your donut for free, so keep that in mind.\n\nAfter browsing around, I ended up purchasing 2 medium sized pumpkins, 2 small pumpkins, a hay stack, some flowers, and a corn stalk. This cost around $50 which I thought was a little steep, but I also wasn't paying too much attention to prices. I was too consumed with my delicious treats while filling up the wagon. Regardless, this was a nice and short little trip. The perfect dose of fall.",
            "author": "Jacqueline B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-07-23",
            "description": "Stopped by here on a whim after a wedding at Kuiper Farm.  Such a disappointment.  When I got home, I realized that the expensive blackberries were starting to mold already.  The ones that weren't were not even good. The chocolate donuts - MEH - dry.  Overpriced and not even good stuff.  Expensive mistake learned, just because it looks cute, doesn't mean the stuff is good.",
            "author": "J.E. S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-06-29",
            "description": "So so so disappointed in produce they sell at Naperville farmers market at St Johns church. Overpriced mushy garbage. Yup I threw 12 bucks in nectarines away they were inedible. Stay away from this ripoff place.",
            "author": "El L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-28",
            "description": "I've always loved getting my summer produce and pumpkins from windy acres but when I had my wedding there in June they surpassed my expectations. Everyone so accommodating to making my dream wedding come together. They even went as far as to build outdoor seating and a bar area for a cigar bar we really wanted. \nI didn't want a traditional wedding.  I wanted to have a beautiful ceremony and a fun reception with outdoor games, drinking and dancing and they provided just that.",
            "author": "KateLyn B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-22",
            "description": "Beautiful choices of healthy, colorful, delicious fruits and veggies! I brought my two youngest kids, who loved the selection and service. This is a gem!!!",
            "author": "Anne S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-10-09",
            "description": "Decided to try this local farm today and was so disappointed. Expensive for what you get. $13 a child and since it's a holiday no coupons allowed and they didn't offer their free item for the day. Apples were $4.50lb. Peaches were $4.50lb and they are even from the farm. Never again!",
            "author": "Elizabeth W."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-07-25",
            "description": "I bought several items this morning and when I got home, I realized I was charged $7.00 for a pint of cherry tomatoes and ONE medium peach. When I called to inquire because you aren't given a receipt, the lady said, \"You bought honey for $10 and you have to add $2.50 to that for tax, we charged $4.50 a pint for the tomatoes and the peach could be anywhere from $1.50 -$2.00 depending on the size.\" \n$2.50 tax on a $10 jar of honey??? NEVER going back.",
            "author": "Solange L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-24",
            "description": "We have been visiting Windy Acres Farm since I was a child. Now that I have my own we are making this a family tradition with our daughter!\nTheir attractions are so much fun and geared for all ages. \nAnd their apple cider donuts are the best!",
            "author": "Amanda T."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-05-07",
            "description": "Buyer beware. Purchased \"fresh\" asparagus, I asked several times while I was at the stand if it was fresh as the bottom of the stalks looked dried out.  The women at the stand ( the owner) insisted that it was cut last night. I asked if I could break off a part of the stem-- she agreed-- and since it looked fairly okay I bought several packages.\n\nOnce I got it home, it became more obvious that this was not \"fresh\"-- some stalks were beginning to wrinkle and one broken stalk was extremely dried along the break.\n\nHere's the real rub--I called them back and after some discussion the women finally admitted that they do ship things in at the beginning of the season.  She outright lied to me at the stand and during the beginning of the call.  Worse than that she took no ownership for not being able to recognize a fresh cut stalk and one that had been drying out in a box for weeks!  \n\nBuyer beware--I had heard this about them, but didn't see it first hand before now.  What you get may not be from their farm or even some farm nearby--you may get grocery store produce at farm stand prices--and they are expensive!",
            "author": "Joanne G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-20",
            "description": "Had a great day at windy Acres. Kids Loved the jumping pillow tractor rides bounce houses pumpkin patch. There is so much to do here. They also love the corn cob and just running around a wide open space. We will definitely be back and don't forget to get a doughnut!",
            "author": "Kimmie A."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-08-06",
            "description": "Total rip off.   I paid $29 for around 10 peaches.    They are rotten and mealy.   $6 for 3 tomatoes that taste worse than ones I can purchase for considerably cheaper at the grocery store.  $4 for 6 ears of corn that was \"fresh picked\" this morning.  Out of 6, 2 were rotten.   Disgusting rip off. I will never return.",
            "author": "Tracy C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-09",
            "description": "We had such a wonderful time there today. We were there for nearly 6 hours and thoroughly enjoyed ourselves.",
            "author": "Courtney S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-05-02",
            "description": "I couldn't be more disappointed in Windy Acres.  Over the years I have spent thousands of dollars with them, both at their Batavia store and at the Geneva Market.  Yesterday, just a little over 24 hours ago, I bought a beautiful hanging plant at the Market for $50.  Within hours of bringing it home, four of the vines were completely withered.   I took the plant and the receipt back to the store today and very nicely requested an exchange.  It was denied.   I won't deny that Windy Acres has a lovely store and beautiful plants.  But when a long-time customer requests an EXCHANGE--not a refund, but an EXCHANGE--within a 24 hour period, it defies logic.   Sorry...I\"ll be going elsewhere from now on.",
            "author": "Shelley L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-10-01",
            "description": "Went last weekend (Sept 26) w/ our 1 yr old son. We had a great time. Yes, this place is expensive/overpriced if you want to purchase most anything there. But we were not grocery shopping either, and what do you expect? All these suburban farms overcharge. Tis the season. On the plus side, the play area was awesome. Kids under 2 are free and there your kids will wear you out at this place. Hay ride is included w/ entry fee.",
            "author": "Jack J."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-07-19",
            "description": "Today I visited your stand at the downers grove farmers market... I purchased #2 of zucchini and squash for a whopping $3.50 per #.  When I realized that I had paid $7 for zucchini only I approached the young man working the stand to explain that I think there was a mistake, that that was way overpriced.  He proceeded to get snippety with me and tell me that it wasn't overpriced.  I would like to add that you are 5x the price at a grocery store and 2x as much as anyone at the same market.  \n\nI am a crop share holder at a local organic farm, personal chef on a part time basis and have a culinary degree from Kendall... 1) I don't mind paying a premium for locally grown, but this was insane 2) more so, I don't appreciate the way I was spoken to by your son / vendor... he was disrespectful, gruff and made a scene out of a small inquiry.  He needs to learn a little about customer service.  \n\nPS he wouldn't return my item, which I asked, because the health department wont allow it... most customer service focused vendors would have taken the squash back and taken the loss and tossed the product.  Says a lot about what's important to your farm.",
            "author": "Jules j."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-10-02",
            "description": "This is the third year that I brought my children to Windy Acres pumpkin patch. It is expensive, but other than admission, we buy pumpkins much cheaper from the superstore across the street. My complaint after our visit today was BEES EVERYWHERE. I am all for saving the dwindling bee population, however, there were bees on every inflatable and almost every swing, slide and kiddie cottage. I am seriously allergic-- so much so that I must carry an Epi-pen. I saw one girl get stung. My kids were so disappointed that they could not use the bouncy houses and some of the other equipment. I told two employees about the bees. One employee said there was nothing they could do as they raise them for honey. Wrong-- they could have put them at the edge of their large property far away from the pumpkin patch and not near the tube swing and many other attractions. Or better yet, realize raising bees on a children's pumpkin patch is not a good idea. I am so disappointed-- there was not even a warning sign before entering. Had I known, I would have turned around and left to visit another pumpkin patch. NEVER AGAIN, Windy Acres-- we will go elsewhere from now on.",
            "author": "Amanda E."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-10-12",
            "description": "Grew up coming to this farm for pumpkin patch fun and wont ever go back again. So ridiculously over priced! $12 per kid, including a 2yr old, and $6 for an adult to stand and watch your kids play.  Swedish days is more of a bargain!",
            "author": "Amanda T."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-06-21",
            "description": "Don't trust the lady that is usually checking you out at the register.  was told tomatoes were picked red and ripe  from the vine on Sat.  We made salsa believing this.  I actually cut up one to just taste it.  I promise you...there is NO WAY this was picked ripe.  Grocery store bought tomatoes taste better than this.  Will never trust this place again.",
            "author": "Jo J."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-09-18",
            "description": "I go to the French Market in Wheaton often, and usually do not purchase from Windy Acres because they are more expensive than other similar vendors.  On September 10th though I did buy pears from them.  I thought the price was high when I was told the cost but paid, thinking the pears - which were priced by the pound rather than by the box as other stands had them - I paid, thinking they were heavier than I had thought.  When I got home though, and weighed them I discovered that either their scale was way off (charged me for five pounds when I actually got three) or the price was nearly double what was posted.  I went back the following week and complained.  I was argued with, told that I didn't weigh the pears correctly, that last week the price had been $4.50, not this week's $3.50 (which was a lie), ultimately there were two clerks continuing to argue about this when finally, grudgingly, they offered two pears.  I took them, although this still does not make up the difference in price.  I will still go to the French Market, and spend money at the honest vendors there but I will never purchase a thing from this place ever again.",
            "author": "Jeanne T."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2011-10-16",
            "description": "Moonwalks and petting zoo here used to be by the ticket...it's now $12 for kids and $6 for adults just for admission. There are a few pumpkins by the cash register area but you have to pay the admission to get to the \"nice\" pumpkins in back. Been coming here for about 14 years and unfortunately they just priced themselves out of us coming back next fall. There are better and less expensive options for some fall fun.",
            "author": "Eric S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2010-07-11",
            "description": "So this places sells produce at our local farmers market.  I stopped by last week and bought some tomatoes (expensive and chewy skin) and as I was paying my 2 year old snagged a raspberry from a pint and the \"chic\" yelled at her!  As I apologized she continued on about \"no touching. \"  Frickin' Crab Ass,  I bring my kids to the market to introduce them to wonderful looking and tasting produce.  I wish other adults were more pro-active about getting children to eat produce and embrace the idea of a fresh fruit sample for a child.  I miss the Green City Market in Lincoln Park.  The vendors there always offered a sample to kids and it made them smile to see a kid enjoying a snap pea or a fresh apple slice!",
            "author": "Missy B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-04-08",
            "description": "This place has the best assortment of flowers and veggie plants I can find. I have gone here for years and I am never let down. I even take my flower pots and the owner will plant her beautiful arrangements for me. So simple, so gorgeous. My neighbors think that I took the time to put them together and they have no idea. Great deals too. They grow their own fruits and veggies and they taste like nothing I've ever had before. My kids actually ask for vegetables and fruits! Yum, I go here at least once a week for fresh groceries.",
            "author": "Kris S."
        }
    ],
    "priceRange": "$$",
    "name": "Windy Acres",
    "address": {
        "addressLocality": "Geneva",
        "addressRegion": "IL",
        "streetAddress": "37W446 Fabyan Pkwy",
        "postalCode": "60134",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YXg3TvV0CGg4kRGeNQSfUg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16302326429"
}