{
    "aggregateRating": {
        "reviewCount": 55,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-13",
            "description": "I'm not much of a reviewer, and have never felt the need to review a market. But I love Windy City Produce! It has been a longtime dream for me to live near an amazing market, and last year I moved here and the dream came true. This market is the perfect size - big enough to stock a lot, and \nsmall enough to quickly get what you need. \nSome highlights include: \n- fresh Oaxacan cheese\n- fresh requeson\n- avocado salsa that makes you cry in the best way\n- an abundance of delicious tortilla chips \n- a great variety of produce\n- carnitas\n- churros that are still warm in the morning\n- friendly staff. \nThank you!!!",
            "author": "Amanda S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-05-10",
            "description": "I love Windy City! Since they reopened, it seems like they're constantly improving their selection. The produce is great, and they have enough other groceries of good quality to drastically reduce my shopping at a larger chain.",
            "author": "Joe G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-09",
            "description": "I come here a couple times a week, due to it being down the block from my job. Everything is fresh, and priced well. I love how they cute lil snacks from fruit to nuts in containers ready to go. The staff is always friendly, which is a hard thing to find nowadays.",
            "author": "Gil E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-17",
            "description": "I've seen some men going in and out occasionally, and recently new windows went up. Then today a new sign--\"Opening Soon\"!\n\nYesterday I saw an additional sign on the door--\"Opening day, July 31st\".",
            "author": "Clint M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-08",
            "description": "I do all my shopping here for food. I love their Rotisserie Chicken and their ribs. I usually ask the butcher to give me 4 or 5 strips of Rib Eye Steak and get the lard to fry the meat. Super delicious. The owner is real nice and the cashiers remember you like family. Totally recommend.",
            "author": "Brian P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-08",
            "description": "I live a block away. I'm here all the time. We've started buying all our produce here as we need it and can honestly say it's some of the best in the city. Keep an eye on the price drops. Great meat selection as well. I just wish they had Ben and Jerry's ice cream",
            "author": "A M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-27",
            "description": "Love this place!! Love the staff!! My family and I shop here all the time, not as big as tonys and jewels but u can get what u need without going far to these stores. The meatmarket guys are very helpful and know there meat!! The deli girls are awesome, cut your stuff and show you before they keep cutting it. Thank you!!! Fresh bread, chicken, carnitas, ribs daily!! The cashiers awesome!! Carla your awesome!! Keep up the great work and thank God you 're-opened , we need you in our community!! George we miss you!! Natty looks for you every time we shop!!",
            "author": "Mike V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-04-20",
            "description": "I've heard the news on TV at the Neveria by my apartment.  Yelp wouldn't let me leave a review without rendering the number of the stars before submitting the review.  Thus, these five (5) stars are for the new Windy City Produce that I'm looking forward to visiting.  \n\nMy thoughts and prayers go to the owners and workers of the Windy City Produce.  Please stay strong.  You are obviously loved by the community, and you will be able to rebuild the business one day, though the journey may be very, very tough.  \n\nI've bookmarked this place because I've passed by a number of times.  I've heard great stories about the Windy City Produce.  That's too bad that I've really missed the opportunity to check it out.  \n\nI was having a crappy day at work.  However, after knowing what people at the Windy City Produce are going through, I realized that way more people are enduring and attempting to make through ultra difficult times.  I should become an \"encourager\" to send lots of love to them.  Neighborhoods are important backbones for the city of Chicago.  I'm a believer in local businesses and will do everything to support each one of them.  \n\nI will keep you \"bookmarked\" on my Yelp page, because I have a firm faith that you guys will make a comeback.",
            "author": "Rosa J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-04-04",
            "description": "They have the tastiest rotisserie chickens to take home for $5.99. I share one with my boyfriend and 2 dogs.",
            "author": "Kim L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-12-29",
            "description": "Yeah! Local Grocery Store! Open Again! Produce is always great, and they have a really good selection of pretty much all the basics you would need. Super awesome addition to our neighborhood, prices are very reasonable and the staff is always friendly and helpful.",
            "author": "Stephanie W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-31",
            "description": "Please mark this as opened now.  The grand re-opening is Sunday, July 31st 7am to 9pm.  \nHere is their website.  http://www.windycityfreshmarket.com/  And phone number  (773) 685-3606. I'm going to go out and get me some more Avocados.  I'll review with more details later today.",
            "author": "Jane S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-03-09",
            "description": "Love this place. Really good prices on just-what-I-wanted: strawberries, manchego and Edam, honey, fresh rosemary, and the ordinary stuff that makes a kitchen work, like baking supplies, choices of olive oil and vinegar. Recommended!",
            "author": "TG W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-07",
            "description": "Back open and looks wonderful inside, they have added a deli section as well to the back of the store. So glad they are back open and can walk to my main grocery store once again.",
            "author": "Joseph F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-11-17",
            "description": "1. Very good guacamole - sometimes with a pit, \n2. Good veggie and fruits selection, \n3. Didn't buy meat there.  \n4. Only one produce store in my closet neighborhood. \n5. Inexpensive. \n6. Not even close to Marianos.",
            "author": "Derrick P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-10-24",
            "description": "This is my local produce store. In the summer they have an amazing taco stand they set up outside. I can smell this heaven from my house.  \nTheir produce is always fresh and overstocked.  Id say the ratio for fresh fruit is 90/10 being able to purchase it for cheap. \nThe meat selection is pretty much always the same. ASk them to clean your skirt for you and its so tender. \nThe rotisserie chicken is also delish! \nThe women are very friendly and the lines aren't too long.",
            "author": "Silver F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-01-06",
            "description": "Since it reopened the place has been clean it's nice to see they completely separated the deli and the butcher,  (it wasn't good when the butcher that had just handle raw meet would than slice some cheese for you ).  Everything is fresh and the staff is friendly.",
            "author": "Jorge P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-01-03",
            "description": "One Of my favorite veggie/ fruit Store. Good prices For a Great and always fresh products. U can smell those fresh strawberries all over the place. They got Good salsa and fabulous guacamole.",
            "author": "Patrycja E Z."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-26",
            "description": "Any one know if they are going to reopen. Drove by a few times but it doesn't look like there's any construction going on.",
            "author": "Raymond Z."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-10-10",
            "description": "I'm so happy to have moved to this neighborhood and found Windy City Produce! I'm in here at least once a week for produce and groceries. The fruit/veggies are always delicious & they have great prices(way more affordable than farmer's markets). \nI love that Windy City is a family owned & operated business-the owner is here almost every time I've been in and is always friendly. \nThe guys behind the deli/butcher counter are nice, knowledgable and have great meats. They bake fresh bread  & there are rotisierre chickens too! \nI've made so many wonderful sorbets this summer because of the great fruit prices here.",
            "author": "Jenny R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-22",
            "description": "Since I live a mere block from the joint, I'm probably a little baised, but that's ok, you can deal right?\n\nWCP isn't the largest produce store or the best, but what it doesn't have in those two areas is fully made up by convenience, prices, and the really friendly staff.\n\nI shop at this store on a weekly basis and the produce is consistently good, even great. The prices are ridiculously reasonable (for produce) and it's always being restocked so you know the produce is fairly fresh.\n\nThe meat counter is another serious plus. Not only is it also reasonably priced, but the fact that they have already cooked carnitas, rice, and other goods for those days I don't get home from work until 8 p.m., is a major plus. Even the pre-cut, seasoned fajitas are a positive for me--those are for the days I get home at 7 p.m.\n\nAnd if your produce, on the rare occasion, doesn't sustain itself past a day (as was the case with some strawberries this year), they'll cheerfully refund your money or let you replace it with fresher product.\n\nI'm fortunate to have such a great little place so close to me...and now, I'm off to buy some vegees. It's time to make SALSA!",
            "author": "Michelle S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-09-24",
            "description": "This is my new main grocery store :-)Glad that horrible Jewel closed down on Belmont and Pulaski. The store is small, but don't let that fool you. They have a wonderful selection of produce that is good quality and affordable! I picked up a papaya, blackberries, and kale. Checked out the avocados and they looked yummy!!!!2 for a dollar- you can't beat that. They have my favorite yogurt (plain Greek), and sparkling water -another winner! What really sold me was that they have agave nectar-  I put that in my tea and oatmeal AND it is way cheaper than Whole Foods. Shut I just realized I forgot to check out there nut selection. The woman in the meat section actually left her area to show me where something else was in the store :-). If you live in Avondale I would check this place out especially if you eat a lot of veggies.\n\nBtw their salsas look fresh and yummy!!!",
            "author": "Candi D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-02-01",
            "description": "It was such a wonderful surprise to realize after moving to Avondale that we were right by one of the best little markets in the city. Beautiful produce, really nice people, good meat counter and excellent dairy and eggs. They carry some really good organic products. We eat healthier, cheaper and happier because of this nice little store.",
            "author": "Walter B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-01-11",
            "description": "Good place for a quick shopping trip. Reasonable prices and fresh selection. People are quite friendly.",
            "author": "Aaron K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-11",
            "description": "The building is super tiny but they manage space well. They have a nice selection of both common and more exotic vegetables. The meat counter always looks clean and the meat itself looks tempting and fresh. There's fresh bread to be had, wholesale dried fruits and snacks, and plenty of dairy. The market has a decent selection of baking supplies and canned goods, as well as half an aisle dedicated to strange but delicious Eastern European soda. Cockta indeed!\nThey take debit/credit cards and LINK for my welfare people out there.\n\nBut that's not why I'm here spreading the love and legend of Windy City Produce.\n\nThis market has -hands down- the BEST guacamole I've found in Chicago, short of what my sweet abuelita crafts with her own hands. And she doesn't do it very often, so I haunt Windy City Produce for my avocado fix. They can run out by evening, so I try to stop by in the afternoon for a container. I don't know who makes it, and I don't want to know. Afixing a face to this taste sensation might detract from the wondrous symphony of fresh avocado, onion, cilantro and habanero that titilates my tongue.\n\nGet yourself some and see.",
            "author": "Emily H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-04-29",
            "description": "This place has several things going for it. One: It is walking distance from my place. Two: They have a great selection of fresh produce at VERY good prices. Three: the service is outstanding.\n\nWe needed some hazelnuts. They had hazelnuts but they were only packaged in one pound containers. We asked if they had anything smaller because we really did not need that much. I was expecting a flat out, \"No, that is the only size we had. Instead the lady took it in back and split the container into two smaller ones! Now in my opinion, that is the definition of going above and beyond.\n\nThis place is kind of run down but I don;t really give a hoot. They have won me as a loyal customer!",
            "author": "Dave S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-09",
            "description": "Windy City is close to our home and by far the most affordable produce in the area. The owner is always friendly and the staff is as well. Some of the produce needs to be picked through but nothing to steer you away from shopping here. Avocados are always ripe, too! Inexpensive and convenient.",
            "author": "Tanya P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-18",
            "description": "Wonderful place! You can pretty much get any produce you need from here. I only wish they had more of a frozen food section, but that's understandable considering the place is called Windy City Produce :)",
            "author": "E G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-04-20",
            "description": "When I heard the news about this place burning down this morning my heart literally broke. I'd been coming to Windy City produce for years with my family and never thought I'd say that as a past tense. This was the kind of place so close to my parents house that if we'd forgotten the garlic or something for a recipe - it was easy enough to just run over real fast and grab it knowing they'd be there and have what I needed. I absolutely loved their fresh produce and their home made salsas were THE best in the area if you ask me. Between Pulaski and Kimball along Milwaukee ave there are a few other smaller fruit markets but this was by far my favorite. Even now that I live on my own a bit farther away, I'd still prefer to take the extra 10 minutes to walk here ANY day. The produce was always fresh and the service fantastic, friendly, and welcoming. Where am I going to grab my quick lunch tamales now!? I wish them the best of luck and hope they can rapidly rebuild the business. Thank you Windy City for the many years of awesome service and foods! I'll be back when you are back and I know my family will be too.",
            "author": "Emily S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-02-23",
            "description": "I love coming here, it's super close to my home and the produce is always fresh and cheaper than jewel. My only complaint is the cashiers don't seem to be that polite. I smile and say hello, but they usually don't. Everyone else that works there seems really nice.  They have a great selection of items. I wish they had pet and baby products. That'd be awesome. It's so convenient and I love supporting local businesses.",
            "author": "Briana M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-03-14",
            "description": "Super little store! Great prices on everything and a huge selection. Pretty good meat department too. \nThe employees are all friendly and the store is clean. Somtimes they ring up stuff wrong but it usually equals out. Like they overcharge for apples but then undercharge oranges. Its a perfect little grocery store and you should shop there all the time!",
            "author": "Jennifer J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-12-02",
            "description": "Everything here is priced very well and is incredibly accessible. The deli staff is very friendly with a wide range of stuff to fix your hunger up. The produce is very fresh and it's never a long wait in the lines. Hands down the best place in Irving Park to shop.",
            "author": "Allen F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-01-19",
            "description": "Great selection of veggies and fruit. Great selection of avocados. Yum\n. \nGreat prices. CHEAP! I bought 15 limes for a dollar once. Don't know what I would do with 15 of em, but what a deal. I had to buy them.\n\nGreat deli selection. They have some flank steak that is out of this world.\n\nGreat tortillas. I looooooooove them.\n\nGreat staff. They are always so friendly and sweet.\n\nGreat. Great. Great. Great. Great.\n\n:)",
            "author": "Melissa D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-05-17",
            "description": "This place is within walking distance of our new apartment. I LOVE it!\nDelicious, fresh and locally made mexican breads, tortilla chips, tortillas, salsas, etc.  Cheap glass bottles of Coca-Cola from Mexico (made with cane sugar), interesting array of dried herbs, chiles, and some oddities (dried prawns! dried tofu!) Good selection of Polish grocery items as well. Very clean meat department  (no icky smell) with very cheap prices. (Hello fresh chorizo!) Fresh produce, no shriveled up/spoiled items (unlike many other ethnic markets I have been to,) and deals like 4 bunches of fresh cilantro for $1.00, fresh cactus for $0.96, etc. \n  Friendly staff, most patrons & employees are speaking Spanish, (which I am rusty but functional with, haha) but have no problem communicating with you if you are not familiar with the language. (Again, like other ethnic markets I have been to.)\n  So glad to be in a neighborhood with fresh market options in such an easy to get to location!",
            "author": "Harlow-Merissa K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2007-01-18",
            "description": "I use it as my supplementary grocer, with my primary sustenance coming from the venerable Trader Joe's.  \n\nWith the produce--most of the time you can hit the jackpot on price AND quality... $0.99 for a 16oz. pack of strawberries was my latest score.  However, I've had shoddy-quality fruit a couple of times (less than 10%).  \n\nOverall, it's a great mid-size grocer with lots of quality to offer at low prices.  Kudos.",
            "author": "Blanket J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-08",
            "description": "I've got to say, even now that I've moved on to less ethnic pastures, I still catch myself coming back two years later.\n\nThe biggest draw for me is that Wally's is close by, so if you're like me and you've absorbed some of the cultural inclinations of the Northwest Side, you probably have strange midnight cravings for borscht and nopalitos.  If this is you, then Milwaukee and Pulaski is your intersection for groceries.\n\nLike I said in my previous review, Windy City has a firm selection of good, fresh produce in a small space.  Their prices are as good as anywhere (Jimenez, Cermak, etc.) and they also have a small full-service deli.  By the way, the churros at the cash register for $1?  Nice touch.\n\nIn summary, if you live anywhere nearby, this is a great place for fresh fruit and veggies (even fresher than Wally's and a million times better than any big box stores).  They also have a good (yet smaller) selection of Mexcian staples: beans, meats, rice, cheeses, etc.  Best of all, it's easy on the pocketbook.  Also, even though the parking lot consists of about 3 spaces, it never seems hard to park here.  It only took moving to a neighborhood served by Whole Foods and Jewel to make me realize how lucky people are to be served by neighborhood gems like this one.",
            "author": "Timothy M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-03-25",
            "description": "This place is okay, Don't plan on doing your full shopping here. Milk and egg prices are bit high here but if you in a pinch and don't drive this is a good place to come. I mainly come here for there fresh bread, which is awesome, and for there produce, duh!! Their prices on fruits and vegetables are pretty good and usually cheaper then Jewel or Tony's. Also they have pretty good selection of spices for a good price as well. I've never bought meat from, so I really don't know there pricing. Again this store will get you the basics but more then likely you'll have to go somewhere else to get what you want or to get a better deal. \n\nJust to reemphasize that this place is a great produce store and probably would have got a higher rating if it wasn't for everything else.",
            "author": "Roberto F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-11-12",
            "description": "Stopped by Windy City after work one day and was pleasantly surprised by all the beautiful produce.  It is a smaller store but they have a great selection of veggies and fruit at great prices.  For me the best thing is that the produce isn't squishy and past its prime.  \n\nthe rest of the store carried standard things like white bread, pb and j, nothing special.  i did see some rotisserie chickens that looked tasty though...   and somehow i missed the churros at the counter but would looove to get one the next time around.",
            "author": "Izabella d."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-12-05",
            "description": "This place has a good variety of produce at excellent prices. They also make carnitas everyday which are the best.  They also make ribs everyday which are good. I just really love the carnitas they're ridiculously good and only 4 bucks a pound. The best cheap dinner ever. mmmmm. Carnitas are my favorite :)",
            "author": "p s."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2005-10-04",
            "description": "Given my penchant for supporting local businesses, Windy City is one of my regular stops for grocerise.  Although it is mainly an Hispanic market, in the past year or so it has started to stock many Eastern European products, thus reflecting the fabric of the neighborhood.  At the deli you can find seasoned chicken and beef ready for a quick turn in the fry pan for fajitas and also Polish hams and cheeses.  Be sure to check the rack in the back of the produce section for products priced for a quick sale.  And if your Mexican recipe calls for 'huevos del toro' you can find them here at Windy City!",
            "author": "Camille O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-11-28",
            "description": "The staff is always super friendly. Great prices and great selection for a small store. Try their pork marinated in adobo from the deli counter..it is amazing! (and cheap) Really love shopping here!",
            "author": "Michelle Z."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-12-29",
            "description": "There is a much better grocer a little further from my house but totally worth it.  This place is a bit too small and the prices and variety aren't all that great compared to other produce stores.",
            "author": "Elizabeth A."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2010-07-18",
            "description": "Sour lychees. Mealy peaches. Moldy rhubarb. Fruit flies aplenty.  This is what I experienced today at Windy City, a small and underwhelming produce market.  It's disappointing that the most exciting and exotic items there were also in the worst condition.  Maybe I had a bad day there, I don't remember it being so awful, but I was underwhelmed.\n\nThey do have a fairly wide selection of entirely non-organic fruits and veggies with some very cheap prices and some high prices - cherries and berries were expensive, and orange peppers were over 4 dollars a pound.  I can do better at Tony's or Stanley's.  \n\nReally, the only reason to visit this place is if you live in the neighborhood, go to Wally's, or want to partake of their fine selection of European jams and jellies. They have a few jams I love which I can't find elsewhere.  Also, European nutella in a glass jar!  But the produce is so-so and not that cheap.",
            "author": "Liz C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-01-19",
            "description": "When I lived in the suburbs, we had a little place like this near our place. Well that place wasn't little (they had situated themselves in what had been a Cub Food's before they closed due to a violent crime that took place there, but anyways) My old store had a ton of imported food, which was my demise, or the demise of my pocketbook. In reflection of that place, I went on search of a place near me that had a good selection of imported or foreign food items, and very cheap produce. And then there was Windy City. \nEvery time I visit, we are always treated very nicely. I've spent quite a bit on produce the past few times (I went vegetarian in the new year) and they are always willing to help me to my car if I need. Last time I went they even gave me a free 2 liter! The selection of produce is fantastic, and the pico de gallo and guacamole are always on par. When I was a meat eating lady, we would often get the Carne Pastor there, which is absolutely divine. \nI just love this little place, they always have the veggies, fruits, grains, and beans that I need, always a lttle something special, and some things I've never heard of, or have been dying to try. God save me, the day I have to move away.",
            "author": "Kristen P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-01-08",
            "description": "Before I begin, I have to confess something to you all: When I lived on the Southwest Side, I was spoiled rotten by Pete's Fresh Market on S. Pulaski. I've recently moved to Avondale, here on the Northwest Side, and have been shopping around for my fresh-meat-and-produce go-to place, and I think I've found it with Windy City Produce. It's a small store with an as-expected limited selection, but what they do have here is fantastic. They seem to balance the needs of the neighborhood pretty well, as they carry both Hispanic and Polish foods. The staff are friendly and pay attention to their customers. True, it's not Pete's Fresh Market, but Windy City Produce is close by and the prices are right.",
            "author": "Brian M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-02-25",
            "description": "I feel it necessary to change my rating of this place.  The mean girl in the mornings is gone and has been replaced by a rather friendly girl who has manners and says hello.  I have noticed in the last 6 months or so that they have updated their displays and brought in more products.  I like the changes.  Keep it up, Windy City!",
            "author": "Bonnie L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-02-13",
            "description": "Great prices (that means CHEAP), good selection of fruit and vegs.  Wonderful gaucamole. I lick that container clean so as not to waste a single bit of it.  Everyone has always been very friendly and if I'm browsing sometimes someone comes by and asks if I need help finding anything in particular.  I stop in here about once a week.",
            "author": "Megan G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-03-13",
            "description": "i swear, get their made-daily pico de gallo. damn delicious.\n\ni love, love, love, love how i can get all the ingredients to make tostadas, tacos, or nachos for roughly $10. their produce is always fresh and insanely cheap. also, they have a small but decent selection of polish goods if you're feeling too lazy to walk down to wally's.\n\nplea to wcp: get some squash, yeast and chives!\n\nsupport local.",
            "author": "Ki W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2007-04-18",
            "description": "i've been living up the street from this grocer for almost a year and it was the first place i went to for my vegetables and meats. although it's def smaller than your average place (it's around mid-size with the produce taking up a little over half the space) they pack it with a good variety of fruits and vegetables. although there are some noticable absences (uh...can a brotha get some squash?) they make up in great prices.\n \nmy last trip (which was a little less than 2 hours ago)\n \nspinach (great for my omelets and lasagna) : 69 cent a lb\nromaine lettuce: 1.29 lb\n \nand a bunch of other stuff i can't remember right now but it's great.\n \nbest little grocer in the area.",
            "author": "Eric P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-08-02",
            "description": "I love Windy City!  Although I no longer live in the neighborhood, this grocery store used to be a staple.  It's perfect for all of my Polish, Mexican, & staple groceries.  They have an excellent & cheap meat selection and great produce which is comparable to most others of it's type.  They have great breads and baked goods as well.  A personal favorite is jars and jars of vegetable salads.",
            "author": "Morgan C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-05-09",
            "description": "I stopped by WCP yesterday, and I wasn't so impressed. I think you can get the same items for around the same price at a variety of similar type places in the city.  I was interested to see that they sell Phil's Cage free eggs though there were no prices so I couldn't figure out how much they were. They also had generous bundles of basil and mint (handy for those summer mojitos) for 99 cents a bundle, which beats all big box grocery stores.  Being no Rick Bayless, I  didn't have much use for some intriguing looking produce items, though perhaps someday. They sell flowers and vegetables for your garden outside. Ample parking and Polish souvenir store across the street.",
            "author": "Ingrid G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2005-07-14",
            "description": "My mom recently told me about this place.  It is a good market for fresh fruit and vegetables.  Everything is very reasonably priced and very fresh.  They have a lot of Mexican fruits and vegetables that you may have a hard time finding elsewhere.  They may not have the most extensive selection, but if you are in the neighborhood, it's definately better than going to Dominick's or Jewel.  It's also much cheaper.  Also what's great is they have one of the best dollar stores in the city right across the street on Milwaukee Ave.",
            "author": "Urszula H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-03",
            "description": "I've been coming to this store since my mom has been pregnant with me--through owner changes and remodelings and all. The prices at windy city are great, as in normal stores seasonal fruits and veggies are the cheapest, and when not in season obviously they're more expensive. The service is very friendly, especially the owners wife who is usually seen bagging groceries and greeting everyone warmly. There used to be cashiers who were rude and full of attitudes. They don't have the best selection of Polish food, but for what it is it's decent. They always have fresh tortillas, breads, etc. I LOVE their guacamole, the best I've ever had. Recently the prices went up for the guac, but it's worth it regardless. And they have great authentic tortilla chips from el milagro (in the paper bag). Usually if you don't see something you need you can mention it to the cashiers and they'll pass on the info to the owners. All in all, I love this place and I'm there probably five times a week. And they have great churros =]",
            "author": "Margaret D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-21",
            "description": "This is where I find most of my best produce. Recently I was looking for some white mushrooms and they had the best and the most beautiful ones and at a very decent price. Oh and I almost forgot GUACAMOLE. They make it daily and it to die for. I used to make my own but it was not as good and now when i bring it to parties people say that I really improved my recipe. Ladies at the registers are always nice and the meat and deli section is great to. It's a small place and not everything is great but you can find a lot to satisfy your taste buds.",
            "author": "marianna c."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-08-28",
            "description": "i stopped in here and was pleasantly surprised. the produce is really superb, and they stock some unusual items like black radishes & pluots. the store is a good mix of mexican & polish groceries.",
            "author": "jason t."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2008-09-17",
            "description": "This place sucks.  Since I don't have the option of NO stars, they get one.  Because it's basically across the street from me, I've tried countless times to give them a fair shake.  And it seems, more often than not, that I leave disappointed.  For starters, it looks unsanitary.  With the exception of fruits & vegetables, their prices aren't very good.  And I can get comparable/better quality and prices on produce just up the road.  Service?  I don't think I've ever felt more despised.  Is it because I'm white?  I go to the deli counter and the guy looks at me like I just don't belong there.  Of course, he says nothing; only stands there staring at me.  After a few awkward seconds of this, I just tell him what I want...one pound of turkey sliced thin.  A few moments later, he hands me a pound and a half of thick cut ham!  WTF?!   Their deli selection is skimpy.  I mean, they have maybe 2 brands of turkey.  How hard is it to at least get the right meat?  When I alert him to HIS mistake, he cops a f*cking attitude like there's something wrong with me...slams the ham that I DIDN'T order on the counter and grabs the turkey.  I told him to forget it.  Then I get to the front to check out.  Again, I get the same vacant, distant stare...no \"hello\" or \"how are you?\"  It's all they can do to even tell me the damn price of what I owe.  I didn't ring the stuff up.  And I can't read your freakin' mind.  Tell me what I owe!  And then they act like they're doing me a favor by bagging my groceries.  Screw this place.  They get no more of my business.  From now on, I will ALWAYS just bike up to Family Fruit Market, where it's clean, the selection and price is better, and the service is always superb.",
            "author": "Chad H."
        }
    ],
    "priceRange": "$",
    "name": "Windy City Produce",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "3340 N Pulaski Rd",
        "postalCode": "60641",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/BoJ-92hb455gov8hzyFeMQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17737774544"
}