{
    "aggregateRating": {
        "reviewCount": 25,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-30",
            "description": "As a lifelong city boy, born and raised on the north side of Chicago, I found Alliance to be a humbling if not learning experience.  Purchasing meat from a grocery store, all neatly packed in plastic and stacked like Legos in a box, gives one a less than ideal idea of where our once live food comes from.\nWalking into Alliance was like stepping into another era.  The shop is old and the shopkeepers are extremely friendly and willing to answer any questions you may have regarding their live animals for slaughter.  I told the man that I wanted a medium sized chicken and he immediately went into the back and brought out a very healthy looking bird, screeching the way I would expect it to.  I said, \"I'll take it.\"  He brought the doomed fowl into the back room and it quit screaming within seconds.  The task was complete.  While the chicken was being processed, the shopkeeper brought me into the back to see the live chickens, ducks, rabbits, and even a turkey, wandering the livestock area, apparently searching for an escape.\nThe processing area was extremely clean and I have no qualms about becoming a regular of this establishment.\nI'll have to admit, I felt sad for the fate of the bird I purchased, but that's the way I want to feel.  To know that I saw the animal alive and breathing before I ate it, allows me to appreciate the animal lives lost so that I can live.  I felt gratitude for my bird's life and you can't find that at your local Jewel Food Store.",
            "author": "Joseph L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-03-10",
            "description": "I have been going to Alliance for years and I can't believe I haven't left a review yet. I love it! Chicken and eggs are delicious and the people are really nice, too!\nWhen I first went, I was a bit intimidated. You can choose the size of your chicken and how you want your chicken cut up. DON'T eat the chicken the day you buy it: it will be terrible and tough if you do. You'll bring it home warm. Put it in cold water and then in the refrigerator for a day. The muscles need to relax. Next day, yummy!",
            "author": "Michele B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-03-12",
            "description": "This place is certainly not for the squeamish. That being said, if you can reconcile with the fact that you will likely see your chicken live before it's nicely chopped up and sent home in the bag, this is a good place to go. \n\nI came here because I was looking for a place that would provide fresh chicken like I had when I visited Costa Rica last year and I must say I was not disappointed. This chicken is FRESH and it tastes so much better than any of the stuff that you find in the grocery stores. I also found the staff to be very nice and helpful. \n\nLike the other reviews say, be aware that you're basically going into a small indoor farm and live chickens are not the most pleasant smelling animals. All that aside, it is worth is for the best and freshest chicken around. I will be back again.",
            "author": "Khesa P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-05",
            "description": "My mother regularly picked up chicken from here. Wow! You can really taste the difference in quality. Thank you for keeping the tradition of fresh local food alive.",
            "author": "Edgar R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-04-13",
            "description": "I needed a whole fresh chicken for this recipe and I had no clue where to. What do you do in this case?? Turn to yelp. After reading some great reviews I decided to go in and check it out. Wow was I in for a treat. Never before I have I picked out a alive chicken and then moments later ended up in a grocery bag.\n\nWhen you first go in, the place doesn't look like much just some refrigerator s full of eggs, fish etc. But then you notice the clucking of the chickens in their cages! The gentlemen asked med or large. Next thing you know a live chicken is on a scale breathing his last breath. 5 mins later he was in a bag ready for consumption!! \n\nWow was he delicious! The only downside was the cleanliness of the shop, it looked really rundown and kind unsanitary but then again you are running a mini chicken slaughter house in the city.",
            "author": "Trevor D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-04-10",
            "description": "The best place to get healthy poultry. Great service and also very fast. Clean and very fresh!!",
            "author": "Hasan H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-03",
            "description": "Allow me to step off my soap box and say this place scared me, but I plan to be a long time customer. \n\nSo I was a chain store grocery shopper. After finally getting fed up with the quality and price of Jewel, the hunt began for better meat. This place was close, promised high quality, had low prices and most importantly wasn't Jewel. \n\nI rolled over on Sunday and found easy parking on Chicago Ave. Street parking is free on Sunday, so I felt like today was going to be my day. Then I walked into this place and the shoulder high counter made no effort to conceal the floor to ceiling chickens. The chickens are in cages stacked against a very visible wall.\n\nOkay, time to put my big girl pants on. I walk to the counter and the man asked me what I wanted. At that moment a chicken clucked and my big girl pants fell off. \n\nI humblely told him this was my first visit. He asked if I wanted \" big or small.\" I said small. He then disappeared into the chicken wall and returned with a bird squawking and squirming beneath his grip. \n\nHe weighed the bird and told me the price.He asked if I wanted the head and feet. I nearly tripped over my big girl pants in terror. I said no. He I nodded in agreement and the next time I saw the bird it was in a plastic bag. That's right. He gutted, plucked, and diced the bird into pieces within minutes. \n\nThe entire experience took no more than 15 minutes and cost me 8.60. While I was nervous because shit got real real, I must say the chicken was delicious! Way better than the frozen bags. Way better than that rib meat added shit. \n\nKeep in mind the bag will be hot as the chicken was alive mere moments ago. Your nose may be a bit hot from the smell, but if you are a meat eater you aren't going to beat the service or the price. \n\nI hope going forward they list the price per pound, but I am coming back either way!",
            "author": "Aja G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-01-26",
            "description": "I've been coming here for years to have my chickens and ducks butchered. The staff butchers halal which my customers appreciate very much. The pricing is reasonable, and the staff are excellent. Love this place.",
            "author": "Jill L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-11-23",
            "description": "You can tour the back if you want and if they're not too busy. It is a small indoor farm, so it won't look like a lab; but for what it is, it is very well maintained and pretty clean if you can factor in normal animal life. The prep area is very clean. One thing to keep in mind: poultry is not meant to be eaten the day it was slaughtered, or it's tougher than it should be. Keep it in the fridge for four days then cook, or three days then freeze (then defrost for two days in the fridge, not on the counter). All their stuff is Amish organic, do the fridge thing and you'll have the best poultry you can get in the city.",
            "author": "H. J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-02-18",
            "description": "I live in the near west suburbs but made the trip here to have my 3 backyard egg laying hens \"readied\" for the stock pot. Friendly service and as clean as a poultry shop in the city can be. I would definitely bring my chickens here again.\n\nRegarding some other reviews of the cleanliness of the back room, all I can say is that I went back to see my chickens butchered and I don't think anything was unusual.  The floor is wet, there is blood on it, and it smells like animals because they are in the room next door.  I'm pretty sure that they kill and process animals here so I don't think that anyone should expect to be eating off the floor.",
            "author": "Scott S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-08-04",
            "description": "For anyone who thinks it's \"jarring\" to see your food before you eat it, you might want to stick to vegetables. \n\nFred and Wally are super friendly shop keepers and make the (intimidating) process of buying, butchering, and cooking a formerly live chicken as easy as possible. You can select sizes or individual birds, get your poultry prepared or take home a whole hen - with or without feet. \n\nThe chickens look different than a grocery store chicken because they're not weighted down by oversized breasts, and they taste different too. They're so much better and fresher! Hard to believe people would leave Yelp reviews about a place without actually sampling the product. \n\nOther pluses: \n\n- Capons and turkeys at holidays \n- Fresh, super cheap, organic eggs \n- Quail eggs (if you're into that) \n\nSupport a neighborhood business, eat well, and save money. What more could ya want?",
            "author": "Alex B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-08",
            "description": "I called in a pickup order for three medium chickens, butchered in pieces, no heads. $28 bucks for everything. We were 40 minutes late picking them up, and they kept the birds on ice for us. Thank You very much!",
            "author": "Zeb M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2013-05-06",
            "description": "This place stinks. Like, really stinks. When the temperature is pleasant and the wind is just right, I get a nice noseful of rotten chicken. The stench is heavy and hangs in the air. It's so bad in the spring/summer I have to keep my windows shut if there is a breeze. I like the idea of fresh chickens in the city, but it really sucks being near this place.\n\n(Not to mention, it seems to attract an unusually large group of rats in the alley. Freaking gross.)\n\nIsn't there some city regulation about stuff like this?",
            "author": "Fred T."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-02-20",
            "description": "Hey. They have fresh live chickens, turkeys, and ducks for sale for food. You buy them, they snuff them, you stuff them. Capische.",
            "author": "Adriane P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-12-05",
            "description": "Incredible staff and great livestock.\n\nWe get our turkeys from here every year for Thanksgiving.\n\nPricier than a frozen one but a billion-times better taste and whatever.\n\nAlso, it really makes you appreciate meat and where it comes from. The owner is completely open about the farms they ship from and it's far much better than mass-processed poultry.",
            "author": "Maram K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-01-25",
            "description": "Wanna become a vegetarian quick?\n\nAsk to tour the back of this joint!\n\nWalking through shit and retching at the ammonia stench of fowl waste is a nasty thing.  Do yourself a favor and see where your food comes from and show your kids.\n\nI'm not knocking Alliance, the whole eating meat thing is just nasty.  That said, I still do it and came here to get some rabbits slaughtered for a meal with my friends.\n\nThey were out but had chickens, guinea hens and turkeys that they would slaughter on the spot.\n\nWe went for a tour.  It was gross.\n\nSo yeah, haven't successfully eaten anything from this place but it is a definite trip.\n\nCheck it out!",
            "author": "J J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-02-17",
            "description": "There is slaughter of live animals in the middle of a  major urban area occurring here. No, they don't practice santeria here but you can get some rather fresh chicken here.\n\nI admit I am used to getting my chicken on a plastic tray wrapped in plastic wrap. My parents used to patronize places like this when I was a kid. Sunday was always homemade chicken soup day. The things I remember is 1) the smell, and, 2) the sound of the chicken being slaughtered. The place does  have a barnyard aroma to it which is to be expected. You order your chicken live and it is weighed and then slaughtered.\n\nThe chickens are billed as organic Amish birds. The proprietors are middle eastern and the service is pleasant. A middle sized chicken is about eleven bucks.",
            "author": "Dan E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-19",
            "description": "Saturday afternoon. Live chicken. Owner is friendly and we chatted for a bit while chicken is slaughtered and cleaned.\n\nMuslim owner, muslim butcher I asked if the chicken were zabiha. Yes. And they told us which farms they got their chickens from.\n\nPrice is not any more expensive than grocery store like Dominics or Jewel, if not cheaper. $1.69 a pound. I did not see any already butchered whole chicken in the display case, just parts, feet and stuff. Mostly things that people did not want. They'll freshly slaughter the chicken per request.\n\nwe asked what to do with feet and he told us we could make soup. Now I remembered that's how my grandma used to put chicken feet in soup. \n\nThe owner also gave tips about working with fresh chicken, you have to let it sit, chill to relax the muscles its best to cook it the day after or after at least 2 hrs refrigeration.\n\nThey also have eggs, quails, ducks, rabbits, and around festivities, turkey.\n\nOverall I am a big fan and I should come more often. It's hard to justify a trip just for chicken, I wish they had meat, too.",
            "author": "Khadijah L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-11-22",
            "description": "I went there today to get a turkey and a duck to smoke for Thanksgiving this year.\n\nRobert Heinlein once wrote that an example of a \"man with unintegrated values\" is one \"who eats meat but would rather somebody else did the butchering.\"  This is only one step removed from that--you walk into the store and the smell is what you'd expect when there are a large number of live animals waiting to be turned into food.  You're offered the opportunity to look your \"prey\" in the eye and approve its \"termination with extreme prejudice\".  Deal with it, or become a veggie.\n\nThat said, it's the ultimate in fresh food for the carnivore or omnivore.  Chicken, duck, goose, turkey, rabbit--heck, they had *quail* for only $3/each.  (I'll warn you--they're all eyeing you with extreme suspicion.  I think the rabbits really know what's going on...)  They'll slaughter, clean, dress, and pack it for you quickly, at a remarkably low price.  The only reason I didn't give it 5 stars is that I have yet to prepare and devour my critters; I have every expectation that it's going to be excellent.\n\nWhen I expressed some curiosity concerning how they got such a quick featherless bird, the owner offered to take me in the back.  I accepted, and am glad I did.  Yes, it stinks, and the floor is wet--they clearly wash it down frequently, and the aroma is certainly from the live animals, which are kept out of the processing area.  The equipment looked clean, and it's as humane as such a process can be.\n\nOh, and someone commented about them being packed into cages--yes, most are.  But at the rate I saw customers coming and going, I'm sure they're not there long.  There were also some chickens and ducks wandering around loose--I figure they got out when someone opened a cage--and I did comment to them, \"If I were you, the door is *that way*.  Make a break for it...\"\n\nI intend to go back--those quail are too tempting.  (Sorry, birds--that's what being a top predator means.)\n\nADDENDUM: I ate the birds.  They were Very Good.  This is a definite go-to.",
            "author": "Dave I."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-17",
            "description": "I've been in this joint twice now & love it! There are bunnies hopping about & animals that are clearly in excellent health. My friend purchased a live chicken for me last summer; she got 2 days in chicken heaven before I slaughtered my first non-marine animal. She was delicious! The shop owners are extremely friendly helpful & knowledgeable about butchering humanely. Will be shopping here again soon!",
            "author": "Angela K."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-01-04",
                "description": "I love this place. Well, I used to. It still gets 5 stars, but I'm sad. \n\nI stopped in today to get some freshly butchered chicken breasts. They told me they had none. I was a bit surprised, since they are usually happy to slaughter a chicken for you if they're out of something, and they usually aren't out of anything til later in the evening anyway. I asked if there would be any tomorrow, and the owner said this: \n\n\"It's a new law. We can't sell live chickens *and* sell cut chickens. So we're just selling live chickens.\" He looked sad. So did I. \n\nI don't quite have the guts to kill, pluck, and butcher a chicken myself, though I have no qualms about 'knowing where my food comes from' or watching the butchering process myself. I hope the place goes back to selling cut chicken.",
                "author": "Josh S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-02-02",
                "description": "Get live poultry here. No fresher than that!! Chicken on this date was $1.99 lb. They will prep your purchase however you prefer...just let them know first. If you can't stand strong poultry odors, this place is not for you. But, if you like fresh and juicy...when cooked right that is, this place is for you. Just bring a clothes pin for your nose.",
                "author": "Henry Y."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-09-26",
                "description": "I only get my chicken from here now.  Anyone that doesn't is just crazy.  It is the freshest chicken you can get in the city.  Upon walking in you state the size of chicken that you would like.  They then pick a live chicken for you to approve and proceed to clean and butcher the meat to your specifications.  It is some of the juiciest and flavorful chicken I have ever had and its cheaper than going to Jewel or Dominicks.  Don't be afraid to walk in and let Sam or Fred serve you up a great bird.",
                "author": "Greg G."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2009-06-18",
                "description": "It's pretty jarring to see so many live chickens right in West Town.  Not really what you expect to see in a major American metropolitan area. \n\nI should first make the disclaimer that I have not actually eaten the chicken from this place, so my review is not based on the food itself.  The one time we went in, it was just to inquire about the prices ($1.69 a pound), and they only had one butchered chicken available.  The second time, my boyfriend actually went to purchase one because we were having guests over for dinner, and they didn't have *any* available. So, I guess staying stocked is not their strong point?\n\nThere is, however, an abundance of live chickens which presumably eventually get butchered and sold, though not on demand. This is where I'm feeling kind of torn.  My understanding is that a freshly butchered chicken is orders of magnitude better than what you can get at the supermarket.  On top of that, I'd sooner eat one butchered here in a small local business using old fashioned methods rather than in some massive scary processing plant hundreds of miles away.  \n\nAt the same time, the store touts that they sell poultry that is both \"organic\" and \"Amish.\"  If you've seen an Amish farm, you know that the animals are generally raised quite humanely in farms that look like picture book farms, and not in giant mechanized facilities. And of course, everyone loves organic, right?  So this is why it troubles me that the live chickens here are crowded into stacks and stacks of cages with the chickens practically on top of each other (think lobster tank) behind the counter.  There certainly isn't outdoor access or sunlight or anything you would associate with a humanely raised animal.  And just because the animals might have been sourced from an organic farm doesn't necessarily mean that they're receiving organic feed once or humane conditions in the store. Are they still organic then?  Do they arrive at the store as chicks or full-grown? How long are they in these conditions?  \n\nAnyway, like I said, I'm torn because organic, Amish chicken butchered locally is better than commercially produced poultry for so many reasons, and yet somehow the store doesn't seem to be living up to its promises.\n\nIf I get the opportunity to purchase from there, I'll write an update.",
                "author": "Elaine H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-01-03",
                "description": "My mother has been going by alliance poultry since i was a little kid . Now i am  26 and me and my wife and our 2 year old take a visit from Orland park to the poultry shop . All the chickens are Amish bread , they have rabbits , ducks , geese , quails , sometimes fish  , turkey on thanksgiving , and every now and then, they get some funny looking chickens and pigeons , I only order chicken from there , and every thanksgiving i get 2 turkeys , 1 for me , and 1 for my in-laws . The price for chicken is around $1.69lb . Its a little more then jewel or Dominick but to me , theirs no price on healthy organic food . You will taste a difference in there chicken , In the other post Elaine H posted they didn't have any chickens , I always find chicken when i go there , once on thanksgiving day i was late on buying a turkey and they didn't have any left . So now i always buy a day early , because fresh chicken like that needs to sit on ice for at least 3 hours before you cook it or else it will be tough to chew . I gave alliance 5 stars based on there great friendly atmosphere , there product of course , and of course healthy Amish chicken , Also , on the Jewish holiday they have a rabbi come in and butcher the chickens because they don't sell pork . And Jews don't eat pork , so it works out for them . Also for Muslims there is a Muslim butcher always on duty there . And of course for Christians there's always a christian butcher there also . So everyone wins .",
                "author": "zaid a."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Alliance Poultry Farms",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "1636 W Chicago Ave",
        "postalCode": "60622",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/WuaQDCZHUFqas6GlCe9YqQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13128291458"
}