{
    "aggregateRating": {
        "reviewCount": 16,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-18",
            "description": "This place is great!! Once you try the fruits and veggies you will know what I mean! There's an assortment of meats as well as jarred goods. Every time I have stopped by there is something seasonal at the store.",
            "author": "Grace C."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-12-19",
            "description": "This is not Amish Farmers store. Is mix. I found some products from the market in Chicago. A lot products from regular stores with very high price.  Nothing different than Rich Or Jewel Inot go for fakes products",
            "author": "Hanna S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-02-25",
            "description": "Yesterday I went in to buy chicken and one of the ladies that was serving the chicken had a glove on \nOne  hand and didn't  on the other  and she was touching her her running nose with the bare hand then I asked her if she could go and wash her hand and she's said  \"No me no wash hands it's good\" then I said then I don't want the chicken. She she put a new glove on the bare hand. I think they should have some training of how to handle food properly for safety. I asked  the cashier to see the supervisor and she said no supervisor or manager here.",
            "author": "Ivan M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-03-30",
            "description": "This is the best Amish store. Best meat, it's so fresh  , it's far from me but it worth it! Whole Foods is price and this is much better. Fresh,FreshFresh!",
            "author": "Martina T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-02-28",
            "description": "The products that were available were high quality.  I'm assuming that the lack of variety is due to the current season and I understand that. Hoping that spring/summer brings a little more of a selection.  Staff was a little cold but helped when I asked for it. Will be coming back.",
            "author": "J O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-01-10",
            "description": "Love this place. Great for those who like to \"hunt\" their food to be in the most natural state and freshest possible.",
            "author": "Alina W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-03-08",
            "description": "This is a tiny store that sells Amish produce and other staples like cheese, jams and breads.  The prices are extremely fair to say the least.  I picked up\na bag of raw almonds was $1 and a cup full of flax seeds was $1.50.  While small, the store offers a great organic selection for those nearby and don't want to pay crazy high prices at the big stores.  I was really impress.",
            "author": "Lily F."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-03-03",
            "description": "Love Amish Farmers. Have been shopping there for a couple years now. Love getting my farm fresh organic cAge free eggs!!!! The butter is amazing, so happy I don't have to drive to Wisconsin for it. Have not had any bad vegetables or cheese from here. It's a great little store for the area. My only issue (and yes I get it's a mom & pop shop) but the people working in there don't seem to keep to the standards for working with food. I have no bought any meat or poultry from there. The women who ring at the register do not speak English very well and always assume I am polish and speak to me in polish. Today there is a sign in English and polish that they are looking to hire a woman only, part time. Not to mention some of the people who shop in the store are rude and have no manners. Look for farm fresh go, but just be patient with the other patrons. Oh and the price for everything in the store is just right!!!!",
            "author": "Kim I."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-08-15",
            "description": "The staff is not very helpful or very friendly.  Their certainly not Amish.  There isn't anything else like it in the area, so with it's limited selection, I guess it is what it is.",
            "author": "David B."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-05-07",
            "description": "I love supporting local businesses but this place is a little overpriced on their veggies even if they are organic. When I walked in there were two employees who barely spoke any English and only one customer. \nI browsed around, but the store is pretty small so it was a short trip. Picked up a couple things and headed to the register where I proceeded to wait for the next 10 minutes while they stocked their fridge with meat in the interim 4 or 5 more customers walked in and they quickly ran to take care of them while I continued to wait. \nFinally about 15 minutes later the same girl who was serving meat came over to the register and asked me if I was ready.\nWhich I would like to assume so, since I had just waited almost 25 minutes to ring up a container of white pepper, butter, eggplant and gizzards. Before I left the store I realized of the 4 items she had only given me 3 charging me for the eggplant but forgetting to bag it leaving it on the scale.\nIn the future I'll just hit up a local Mariano's, whole foods or traders joe's for better prices and quicker customer service.",
            "author": "Cindy D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-08-11",
            "description": "They have local and organic produce, from Illinois and Wisconsin. Their array of local goats milk products is really impressive, I sacked up and tried some goats milk keifer....frigging delicious. The butcher counter is likewise very impressive, I am completely intimidated by the fresh duck and trout. Time to bust out The Art Of French Cooking Vol II. I found a 50lb bag of potatoes from Plover, WI last week. Your Idaho potatoes are inferior, look at them with disappointment.",
            "author": "Katrina B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-29",
            "description": "I've been to this little market twice now and I LOVE it. Fresh organic produce, grass-fed meat and dairy, organic honey, Himalayan salt, organic whole spices, tea, coffee and they also make some traditional Polish products like galetka (sp?) and kiska (blood sausage or think black pudding)...it's honestly a thrill every time I'm there.\n\nIn all honesty I will tell you that I purchased their grass-fed eggs there that I'm assuming are pasteurized (being sold retain and all) and although they were extremely yummy they did not compare to my raw grass-fed eggs I usually get at the farm. They were not as orange and full which will lead me to believe that the ones in the market here are grass-fed (perhaps grain supplemented and pasteurized) which change the appearance of the yolk. Nevertheless, they are still better quality than in a mass marketed store.\n\nThe kiska was phenomenal, the cherry tomatoes succulent and sweet, the mushroom fresh and firm. There is also a very nice selection of smoked & cured sausages.\n\nI would recommend anyone to check this local family owned place out.",
            "author": "Denise S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-10-31",
            "description": "JUST GREAT  STORE!  My family  is going  there  for almost  a  year  ,we love  the products,  everything  is  fresh  and it  last  longer  , meat  is always  fresh  and you  can  taste  the  difference!  They  also  have milk  produce  we love butter  and whole  milk  is actually  whole! You  also  have  to  try  bread  Awesome  ! Pricing  is in range  of  Jewel  Osco  . The best  time  to  visit  is Friday  late afternoon  or  Saturday  that's  when  they  have  the best  selection  !",
            "author": "Malgorzata P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-01-12",
            "description": "Love this little store! Always fresh food and veggies; awesome whole grain bread. They're constantly expanding their selection. Stop by and give this small; family owned business a try!",
            "author": "Kathy W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-11-02",
            "description": "I stumbled across this wonderful little store just yesterday and it was doing a good business for a Sunday afternoon. The product selection and atmosphere was absolutely delightful! They carry a nice selection of local, natural and/or organic produce, great cheeses, fresh real meats, eggs, dairy and sausages. It was real cool seeing all of the sausages hanging behind the meat counter, just like you find in European markets.  I was blown away by the good pricing. I saw organic apples for $1.50 a lb. I bought three dozen free range brown eggs for $7.70. Try doing that at Whole Foods! The employees were friendly but spoke little English, which was fine by me as it enriches the experience for me. If I wanted Same-o, Same-o, I'd go to Jewel.",
            "author": "William R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-28",
            "description": "Love this place! So happy I walked in couple weeks ago. Won't go anywhere else to buy meat, fresh vegetables and fruit. Homemade jelly, butter and organic milk are awesome! And I don't think this place is overpriced! I don't mind paying little bit more for healthy food.",
            "author": "Lenka L."
        }
    ],
    "priceRange": "$$",
    "name": "Amish Farmers",
    "address": {
        "addressLocality": "Franklin Park",
        "addressRegion": "IL",
        "streetAddress": "9711 W Grand Ave",
        "postalCode": "60131",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/isPb_L5EA5VAvIGbORL60g/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18479162483"
}