{
    "aggregateRating": {
        "reviewCount": 1,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-17",
            "description": "You go to the farm and you pick your own strawberries.  In all of my case studies, I've determined that food you pick yourself tastes better.  A little bit of sweat equity yields better tasting fruit and veggies. Okay, in reality, it probably has a lot more to do picking the produce at the peak ripeness and then eaten in the following days instead of sitting on a truck to travel to your grocery store. \nThese strawberries were amazingly delicious.  I ate a whole bunch while I was picking because I was really thirsty and the strawberries were juicy.  The picking part was easy, even though we visited near the end of strawberry-season (July 5), there were still plenty of good berries in the field.  These berries are smaller than the ones you will buy in stores but everything they lack in size they make up for tenfold in flavor.  I can't vouch for how long your berries will last because it didn't take long to eat most of them.  We did freeze some but I would suggest forgoing washing them since I think they will fall apart.\nI thought the price was a little high ($1.50/pound) for picking your own berries, but I still plan on going back next year. This place is also a little difficult to find so I would suggest calling ahead for directions (and for their hours since I believe they change throughout the season).  My personal method of looking at a map and directing my mother down random country roads ended up with me leading us down a very poorly maintained \"road\" and my mom thought I was going to break her car.",
            "author": "Alyssa K."
        }
    ],
    "priceRange": null,
    "name": "Annie’s Acres",
    "address": {
        "addressLocality": "Bellevue",
        "addressRegion": "IA",
        "streetAddress": "30327 Mill Creek Rd",
        "postalCode": "52031",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+15638725652"
}