{
    "aggregateRating": {
        "reviewCount": 12,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-05",
            "description": "So glad I found this on its last night! I just went to Asia this summer and have been missing the night markets there. The Argyle Night Market isn't huge, but it was enough to give me a small taste of what I've been missing. \n\nThey close off a small portion of the street (one block) and the restaurants there set up small shops/tents and sell their food. Everything was super cheap and we got a nice meal from it. \n\nLive music, lots of people, yummy food and a sense of community. Loved it! I hope they can expand in the future and make it bigger!",
            "author": "Rosy L."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-09-01",
            "description": "Not the extensive and brimming with food stalls Asian night markets that I'm used to. The food options are pretty slim; you're limited to some meat kabobs and fried offerings. They nowhere near represent the array of Vietnamese food you can find in Argyle. The music is nice, although the night market should take place at a later time; 5-9pm is still an early time slot to be considered a night market. I wouldn't come during repeated weeks, but maybe once a year to see if any of the stalls are updated.",
            "author": "Linda N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-24",
            "description": "This market is a trip. Don't expect a farmer's market - this year there has been only 1 produce vendor with limited supply. Instead, expect delicious Vietnamese food vendors, diverse entertainment, and excellent people watching. Kie-Gol-Lanee, the Oaxacan spot on Sheridan, also has a stand this year with delicious tacos, tamales, and huitlacoche blue corn quecas (quesadillas). Entertainment has included Latin jazz, soul, urban, Hawaiian, Mexican folkloric, taiko drumming, and community drum circles. The music attracts local characters who are fun to watch and dance with. This market might push you outside of your comfort zone, but give it a try!",
            "author": "Emily R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-05",
            "description": "Such a wonderful mix of cuisines, great music, and happy people! Love to see the community coming together on Argyle to put on this wonderful weekend event!",
            "author": "Rachel Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-10",
            "description": "Small night market with some typical and some interesting ready to eat food, mostly inexpensive.  Mostly SE Asian stalls that represent the area restaurants. Wish it was bigger with more stalls but the stalls were varied and the place was not too crowded. Some harder to find items like Huilacoche in home made blue corn tortilla quesadilla, skewers of beef wrapped in betel leaf (?la lo lop) chicken guabao, makes this a worthwhile destination on a summer Thursday night. There are also food to go, including those yummy Phoenix tofu in their killer sauces.",
            "author": "Ted S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-07-22",
            "description": "This market needs work. I was hoping for a lot of stalls full of weird produce and unusual street food, and LATE NIGHT snacks. The reality is a few stalls of vegan makeup and stuff deep fried in tempura. Also, the \"late\" only goes until 9 PM? What! The restaurants in this area are spot on, and I suppose that's draw enough. This fest has been going on for several years now, and I want to see it expand and really be a thing. I'm glad that it's here, but it needs to grow, grow, grow!",
            "author": "Erika G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-20",
            "description": "Mainly food stalls and only one block long, but the music and ambience are nice and the food is solid & reasonably priced. Not too crowded.",
            "author": "Lily T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-08-06",
            "description": "Wow! I can't believe I only heard about this market this year! We stopped by tonight and it was great! Live music, cheap food, great weather--whats not to like??? For $9 I was able to buy a large portion of chicken noodles, fresh papaya salad and a delicious pork skewer.  The street was closed off from traffic which made it easy to walk around.  It was a small area where the vendors were set up but I liked the intimacy of it all.  It wasn't overly crowded which was great but there was not a lot of seating on the sidewalks to eat our food. Maybe next year they can set up some tables for patrons to eat at? Super easy to get to --right off the Argyle Red line stop.  I will be back!!",
            "author": "Janet E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-08",
            "description": "How is it Argyle Night Market has no reviews?!  Located on Argyle St, it's an area known predominantly for it's Vietnamese and other varying ethnicities from the South East Asian community.  If you want Pho you come to Argyle.  There are some who are beginning to call Argyle \"little Chinatown,\" but that's just inaccurate. Argyle is an amalgam of varying ethnicities and although Chinese is present, it's a disserrvice to the majority of restaurants, groceries, and peoples to lump this neighborhood into some \"part 2\" of Chinatown.  \n\nIt's not.\n\nArgyle is Argyle.  The Argyle Night Market is one block that holds a market similar to what one would find in Southeast Asia on any given evening, except much smaller, and much less food options. \n\nBut here's what I love, and why I chose to live in Uptown over all other areas of the city: Diversity, and pride in that diversity.  White, brown, black, and all shades inbetween, old folks in their wheelchairs, a band twanging out country music, boyfriends holding hands, mixed couples buying fruit from the farmer's stand, it's palpable.  And it's important. \n\nI hear a lot of classist folks hem and haw over Uptown,  the main complaint being that Uptown \"is ghetto.\" I hate that word, and I hate when it comes out of a certain type of person's mouth - mainly those who stick to Lincoln Park and get scared by the sight of brown folks, or poverty, or homelessness, or people with obvious mental health struggles walking about in the community.  Uptown is diverse in those ways, as well.  It also hosts a large number of nursing homes. Uptown also has high rises that scrape the sky, gorgeous homes in Buena Park, historic sites, and although going through gentrification it has been known for years as a place where residents want to nourish the idea of mixed income neighborhoods. It has had it's controversies, and there's no denial of some of the struggles, but if you miss out on the Argyle Market due to some unreasonable and foolish fear then we can't be friends. \n\nArgyle, and the Uptown community, is a vibrant and beautiful community with deep ties and a deep pride in all that makes it resilient and everchanging.  It boasts itself as the most diverse and most populated area of Chicago, this is something to love and contribute time and energy to. This is what makes Chicago lovely.\n\nAt the night market I bought peaches and white potatoes from a farm stand, tried tofu from a local Vietnamese family business located on Argyle St., tried blueberry lavender ice cream from a white guy with islands tattooed on his calves, took a flier from a black man promoting the night circus in the parks,  bought noodles and lemongrass chicken from a Vietnamese stand, and perused stands selling homemade baked goods, including \"Uptown Brownies.\"  \nI watched kids dance and giggle and enjoy the country band that was playing, and I saw people out enjoying their ties to each other.  \n\nArgyle is an important part of Uptown.  The market has ended now, and you missed it.  \n\nYou missed it.",
            "author": "Sarah P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-26",
            "description": "Small number of fruit and vegetable stands, but a great place to check out some inexpensive Vietnamese street food (pot stickers, fried rice, and etc.), as well as an interesting collection of local vendors, together with a DJ on stage and an eclectic mix of people.  Recommend grabbing a few appetizers at the market, then stopping by a local grocery for some Vietnamese Coffee to take home (we love Trung Nguyen coffee!).  Then, head a block or two to the corner of Broadway and Argyle to have a nice dinner of Pho at Tank Noodle or a Bahn Mi (sandwich) at Ba Le Banh Mi.  Nice way to spend a Thursday evening!",
            "author": "Chuck T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-16",
            "description": "Two week ago I was up north near Argyle and. stumbled into Argyle's Night Market. I was driving east on Argyle and the street was blocked off in preparation for the market around 4 o'clock. I watched as the venders built their booths, cooked the food, and displayed their wares. There were many original booth at this market: one woman doing henna tattoos, another selling books, wheat free dog treats, brownies, candy and bakery good. In addition there was one booth selling fruit and vegetables and several restaurants were selling specialties, the scent of foods waft the area motivating visitors to their booths to purchase their food. All age groups participated there were even young adults tie-dying T-shirts to make money for their neighborhood organization. This was no \"Wonder Bread Market,\" this is a weekly event going on  until winter, uniting groups of people. Mixing traditions: styles, art,s, flavors, even the musical presentations from the Argyle Community and the surrounding areas. This is a very interesting market that happens every Thursday night. I would recommend going at least one time to experience it.",
            "author": "Eve H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-08-20",
            "description": "I was a bit underwhelmed by the Argyle Night Market. Don't expect a Taste of Randolph or Wells Street Art Fair sized street fair. It was literally about one block. There were vendors from some of the local restaurants and Vietnamese grocery stores, but they were mostly selling the same things. We only spent about half an hour at the actual night market, then ended up walking around the Argyle area. Not a bad place to stop by if you're in the area, but I wouldn't make it a destination point.",
            "author": "Heidi L."
        }
    ],
    "priceRange": "$",
    "name": "Argyle Night Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "Sheridan Kenmore",
        "postalCode": null,
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/74B799FpjRdmS_bBtNfDiQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}