{
    "aggregateRating": {
        "reviewCount": 7,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-14",
            "description": "After being to several farmers markets and have now realized what an amazing farmers market we have compared to other towns 10x the size of Beloit.  To start with, the ACTUAL farmers market does not start until mid June when farmers get their vegetables in.  So in May, its call the \"preview\" or some sort of limited market.  The full scale market has a HUGE variety of friuts/vegs, and many farms are non-GMO and Organic.  They also have multiple bakeries and craft people rounding out everything you could possibly want in a Farmers Market......My personal favorite:\n\n1.  Froggy Farms - Organic vegs, and these gargantuan garlic that taste\n2.  Salsa Man - Don't be fooled by imitators....his chips and salsa are amazing.  You can tell it is fresh and the variety of flavors is unparalleled. \n3.  Boomerang Bakery - Based out of Monroe, this place has the best pastries, but most of all, they sell a chop bread which is phenomenal.\n4.  Juice Lady - I don't know her name, but she sells fresh juice and smoothies that are truly fresh and worth every penny.  \n5.  Donut guy - there is tent that sells cinnamon sugar mini donuts that come out of the fryer and melt in your mouth.  They are a heavenly way to try to clog an artery.....and truly worth it.\n\nOverall, an excellent Farmers Market with plenty of variety of vegs and food.  I do wish we had a few more food trucks, but the bakeries somewhat make up for it.  Make sure to bring cash because most people don't take credit cards.",
            "author": "Neel K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-03-18",
            "description": "This is my favorite farmers market - good music, beautiful produce,\nDelish Bakery goods - u gotta try the fresh made donuts and the French pastry!  \nRestaurants, food trucks, food stands, all serving up yummy food \nAnd drink!  My favorite:  the taco truck for steak tacos!\nThere's also a good selection of vendors with specialty\nItems like jewelry, crafts, yard decor, plus more.  \nGive it a try, no disappointment here.",
            "author": "Mary N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-04-20",
            "description": "An expansive market with great, friendly vendors, live music and delicious eats!",
            "author": "Daniel L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-06",
            "description": "a great farmers market. tons of vendors with a wealth of produce, cheese, pastries, seafood flowers and more.  I was impressed with the bounty of produce that was available. I was able to purchase fresh ginger which is rare to find in the Midwest. beautiful flowers, fantastic corn. artisanal cheese products. jams, jellies, pickled veggies. even a seafood purveyor who also has a food truck at the market. there was a taco truck too with some authentic tacos/burritos. I bought amazing bread and pastries from a cute little woman from Nigeria. a band palyed Andean flute music all the while. if you want to take a break head to Bushel and Peck, a market/restaurant to relax.  all in all a great market  and fun place to bring a family.",
            "author": "Larry B."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-05-20",
            "description": "Meh.\nNot too many venders with things I'd buy. Seemed a tad pricey. Especially plants. \nNo music was playing at the time that we went.\nNo dogs anymore....very disappointing. Dogs are people too. Ha. I don't have one currently, but I like to see them :) \nMaybe as the summer begins more vendors will be there.",
            "author": "Pamela B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-29",
            "description": "Update:  This market is no longer dog friendly as of Sept 6, 2014.  However, this one is https://www.facebook.com/pages/Natures-Touch-Garden-Center/209712625716116\n.\n\nWe have been to the two Janesville farmer's markets and we told Beloit is where we should go next.  We took our dogs, but left them in the car.  (air on of course).  As we rounded the corner ... dogs, dogs, dogs.  Wow, it is dog friendly?  We quickly went back to the car and they were so excited.\n\nWe all went to the farmers market, bought fresh local produce, listened to music, drank some fantastic lemon aid and met all sorts of new canine friends.  If you have dogs, people here love dogs.  Parents were stopping asking if their child could pet them.  Little children were saying \"look at the dog\" all around us and every other dog.  There was even a police dog in the center greeting kids and families .. that's a first for us.  At the end, I sat down with all my bags and my dog got away from me and a woman we met earlier, got his lease and said \"its all good\".  I was  in doggy friendly heaven.\n\nA good time was had by all!\n\nThe only thing I will do differently?  Next time we will go earlier, get the shopping done, then enjoy all the canine friends.  Every dog wants to stop and greet others, and is clogs up the isles \n\nhttps://www.facebook.com/BeloitFarmersMarket",
            "author": "Tawny P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-10-19",
            "description": "Happy days, beautiful people, beautiful music, delightful Beloit.  Farmers Market is simply not to be missed.  The many vendors, from food, vegetable, fruit, meats, cheese...to soap makers, crafters, musicians, flowers galore!  its the perfect start to ensure a great weekend!  Another reason to love Wisconsin and relish in the charm that is Beloit",
            "author": "Tante N."
        }
    ],
    "priceRange": "$",
    "name": "Beloit Farmer’s Market",
    "address": {
        "addressLocality": "Beloit",
        "addressRegion": "WI",
        "streetAddress": "State St And Grand Ave",
        "postalCode": "53511",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/o3ooVxa6aZHe_YPvKfpR2w/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16083650150"
}