{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-10-27",
            "description": "Boley's Farm is located at 151st Street and 81st Court. It is a small farm of just 5 acres that the Village of Orland Park purchased a few years ago through its open land acquisition program. The village's open land program prevents many of these historic properties from being gobbled up by developers for a few more houses. While the farm is named Boley's after the founding family, the village rents it out each year so a farmer can sell fresh fruit and vegetables during the summer months. It is currently operated by Hank's Farm Stand. \n\nThis is a delightful little farmstand stuck right in the middle of a residential neighborhood...this makes it special as many people miss it but it is worth the trip to find it. Their fresh corn during the height of the Illini Sweet season is the best anywhere. Besides the usual fresh produce, they also stock honey, jellies and jams, and other products from Amish farmers downstate. Whether you are looking for just a few of these or those...or want a bushel full for canning, this place can satisfy your needs. The people here are wonderful. Highly recommended.",
            "author": "Rick B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-17",
            "description": "Hank and Bev run the farmstand.  They are super friendly.  The produce is always fresh and delicious.  The old Boley Farm is one of the true gems of the southwest suburbs.",
            "author": "Larry V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-17",
            "description": "I absolutely love this farm great produce and wonderful sweet corn and the Amish salsas and pickles and jam are great also. Once you come you will back again and again.",
            "author": "Marryann S."
        }
    ],
    "priceRange": "$$",
    "name": "Boley Farm",
    "address": {
        "addressLocality": "Orland Park",
        "addressRegion": "IL",
        "streetAddress": "W 151st St S 81st Ct",
        "postalCode": "60462",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2zGG3hhcpH46H9RktPAQow/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17084036219"
}