{
    "aggregateRating": {
        "reviewCount": 14,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-05-27",
            "description": "This is a well-organized, lovely market in the park on Chesterton's beautiful town square.  Very family-friendly and dog-friendly.  Plenty of both sun and shade, but seating is quite limited.\n\nFabulous Jamaican jerk chicken and smoky pork barbecue, brick-oven pizza, pierogi, fresh (not frozen) shrimp, and wonderful desserts and pastries.  Soft pretzels made from scratch on the spot while you watch.  Crafts and products of all sorts.  Garden-fresh produce and local honey.  There's a world-class antiquarian book store on the corner of the square.\n\nThis market makes for a wonderful summer morning experience, but maybe bring a camp chair if you want to be sure of having a seat. If you don't mind strolling, this is your place!",
            "author": "Stephen W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-05-05",
            "description": "This is s pretty good size during the season, but options are limited on opening day. There are the typical bakeries, wild honey, wine, cheese, and food vendors. They have live music which is always fun. If you're like we were and get in line for jerk chicken too late, there are brick and mortar dining options down the road. \nI recommend cycling if you can, or park away from the square to avoid traffic.",
            "author": "Lauren H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-05-06",
            "description": "Well run market which has evolved wonderfully over the years. Get there on the earlier side, like before eleven, if you want to get some of the items as they go fast. Long lines for the food trucks, but that is usually expected. Good selection of food. But, few places to sit and eat it. You can even get your knives sharpened!! Would love to see one more bakery offering an assortment of breads. Good entertainment, but because the music is in the middle of the market, there is no place to sit and enjoy it. I go back again and again!",
            "author": "Christine M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-08-09",
            "description": "This market was great! Tons of options and some great smelling food! We went looking for fresh fruit but unfortunately we arrived later in the day and most of it was gone! \n\nMy only \"complaint\" is that there needs to be more seating to eat the great food. They have a few picnic tables and some brick walls to sit on but nothing substantial.\n\nWe will definitely go back.",
            "author": "Mike G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-09-11",
            "description": "Located in Chesterton Indiana every Saturday from 10 to 2 from the beginning of May through the end of October. There are numerous food vendors. Specialty handmade items and homemade food products. Surprisingly there isn't a lot of fruits and vegetables you may expect to find. And people love to bring their dogs they're everywhere. It's pet and family friendly. The food available is always exceptional. It's a good time and well worth the trip.",
            "author": "Shelley C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-10-29",
            "description": "Great veggies and sad to see blueberries gone. Bread Honey.  And of course Books and coffee. Marylin's Veryberrie pie",
            "author": "Jim M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-09",
            "description": "great local produce + specialty items like bread and cheese = always a must go on Saturdays\n\nI love this farmers market because the venders have been the same for ages and I can get a ton of my produce locally.  They have cheese, bread, honey, and preserves that I splurge on sometimes but most of the time I am happy with my basket full of local produce.  I highly recommend this market!",
            "author": "Meg A."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-07-15",
            "description": "Out of all the farmer's markets I have been to, this is my second favorite.  I say second because if you are looking for acutal produce, forget it.  They have 2-3 of thier 80+ vendors that acutally sell veggies and they are so slammed that I don't even bother.  However, if you want artisan breads, cheese, pastries and other crafty things, this is perfect.  Also, the amount of food vendors is head spinning, from bubble teas to tacos, you name it, it will be there most likely.  \n\nBut veggies at a farmer's market, not this one hardly...",
            "author": "Amanda M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-05-05",
            "description": "Great market - very authentic. There were around 40 to 50 vendors offering everything from baklava and tamales to pierogies and olive oils. It reminded us of a market we visited in northern Italy with Italian music playing and the smell of fresh pepperoni in the air. Great place to not only make purchases but learn about the story behind the food from the vendors.",
            "author": "Brittany S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-09",
            "description": "I'm a veteran to the Chesterton European Market as I've tried to go at least once a year for the past several years.  Multiple vendors line the square offer items from food items (fresh fruit to desserts from a convent) to knife sharpening to plants and even dog treats. \n\nMy favorite vendors include Lehman's Orchard from Niles Michigan (they have veggie chips and a nice selection of dried fruits and jams/honey) and Kris' Country Kitchen out of South Bend with their homemade cookies and other goodies.  I also purchased a bag of kettle corn and a pretzel from another vendor which was one of the more delicious I've ever had.\n\nI'll definitely be back at least one more time this year.  The market runs from May until the end of October.  With the entertainment and all the square has to offer, there is always something for everyone here.",
            "author": "Mike P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-08-15",
            "description": "This is an open air market, fashioned supposedly after European markets.  I'm not sure, I've never been to a European market so I can't speak to the authenticity of it.  It has a nice array of vendors; however, way too many crafty things for me.  You can only buy so much soap, bath oils, beaded jewelry before it doesn't make it worth your time to go.  \n\nSome of the vendors are unique.  There is a cheese person there; however, I shy away from that because in the summer, all the cheeses are out (unrefrigerated with flies buzzing around), people sell sandwiches and full meals, baked goods and the aforementioned crafty items.  Sometimes there is a band playing or a musician plying his trade in the middle of the market.  It's a good place to people watch and get up to date info on new olive oils, some very good tapenades, lovely pastries and grab a cup of coffee or a smoothie.  For my tastes, I like the market by Skip's on Red Arrow Highway in Harbert, Michigan.  They also have some crafty vendors but I look at them more as artists, but they also have great farm produce. There is always a rescue group booth for puppies and kitties waiting to be adopted as well.",
            "author": "L. R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-05",
            "description": "Wide variety of vendors, produce and wares. Can always find something there. Open air market...weather matters.",
            "author": "Ed F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-15",
            "description": "Bring a lawn blanket and prepare to picnic with your family and friends at the Thomas   Centennial Park.  You see, Chesterton is all things Americana.  It's a quaint little town with a cute little market that has everything from fresh cut flowers, garden vegetables, fresh lemonade, BBQ meat to jewelry, scarves and mittens.  If you're not from Indiana, it's a nice way to experience some things unique to the state and region.  For example, they have local vendors like the famous Wakarusa Dime Store with their exclusive Jumbo Jelly Beans (huge and quite yummy with all sorts of flavors).  Kernels and Kones was there with their chocolates and gourmet fudge (fudge which is apparently from Pennsylvania but still excellent nonetheless).  I especially enjoyed the Polish accordionist Steve Kowalczyk and how he used timeless pieces to entertain passersby.  I had an enjoyable time and felt my 2 hours was well-spent.  I would definitely return to this open air market again.",
            "author": "Susan T."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-08-27",
            "description": "Visited last Saturday after an outstanding stop a few years ago.  This time was a bust for me.  The Michigan peaches were mealy, the corn mediocre and the melon was rotten and tasted really bad.  The only thing that was good were the organic blueberries.  As for a taste before you buy!",
            "author": "Linda K."
        }
    ],
    "priceRange": "$$",
    "name": "Chesterton’s European Market",
    "address": {
        "addressLocality": "Chesterton",
        "addressRegion": "IN",
        "streetAddress": "Thomas Centennial Park",
        "postalCode": "46304",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/CXcNVk72g98auf0Af3EvVw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+12199265513"
}