{
    "aggregateRating": {
        "reviewCount": 1,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-05-24",
            "description": "This time last year I worked in Clayton and on Thursdays and working Saturday's the Clayton Farmers Market (\"CFM\") was taking place within earshot. That said, more often than not, I found myself going booth to booth and leaving with some amazing items.\n\nThis weekend I got together with some girlfriends to go check it out and found out that CFM would not be happening this year. This is an extremely popular farmers market and the location in Clayton has changed several times over the past few years. Currently, the city is looking for a spot that will accommodate all of the traffic and vendors while being accommodating and respectful to the residents and the local business community. \n\nMy experience has been a bountiful amount of fresh fruits, vegetables and everything healthy and delicious sold by the basketful or individually. There are also lots of other vendors that sell cool things like soaps and those random things that you purchase because of the people that are there selling them and the sense of community that is fostered at farmers markets like this.\n\nWhether you live or work in this community or any community, I definitely suggest that everyone try local farmers markets (especially the organic growers). One Farmer cannot attend all local farmers markets - so try different places out and see what is being offered. Support our local farmers!! I have loved CFM in the past and I know they will be back bigger and better!",
            "author": "Kay X."
        }
    ],
    "priceRange": "$$",
    "name": "Clayton Farmers Market",
    "address": {
        "addressLocality": "Saint Louis",
        "addressRegion": "MO",
        "streetAddress": "N Central Ave",
        "postalCode": "63105",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/5qmTt5AHakuQmTCCEHGGNw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}