{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 2.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2015-05-24",
            "description": "The Creve Coeur Farmers Market (\"CCFM\") is relatively new and in the Westgate Shopping Center; the same plaza that holds TGI Friday's, La Bonne Bouchee and Edgewild Bistro & Tap.\n\nThus far I have attended CCFM twice and there has not been much available that I would purchase. On the last trip in particular, there was only one real Farmer that was there; he had chickens, fresh fruits, corn and the like. Another vendor had organic plants especially some organic heirloom tomato plants. Other than that everything else was soaps, jams, Creve Coeur support merchandise and items made by children to support their activities. No one had card-readers, or at least the three vendors I wanted to purchase from (thank the heavens I had at least $20 on me). At the support Creve Coeur court booth they wanted people to write down their credit card number and they would run them later. That is a NO-NO and a security/privacy issue waiting to happen. I know the new thing is for every municipality to have a farmers market (that concept is like all the police departments in St. Louis County - it's too much and has intrinsic inefficiencies). Another reason I think Creve Coeur may have a hard time getting this market off is that there are six grocery stores within a mile and there are so many other great farmers markets that have been established. \n\nHopefully as the weeks go on CCFM will build up and have more vendors and card-readers. This is a very large parking lot and there's certainly room to grow. They will need more than jams, one farmer and frozen slushes to bring people out.",
            "author": "Kay X."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-09-16",
            "description": "I've been here twice and it seems hit or miss. The first time there we saw about half a dozen actual farmers, selling produce that was pretty nice and we got some great veggies. There was also a stall selling fresh baked cookies that was good. A few people were selling hot food, from hot dogs to chicken curry. Other stalls were arts and crafts (soap, kids clothes, jewelry) and didn't really catch my interest. \n\nWe went a second time just today, and there were even less farmers selling goods. Only saw 2 selling produce, and 2 stalls selling cuts of meat and eggs (the eggs were completely sold out and a regular told me they were really good hence their popularity). We got some smoked ham hocks and some really tasty chicken curry. \n\nMost of the rest were arts and crafts stuff that again, weren't what I came to buy. I guess you really have to come during peak seasons to get more selection.",
            "author": "Lana T."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-08-19",
            "description": "Very few vendors with food. A lot of art and crafts and windmills. Not worth the trip.",
            "author": "Scott K."
        }
    ],
    "priceRange": "$$",
    "name": "Creve Coeur Farmers Market",
    "address": {
        "addressLocality": "Creve Coeur",
        "addressRegion": "MO",
        "streetAddress": "12320 Olive Blvd\nWestgate Shopping Centre",
        "postalCode": "63141",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/RZcTRma6XTFzKdYGCSJqxg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13146292765"
}