{
    "aggregateRating": {
        "reviewCount": 87,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-18",
            "description": "This place is a staple in my work week. I simply couldn't crop it out. ;)\n\nWhether you are doing some light shopping for hot sauce, pasta, produce, or grabbing a quick bite to eat, this place is affordable and amazing. Love it. Want some more of it.",
            "author": "Zach T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-10",
            "description": "Alas the City Farmer's Markets are bustling with local Farmer's fresh produce!! When they First opened this Spring it was more food trucks and tents from nearby restaurants selling quick grab and go lunches or treats. Which in of itself is fine except when you really look forward to what the name implies - a Farmer's Market! (Hence the 4 of 5 star rating) There's really nothing better than supporting the local Farmer's and bringing home farm to table produce knowing they are all pesticide free and the money goes right back to them growing beautiful produce Season after Season!! \n\nJust take the grocery shopping off your errands since they are open from May to October because just about anything you could ever want is found here in beautiful abundance and much less costly then the stores plus you actually get to meet the dedicated Farmer's and their families. So darn cute!\n\nOf course everything is seasonal and so what you find may varry but on my most recent visit, I brought home a basket of blueberries, another of cherries and some strawberries, juicy peaches, kale, sweet corn, vine ripe tomatoes, fresh basil and mint, cucumbers, zucchini, eggplant, sweet onions, raw apiary honey and a fresh bouquet of flowers all for under $40!!\n\nTip: Go a little early and scout out the Perfectly Imperfect boxes... these treasures are slightly blemished but otherwise perfect and a generous box will only run you $5.",
            "author": "Miss A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-17",
            "description": "Thank You Mayor Rahm Emanuel for taking care of Daley Plaza and encouraging all of US in Chicago to \"Cheer\" on the Chicago Cubs in tonight's home game at Wrigley Field in the third game against the Los Angeles Dodgers Playoff Series...I was here today at Daley Plaza and had to take a picture of the fountain that is NOW in CUBBY BLUE!  It made me smile...as many other people snapping pictures and selfies nearby!\n\n\"Go Cubs Go, Go Cubs Go, Hey Chicago What Do You Say?  Cubs are Going to WIN TODAY!\"\n\nThanks for the Chicago City Spirit to you and all workers at Daley Plaza...little things like this bring people together...and make it a community!\n\nPS.  Can you Fly the W Flag there? Inquiring minds want to know?",
            "author": "Christina S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-09-28",
            "description": "I enjoy going to the farmer's market on Thursday's. The same vendors are there every week and I enjoy the atmosphere. The prices, in my opinion, are slightly higher compared to a grocery store but you get to buy from local farms. My favorite places are the Amish bakeries (they have donuts, bread, pies, etc) and the mushroom farm (vegan tamales, ravioli, veggie burgers). \n\nBeware! \nI bought a head of broccoli at one of the vendors and there were small, green caterpillars. I didn't notice them until I went home. There are ways to get ride of them but I stopped buying broccoli out of fear of finding those little critters. Just make sure to check your vegetables before buying.\n\nAll in all, it's just a great place to browse and experience. I believe it ends at the end of October, so don't miss out!",
            "author": "Kathleen S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-03",
            "description": "I'm Felipe Rincon , me and my wife Laura sell Tamales at this Market . Friendly busy place lots of vendors, you have so many different choices of food and products to choose from. Look for us Aracely's Tamales !",
            "author": "Felipe R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-17",
            "description": "The City Market themes here at Daley plaza and all over, from South Loop to Lincoln park, are what make me proud to live in Chicago. \n\nA tourist attraction in itself, the farmer's market at Daley Plaza Thursdays 7am-2pm is what make going to work in the Loop area GREAT. Tons of foot traffic weaving underneath the Chicago Picasso from businesses men/women, tourists, students, and seniors all looking for the same thing: to eat and buy good ingredients. Dozens of little stalls showcasing aromatic baked goods, fresh home-grown vegetables, beekeepers from Indiana, bamboo tabletop decorations, fragrant floral pieces, even fig trees - a culturally abuzz square framed by the tall skyscrapers and under the shadow of Picasso. Yes, even if you aren't coming to buy anything, then come for the vivid colors and rush of life you'll experience here (can you tell, these kinds of things inspire me?)\n\nA huge shoutout to my friends at Kress Apiary for keeping the bees alive, please do buy their unfiltered, raw, honey (which keeps bits of honeycomb, antioxidants, and nutrients that other honey companies filter out)",
            "author": "Rhona K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-06",
            "description": "Smaller farmers market with a great location weekdays in the heart of the loop. It's fun to escape the office and walk around to sample the different foods (I always snag a taste of the tofu samples).\n\nAs with a lot of the farmers market, it's pretty much the same vendors that are at all the other farmers markets around the city. But, as it gets later in the season, there's a lot more produce at a bit more reasonable prices.\n\nThere's also lots of bakery vendors, some restaurant stands (where you can get lunch food like sandwiches or pad Thai), and flower/plant stands.",
            "author": "Jessie B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-05-24",
            "description": "When I use to live only a few blocks from Daley Plaza I would venture to this farmer market every so often but I never found much I care to buy. It's nice to have a farmers market right in the loop but outside that novelty I've been to much better farmers market and as a local or tourist I just tend to breeze right through it.",
            "author": "Ming T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-08-27",
            "description": "I recently moved to River West, and this Thursday market is the one closest to me. It's not as crowded as a lot of other markets, so you can get the personal attention they lack. One of the vendors here actually took the time to explain the difference between a leek and a large green onion. (Leeks are milder and better for sautéing and don't get as slimy.)  \n\nMy favorite bakery booth is the Amish one. I'm not sure if these women are really Amish, or if they're just actors dressed up to look Amish (hey... I've seen Witness). But I'm leaning toward authentic because they don't pluck their eyebrows. The Amish purple wheat bread with nuts is delish. But if you don't buy it before lunchtime, they usually run out. \n\nThe best produce is in the booth in the photo below. They have the best quality tomatoes, leeks and even golden beats... even my Whole Foods didn't have golden beets this summer.\n\nMy Yelp app found a Starbucks a half block away on Washington. So last week we bought a couple of lattes and sat at one of the tables in Daley Plaza. I had a yummy pan au chocolate (from the booth on the southwest corner of the plaza), and my friend had an incredible grilled cheese sandwich from Gayle's.\n\nI love this market!",
            "author": "Marcia S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-29",
            "description": "Magical.  \n\nThe Farmer's market transforms the usually hectic city corner into a blissful bazaar. \n\nOn a nice day it's pretty hard to convince yourself to go back to work.  Thursdays have become my favorite day of the week! \n\nEverything is so reasonably priced.  You'll pay more at Whole Foods for practically everything at the market. \n\nThe vendors are nice and everything is fresh.  \n\nThere is something for everyone.  From fresh flowers to homemade cakes and candy or even just a quick getaway from the office! \n\nStop by for a jar of honey or an Amish donut before it's too late!",
            "author": "Sarah V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-04",
            "description": "I work near Daley Plaza few days w week now. And I LOVE being there at the lunch time. On Wednesdays- Art Festival. \nOn Thursdays- Farmers Market. Fridays- Food Trucks. \nPricey but usually it is worth it!\nYou can smell the roses here. Eat some organic tomatoes & strawberries. See what other culture means. Listen to good music. Even dance. \nSee u there :)\nP",
            "author": "Patrycja E Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-11",
            "description": "This is the best farmers market in Chicago for several reasons:\n\n1. It offers the cheapest produce in the city - tomatoes for $2/lb instead of $4 or even $5 in the neighborhood markets (There's a specific vendor from the Indianapolis area that has the best tomato selection around), inexpensive flowers, great selection of produce throughout the season at very reasonable prices. \n\n2. It's conveniently located steps away from the Washington blue line stop. \n\n3. There are places to sit. \n\n4. It begins before 9 a.m., unlike certain neighborhood markets (I'm looking at you, Logan Square...what kinda start time is 10 a.m.?!)\n\n5. It's downtown, close to Michigan Ave and State Street shopping. \n\nENJOY! Go get some tomatoes from the Indianapolis fellas!",
            "author": "Michelle K."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-05-12",
            "description": "I've been to Daley Plaza's FM about 8-10 times over the many years and overall it's ok but a Farmers Market, it really isn't. It's more of a collection of specialty items that, while intriguing and somewhat unique, don't really rep a FM, apart from logistics.\n\nIf you're looking for tons of fresh fruits, veggies and produce, well, you might want to look elsewhere. These are the items i look for when going to a place like this.\n\nAs a side, when going to the (WI) Brunkow Cheese booth, I inquired about their awesome product in a few of Chicago's notable restaurants to which they responded in utter confusion with a side of attitude.lol.   Hey Brunkow, if you're being featured in restaurants by your namesake, you might want to have the ppl representing your product/company have a basic understanding of where you are being served. Just sayin.",
            "author": "Brent W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-22",
            "description": "I pass by they have like Google festival and computer science\nAlso see ppl setting having their lunch on the areas w/tables and chairs  then the fountain  is very relaxing",
            "author": "Cely R."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2015-07-03",
            "description": "I made a mistake in ordering a shrimp sandwich from Amazing Shrimp the other day. I've never thought of Hammond, IN as shrimp experts, or shrimp anything, but I figured, maybe they're transplants from a place where they do know shrimp. Anyways, all I can say is UGH! Nothing is much worse than feeling gross for the remainder of the day. The guy behind the tent thankfully dropped the garlic salt housed in a glass container, right before my order, or I would have been treated to a salt bath with what was termed a shrimp sandwich. The sammy was all about a huge brioche roll. After that fluffy/puffy 2 inch high, 3 inches wide piece of shiny bread, I couldn't tell you much about the shrimp, as I couldn't taste it and only saw 1 chopped up and swimming in a mayo and cabbage sea. There was seriously A LOT of mayo - i tons of dripping mayo and messy cabbage hanging over the bread. It was more like a slaw sandwich with a medium sized shrimp as an afterthought. For $13.00, that was about the biggest rip off the market has to offer.  \n\nNow, Brunkow Cheese of WI is the antithesis of the shrimp sammy. Everything from the aroma to the taste to the price was so perfect. Absolutely wonderful cheese!!!! 5 stars for the Brunkow family of cheese. \n\nA few weeks ago, the best asparagus for a buck a bunch were here. They were thin and green and delicious - so good, they were tasty raw. Not to forget, a huge bargain!!  \n\nPrices for cherries are high - or higher than Organic cherries delivered to my door...so I thought that was a bit odd for non-organics to be higher than organic. They looked tasty for the cherry devotees like me. \n\nThere's a guy that makes AMAZING cakes and has samples out to tempt customers even further. If there were more than 2 of us to devour a cake I would buy one in a heartbeat. Every flavor I've tried is decadent, flavorful, delicious and so moist.",
            "author": "Rebecca C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-29",
            "description": "Great time at this farmers market!!!! The variety is unbelievable, something for everyone. If you're in the city when the market is happening stop by!!!!!",
            "author": "M Z."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-27",
            "description": "This is a great place to get lunch if you are downtown. The prices are equal to or less than what you would pay in a restaurant and you can be assured of organic, non-gmo fare. I love Gayle's cheese sandwiches but they also have the longest line. However, just down from Gayle's is a tamale shop on the southwest corner that serves organic vegan tamales 2 for $5 that are to die for! This particular market seems to lean more towards prepared foods for consumption probably because there is such a huge supply of rabid lunch fanatics. However there is an ample selection of organic vegetables, meat, fruits, and normal farmers market-type items for sale.\n\nThis market runs from mid-May to the end of October and is famous as the longest running farmers market in Chicago. The hours from 7 AM to 3 but many of the stalls stay open later so you can stop and pick something up for the ride home if you're lucky.",
            "author": "Dan H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-10-10",
            "description": "Another great part of this great city is the various farmers markets.  I was able to stop at this market and check things out.  \n\nDue to the location which is right outside of the Daley Plaza so you can pick up vegetables, fruits or flowers when you are leaving the courts, heading to work or during your lunch break.  The market starts in the morning and ends early afternoon.\n\nThe prices are okay for location.  Great people watching.  Go and enjoy this market.",
            "author": "Ken O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-18",
            "description": "What an adorable little market! They have pretty much everything you would expect (fresh pasta, plants, vegetables, dog treats, etc.) right in the middle of the loop.  I got a grilled cheese breakfast sandwich from Gayle's, which I will forever compare all future grilled cheeses against.",
            "author": "David N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-18",
            "description": "Passed this twice before actually stopping to check it out. Kinda lame in May, though...",
            "author": "George C."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-08-08",
                "description": "Awesome market. I will have to update this review after I actually buy something. However, this review is based on walking around and seeing all the vendors. There are many vendors here, a supple amount, actually. Dude, what a variety of fruits and veggies that are in season and fresh. The prices weren't bad either. The only downside, they only accept cash! Come on people, it's the digital age, getting an effing square already! \nThey have a huge variety of vendors as well, from fresh fruits, veggies, and herbs, to local made cheese from the great North, to fresh bread, flowers, and food vendors that filled the plaza with a great aroma. \nI will have to bring cash next time to actually try these vendors out!",
                "author": "Brenden B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-08-05",
                "description": "Definitely worth a trip. Excellent corn, potatoes, fruit, flowers, etc. not cheap but high quality. Try the caramel cinnamon donuts! They melt in your mouth! Also, try the Belgian waffles. Even the plain is soooo good. You can eat lunch and get your produce shopping done all in one place.",
                "author": "rachel w."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-09-11",
                "description": "Aside from being a little piece of nature in the middle of the business district of Chicago, the Daley Plaza Farmers market sports excellent selection, variety, and value. Doubly so on that last one considering you're in downtown Chicago.\n\nI go there once a week while we're lucky enough to have it for a week's worth of veggies, pastries, and toffee (OK, i load up on all sorts of other treats too).\n\nBased on the produce alone, i would give it a $, but considering all the sweets and treats and candles and flowers and whatever else you're unlikely to walk away with without buying, i rate it as a $$ overall cost factor.\n\nIn relation to the Logan Sq or various other farmer's markets I've run into, this one is the best for produce. The one by Damen between Irving and Montrose has a better cheese selection though.\n\nIn response to a couple of other reviews, some vendors DO accept credit cards, but it's not a uniform policy. I don't particularly mind since i take cash out before going there and i can certainly understand the micro-economics involved.\n\nLove it. Will take advantage of it while it's around.\nYou probably should too.",
                "author": "John K."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-07-25",
                "description": "I can't believe I haven't been here every week this summer! Awesome produce & prices.",
                "author": "Elizabeth A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-07-22",
                "description": "Simply love the farmer's market. It comes along the way to my office walk from home. The whole feel of fresh, organic produce items gives me such a good feeling.\nThey got some really good stuff out here. I always end up buying flowers,honey and cheese. \n\nA must visit when one is around loop or daley plaza on thrusday.",
                "author": "Vineet S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-09-03",
                "description": "I just moved offices and am now close enough to walk to this market - YAY!  I'd been going to the one in Federal Plaza but this one is significantly bigger, and better.\n\nFirst of all, it's just gorgeous.  The Daley Plaza has this lovely fountain, and seeing all the tents set up around it will give any foodie a thrill.  Who doesn't want to spend a lunch break here?\n\nThis market has several vegetable stands offering a variety of seasonal deliciousness, and a good selection of fruit as well (well, now, anyway).  They have tomatoes and apples and potatoes in varieties you've never heard of, the biggest squash I've ever seen, people handing out random samples of goodness. flowers, cheese, bread, herbs (do not miss the fresh herbs stand, it is BOMB and so cheap and they have kale and other beautiful greens), pastries, toffee. the Amish people who sell the yummy food, mushrooms (ew but whatever), jams/salsas, soap and a few other crafts, and some places where you can actually get lunch instead of just ingredients!\n\nI'm depressed that I only have 2 more months to go here.  Green City Market isn't convenient for me and this place is the next best of the city markets, in my eyes.  You will find me here every Thursday until the end of October.  I'll be the weirdo getting funny looks in the elevator because I have a massive heap of basil sticking out of my purse.",
                "author": "Meredith A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-10-15",
                "description": "All these years working downtown, and never have I stopped to check out the Farmer's Market.  It wasn't until a brisk fall morning waiting at the bus, when I spotted a lady with 4 loaves of bread.  She initiated conversation with me, stating that she was looking for her favorite bus driver to give him a loaf of her Labriola garlic parmesan French bread.  Garlic parmesan... \"Where did you get those from?\", trying not to sound too desperate.  She pointed and said, \"Right across the street\".  \n\nShe then went on to state that they had fried cheese there, lots of local farmers with fresh produce and bakeries for some morning goodies.  I looked at my watch, and knew that making a detour before work that morning was impossible but dutily noted to leave earlier for work the next week. \n\nMorning meetings, cuddling up in a warm bed on a cool morning, unpacking after a work move...none motivate me to leave earlier for work.  Nope? And what does? Obviously some garlic parmesan bread. \n\nSo the next week, I left a little earlier and upon arriving, I knew to make a beeline for Labriola.  My bus occupant said they sell out fast, so that was the treasure that I was looking for.  I bought one loaf at $4 and knew if I fell in love with it, that the Paleo diet would be history.  I also bought an almond croissant at Delightful Pastries for $3 or so which completed my morning breakfast.  \n\nThe almond croissant was very good.  Flaky, crusty, airy, but could've used more almond paste inside it.  The garlic parmesan loaf was incredible.  Wonderful ratio of garlic to parmesan, and if consumed within 24 hours, a great texture as well.  Don't try to ration out the loaf over a few days, or it will be hard as a rock.  \n\nI sampled the hot cheese they had simmering up.  For whatever particular reason, the curds don't really melt into a glob, and stay in curd form.  The salesman reassured me that they would hold up the day without being refrigerated, but I just made another mental note to pack a small cooler on my next visit. \n\nFarmer's Market is only open till next Thursday, Oct 18th this year from  7 am- 3 pm.  On the last day, for the very first time, they will be have a Red Meat Market with chefs, butchers and guest speakers throughout the day....more mental notes for the folks who want to remember to bring their coolers that day",
                "author": "April P."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-09-07",
                "description": "I come from a city where Farmer's Markets are plentiful, but none of them even compare to the Daley Plaza Farmer's Market! There were so many great vendors for flowers, vegetables, fresh baked goods, and cheese. Many of the vendors have samples available for tasting and taste we did. During your visit if you come across the Brunkow Cheese booth make sure you stop by to see if they are grilling up some yummy cheese samples. I don't even have words for how good it was!\n\nDecent prices and a great variety!",
                "author": "Erin C."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2012-08-30",
                "description": "It seems very cool and convenient to have a farmer's market right in the middle of downtown Chicago.  They do a good job of filling the plaza and attracting a good crowd.\n\nHowever, the prices are pretty much doubled across the board, compared to what I would pay at any farmer's market at home in California.  Although, when you factor in supply and demand, multiplied by location, location, location, I guess I didn't really expect it to be *un bon marché*...",
                "author": "Chris Y."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-07-23",
                "description": "I LOVE THE CHICAGO FARMERS MARKETS!!  They serve food, are good people, and have a great selection for a small space in the city.  Need I say more??",
                "author": "Kelsey K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-09-11",
                "description": "I love this market.  It's like  touch of the country in the heart of the city.  The fountain and the Picasso are such a cool backdrop for the stands ands their umbrellas.  This market has a bit of everything.  You can pick up a great selection of fresh produce, including a generous bunch of kale for a dollar!  The raspberries were beautiful and much less expensive than their grocery store counterparts.  There are quite a few stands that sell ready to go meals, like noodle bowls and sandwiches.  My favorites are the vegan tamales and vegan fruit bars.  While you're at it you can pick up a nice bunch of fresh flowers.  There are several flower stands to choose from.  A lot of loop workers visit the market at lunchtime.  It opens early so you can also swing by and pick up your morning fruit.  The energy is great here, and the market is much more extensive than some of the little neighborhoods ones.",
                "author": "Debra L."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-08-01",
                "description": "After I heard there was a Thursday farmers market downtown I (literally) took the next train there! It is pretty big! They have more produce than my neighborhood farmers market. They also seemed to have a lot of great lunch time options that could be eaten right away. I was surprised by how large the space was. There were tons of produce for what seemed to be pretty inexpensive. Also, they had so many gorgeous flowers! I love buying flowers at farmers markets, they just make the day better! \n\nThere is also the relaxing fountain you can stop and eat or relax at during your lunch break. I will definitely be coming back (and have cash with me!) This is a great way to take a few minutes and relax from the work day. Go check it out!",
                "author": "Amanda F."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-09-16",
                "description": "I happened upon this farmers market on my way to meet a friend for lunch. I have 2 words for you....BREAD CHEESE. If you have not had this stuff you need to try it. 1 for $6 or 2 for $10...I bought the jalapeno one and the garlic one. YAY. Bike parking on the perimeter.",
                "author": "Allison V."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-09-30",
                "description": "I a restless sleeper, which means I'm cranky when I get up in the morning. Trying to wake me up is kind of like poking a sleeping bear with a stick, others can verify this. However, the Loop farmer's markets have me waking up early of my own volition.\n\nMy usual market is the Federal Plaza market on Tuesdays, but when I forgot to pick up a few items I decided to visit Daley Plaza on Thursday. There are many of the same vendors and good number of ones not represented at Federal Plaza too. I had come for two items, but before I knew it I was toting a very heavy bag full of apples, tomatoes, cookies, bagels, and broccoli back to my office.\n\nMy one regret is that I didn't get turned on to this market earlier in the season, it really is a gem. They have pretty much everything you'll see at a weekend neighborhood market, but with fewer crowds, strollers and kids, which in my book is a huge bonus.\n\nYou only have a few more weeks to partake so hustle your butt over there!\n\nThursdays. Daley Center. Be there or be square!",
                "author": "Mary T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-03-19",
                "description": "This review is specifically for the Menonite and their baked goods. I miss you all in the summer months. Your banana bread, apple bread, and pumpkin bread is phenomenal. Please come back soon.",
                "author": "Pat D."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-05-21",
                "description": "Strolling into work late after an appointment today I could stop at this super-convenient and spacious downtown farmer's market on a Thursday. Of course farmer's markets cater to what's in season locally, and locally here usually means Michigan or downstate IL. Several Michigan farms had fresh asparagus, herbs for planting and flowers for planting. \n\nYou want a 2 ft. tomato plant that you absolutely cannot kill at this point? Here you go! Herb plantings were plentiful, and already fully grown; including basil, cilantro, rosemary, mint, oregano. Grow your own, as they say!\n\nThere's also artisanal breads, fresh baked goods,a kind of \"hip\" Roller Derby-type girl selling \"cutting edge\" baked goods,  fresh honey and the list goes on and on. I really liked how spacious the Daley Center Farmer's Market is, because it's a pain being elbow to elbow with someone and fighting over the last stalk of dinosaur kale!\n\nI vow to wake up early on Thursdays, pack my canvas Yelp tote, and stop here on my way to work this summer. Do I sense you getting a little \"green\"?",
                "author": "Kyle H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-02-03",
                "description": "I go every week for the amazing produce selection (Nichols Farm, etc.).\n  \nSpring can't come soon enough.",
                "author": "maurice s."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-08-19",
                "description": "I love me a Farmers Market, and this one does not disappoint. Lots to choose from, great vendors & the prices are very decent. Nichols Farm, Brunkow Cheese (Go. Eat. Samples. Now.), River Valley Kitchens, just to name a few. I definitely recommend hitting this up before it's gone (last day is October 31)!",
                "author": "Karen C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-10-11",
                "description": "What a great contrast between the downtown office atmosphere and the fresh farm food!  It's wonderful to walk through the farmer's market on the way to work or during lunch, and it always smells very fresh and herb-y. This farmer's market is more expensive than others and what you can buy at the store, but I think it's worth it every now and then to support local farmers. \n\nI recommend the quiche from the Delightful Pastries stand. It's very rich and buttery, but not too heavy. They also have a variety of breads and puffy pastries.",
                "author": "Cora T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-06-05",
                "description": "This is a great weekday option if you are looking for a farmer's market smack in the Loop.  Its no Green City, but it comes pretty darn close.  And most of the really good vendors from Green City are there anyway.  \n\nGreat selection of veggies, fruit, flowers, baked goods, cheese, and other pickled treats and jams.  Its a great reason to support local farms, eat in season (because its good for you and it just tastes better when its supposed to be eaten), and get outside.  Seeing all the colors alone is a visual treat.\n\nFarmers markets are not for everyone, but they should be.  Sure they cost a little more that crappy store produce, but you know where your food came from and can ask the person that grew it any questions you have about how it was grown, the best way to cook it, and how much longer you will be able to get it.  Its completely worth the extra few dollars total, and the taste of fresh veggies and fruit will blow you mind.\n\nHighly recommend, go check it out and bring cash!",
                "author": "Sarah F."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-07-07",
                "description": "Such a fun place to go to on your lunch! There seems to be a great variety of fresh produce, flowers, bakery items, cheeses, and even some tasty lunch options!\n\nI wanted to get some fresh air on my lunch today, so I thought I would head over here to browse, not buy. I only had $3 on me, so that didn't seem too hard. However, to my surprise, I found a bag of mini chocolate chip cookies for $2 and a giant sunflower for a $1! I obviously could not pass up such great deals, especially when they are so delicious and pretty--sooo I got both. It made my day.  I can't wait to make this Market a part of my Thursday routine!",
                "author": "Sonia B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-09-19",
                "description": "I have a confession to make. A secret I have been harboring for years....\n\n*deep breath*\n\nBefore a couple weeks ago, I had never been to a farmer's market before.\n\n*hangs head in shame*\n\nI know. I KNOW. I always MEANT to go. Hell, I live right down the street from one of the biggest farmer's markets in the city. But I somehow never made it, and now... NOW... I am kicking myself for all that wasted time!\n\nMy employer recently relocated our offices, and now I am steps away from the Daley Plaza Farmer's Market. I knew this, but it took me getting downtown way too early for work one day to go try it out.\n\nAnd boy, am I so glad I did.\n\nDelicious, fresh bread! Delicious, fresh fruits and veggies! (Except you, yucky grapes!) More pastries than you can shake a stick at!\n\nAnd who knew the Amish were so freaking nice?! Not I! (Though they did seem offended when I declined a free sample of a doughnut.)\n\nAnd it's all so CHEAP! And all of the vendors, not just the Amish, are incredibly nice. I was just walking around SMILING and taking it all in.\n\nI'll be back. Again and again and again.",
                "author": "Jo W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-10-01",
                "description": "I love wandering around this farmer's market...It's convenient for me because they actually open at 7AM (Thursdays) so I can visit before work straight from getting off of my train in the morning. And, I gotta say, I am a cheese addict. And, there is plenty of cheese!\n\nI'm not overly interested in the fresh produce...The prices are generally higher than at my grocery store (Meijer). But, they do have some varieties of veggies that are not available at regular grocery stores (think purple potatoes and peppers you've never heard of, for example), so that is a plus.\n\nI'm in it for the dairy. There are several booths that offer various cheeses. And, a big plus, they offer samples! In recent weeks I have bought some tasty garlic-cheese spreads (2 for $10) at one booth and a chunk of bacon-cheddar cheese at another, among other things. Both were well worth it--the bacon cheddar went great on breakfast sandwiches and the spreads were a great companion to the football Sunday snack offerings.\n\nAnother highlight for me is the baked goods. Labriola has a booth where last week I obtained two nice pieces of Ciabatta bread which inspired some tasty Italian sandwiches for dinner that night. Also, there is another booth that sells some really good bagels...I got pizza ones and they were excellent.\n\nI will defintiely be sad to see the market go once chilly weather prevails...There's always next year to look forward to, though!",
                "author": "Jackie H."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-09-26",
                "description": "My favorite of the weekday downtown farmer's markets.  The amount of vendors and quantity of produce is nearly overwhelming.  I've picked up incredible tomatoes, breads, cookies, cheeses, organic honey, etc over the last few years here.  Its a great 20 minute mid-day diversion from the office and gets me outside.  Its fun to browse and people watch, even if you don't plan on making purchases.  During many market days here, there is also some sort of Daley Plaza cultural fest going on also, such as Turkish fest, Thai, etc along with stage entertainment.  There was even a celebrity chef cook-off some weeks back, that was fun to watch.\n\nLately the apple crop is in full swing and there are no less than 20 varieties available.  Honeycrisp is a personal favorite.  Also, be sure to checkout the Amish vendor and pickup some of their peanut brittle.  Its amazing.  Organic, raw honey from Kress Apiary is top-notch.  Makes the grocery store honey bear stuff look bad!!",
                "author": "Matt P."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-07-16",
                "description": "Oh you lucky, lucky Chicagoans.\n\nI was quite surprised to find this farmers market when I stepped out of my hotel Thursday morning to meet a friend for tea. At that time things were just getting started but it was easy to see the makings of a wonderful market - vibrantly colored fresh produce, baked goods (I got a delicious black and white cookie to take back with me on the plane), flowers and cheese.\n\nI love to see local, seasonal produce being sold on the street, during the week where it's accessible to all. Hail, Chicago!",
                "author": "Miriam W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-03-17",
                "description": "A cool thing to have a farmer's market right in the middle of downtown. Really pleasant to stroll around and look at what's for sale.",
                "author": "Alex H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-05-25",
                "description": "If I were a cheerleader, I would say \"more Brunkow Cheese, if you please!   Brunkow Cheese!  Brunkow Cheese!  Rah, Rah,  Brunkow Cheese!\"\n\nThat's why I'm not a cheerleader...because my cheers suck.\n\nAnyhoo, I wanted to surprise hubby with some romance, so I thought there would be no better place to go than the Farmer's Market during my lunch break.  My co-worker raved and raved for over a year about the Brunkow Cheese.  I finally went to see for myself.  \n\nTWO Brunkow Cheeses for $10?  Yes, please!  I got the regular and the garlic.  I also picked up a 1 pound loaf of fresh Italian Bread from one of the baked goods booths (cant remember which), for only $3.  I gave the cute boy at the booth a $5 bill and told him to keep the change, so he gave me a pretzel roll...*blush*   Great bread AND flirting? AND a preztel roll?  Sure!\n\nMy surprise Hubby romance was complete...I had my cheese, my bread, and all I needed was some wine (which I picked up after work).  Thanks, Farmer's Market!  Hubby was so surprised and happy...\n\nI can't wait to go back this week.  I saw some awesome portabella ravioli and some homemade pasta sauce with my name on it",
                "author": "Alicia M."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2011-05-20",
                "description": "I love that I work so close to Daley Plaza to take advantage of this market.  I love strolling through at lunch.  The Amish rock my gluten filled world.  Nice flowers/plants, but I find myself not being able to buy any since I will have to walk back to the office and take the train home. Not too many produce items -- I've seen mushrooms, asparagus, potatoes, some fruits, etc.  They also have a large variety of cheese, some frozen choice cuts of meats, but lots and lots of bakery items ;o)",
                "author": "Susan M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-09-03",
                "description": "A nicely dressed woman enters a room ever so shyly. She is unsure about being in this room, it is crowded and the people are little intimidating, but she musters her courage and sashays to the front of the room, The room is filled with people bogged down with bags & bags of fresh produce, baked goods, fresh herbs, and flowers that peak out of the top of said bags. The people all look at her, she is obviously new to such a gathering, so she stands and turns to the crowd to utter these words: \n\nHi, my name is Unity O and...(pauses nervously), uh well, and I am Farmers Market Whore!! \nThe crowd erupts in applause and shouts \"WELCOME\" in unison. Women sighs with relief and sits down with a satisfaction of knowing she has found her people & her place in this crazy world. \n\nIn all seriousness folks, I think I have a problem--I cannot stop going to Farmers Markets, I have been to so many this summer and I cannot seem to stay faithful to just one. I have this insane yearning to try them all, I do wish there was such a thing as FMA ;-) \n\nSo, I wandered on over to this market this afternoon, actually stumbled upon it on accident because I was simply on my way to dropping off my tax appeal (stupid cook county!). What a nice market this is, they have loads of booths for fresh produce, baked goods, and also flowers. It is also very spacious which makes this chica very happy. It seems to get crowded during the lunch hour and how lucky are the folks who work near here?!?!?! Since it is mainly a work crowd here, one major bonus: NO STROLLERS, thank goodness!! \n\nIt was nice to wander around and see what was being offered, it was also very nice to actually talk to the farmers and hear a little about their products. I loved the people from Kress Apiary, they were so personable & funny--definitely want to visit their farm. I did notice that this FM has more baked good/bakeries stands than other FM I have been to this summer. This is definitely a smart move since you are looking at people on lunch breaks, they usually come hungry. One place I was more than happy to buy baked goods from; Misericordia. Not only do I get yummy cookies and blueberry bread, I can feel good about it too since it goes for a great cause. \n\nSo, if you work near here or are in the area on a Thursday, stop on by & get yourself some delicious food.",
                "author": "Unity O."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2009-06-29",
                "description": "This is the first new review I've done in a while so I'm gonna be a little quick about it.  Recently I've been hitting up farmer's markets and trying to eat a little bit healthier and support local farmers. Going to farmer's markets around here is also a  great way for me to kill some time and  see all this great food and produce. \n\n    I got up later than I thought, 10am with a bad headache. I still managed to head on over to the market and it was very crowded but still had enough space to walk around comfortably.\n\n   *Quick note: Yuppie parents, for the love of Zesus please, PLEASE, quit bringing those damn wide ass, double-decker, pimped out strollers to places you damn well know are gonna be crowded! \n\n    Anyway, there were a lot of stands to go around and browse at. \nWhile some of the produce didn't look the best to me, I was pretty happy with all the different selections of food. Some stands I would defiantly go back to are: \n\n*The Bleeding Hearts Bakery salted caramel cupcake- Very sweet and rich. Drink milk if you buy, the strawberry rhubarb cupcake looked good as well but I didn't get it.\n\n* This berry stand with this goofy guy from Michigan- I tried these raspberries he was selling and they were the sweetest I've ever tasted! \n\n-His black and strawberries were sweet too and he has a 4 pint for $15 deal so you can mix and match them. \n\n* All the bakery stands goods looked so tasty and a couple of them raise money for good causes.\n\n* As I said before, some of the produce didn't look the best but the prices are a bit lower than other markets and I saw a lot of variety. \n\nSo, if you live at any of the school dorms downtown or your looking to do something different for your lunch break, Check It Out!\n\nP.S. Whoever took the napa cabbage I was about to buy, I WILL FIND YOU!",
                "author": "Amina D."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-08-21",
                "description": "This is a great little farmer's market. After returning to the country from a seven week trip, the first thing I wanted to do was get some good, homegrown midwest produce.\n\nI got to the market yesterday at about 8:30 a.m., and was surprised to see practically no one shopping. I know it's in the heart of the Loop, but one vendor had delicious-looking bagels for breakfast and another had beautiful scones! This would be a great place to pick up a nice, light breakfast before work.\n\nThere were a good amount of vendors at the market, which was nice so I shopped around for the best prices on my fruits and veggies. I found the prices to be pretty reasonable, less than the Green City market. I walked away with two bags of fruits, veggies, and bread for less than $20. \n\nAlong with 5 or 6 produce vendors, there were a couple baked good vendors as well as some clothing and jewelry and flowers. Weird, but good. \n\nOverall I'd definitely return to this market because the prices are right and the produce is impeccable.",
                "author": "michaelia f."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-02-20",
                "description": "Somehow, even though I looked forward to every Farmer's Market Thursday, I almost always managed to forget my reusable tote bags.  I blame it on being too groggy when I left for work in the morning... but by the time 11am rolled around, my friend and co-worker Laura B. and I were wide awake and hurrying down to the market, hoping we'd be able to haul all our goodies back to the office with us.\n\nSo, so, SO MUCH good stuff!!  Artisan breads, homemade jams, jellies and salsas, absolutely addictive Amish toffee, pies and cookies, mushrooms, cheeses, Michigan peaches (God, they were SO good last season!!) and other delicious fruits, all manner of veggies out the wazoo, tons of bright, beautiful flowers and our very own Bee Man (you know, the guy who brings his bees and all their delicious honey)...  In the early autumn, you can get tasty caramel apples that were dipped that day or take your pick from many lovely pumpkins and gourds... I just loved this market.  It's a great source for fresh produce during the growing season and visiting the market is like going on a little vacation during the work day--so many lovely things to look at and sample.\n\nMost Thursdays, I left work with an embarrassing amount of produce that made riding the L home a bit challenging, but once I tasted those fresh tomatoes or those juicy peaches (so freakin' good!), it certainly made the haul worth it... especially the time I brought home a giant stalk of still-attached Brussels sprouts.  I had to carry it on the train like a baby and everyone looked at me like I was nuts--but damn, those were some tasty little guys!\n\nThank you, Farmer's Market, for making sure I had such tasty, fresh food to eat and for giving me a break from Cubicle Land.  Come back soon and I'll bring my bags.",
                "author": "Julia W."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2006-06-22",
                "description": "This is a great farmers market.  Elizabeth N and I checked it out during lunch today and we'll definitely be back many more times this summer. The cherries and strawberries looked so fresh that I couldn't resist buying a bag of cherries, even after a big lunch. The cakes, breads, and cookies looked delicious as well!  My only complaint was that there weren't any peaches, but I guess they aren't in season yet and will be there in just a few weeks. This farmers market is open every Thursday from 7 am- 3 pm and I definitely recommend checking it out if you haven't yet.",
                "author": "Andrea R."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-06-25",
                "description": "Thursdays are wild at the Daley Plaza and each Thursday keeps getting better and better.  Today I found myself in front of the Rise 'n Roll Bakery; a lovely group from Middlebury, IN.  Dressed in garb similar to the Amish, these people are Farmer's market to the core.  And they produce some of the best baked goods I've had so far.  They had homemade granola, pasta, cheese, cookies and so many other delicious looking things that I could have spent $200 at their tent.  I will be back to visit them!  I also love purchasing a variety of fruits and vegetables from the Nichols Farm & Orchard.  These people also know how to produce some great tasting food!\n\nFor those of you who haven't been, the Daley plaza farmer's market contains many of the same booths as the federal plaza farmer's market on Tuesday, plus a few more.  In season fruits and vegetables can be found as well as a variety of baked goods.  If you work in the area, stop by before work for the best selection or make a trip down for lunch.  Why spend $10 on lunch to get a sandwich when you can grab lunch from a farmer's market?  Go now and show these locals how much we appreciate their efforts.",
                "author": "Dusty K."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-09-18",
                "description": "I was here 2 weeks ago.\n\nI got some sugarless jam--blueberry and a mix of apricot/cherry. 2 jars for $10.\n\nI  got Indiana peaches that were sweet and  juicy. 6 peaches for $6.\n\nI got a box of cinnamon donuts hole ($5.50), 2 boxes of cashew brittles  for $10 from the Amish stand.",
                "author": "Linda C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-10-09",
                "description": "I'll wake up early on a Saturday and go out of my way just to go to a farmer's market, so having one downtown a block from work makes this an instant part of my Thursday. \n\nPicking up some fruit and a muffin for breakfast along with some produce for the night's dinner seems to ease me into my workday. Taking a short stroll through the market, looking at stalls of flowers and fresh fruit, vegetables and baked goods makes this a great way to start the day.\n\nA lot of the farmers and vendors here are also at Green City Market, so if you are fan of that one, this is certainly worth a browse. Fresh food, nice people and the more we invest, the better chance they will return next year.",
                "author": "Chris S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-08-03",
                "description": "Is it Thursday yet? Is it Thursday yet? Is it Thursday yet?! Sigh...why must this Farmers Market only run every Thursday until October 15th, from 7 am - 3 pm? There are just too many tasty and beautiful things here to pack into one day a week! \n\nSituated in the famous Daley Plaza, it is either a bad idea or a very good idea to visit this Farmers Market while you are hungry. It's bad in that you buy a lot, but it's good in that things aren't too expensive. \n\nMini reviews of some of my recent haul: \n\n- This morning I just finished off the last bit of DELICIOUS Zucchini Bread, baked by the beautiful people at Misericordia, a great non-profit organization assisting children and adults born with developmental disabilities (http://www.misericordia.com/). They mostly sell loaves of Irish Soda Bread, Banana Bread, and other sweet loaves, that each cost $3.25 (or $3 apiece if you buy at least three). The loaves are so moist that you will regret that you only purchased one loaf. \n\n- Wisconsin cheese samples are evil, because they taste so good and cause you to buy a $5 bag of cheese curds that will take you two weeks to finish. The particular bag of cheese curds I bought was plain, though the booth also offered them in dill/garlic flavor. Oh don't tempt me! \n\n- Artisan Bread. For $1.50 you can buy a sandwich-sized garlic/marinara bun that makes a fantastic lunch. I suggest microwaving it for about 30 seconds to really bring out the softness and garlic taste of the bread. This artisan bread booth also sells pretzel bread loaves. \n\n- Fresh flowers. If this Farmers Market were on Monday, I would gladly purchase three giant sunflowers for my work desk, for $2! Boyfriends, take note if you're looking for weekend date bouquets. \n\n- Fresh vegetables and herbs. Sweet corn, tomatoes, potatoes, blueberries, raspberries, eggplant, squash, cabbage, lettuce, bok choy, cantaloupe -- you name it, it's there, and for CHEAP. I am definitely buying a $1 cabbage the next time I am there. I also can't believe I got a plastic shopping bag worth of fresh basil for $2! Mmmm...time for me to make some caprese salad! \n\n- Inept bamboo caretakers, you need GreenGreen, the bamboo fertilizer. You can purchase them here for a $1 per bottle, as well as bamboo plants, in case you've really killed your plants. \n\nOther stuff to check out include the Amish booth that sells fantastic cashew brittle, blueberry pies and strawberry angel food cakes. You can also buy oatmeal soaps, fresh jams and preserves, honey and chocolate from other vendors. \n\nI think I've convinced you. Yes.",
                "author": "Lesley A."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-06-15",
                "description": "What I've got to say is this:\n\n*Shitake mushrooms\n*Fresh asparagus\n*Baby garlic\n*Two loaves artisan bread\n*5-year cheddar\n*Raw milk cheese\n\nTwenty bucks.",
                "author": "Ellen M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-09-06",
                "description": "Civil rights rallys and organic honey, this place is sweet *pun pun pun* tough crowds to navigate around, but that's hardly a problem with so much delicious and fresh food around you.",
                "author": "Amit T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2006-10-03",
                "description": "This is my favorite farmer's market in the city, and I'm super bummed that it's over for the season.  (Though I am a fan of Halloween Village, which will be set up shortly.)  There's nothing better than sneaking out of the office and strolling around here on a beautiful summer afternoon.\n\nI know most people go to farmer's markets for the produce, but I am not most people.  I go for the baked goods.  And oh my god, are there some amazing baked goods here.  My favorite booth is Misericordia's Hearts & Flour bakery.  Not only are their chocolate chip cookies (and brownies and lemon loaf and pumpkin bread) AMAZING, but the money earned goes to such a fabulous cause that you don't even feel guilty about consuming a million calories.  \n\nAlliance and Bleeding Heart bakeries have booths as well.  I'm kind of meh about both (I've written a separate review for Bleeding Heart if you're interested), but at least you're able to check out them out without making a separate trip.\n\nAlso present are La Briola (love the pretzel bread and the foccacia!), Rise N' Roll (a fine Amish bakery with great muffins and nut brittles) and some Polish bakery whose name is escaping me at the moment (I never tried their stuff, but I did eye their pineapple upside-down cake and butter cookies on quite a few occasions..... maybe next year).\n\nThe booth for Kress Apiary has part of a beehive behind glass, so you can watch hundreds of bees crawling around and vomiting pollen..... I mean, making honey.  It's fascinating and gross all at the same time, and I'm compelled to check it out every week.\n\nThere are several vendors selling flowers, which are an incredible value here.  You can buy a HUGE, colorful, beautiful bouquet of wildflowers for about $5 or so.  Which means that if you're a guy and you work nearby, you have no excuse for not bringing your wife or girlfriend flowers at least once during the summer.\n\nAnd of course, there's all the booths for fresh fruit and vegetables.  (I did buy cherries a couple of times this year, and they were perfect every single time.)  And a couple for cheese and fresh meats and jellies and all that other stuff you can buy at a farmer's market.  If only someone would set up a sandwich booth, they'd make a killing during lunch time.\n\nNow I'm stuck waiting for next summer.",
                "author": "Christiana S."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-07-13",
                "description": "I am a huge fan of farmers markets. I love love love the produce and flowers they sell here!! On my last visit I bought two HUGE zucchini squash for 50 cents each. They were mutant HUGE. Then I bought a bouquet of lilies which made a great centerpiece on my kitchen island. Lasted over a week and made my condo smell so fragrant. I bargained with the guy and got the flowers for $5. (He said not to tell anyone, so dont tell him I told you). I love a good deal. Of course we went later in the day when they were closing so I was able to pull a William Shatner (the negotiator).",
                "author": "Janet E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-12-20",
                "description": "Made a quick stop here on our way to catch our plane home. Being Christmastime I was told by some locals I had to make it a point to see the big Christmas tree and sample some homemade goodies. It was enjoyable. The homemade ornaments and gingerbread and handmade toys were exquisite. As a tourist though, I have to say it was a little expensive overall. We had an hour or so to stay. Parking was 20 bucks, a cookie was 7 and some children's mittens for 15. And the tree wasn't very big this year. Maybe my friends were referring to another one nearby. I don't know. But I'm glad we stopped.",
                "author": "Deborah G."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2006-07-10",
                "description": "I was curious to find out what was happening here in front of Daley Plaza. After reading reviews from Andrea & Elizabeth few weeks back, I decide to venture out to this place during my lunch hour last thursday because they are closed when I get off.  I liked most of things I saw, bought some strawberries.  I'm use to dipping them in sugar and eating them ever since my mom introduced it to me since I was a little kid.  I guess my mom used sugar to get me to start eating fruit, it sure did work!  So every time I eat a strawberry, I have to dip it in sugar.  Well, I didn't have any sugar at work so I decided to wait until I got home.  \r\nGuess what..  oh man, I never got so many compliments from my coworkers.\r\n\r\n\"George, where did you get these?\"\r\n\"George, thanks for the strawberries, very delicious\"\r\n\"George, you checked out the farmers market? how nice\"\r\n\"George, only girls go to farmers market.. but thanks for the strawberries\"\r\n\r\numm... all my strawberries were gone :(   I had two little pieces with no sugar.  I'll definitely go back again for more strawberries but smarter to hide it from my coworkers.",
                "author": "George K."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-05-18",
                "description": "I love it!!!\n\nGreat produce, herbs, veggies, flowers, cheese and baked goods.\n\nGreat central location.",
                "author": "Mei J."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2008-06-17",
                "description": "Strawberries, asparagus, cookies, herbs, strawberries, asparagus, strawberries, homemade salsa, asparagus...this place has everything.  Also, strawberries and asparagus.\n\nHow European.  If we could only successfully adopt their siestas and red light districts, we'd be set.  I bought some fancy dips but I haven't decided what to actually dip into them yet.  The options are limitless as far as I'm concerned.  There's sour cream involved - I will eat it off of ANYTHING.\n\nAnd 3 peonies for $5?  Marry me.",
                "author": "Wayne C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-09-03",
                "description": "Two words: Monster Cookies.\n\n(Check out the Rise 'n Roll bakery stand)",
                "author": "Heather K."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2008-06-13",
                "description": "I am not playing the spoiler, but I must compare this venue with others in the area for fresh fruit and vegetables - if you can patronize the markets outside the downtown area ....  \n\nI bought strawberries this week and while they looked great, they are tasteless.  Same for the tomatoes, pithy and tasteless.  I've tried the  rhubarb .. I grew it in my native PA and it is easy to grow and harvest so that's no contest.  The corn is good, not great. \n \nGreen City Market, Logan Square's and the Lincoln Park school market on Armitage are all superior and no more expensive.\n\nFor those who desire authentic croissants and European pastry, a bakery like Vanille on Clybourn - the best French goods in the city by far - is the place to go.  I haven't found a farmer's market that offers high quality Eurpean pastry - well, why would they? Farmers don't produce pastry! Ha!  LaBriola bread products are quite good.\n\nI agree that these downtown markets are a welcome oasis for sunning, browsing, and prepared foods.  That's my two cents.",
                "author": "Darkling S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2006-08-18",
                "description": "I have no idea why I haven't been to this farmer's market before!  I went for the first time yesterday and was so pleasantly surprised that I had to run and find an ATM machine to buy all the fresh produce.  I didn't have nearly enough time on my lunch break to do the market justice but this was my final take-home:\n\nfresh picked green beans\nripe grape tomatoes\nGruyere cheese \nsmoked mozzarella\nhorseradish cheddar\nsugar-free blueberry jam\nbouquet of sunflowers\n1 pot of rosemary\n1 pot of cilantro\n1 pot of peppermint\n\nAll of this for $30!!!  The bouquet of sunflowers was only $1... where else can you buy beautiful flowers at that price in the city???  It was kind of a pain hauling my booty back to my apartment on the bus during rush hour but definitely worth it.  My only complaint is that SOMEONE should be selling sandwiches for those of us who have to visit on our lunch breaks.  What a killing they would make!  All in all, this is a great way to get the fresh produce we should all be enjoying.  I will definitely be going to this farmers market every Thursday until the end of the season and you should too!",
                "author": "Hannah B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-06-17",
                "description": "What could be better than a Farmer's Market in the middle of the war zone I call the Daley Center! After coming out of heated court calls and dealing with mostly nasty people day in and day out in the courtrooms, Thursday Farmers Markets are really a de-stresser!\n\nThey have the yummiest cheeses and freshest pastries and beautiful flowers! Must go there! You will not regret it!",
                "author": "Pamela P."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-05-27",
                "description": "One of my favorite Chicago things is when Farmers' Market (\"FM\") season begins. I usually hit up this one because it is close to work and makes for a great outing during my lunch break...especially when the weather is just calling my name to get outside. If lucky, you can snag a spot on one of the benches; eat lunch, hangout, or people watch.  It's a great place for people watching. \n\nI absolutely love getting my veggies, pastries (most of which make great afternoon snacks at work), and sometimes flowers here. I tend to browse the booths before purchasing anything. My mom laughs now when I tell her I stock up on vegetables. As a kid, I despised eating vegetables (well, I did like one or two things) and here I am buying stuff I did not like when I was young. I am a sucker for apple and pumpkin butters, and there is one stand (sorry but I cannot recall the actual name of the vendor!) which sells varieties of jellies, jams, and butters. Apple and pumpkin butters = yummy in my tummy. There is usually a deal 2 jars (jams, etc.)  for $7, I think.\n\nIt tends to get super busy during 12-2 PM, and I like to go towards the end when people are heading back to their offices (and just before FM closes). My theory does not always turn out as expected - still crowded. Oh well.  :-)",
                "author": "Mickey A."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2011-07-10",
                "description": "It's cute, it's fun, it's centrally located and a nice spot to take a break from work on a Thursday. However, let's be honest - everything is way overpriced (even higher prices than Whole Foods in some cases!) so spend your $$ wisely.",
                "author": "Anna P."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2006-06-22",
                "description": "I love the farmer's market!!  I'm so glad that it's back.  I purchased some cherries and strawberries last week and couldn't believe how flavorful they were.  I forget how yummy fresh summer fruit is.   \n\nSome of the vendors are a little overpriced, so you have to bargain shop a little.  If you go there every week, like I do, you get to know which stand to go and get the best price.",
                "author": "Amy H."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2009-08-11",
                "description": "I got here as many of the booths were starting to pack up but was still able to absorb the hustle and bustle of vendors trying to sell their wares. I visited the natural soap stand, the Misericordia's Hearts & Flour Bakery stand, then the Amish from Indiana, oh and also the Stover Farm (Michigan) stand, where I picked up some raw honey, which I have yet to taste but was excited to buy   =)\n\nThere seemed to be a diverse mix of vendors and they all seemed very enthusiastic about their products. It was a lovely stop on a picture perfect summer day.",
                "author": "Lourdes A."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2005-09-30",
                "description": "This is a pretty big market, and the only one I manage to make it to because it's not during my precious Saturday mornings. Lots of apples, cheeses, baked goods, fruit and vegetables. Don't know why I couldn't find any cider, maybe later in the season.",
                "author": "A.S. V."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-05-27",
                "description": "One of my favorite parts about summer in Chicago.  Great vegetables, baked goods, cheese, flowers, etc...  If you can come before lunch it isn't very crowded, and you can sample everything.  My favorite spots at this farmers market are the pretzel bread folks (on the Southwest corner of the plaza) and the Amish cheese and peanut brittle people.  It's delicious!  \nOnly warning--if you go after lunch a lot of good stuff will be cleared out.  Try to get there early!",
                "author": "Brenan S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-02-28",
                "description": "Although farmer's markets aren't my sort of fun, people seem to really love this thing in the Daley Plaza. It is of course free to walk around.",
                "author": "Chris H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-02-15",
                "description": "I guess long ago people were tired of fresh fruits, vegetables and flowers at outdoor markets, and the concentration, selection and novelty of the grocery store was refreshing and different.  \n\nHowever I am on the other side of that one - I am tired of the grocery store and find fresh fruits, vegetables and flowers at an outdoor market irresistible.  If anyone needs a farmer's market organization promoter, writer, etc., please get in touch.  Honestly, I can't find enough good things to say.",
                "author": "Gfiddy F."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2006-06-22",
                "description": "I went today for the first time and was pleasantly surprised at all the food items they had at the farmers market!  They had gorgeous flowers, and great looking fruits and vegetables, and although my intentions were to go and get fruit, I gravitated towards the cookies, cakes, and bakery items- I just can't stop my sweet tooth cravings.  Anyway, everything looked very fresh and although they didn't have peaches yet, I'll definitely be getting them when they do!",
                "author": "elizabeth n."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2006-08-21",
                "description": "Possibly the biggest and definitely one of the best.  Everything imaginable is here.  They have baked goods, fresh produce (veggies and fruit) flowers and usually have something to get to eat for lunch.  They also usually have a vendor that sells beef.",
                "author": "Alan R."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-07-23",
                "description": "I try to make it here every Thursday to buy produce for the weekend - it all looks and tastes so good!  I can buy huge eggplant for $1 apiece, the best cherry tomatoes I've ever had plus great fruit in season.  The jams and honey can get a little pricey but they're made locally so it's a trade-off.  \n\nIf you've got a few bucks to spare definitely come out and pick up a nice addition to your lunch or enough fruit and veggies for a weekend of grilling!",
                "author": "Jon H."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2007-06-07",
                "description": "Went to the Farmers Market today @ Daley Plaza. I was really impressed with the selection. Everything from baked goods like pies, breads, and cookies, coffee, fresh fruits and veggies to potted plants and herbs, bath salts, soaps and things for your home. I am kicking myself now because there was a lady there with organic cleaning products, one thing I picked up, I think was a spray cleaner for the kitchen ..smelled like an Orange Grove! I meant to go back but I got sidetracked. Hopefully she will be there next week. All the vendors I bought from or chatted with were friendly and helpful. We will be back next week. Also...for you parents, all of the vendors were so kid friendly. My 6 year old had a great time too!",
                "author": "Vanessa R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-05-16",
                "description": "Daley Center Farmer's Market seems like such a tradition in Chicago. There are better farmer's markets out there, but this one is like a breath of freshness is out busy city. It's a great way for the thousands of people working in the city to conveniently take a break during the day. I really enjoy alot of the jarred items that the small farms prepare. There are alot of baked goods there as well but i prefer to pick up some fresh veggies for dinner that night. Sometimes I grab fresh flowers too.",
                "author": "Rachel R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-09-14",
                "description": "I look forward to Thursdays in summer because of the Daley Center's Farmer's Market. The market includes a nice selection of fruits, vegetables, plants, and bakery. During the summer, I stock up on fresh cucumbers, zucchini, and tomatoes. The fruit sold is often Michigan apples which tends to be a little pricey; you've been forewarned. I sometimes buy the berries as well if they look good and aren't too expensive for a farmer's market price. The bakeries represented often include Misercordia and Bleeding Heart bakery. Since baked goods are one of my downfalls, I tend to avoid it, though tempting. Last summer, one of the vendors sold pickled aspargus which some of my coworkers picked up right away too. I often stop by before work to stock up because the vegetables go pretty fast and then have fresh veggies chilling in my work fridge during the day. Go early and stock up. The farmer's market is another one of those nice things that brightens the dank, dark Daley Center up once in a while.",
                "author": "Carrie S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-06-22",
                "description": "One word...strawberries!  Those large berries we get from California have nothing on the ones at this market!  I live in Palatine and, though our French Market is improving by leaps and bounds every year, I'm often not home on Saturdays.  Plus, by Saturday morning my meals are planned and the shopping done!  I like that the Daley Plaza market is on Thursdays, and that it's on my way to work.  Stop in the morning so that you get the best selection, but go at the end of the day for flowers...they tend to lower the price!",
                "author": "Danielle K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-07-23",
                "description": "the lilys at the flower stand will last you over a week and the guy is super nice. any of the ones on the ground are fragrant ones and the ones on the table are not.  the tomatoes are always killer--one guy located in the middle has heirloom and will give you a sample if you're uncertain. there is a bagel stand that is phenomenal. the bagels will literally change your life. the everything ones in particular are highly recommended. i'd stick to bulldog or bleeding heart bakery at this market for baked goods. theirs are really good. the others that i've tried (usually have a corner spot) are for a great cause, but really dry and flavorless. this market tends to be better than the one on tuesdays just south on dearborn. *forgot to add that the amish goods are not surprisingly amazing.",
                "author": "erika s."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2005-12-14",
                "description": "Love this farmers market! They have a great selection and everyting is soo fresh!! I save so much money when I get my produce and other food here because it's soo much cheaper!",
                "author": "Julia B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-08-05",
                "description": "Great deal on local produce.  Everything is better quality and it is the same or less expensive than getting it in the store.  And you get to buy it from the people that helped grow it.  It is also really convenient if you work by the loop to stop in before work or at lunch.",
                "author": "Sarah C."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Daley Plaza Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "50 W Washington St",
        "postalCode": "60602",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/SZJIWuwBw6B2ErvpDaTvIg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}