{
    "aggregateRating": {
        "reviewCount": 7,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-05-30",
            "description": "My favorite Farmer's Market!\n\nAmazing vendors - Baetje Farms (superb goat cheese), Salume Beddu, Whisk (their popsicles are both interesting/refreshing/delish), Double Star Farm, MO Grass Fed Beef, Companion....etc. \n\nFood Trucks! - A big fat Holy Crepe or I love love love The Big Cheese - making grilled sandies utilizing all the local ingredients, found at the market - how perfect is that?!\n\nFree Yoga! - It's at 9 a.m., and the instructor is f-ing hilarious.\n\nThis place is just full of activities - yogis, foodies, kiddies, and in summer, usually some live music and/or a wedding happening at Piper Palm House. \n\nBest in St. Louis! -  says the yogi who loves fresh foods (is there any other way to get tomatoes and lettuces?)",
            "author": "Sal E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-25",
            "description": "This review is about the Tower Grove Farmer's Market.\n\nThis really is a nice experience. If you go early, it's not too crowded, but after 11 it gets really squished. My first week, I brought home delicious homemade granola, honey, duck eggs and sweet potatoes. One of my favorite trucks, Lulu's, was there with breakfast fare. The Retrailer, which sells awesome organic homemade loose leaf tea, was there. They also have free yoga and qi gong. There's meat vendors and I scoped out a place to buy goat There were fresh flowers, handmade wares and plenty of places selling other veggies, pastries and food and drinks.\n\nDon't forget to bring plenty of cash, some of the vendors don't have credit card machines. They're open 8-12, saturdays. A nice start to any Saturday!",
            "author": "Katherine B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-13",
            "description": "Why have I not been here yet? So much good stuff in a single street block! \n\nYes, I realize that many of the same vendors that make appearances at the Tower Grove Farmers' Market are at the Downtown version during the week. So what? They're still awesome! After sampling the Baetje Farms goat cheese, I want to relocate to Bloomsdale, MO... wherever that is!\n\nThe nice thing about the Downtown market is that it's on Thursday nights, a perfect weeknight for browsing and letting off some steam before the weekend hits. I met a few gal pals down here last night, we picked out some local ingredients and made dinner at one of their lofts. It was like a mini Top Chef Challenge, since the rule was we could only make food that came from the market (minus spices and oil). \n\nWhat did we eat? Mini grass-fed beef burgers with peppered goat cheese, croistinis with sauteed onion/eggplant/tomato/garlic and  zucchini fritters. We also picked up some wine from Culinaria and it made for a perfect summer night.\n\nFor the people who say there's nothing going on Downtown after 5 pm, please check out the Farmers' Market. Just one example of how there's things to do, you just have to make the effort to do them!",
            "author": "Abby S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-10",
            "description": "What's this?  _Downtown_ Tower Grove Farmers' Market?  Why yes!  Located in the Old Post Office Plaza (on Locust between 8th and 9th), they close down Locust and have a couple dozen vendors.\n\nEvery Thursday, June - October, 4-7pm. \n\nOnly downside is that while $20 gets you like 9,000 pounds of stuff at Soulard (though a lot of it is crappy), this market is a bit more \"upscale.\"  But the veggies they had were reasonably priced from what I saw.\n\nAwesome things:\nOzark Forest Mushrooms - Black truffle butter (so good, you'll lick this like ice cream)\n\nBaetje Farms - a.k.a the goat cheese folks from Soulard Market.  Delicious!\n\nand well, here's the rest of the vendors that have or will be there:\n\nBaetje Farms\nBlack Bear Bakery\nBuilaland Family Farm\nCity Seeds\nCompanion Baking\nFarmer's Larder\nDouble Star Farms\nFreeland's Vegetable & Berry\nHinkebein Hills Farm\nIvan's Fig Farm\nKakao Chocolate\nKatiePies, Pies & Pastries \nKuva Coffee Company\nMangia Italiano\nMills Apple Farm\nMissouri Grassfed Beef\nMurray's Orchard\nOur Garden\nOzark Forest Mushrooms\nPatchwork Acres\nPrairie Grass Farms\nRinghausen Orchard\nSalume Beddu\nShow Me Fresh Farm\nSilent Oaks Farm\nThree Rivers Community Farm\nTraveling Tea with Queen's Cuisine\nYoder Produce",
            "author": "Timothy G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-13",
            "description": "This Farmer's Market is the real deal!\n\nOne thing I love about this market is that all the vendors grow the veggies or make the goods themselves.  And, they are all local.\n\nI also love the fact that they always have live music!\n\nThis one is only open on Thursdays from 4-7PM, but the people are nice.  Also, bring cash and a cotton bag or backpack.\n\nStuff I love to about it:\n1. Fresh in season Veggies - I try to get something from everyone\n2. Good meat without the hormones\n3. Fresh Bread\n4. Fresh Pasta\n5. Frozen Apple Cider Slushy - so Yummy on a hot afternoon\n6. That everything is local, local, local and homemade \n\n* And,  I am not a fan of goat cheese, but if I was, it would def be on this list.\n\nEven better is that I can ride my bike from CWE to get there!  See you at the market!",
            "author": "Charlayne A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-28",
            "description": "For the record-- the plums I bought from that cute little old farmer-man are still good this week. The ones I bought from the groc store last night? not so much.",
            "author": "Allison O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-13",
            "description": "Picked up some companion bread, fresh goat cheese made locally, great veggies, Pi Truck, overall awesome",
            "author": "Krystal L."
        }
    ],
    "priceRange": "$",
    "name": "Downtown Tower Grove Farmers’ Market",
    "address": {
        "addressLocality": "Saint Louis",
        "addressRegion": "MO",
        "streetAddress": "Old Post Office Plz",
        "postalCode": "63101",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/2if2yrcUMgYUH8EGa1Bztw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13147723889"
}