{
    "aggregateRating": {
        "reviewCount": 8,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-30",
            "description": "The farmers market never gets old. It's great to check out all the local vendors and help out individuals and families rather than giant corporations. \n\nSome weeks have a theme (e.g. dog day), so be sure to check out their Facebook page. The Bloomington PD are usually in attendance handing out stickers to kids and having a good time. One week, the market made a dish incorporating many vendors' products (Filipino Pancit) and was handing it our for free. Some vendors have free samples for you to try (shout out to Huelskoetter Farms and Joe Joe's house dressing). And there's live musician or band is usually playing in the town sqaure.\n\nSome vendors sell out early on a weekly basis, so it may be worth going early to see all the products and produce available. Plus, you're by all the small shops and stores in Downtown Bloomington (e.g. Coffee hound, Ivy Lane Bakery, Common Ground grocery, etc). Furthermore, parking is sually a breeze. You can sometimes find street parking, but there's also the parking garage that's a 2-5 minute walk to the heart of the action. \n\nThe Farmers Market is worth a visit, and may even become a weekly tradition for you and your family.",
            "author": "Clint B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-25",
            "description": "We go to this market every Saturday and are sad that this is the last outdoor market of the year. Now we will go to the coliseum once a month for amazing produce and meat!  We really enjoy the selection at this market. They offer honey, maple syrup, produce organic and non organic, baked goods, hand crafted jewelry, paintings, hand crafted pottery, organic eggs, local cheese, pork, organic chicken and beef. Homemade dog treats, live music, pasta to cook later and sauces and more!  We always stop at Kellys Bakery and Coffeehound for coffee and sometimes breakfast or lunch. Outdoor market is held on all Saturdays from May through October from 7:30-noon. Indoor is held November thru April on the 3rd Saturday 10-noon. http://downtownbloomington.org/farmers-market/\nJust another happy customer!",
            "author": "Laura W."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-08-15",
            "description": "I was looking forward to going and I was really disapointed. The streets were not even marked clearly and once you turned on the right street it was one way and there was no way out...there were not enough venders and even though there were a few hours left before it was over most venders' tables were almost empty...  the venders that were there were just not that exciting... the biggest let down was the guy doing balloon animals.. my grand daughter stood there waiting for about five minutes and then he told her he had to leave without doing her balloon... very unprofessoonal all the way around..",
            "author": "Jennifer B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-21",
            "description": "Fresh produce some of which I've never heard of, challenging me to be a more creative cook! Whenever I am out of town and miss it I cry...\n\ntips...\n1. bring your own bags of varying sizes so you can separate things in a way where you don't crush your tomatoes or eggs\n2. EGGS! If you want them, get there early. like when they open early... its totally worth it if you've never had farm eggs before. You'll never go back to store stuff.\n3. Plow Creek Bakery makes the BEST bread I've ever had. Get the multigrain but save a loaf for me :-) all organic ingredients all written on the outside of the package. Despite having no sugar in it, it has a slight sweetness you'll get addicted to.\n4. Find the pasta people! Get a back of anything that is the thin linguini noodles, they are the best. I buy at least a package or two each week, and sometimes they have a bargain bin with slightly broken noodles for cheap.\n5. I love the Prairie Earth Farms booth, which just keeps getting bigger and better and they now accept credit cards! Across from them is Cook Farm run by two brothers that look like twins... one has a shaved head the other (Dylan) has scraggly hair... love them both. They are kind and knowledgable and always introduce me to new ingredients. They are the reason I love garlic scapes, the daikon radish and kohlrabi.\n\nGoing to the Farmers Market changed my cooking in so many positive ways... I still go to the regular store for other things but I buy most if not all my produce from the market each Saturday and you should too. Support our local farmers and take better care of your health at the same time!",
            "author": "Jessica S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-05-26",
            "description": "It's still early in the season, and this was my first visit, but I am very much a fan.\n\n- You can use a credit card to buy tokens, which all vendors accept.  There is a $2 fee to do so, but the money goes to help support the farmers and the market, and it's $2 whether you buy $10 or $50.  (So get $50!  Tokens don't expire.)\n- WIC cards accepted, with no additional fee.  Badass.\n- BIG!!  Spans a good 4-5 blocks downtown, both farmers and artists.\n- Lots of doggie-watching to be done.\n- Prices are fair and farmers are friendly.\n- Local, mostly organic, know-your-farmer food!\n- Live music\n- DELICIOUS food!\n\nThis is a treasure!  I'll be back every Saturday I can.",
            "author": "Meghan B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-14",
            "description": "One of my favorite parts of living in B-N is coming to the market.  The produce is so fresh, and there are activities for everyone in the family!  $2 credit card fee if you don't bring cash.",
            "author": "Nathan D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-07-20",
            "description": "YES YES YES- really- what more is there to say.  Fresh veggies...live music...lots of artists and vendors of all sorts.  They even have a debit and credit card system now, if you don't have cash.  It's May-October.  Get there EARLY if you want any sort of fresh fruits!!!\n\nApple Ridge Produce- Keith is a rockstar, we &lt;3 him.\n\nBut our true love is Mr. Merrick.  Frank Merrick grows tomatoes like no other.  2 weeks my friends, 2 weeks and tomatoes will be in their PRIME!!",
            "author": "Kelly M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-11-13",
            "description": "Get there early if you hope to take home any vegetables at all.  The market is great, but I have been there at 10 or 11 to find literally nothing left.  I have never seen a Farmers Market that runs out of produce so quickly.  Perhaps that's just how the farmers in Central Illinois roll?",
            "author": "David C."
        }
    ],
    "priceRange": "$$",
    "name": "Downtown Bloomington Farmers’ Market",
    "address": {
        "addressLocality": "Bloomington",
        "addressRegion": "IL",
        "streetAddress": "On The Square In Downtown Bloomington",
        "postalCode": "61704",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0Tu1Yp-UYcq63euKKJaYPQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13094342295"
}