{
    "aggregateRating": {
        "reviewCount": 14,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-11-27",
            "description": "I am moving from Cedar Rapids, and you have absolutely no idea how much I am going to miss the Downtown Farmers Market. I love walking around downtown in the blocked off areas and shopping. There is such an amazing variety of things to purchase! Lawn ornaments, food, kettle corn (mmmm), jewelry, cutting boards, plants, produce, breakfast burritos, you name it.\n\nI had my favorite vendors that I always hit up, but I loved going to every shop and checking out what is new. It's a great place to take visiting friends and family, and it is friendly for all tastes of style and food. Everyone we ever took there fell in love just as much as I did. \n\nI will definitely be driving back a few weekends this summer to attend!",
            "author": "Rachel W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-13",
            "description": "I love it! The night market was fun but busy... I'm sure the next one will be more organized to handle the crowd.",
            "author": "Susan C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-03",
            "description": "First off, lets call it what it is people, it's a french market, not a farmers market.  \n\nSupposedly one of the largest 'farmers' markets in the Midwest, and I'd believe it.  At least 8 blocks of produce, meat, baked goods, jewelry, crafts, and street food vendors.  I didn't check *every* produce vendor but the ones I did notice were all from Iowa.  I wish I had a cooler big enough to bring some organic free range chickens raised in Iowa all the way home to Chicago.  \n\nIt's a pity this market is only every other weekend.  By 8:30 the streets were packed and a few vendors were running out of green beans and cherries already.   Only open till noon so get up early and wander around downtown Cedar Rapids before all the good stuff is gone!",
            "author": "Kate M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-07-29",
            "description": "This is a pretty good Farmers Market.  It's definitely the largest in the area.  They have nearly everything you could want and some of the vendors even take EBT.\n\nParking is always an issue when you have such a gigantic event.  No problem - I just ride the bicycle down there.  It's more convenient and also lets me limit the amount of things purchased.  \n\nBeing a minimalist who lives in a van (by choice), I can tell you this is a \"grazer's\" paradise!   There are lots of samples - enough for a free meal. \n\nThe only thing I really don't like is that dogs are permitted in the farmer's market.  I think this poses a health and safety concern.  It's only a matter of time until something happens - a child is bitten or there is a dog fight or I step in dog sh** ....   About a month ago I saw a large dog lean forward and lick a cucumber sitting near the edge of a table.  Gross!\n\nThe other thing that bothers me has been mentioned before:  One week the event is in the downtown area.  The other week it is much smaller and located near 8th Avenue.  I wish we could have it one way or the other.  A couple of times I've gone to the larger downtown site hoping for something only to find the smaller market was being held a few blocks away.\n\nFor the dog issue and the inconvenience of not having the market in the same place each week, I'm going to deduct two stars.  I've witnessed several incidents with dogs and don't feel comfortable with them being permitted in here.  Mark my words - it's only time till something bad happens.  If I get bitten, the owner is getting sued as well as the city for its negligence.\n\nOther than those minor little things, I think this is a decent event and am glad we have it in Cedar Rapids.  It shows what can be accomplished when we all support a great idea..",
            "author": "Bradford H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-21",
            "description": "You will ask yourself how I can write a mostly negative review of one of the best Farmer's Market around and still give it 4 stars. So I will explain.\n\nThe Downtown Farmer's Market is a outstanding venue and is one of the largest in the nation and probably in the state. I have been involved with it every since it first started both as a buyer and as a concessioner. Over the years the market has expanded to extend for many city blocks and attracts vendors from miles around.\nThe downtown market is not a true Farmer's Market in that it allows non-food vendors as well. You will see people selling everything from jewelry to candles; food sellers from local restaurants, wine, clothing, local charities, entertainers, and so on. Among all the vendors are actual produce sellers. A list of most vendors can be found on the Downtown Market website. It is a huge and fabulous Saturday event.\n\nAnd yet I prefer to skip it in favor of other Farmer's Markets which are smaller and more produce oriented for the following reasons.\n\n1. It is VERY crowded. Attendance is high (easily topping 16,000 per Saturday morning) and the jostling and shoving can be overwhelming at times. You will find a lot to purchase but you will leave exhausted.\n\n2. It has become so big that you will find it difficult to find the vendors you really want to buy from among the 220 + vendors. We are talking about 11 streets here and no printed map to guide you.\n\n3. The crowding is aggravated by carts and strollers making it difficult for challenged walkers to navigate. I recommend that seniors try the smaller markets instead.\n\n4. The organizers still have not learned to ban dog walkers. You will have to dodge leases, the infrequent dog fight, and other canine problems. Just think a minute. What would you think if you saw people walking the aisles of the local supermarket with a dog?\n\nWhat we have in the Cedar Rapids Downtown Market is a great market that has gotten a bit too big and needs to be trimmed down. I am a long-time fan of Farmer's Markets and have attended them for many years, long before the downtown market even existed, but my preference is for the smaller markets, which I visit once a week religiously. The downtown market is only an occasional thing.",
            "author": "Elias C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-02",
            "description": "A great place to spend a summer Saturday morning.  There are over 200 vendors ranging from prepared food, wine, candles, crafts and jewelry and even...produce!  The downtown farmers market attracts thousands of people (and hundreds of pets) at each event on the first and third Saturday from June to thru Sept.  Open from 7:30 to noon, you'll need to come early to get some of the most popular items.",
            "author": "Ed F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-18",
            "description": "The downtown CR farmers market is never a disappointment! Roll out of bed and start your Saturday morning right. They have plenty of options for a quick breakfast while browsing the market. I love love love the jewelry offered-picked up some of the cutest earrings for cheap! The market has quite a few wine vendors that are great. You cannot beat the prices of fruits and veggies here. Don't miss out on the live music, juggling acts, and break dancing, either!",
            "author": "Jaimie L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-06-21",
            "description": "I love, love, love the Farmer's Market in Downtown Cedar Rapids. It is ginourmous and the variety of vendors is really great. I come for the fresh produce but stay for the food vendors!! Had a chicken gyro from the Aladdin stand and it was an awesome breakfast. I looked for the famous Victor's breakfast burrito stand, but they were no where to be found. Not that there arn't a plethora of awesome vendors to choose from! Seriously, come with an appetite. You won't be dissapointed.\nI love all of the fresh flowers, the huge gardening pots and plants at ridic prices, the fresh breads, handmade jewelry, metal work, and of course the fresh produce. It gets seriously crowded though, so be prepared/patient and enjoy. Some places do accept checks and credit, but I play it safe and bring cash.\nI look forward to going every Saturday they have it!",
            "author": "Jessica W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-03-02",
            "description": "We moved here just in time to catch the last one of the summer and I must say I was blown away.  I think I had low expectations coming from California with all the farmer's markets there, but downtown Cedar Rapids farmer's market was amazing.  Meat vendors, wine vendors, so much great produce, and tons of homemade foodstuffs.  We got BBQ sauces, cupcakes, cheese....so much tastiness. I can't wait until it starts again and will definitely bring more bags next time.",
            "author": "Erin M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-04-05",
            "description": "The farmer's markets downtown are one of my favorite ways to spend a Saturday morning. You can find a wide variety of items (of course FOOD, jewelry, flowers, home items, clothing, books) and entertainment (magic shows, juggling, music, theater previews, and a junk band, children's play areas). You can really spend as much or as little money and time as you want. I only wish they would start doing it every Saturday instead of biweekly. If you haven't been yet, it is definitely worth waking up for!",
            "author": "Jennifer B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-03",
            "description": "I just got back from Mexico so it was nice to hear people speaking in English, and not see trash everywhere! It was nice to get out and walk around! Downtown Cedar Rapids is a nice and clean area with great people and great local business's! \nI picked up a few things for the homestead one of the cooler things I think that I got today was an ANT that was made of three rocks and some metal welded around it with washers as the eyes! (RS Randy Schnebbe Welding Studio) Victor, Ia. \nI also found someone to buy great tasting Lefse from! Dale Surh Free-range Chickens, Lefse and Kringla. Calmar, Ia. \nIn a word (customized word art) it's a little expensive and you could easily do it yourself but I bought a Chicago sign for $56. \nI also got some Buttermilk Banana Bread with no nuts! from Carletta's sweet things. \nI didn't think I was going to have much fun with this but I had a great time the weather was so nice the sun was shining and there was a lot of people out this is way better then going to wal-mart. \nThere's not much for entertainment but there was a kid that was break dancing for tips a guy playing a guitar, and a girl playing the saxophone for her college fund. \nThere's over 200 vendors some of them take debit and credit cards but your best bet is to just bring some cash!",
            "author": "Trevor F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-07-04",
            "description": "The 2010 Farmers market beat out DSM's market for the most vendors and activities this year. \n\nIts always packed, and great to bring the kids and big stomachs. Great artisans and food vendors. Open's your eyes to all that is local and out there that you never knew about.\n\nThere are several live music stages/areas, performance artists, cooking seminars, and much more.\n\nGreat place to come and get the fresh goodies to run home and hit the grill or kitchen to star in your own Food Network show parody.\n\nSometimes parking can be an issue, so look around or hit the parking ramps. Bring your walking shoes, as its several blocks.\n\nExcited to see if the NewBo year-round market will be going up too.\nCR also needs a Co-Op like New Pioneer, Bread Garden market, or a Whole Foods.",
            "author": "Sean W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-12-21",
            "description": "We absolutely love going to the Cedar Rapids Downtown farmers market. There is something for everyone there and the produce is very economical. This market is surprisingly large and diverse for Cedar Rapids and it is always great to see so many people out and about in downtown. If you are looking for the freshest produce and smaller crowds, make sure to get there early!",
            "author": "Malorie H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-12-30",
            "description": "A fantastic summer event in the area and outstanding compared to many farmer's markets. Around 200 vendors with a variety of products (produce, food, flowers, arts/crafts, clothing, specialty items, etc.) line multiple streets in the downtown area. The size and offering really is outstanding. Depending on the date and the weather, it can be very crowded and difficult to walk through the streets. An increasing number of dogs has also been a concern to some patrons, although typically there do not seem to be problems. Demonstrations and performances are also held in multiple places throughout, and a number of non-profits fill the park to provide information on all subjects. A must-attend event for anyone visiting the area or living nearby.",
            "author": "Tara R."
        }
    ],
    "priceRange": "$",
    "name": "Downtown Farmers Market",
    "address": {
        "addressLocality": "Cedar Rapids",
        "addressRegion": "IA",
        "streetAddress": "3rd Ave & 2nd St",
        "postalCode": "52401",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/6Ip9KNRFI4QPjXkJ1b_XdQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}