{
    "aggregateRating": {
        "reviewCount": 6,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-08",
            "description": "Eckerts is a yes I've been going to since I was born. It has ice cream and has Easter brunch is best of all and was probably most famous for is being able to pick your own fruits and vegetables. You ride on tractor in to the fields then with your little baskets and boxes you go and you find your peaches or plums or apples or carrots or strawberries or peas or what ever else you could think of. The you ride the tractor back and pay for what you picked.\nAt the cash register there is candy and Jelly made from Eckerts fruits. Oh and I forget to mention all the holiday traditions. On Halloween come and pick a pumpkin. I Easter come and have brunch with the Easter bunny! Those are just my two favorites there's tons more. If there's a nice warm day where you're bored come down to Eckerts!",
            "author": "Sofa D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-09-29",
            "description": "A classic apple picking farm with a barn, classic apple treats, cider, kettle corn, hay rides etc its very kid friendly. There's also a winery next door for something a little classy too!",
            "author": "Noga S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-24",
            "description": "I was visiting St Louis and someone reminded me of the GREAT Peaches from this place. Oh my, these were great, I am going back in 2 weeks and will make another stop. It isn't just a place for peaches, they have a nice market with other fresh vegetables, cheeses, meats and THE BAKERY.  I purchased the Blackberry loaf from the bakery and it was delicious.  A couple days later on my way back home, I stop for more, but they were sold out. I have tried the Apple Butter and it was very good as well.  You can spend several hours here as they have you pick farm, ice cream shop, garden center and restaurant. In my Arnold voice... I WILL BE BACK",
            "author": "Thom C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-26",
            "description": "I love this little farm market! It's so conveniently located for me. They have all of the wonderful fresh produce that the Eckerts farms have plus their homemade breads, jams, pies and other items. They keep the store clean, well stocked and looking tidy. There are always plenty of employees stocking items and checking people out. I really appreciate the convenience of this store. \n\nIf I had one complaint, it would be that the store should be open into the fall and stocked apples, pumpkins, corn and other fall only produce.",
            "author": "Alison N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-04",
            "description": "I always look forward to this place opening in the Spring/Summer. It's open seasonally and THE BEST place to get amazing locally grown peaches. Eckert's is SO good, and if you don't live in Illinois, this is a great alternative. They have a lot of local items here, including lots of produce, salad dressings, chips, bakery items (pies, muffins, coffee cakes etc) sauces, baking mixes, candy, salsas and other canned items. I like the mixes and the produce is always good. The peaches you pay for, but I have yet to find better tasting ones in St. Louis except off the tree in their orchard. The store is small and you can't find things like milk or well known brands but there are some very interesting items. I highly suggest to stop by, grab some peaches, and see what other cool items they have!",
            "author": "Sarah S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-05",
            "description": "As with the previous poster, I also look forward to when the Eckert's opens it's St.Louis market and sells all of it's fresh fruits,veggies and baked good to all of us over the river. I, myself, don't mind going over to Belleville but sometimes it's hard to do so when you don't have much time to do it! I am a fan of their coffee cakes (they are THE best!!!!) as well as the peaches and apples. They have alot of fruits and veggies as well for sale along with salsas, apple butter and some various sodas. Last year and this year they have started to sell cheeses and meats as well (all of which are excellent, btw). I'm a fan, and I usually eagerly await for the shop to open because it's awesome to have some local places to get produce when it's fresh and in season!",
            "author": "Meg M."
        }
    ],
    "priceRange": "$$",
    "name": "Eckert’s St. Louis Farm Market",
    "address": {
        "addressLocality": "St Louis",
        "addressRegion": "MO",
        "streetAddress": "11520 Gravois Rd",
        "postalCode": "63126",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/eGMHMUgeUiO2O6lZ1UiH6g/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13148497903"
}