{
    "aggregateRating": {
        "reviewCount": 20,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-08-19",
            "description": "Great local vendors that sell items, such as fresh fruits and vegetables, baked goods, and handmade items. A few of the vendors that I have visited were Edge of Sweatness (local bake shop) ; Eternal Harmony; Edgewater Candles, and Empanadas Argentinas, which has a variety of empanadas, and they are reasonably priced.\n\nThe event itself is Saturday's; rain or shine; June - October, and located in the Broadway Armory Parking lot; not too far from CTA Thorndale, and not too crowded of an event. As for commuting, i recommended catching the train, but if you wish to drive there is neighborhood parking; as well as a slim selection of metered street parking.",
            "author": "Thomas G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-06-25",
            "description": "This Saturday morning market is a great addition to the neighborhood! It's not as large as the Lincoln Square market, but there are two farm stands, and each offers a wide variety of high quality seasonal produce at great prices. There's also a cheese monger and one or two bakery stands, plus Amazing Kale Burger, which, if you haven't tried it yet, is hearty and delicious! There's a bank right across the street if you need to visit the ATM. I just wish there was someone selling flowers!",
            "author": "Emily R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-10-08",
            "description": "I'm a fan. it's not flashy or fancy, it's understated, but it has everything you need -- two great produce stands with a wide selection of seasonal veggies and fruits, a FANTASTIC cheese stand, and a smattering of pastry (Kate's cookies is almost always there, and then there's a random cupcake person, or a brownie person). I've never sampled the kale burger but folks seem to like it. What I love about this market is that it's unpretentious, friendly, and affordable.",
            "author": "Jennifer N."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-10-21",
            "description": "A somewhat limited selection but what they have is excellent.  The stand I like comes from Southwestern Michigan, great selection of fresh organic apples, peanut cashew or almond butter, honey, cider, at reasonable prices.  Although the limited number of vendors makes this place not quite worth coming out of your way for, add in lunch at the nearby Ethio Diamond, a stop at the Ethiopian grocer across the street for some excellent coffee beans and injera, or maybe a lunch at Daks Korean restaurant, and voila, it is worth going a little out of your way for.",
            "author": "Rohan D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-30",
            "description": "It's close to my place. The cheese guy is pretty great there. But the compliments end there. Even just a couple booths more and I would be a bigger fan. Or add a booth with some bread and another with some eggs and meat and I could piece together a meal here.",
            "author": "Charlie B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-06",
            "description": "New and improved!!! or something like that.\n\nIt's blowing away the competition (A-ville market), the prices are better and the selection is vast. They also carry plant-able herbs, breads, cookies, snacks, live music (provided by Old Town School of Folk Music), and taro chips (which are my favorite). I'm pretty much coming here every Saturday morning now. $20.00 got me more then a weeks worth of produce and a few snacks.\n\nFYI, no soap sold here!! And there is one stand that is still expensive, look around before you purchase.",
            "author": "Nick M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-15",
            "description": "This farmers market is not that big, but it doesn't mean it can't still be good! They have all of your usual basics: Fresh fruits and veggies, flowers, pastries, jams, bread, and cheese. They have some AMAZING cheese curds here. A friend of mine recommended them and she was right. Squeak so good. Some vendors take credit cards, others do not. They are open on Saturday mornings.",
            "author": "Danielle S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-11",
            "description": "OK, It's not big. I'll give you that. But it has all the basics. Fresh fruits and vegetables at a much more reasonable price than Evanston or  Andersonville. So, if you want it to stick around or even get larger, support local! The Hispanic guy in the corner stall is very friendly and always treats me well and his tomatoes are the bomb!",
            "author": "Casimer T."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-09-19",
            "description": "I used to regularly walk to this market and had some stands that I purchased from.  I have become disenchanted.  They sell tomatoes by weight.  WEIGHT.  The Andersonville farmers market offers a much better selection and deal.\n\nI paid 4.50 for 2 tomatoes last weekend and they were not very good.  \n$4.50 .  \n\nI can spend a bit more at the Andersonville market and get 8-10 additional tomatoes classified as seconds (the 2 I bought were just as bruised).  For 3 dollars more, I can get at least 4 additional in perfect condition.  \n\nI strongly feel that this market is overpriced.\n\n\nIf you have to have fresh tomatoes NOT from the grocery store (I find myself in this predicament - OFTEN), this market is here.  Just be prepared to pay overly much for the products.  The merchants ARE friendly.  It can be crowded.  Maybe some day it will grow into a real competitor in the farmers market stakes here in the city.  For now, to me, it serves as a convenient stop when I have missed the others.",
            "author": "Danielle C."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-09-23",
            "description": "Tiny.  I didn't do an exact count, but the two times I went by, it looked like only 7 or so vendors.  If you live within walking distance, it might be nice to stop by.  Otherwise, it's not at all worth going out of your way for.",
            "author": "Angela T."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2007-07-23",
            "description": "Pretty small, just a few stands....but definitely worth a stop if you live in the neighborhood. \n\nGot a big, overflowing heap of luscious blueberries for $4. And then 3/$1 Cukes, Bell Peppers and Zucchini. Everything was pretty fresh, and definitely a good deal...also have some booths with massage, soaps, etc. Very community-based. \n\nNot bad, very friendly...right by True Nature Foods, on Norwood. Ample street/meter parking.",
            "author": "Colleen C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-14",
            "description": "Buying local doesn't get any better. Personable service along with fresh fruits and vegetables. I cannot wait to see what the season will bring us.",
            "author": "Joanna F."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-09-22",
            "description": "I'm not sure which word best describes this farmer's market: sad or pathetic. I think it's a tie.",
            "author": "Chitown D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2008-06-28",
            "description": "I completely agree with Colleen C. - this is worth a stop if you live nearby. I rode my bike a couple miles to get here and after seeing how small it was thought, well at least I got some exercise on the way here...\n\nEverything they had looked fresh. I'm guessing there will be more produce later on in the season. \n\nI will keep this farmer's market in mind but will venture to others.",
            "author": "Eliza M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-05-16",
            "description": "Great standby if you live in the area.  As others have noted, this market is small, but kept us happy with fresh produce, from farms usually no further away than SW Michigan, for a very decent price.  Very good selection, too, for such a small market.  Especially, you know, in late summer and early fall.\n\nSome breads and fresh pasta, too.  Pricey if you know how to make your own, but my tastebuds agree that they'd be worth the splurge.\n\nConnected to True Nature, which is a great stop as well.  \n\nI only wish their season was longer.  I think I just saw that they don't start until July 4 this year?  What about my spring veggies?  \n\nStill, very glad Edgewater has this little institution.  And glad to have lived so close these past few years!",
            "author": "Meghan B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-02-23",
            "description": "i love having a farmer's market in our neighborhood !\n\nthanks paula of true nature !",
            "author": "James H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-10-26",
            "description": "Love this event, always come home with a happy tummy, and a few extra purchases to share with the family. My fave.....Jeanette's Patisserie booth! DE-LISH organic baked goods...come on, who doesn't love Sangria scones or German chocolate brownies? ;)",
            "author": "M M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-06-25",
            "description": "I was excited to visit this market since I live nearby, but it was disappointing. The market was tiny, with just three produce stalls, only one of which was run by a farm - the rest are just produce vendors selling the same stuff you can buy at a grocery store. There was a bakery or two, a cheese-monger, and a couple people selling sauces and things. If you're like me and go to farmer's markets to buy fresh, seasonal produce directly from the growers, look elsewhere.",
            "author": "Abby F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-06-17",
            "description": "we lived a block away from this market for about 4 years. my  wife and i would look forward to waking up on saturday and walking over and picking up fresh veggies for the week. The name of the main farm that has the largest stand there escapes me but the 2 ppl that work it are super nice. There was always a great selection of green leafy's, peppers, tomatoes, basil, corn, cucumbers, etc. of the other tables there are choices of fresh fruit and artisan bread. it is one of the few things I will miss about our old neighborhood.",
            "author": "jason s."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-04-08",
            "description": "This market is wonderful! From late June to October, we go every week. The main farmer has a large assortment of vegetables and some fruit. We usually end up buying lots of green and red bell peppers, broccoli, carrots, cauliflower, lettuce, hot peppers (they have like 5 different types!), watermelon, cantaloupe, onions, green onions, and much more. Of course some of the items change throughout the season but a lot of the items they actually have the whole season (like bell peppers). And...everything is ORGANIC! They are not officially certified but say they would not farm any other way. Also, the prices are really good compared to other markets I have been to like Green City Market. You can usually get 3 green peppers for $2.00. Cheaper than Dominick's and it's organic and local. \n\nThere are also some other stands. There is another farmer that has some more specialty organic greens and veges. Then toward the end of the season there is an apple farmer with delicious organic apples and apple cider. True Nature also has a stand with some items they get from a local farmer. \n\nDefinitely worth the stop - you will not be disappointed!",
            "author": "Hannah S."
        }
    ],
    "priceRange": "$$",
    "name": "Edgewater Farmer’s Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "5917 N Broadway\nBroadway Armory Parking lot",
        "postalCode": "60660",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9rmduY2MHAVkbOC9_7n0xw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17735616000"
}