{
    "aggregateRating": {
        "reviewCount": 125,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-12-18",
            "description": "Best Orchard to pick from!  If you are looking for a ton of things to do outside apple picking, this is not the place for you--and that is what I love about this place.  Free to get in and you are not bombarded with extras like other orchards so this place is def easier on the wallet than most other orchards.  \n\nThey put out a list of which apples will be available for picking so def check that out if you are looking for a particular type of apple. \n\nYou can purchase a basket or bring yours from home at no charge other than the flat fee for the basket which is approximately $36.  You take a wagon to the area for picking and pick your apples and then hop back on to the next area.  You can always grab another wagon if you want to go back to the main area.  \n\nThere are some ponies to ride and a free playground for the kids.  There is food so you can have lunch and the best is the baked potato tent!  The store have everything, but most importantly, their apple cider donuts!  Their raspberry salsa is to die for!  It's cash/check only so be aware of that, but they do have an ATM on site.\n\nThis is def a must-go if you are looking for a good family orchard without all the extras!",
            "author": "Jillian F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-10-24",
            "description": "Best apple pie ever! Best apples in the orchard, so delicious! Awesome little shop with all kinds of goodies to buy. I bought some corn salsa that is to die for and a candle that rocks my world lol! \n\nBad things, the petting zoo is a couple of goats. Very underwhelming. When we were apple picking the honey crisp area was picked over. It was kinda gross, a lot of damaged apples do it was hard to find good ones. \n\nOverall I loved it because I had a great time with my family.",
            "author": "Alexandra J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-09",
            "description": "I live in California. It's been a long time since I've been to Edward's Apple Orchard, but every visit was great. I crave those cider doughnuts every fall. I really hope the orchard starts shipping them nationally. I've had cider doughnuts from other places, but none were as good as theirs. \n\n\"Sadly we cannot ship donuts, cider, or apples, we don't like that once as they are out of our hands we don't know in what shape they'll arrive.\" - Edward's Apple Orchard FAQ page\n\nTo the business: Plenty of businesses successfully ship doughnuts with them arriving in good condition, and I bet you would make a pretty penny off of shipping yours. Would you reconsider your no-shipping policy?\n\nEnd the Californian good doughnut drought.",
            "author": "Caley P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-05-16",
            "description": "Had the best time at this apple orchard! we came on one of the last weekends left for the seasons for Apple picking and left very happy as this was my first time apple picking. I remember the bucket cost us like $40 so it's a little pricey but the apples were absolutely delicious and I would like to make this an annual thing with my kids. I will just try to come a few weekends before as the apples weren't as plentiful by the time we were there and there were a lot of bugs around which may or may not be a good thing. I hope they don't spray as many pesticides but I understand why they do as we wouldn't be able to eat perfect looking apples otherwise. We picked a bunch of Red and Granny Smith and even a few pink ladies, we really found a good selection of all. \n\nAlso the apple cider donuts are no joke and seriously some of the best I ever had as well as the apple pie, wow, you really need to get that. Their little shop of all things apples is also adorable and I wish it wasn't as crowded so we would have spent more time there but seriously this is one of my go to favorite fall activities from now on! We will come back with the whole family next year since we had a blast!",
            "author": "Elina S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-01",
            "description": "It's very family oriented. \n The smells in the air is like desserts of all kinds. It's very nice to be here. They have some of the cutest things to do. And some things for grownups to do as well. \n Some of the smells are tooo much like a farm. Whew. But it's always nice to see the children's eyes light up with the farm animals. \nThey are very vivacious and not laying and malnourished. \n They have a variety of things to see and do. I would have never know this place existed. \nIt's very open. \n I think it's pretty awesome. \nI will definitely return. \nI do recommend. \n\nScore as follows:\nQuality: excellent 5\nCleanliness: above average 4\nLocation: average 3\nPrices: average 3\nCustomer service: excellent 5\n\n20 out of 25= 4stars",
            "author": "Latara M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-02",
            "description": "We come from Wisconsin with our family - we would drive from Florida if we had to. It's worth it EVERY year! We grab a bag of donuts fresh out of the fryer and walk around eating those sweet, crunchy fluffs from heaven. We love browsing all of the other food goodies and home goods. This year they even have super soft shirts and hoodies. They provide an awesome, cleanly array of samples. They are well staffed and incredibly friendly and organized. We didn't have to wait in a single line this morning. After making our purchases, we tried to walk off at least one donut petting the animals and going through the maze. Can't wait to get home and dig in to some dips and salsas!",
            "author": "Meghan P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-13",
            "description": "This is my first time at Edwards Orchard that Donuts was super delicious. I would say the donuts are hot and fresh old. The line might look long and deceiving but it actually went pretty fast and the staff was super friendly. They even brought a basket to me when they saw that I was carrying so many things. They even have samples in their store on the second floor of the main Barn. This place is kind of far and kind of in the middle of nowhere. I've been to the different types of it or apple orchards this is a little bit smaller than a typical ones that I would see closer to the city of Chicago but it was still a must-see. My only complaint is that a lot of parts of it was muddy. I got my shoes dirty but I guess that's kind of expected when you go to places like this. There are donkey rides but there's only a 70 pound limit so I was kind of bummed out about that. There was a maze but is full of mud. I wish the petting zoo was a little bit larger there was only turkeys chickens and goats. I wish there was more animals next time maybe a little bit more than just goats.",
            "author": "Benz O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2019-01-20",
            "description": "You must go here if you're in the area! Best and most fresh apples I've ever had in my life. Hot apple cider is to die for, and apple cider doughnuts are SO good! Can't wait to pick our own apples next year!",
            "author": "Gina H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-10-15",
            "description": "We went to sample their wonderful items and all samples are put away at 3:30. Why so early , they are open another 2 1/2 hours. They close at 6:00 PM. \nFor out of town visitors they need better signs leading to the location.",
            "author": "Jim L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-10",
            "description": "We went on Sunday Oct 8, 2017, 80 degree weather by 10am! Very beautiful. My baby and hubby first time so wanted to give them the full experience. Planned trip so already knew what to expect and how much $ we were spending. It was more for the experience. \n\nArrived around 9:15am, still ample parking. We parked across the street since we planned on going to the pumpkin patch and berry picking last. \n\nTook our pictures by the sign and got our donuts first ($10.09 for a dozen donuts). No lines, nice and smooth. Went to the playground for a bit then made our way to the orchard. Was going to ride ponies but my baby was too small for it, will have to wait till next year ($5 by the way)\n\nTractor ride was fun. Got a whole truck to ourselves. There was 6 of us and a baby hehe. The price was $43 for a basket ($3 deposit if u want to return the basket, we kept ours). I believe it's required for every 6 ppl. Got about 70 apples in it hehe. \n\nAfter picking apples, we went and grabbed a snack. Six apple pies with ice cream ($26 and some change). The girl took my order wrong and only wrote down 6 ice cream  so I had to re-order and paid the difference. How annoying but was not so busy so it was ok. Lines started forming after we got our snacks. It was around 11am. \n\nAfter that we went to the pumpkin patch and berry picking field. Pumpkins were $4 and $8 (only two prices) depending on the size. Berry carton was $3.50 each. \n\nWe were done by noon. It was great. The line to get into the parking lot was literally a mile long when we left. So glad we went early (we are early birds anyways hehe )",
            "author": "Evelyn T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-16",
            "description": "This was my first time visiting Edwards Apple Orchard, or any apple orchard for that matter.  It was adorable.  Parking was easy, I could have spend all day browsing through the store and eating donuts.  My only complaint is that they didn't take credit cards for food, and they didn't have an magnets, which I like to collect whenever I go on vacation.  (I was visiting from LA).",
            "author": "Lynn L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-18",
            "description": "This is my favorite Fall memory and place to go for apple cider, cider donuts, cheese curds, and fresh apples. Love all of the signs and items for sale. It's not the same quaint family orchard it once was, but they have adapted well to their growth. I hope to visit before the season is over.",
            "author": "Amy S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-24",
            "description": "I love the atmosphere of the orchard. There are plenty of things to do from picking your own apples, berries, or pumpkins to the animal barn to getting some great food. Fun for all ages. I would recommend going through the week rather than the weekend.",
            "author": "Shannon J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-31",
            "description": "We love going to Edwards Apple Orchard in Poplar Grove. Their barn is filled with all kinds of goodies, treasures, food mixes, samples of jellies, salsas, salad dressings, snacks, fresh apples, cheeses, you could spend hours in there! There's books, children's toys/clothing, pet supplies, fresh fudge, home decor! So much to see! They have a photo opportunities, children's play area, pet viewing area, goat feeding area, corn maze. Another barn with old time farm tractors and implements, apple & berry picking. Sometimes live music! Also a little cafe where you can get barbecue, hotdogs, apple pie, Mac n cheese, apple cider, etc. Literally something for all ages. Pony rides, wagon rides! Picnic area seating. Favorite part are the warm apple cider donuts, freshly made there! They are warm and crispy on the outside...I never wait to eat them. I wander around the barn eating them right out of the bag because they just aren't the same later! They are still tasty, but you don't get the crispness from the freshly fried cinnamon sugar coated donut! Get a dozen! You'll be glad you did, next day, zap them for 10 seconds. Perfect fall activity for all generations!",
            "author": "Pat M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-09-24",
            "description": "Yes the cider donuts are fabulous. The barn, the music  everything else is a family favorite but the baskets for apple picking have gotten smaller and price is $48.00 a basket. Seems like if you have over a certain number in your group you are told you have to do minimum of two baskets! We were in line to pay for our baskets and i overheard the gentleman next in line say to the register guy\"What, 48 dollars for a basket?\" The guy taking the money replied.\"Tell you what, i will make you a special deal.\" Hey we werent offered a deal! Guess we should have also voiced shock. Next time will do that. That really bothered me.",
            "author": "Debra F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-06",
            "description": "You pick raspberries for just $3.50 a pint. \nNot sure on the price for you pick apples as it was to early in the season but we did buy a bag of appled at their store for about $8\n\nThe dozen apple cider donuts were $10. They were freshly made and very good\n\nThey also sell apple pie slices with ice cream for about $4\n\nNo fee for the kids activities. This place is hugh with plenty of parking. \n\nThey also sell food which looked pretty good. They have plenty of picnic tables to sit down and eat. \n\nGive it a try you will enjoy this place with the kids.",
            "author": "B B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-20",
            "description": "FYI! Cash only and gets very crowded in the afternoon hours! Go early. \n\nThis is a place I usually go yearly. It's hit or miss with the apples. 2015 being the best year to date. It's $40 to pick plus$3 for the actual bushel. You can save the bushel for years. I just have yet to actually do this. Saw some decorated for first time, must for next year.  \n\nCall ahead for apple picking since it changes week to week. Oh yeah the donuts. Do it!",
            "author": "Kim M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-31",
            "description": "If you are accustomed to the no-frills aspect to apple-picking (and unfortunately, there aren't many of those around anymore) then consider Edwards to be the Disneyland of apple picking. \n\nYou get the charm of taking a tractor ride to the apples orchard to do your picking and back at the grounds is a plethora of activities. \nThere's the play area for kids--pirate ship, play houses, play train, tractors to play on. \nThere's the country store--where you can purchase fudge, jams, chips, snacks, dip mixes, cake mixes, any kind of \"treat\" that can be considered country cute.  There's also pre-picked apples and a small array of cheeses. \nThere's the small café that offers fresh apple pie.  There's the bigger café where you can get a meal. The area is huge, well-laid out and totally country cute. Like I said--the Disneyland of apple picking. \n\nI did like the doughnuts (although my favorite apple cider doughnuts is still Harvest Time). The slice of pie was warm and perfect a la mode. I did buy some pre-picked apples and some snacks too.  Although I think the prices are a little higher than what we pay for apple picking--but you gotta pay for the upkeep.  Every person working here that I spoke to was super nice and helpful.\n\nThere was a nice crowd, but it's early in the season...I can see how this place can get packed easily.  So if you are one that needs all the distractions when you go apple picking, this place is for you. This scene is definitely not for me, but I do appreciate what they have available and see that it can be a fun trip.  \n\nCash is king! but they do have ATM's located in the stores in case you don't have enough green.",
            "author": "Aimee M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-08",
            "description": "Edwards is the classic Apple Orchard. A beautiful setting, rural with sweeping views of the countryside in all the fall colors. They have many different types of apples for purchase or pick your own, the Autumn Beauty is one of our favorites. The cider donuts are to die for, warm with just the right amount of cinnamon and sugar, a taste of fall in every bite. Eat lunch in the Apple Barn,  the pulled pork is delicious and finished off with homemade apple pie and ice cream is a treat.  Shopping in their store is a feast for the senses from jams to fudge to all kinds of sauces and all can be sampled too. They even have beautiful home goods too. Also a great play area for the kids and tractor rides....too much to post it all. A great family tradition, be sure to have your picture taken under the arbor with the year above.",
            "author": "Kim C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-10-10",
            "description": "I believe that reviews should provide some sort of useful information to the reader, so I hope that after you finish reading this review, you'll think *wow, great tips man!*.\n\nThe first time I went to Edwards Apple Orchard was when I was about 8 years old. They were some great times, and for some perspective, that was about 15 years ago. And not too much has changed. This past weekend, October of 2016, was the last time I went and here is my advice.\n\n#1. If you show up after noon, you will wait in a MILE LONG line to park. Ho-lyyy Crap. Luckily, we got there early this year at around 10:30 am and everything was fine. We parked quickly, got on the tractor quickly, everything was great. When we left at around 1:30, the line of cars trying to get in was over 1 mile long. I kid you not. Do not show up after noon, you will be waiting hours just to get in.\n\n#2. It is 40$ to apple pick here, and then another 3$ for the apple basket (if you bring your own, you avoid the 3$ charge, but if your basket is smaller than the ones they give you for 3$, you still pay 40$ to apple pick and get less apples, you understand?). If you come here with your girlfriend or husband or best friend, it's still 40$. It's 40$ to apple pick regardless of how many people you have. If you have over 6 people, it's 80$. This isnt some small farm where you pay for what take. You pay 40$.\n\n#3. This place has the best apple cider donuts. Of course, all apple cider donuts at apple picking places taste great. But the ones here just taste better. They just do.\n\n#4. The lunch here is expensive. So maybe eat before you come here. They also dont like when people bring food from outside, so you gotta figure it out. Keep in mind what I said before about arriving late though...\n\n#5. They have pick your own pumpkins here as well. Flat cost of 8$ per pumpkin. Most places don't do this anymore so have fun!\n\nEither way, enjoy! It's a great place. Kind of pricey, so come with your family. And dont come late.",
            "author": "Kevin M."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-10-13",
                "description": "*** CASH ONLY ***\n\nStill great, and a fun day for a wander around with a helpful staff who always seems cheery despite the large crowds. \n\nPeople watching is amazing as well, big slice of Americana. \n\n$40.00 a basket of apples, big gift shop all sorts of things including their famous warm doughnuts, plenty of other delicious foods choices as well. \n\n*** CASH ONLY ***",
                "author": "Tim S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-09-20",
                "description": "This is place so awesome!\nWe had a very memorable and amazing time today on a Sunday.\nWe arrived at noon. There was a lot of people there already. So, I thought \"oh no, the lines\" all of that is a bit energy drained. Well guess what?!?! All the lines move very fast! No matter how long they are, they move fast.  We did the apple picking. For that, you go all the way to the end and wait for a ride. It's past the pony ride. We got a bit lost lol. 40 dollars and 3 dollars for the basket rental or you get to take it. We took it! It's cute. Even though it seems so expensive, when we got home we counted 76apples and we got to choose frome three different bushels. Some where huge and other apples small. The whole experience was just unforgettable. \nAfter apple picking, we went for food. The food was so delicious! It tasted so fresh. Specially the donuts. They have three locations for food plus the store where you can get dozens of donuts to go plus all sorts other goodies.\nBasically we fell in love with this place. Even though its about an hour and half to get there from Oak Park, it's so worth it.",
                "author": "Maricela A."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2017-10-08",
                "description": "It's very good we've gone every year. The donuts are good and the food is good and cheap. However for the Apple picking every year they only have the cheap ones (golden delicious) and it's $40 a bucket. If they had anything else it's be good",
                "author": "Aidan L."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2017-09-24",
                "description": "We have been coming to Edwards for years.  It is a great place and very manageable  for kids . We arrived on a Sunday at 9am and left around noon. $40 for a basket of apples (not bad for honey crisps). Their Gala apples and Pixie Crisp apples were delicious! The warm cinnamon donuts were good and the store is packed with tasty dips and treats. The place is cash only. We spent about $100 on the day.",
                "author": "Mary R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-10-01",
                "description": "Initially was very resistant to driving over an hour, to the middle of nowhere. I was pleasantly surprised with how nice, clean, and organized the orchard was. Get there early, gets very busy. Lots to do for kids, and a very nice store with good quality products, not \"crap fair\" aka craft fair quality. Great apples, good donuts, and overall a great time! Will return for sure.\n\nThe negatives, while limited I want to point out. I have twin 5mo babies, and we brought a stroller to push them around the Apple orchard rows, but were told when we got there that there were no strollers allowed. Bring a carrier so you can wear your baby, or babies. Wish I knew ahead of time. Also, they drive you to the rows which you can pick from, which there were 2 available when we went. Got plenty of apples, but kind of wished we could have wandered around more like other orchards allow.",
                "author": "Jon B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-09-23",
                "description": "We love this place, we only go on a week day. Wife does some \"looking\" upstairs then we head down for lunch, check out the baby goats and buy some doughnuts and maybe some apples. Makes for a great afternoon.",
                "author": "K C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-08-31",
                "description": "Every year I wait for this place to open up. Love it love it. Apple pie with ice cream. Phenomenal. The apple cider donuts. Great flavor. Always a melt in your mouth. Ambient is great. Love the smell. Very homy, and of course it gives a very Autumn feeling. Great place for kids to come and play, great place for family fun. \nThey don't just offer apple pies and what not. They also offer hot dogs, BBQ pulled pork sandwiches, and around September/October, a local church comes and does baked potatoes; which I believe it's delicious. Over all. It's been my favorite place to go to since I was a kid, and it has became a family tradition to go during the Autumn season. Highly reccomend if you are a tourist, or just haven't been here, COME. you'll love the place. with items they used back in the olden days, and the little shop (well not so little anymore) that's is located on top of the eatery.",
                "author": "Sebastian R G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-10-11",
                "description": "Amazing place! First time there and our kids loved it! It's specially designed for toddlers I think, and there's also a cute petting zoo but other than that not much to do for older kids. \nWill def come back next year, awesome food cider and atmosphere!",
                "author": "Hannia C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-09-22",
                "description": "These apple cider donuts are worth the hour and half drive from Milwaukee. Crispy on the outside, I'm digging into the dozen of donuts we bought as I type this.\nRecommendation: get here early, it gets busy quickly! And bring cash, because they don't take plastic.",
                "author": "Kari B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-10-16",
                "description": "Really appreciated all the spot on feedback here on yelp.  Great place.  Free entrance, affordable attractions, clean facilities,  and ambiance non commercial.  The only tough part was that they don't take debit/ credit.  I must of missed this on the other yelpers.  I would definitely go back again.  I wish I could have tried the donuts.  I hear they are to die for.  Unfortunately, my girls have celiac and I didn't want to upset them by indulging on one.",
                "author": "K W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-10-12",
                "description": "Spent the day there with my 5 year old granddaughter and daughter and never even picked an apple!! They were picking golden delicious which weren't are fave but there is so much else to entertain all ages!\nEat, play, zoo, dance, wagon rides, maze, pony rides, bell ringing, eating, pumpkin patch and our favorite-berry picking!\nWe spent hours searching for raspberries, blackberries and the perfect pumpkins!  \nWorth the hour drive but getting there when it opens is the best plan of attack!\nCASH ONLY.- NO CREDIT CARDS",
                "author": "Em B."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2016-10-10",
                "description": "I was hesitant to review hoping my family was the only group that received shameful treatment by the staff, but after losing sleep over it and reading many reviews, it is clear that is not the case. \n\nThat staff was unnecessarily rude to my family and was completely unwilling to accommodate our mid-sized group. While the rules are clearly posted and understood, the staff continued to treat us like nothing more than a commodity. My extended family drove from many hours away to enjoy a nice day together, but the staff had absolutely no care or consideration.  One employee even went as far as to stalk our group because he was empowered to do so and made childish comments when we collectively decided to get our money back and forgo apple picking.  I have never been treated so inhumanely in my life. \n\nI proceeded to speak with the owner who too was passive aggressive. His perceived racism and support of his staffs behavior was quite frankly shocking. He made it very clear that the discontent and treatment of my family were of little concern to him because they service \"15,000 other visitors each day anyway.\" \n\nAlthough the grounds provide for a lot of fun activities, especially for the little kids who loved the day, there are too many other options for picking apples and pumpkins to visit a place that cares more about profit than customer experience.  I personally had come from the city planning on purchasing many fresh goods, but after our experience, could not support the farm. \n\nNeedless to say, we will probably never go back and would not encourage others to either.",
                "author": "Caitlin H."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2016-10-09",
                "description": "Poor quality apples. 1-2 varieties only. Red delicious we're inedible. Super expensive and very aggressive staff. Staff shame and blame visitors in the orchard accusing them of \"stealing apples\" and causing scenes in front of other visitors- throwing away visitors' apples. Derogatory towards city visitors with statements such as \"you wouldnt do this at Walgreens.\"",
                "author": "Doukessa L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-10-19",
                "description": "Do you like Apples!? How do you like these apples!? I got a number....OF APPLES!!!! \n\nI have actually never been apple picking a day in my life. I have always wanted to go. We finally made a plan to go w/some friends but didn't know where exactly we were heading. All I knew was we had it on the calendar for today & when that reminder popped up earlier this week, I immediately got on Yelp & started my research . There are many options of places to go within an hour or 2 of home. My mom and I chatted about where I should look & suddenly, I found a place in Poplar Grove. 40+ reviews and 4-1/2 stars...sold!!!\n\nWe hopped in the car & off we went. An adventure in Illinois; a trip through small towns; a stroll through an orchard...this is what our day would bring. I recently found out some not-so-great news & what this has done for me has been very positive in many ways because I'm really soaking up my life & the people in it. What kind of memories did you make today? Mine were priceless. \n\nEdwards is a lot larger than I expected. They certainly have a great set up here: beautiful country surroundings, a picturesque apple orchard and plenty of stuff to do for the whole family. I learned today that 30 is not too old to ride in a wagon pulled by horses. Hell, you're never too old!\n\nThe people that work here are awesome! The energy and vibe of this whole place was excellent. Everyone was so friendly and helpful. I don't think I saw one person without a smile on their face the entire day. The wagon ride was fun because you got to see the whole orchard. It wasn't very long but very fun nonetheless. I even pet the horses after our ride. \n\nApple picking is at the East end of the FREE parking lot. You pay at the small shed, grab your bushel & hitch a ride on the tractor. They had both Golden & Red Delicious apples today. First we were dropped to pick the goldens. Take as long as you need to pick because there are constantly tractors coming around to pick you up. The orchard was packed w/apples. I had never seen so many apples on a tree before. It was amazing. We got some gorgeous photos & really made some memories while snacking on apples right there in the orchard. The goldens where def my favorite of the day. They practically melted in your mouth. They were so fresh, there is not even a word for it. The red delicious were also fantastic and I'm telling you, I can't wait to bake something apple-y! \n\nThe store here was never-endingly fantastic. They had everything from specialty candy to jams to fall décor and this is where we found the fudge.  You can pick up some holiday gifts here and they are my kind of gifts...edible!!! They have samples throughout the store and let me tell you that this stuff sells itself. For example, we sampled a strawberry pepper jam that was mixed w/cream cheese...oh yeah; I immediately picked up a jar! My hubs found some summer sausage and I found the fresh cheese curds. You can also sample some apples in case you didn't make it to the orchard; they had different varieties in here. \n\nThere is a food area w/things like hot dogs, but we wanted to find a restaurant elsewhere, so we skipped the food here. We found a small maze made up of wire fencing & let me tell you, it was difficult! First time I was in a maze, too! Next to the maze, we stumbled upon some adorable Billy goats!\n\nYou can pick your own pumpkins or you can simply purchase already picked pumpkins. We stopped somewhere else on the way out to Edwards so I didn't look at pricing but everything was very reasonable here, so I feel confident saying the pumpkins probably are reasonably priced, too. Today was also the last day for raspberry picking & due to some rain at the end of our trip here, we skipped the raspberries. We'll have to check them out next year.  There is lots of parking, again, it's FREE so in case you are trying to cram your whole group in a car too small, don't hesitate to bring the extra vehicle. You'll also need the space to load up your amazing apples. \n\nBreakdown of pricing I found important:\n-BRING CASH or Check. No credit cards accepted here!!!\n-Entrance/Parking: FREE\n-Wagon ride: $4 pp\n-Apple picking: $40 per bushel + $3 deposit for bushel. 1 bushel min. for groups up to 6 (I believe); 7+ people: 2 bushel min. Tip: bring your own bags & return the bushel if you want to get your $3 back. We kept ours, it was too cute not to, plus we came unprepared to transfer the apples from the bushel to bags. \n-HOT Apple cider: $1.50\n-FRESH Cider donuts $.75 Tip: the donuts in the café below the shop were fresher than the donuts sold upstairs. However, they do not sell the donuts in the café to-go. Note to self: bring a Tupperware for next time and load up downstairs.\n-Fudge: $6.99 per half pound.\n\nWe decided today that we're making this an annual event. Edwards was a great find and I cannot wait to return next season. \n\nLife is short...pick the apples.",
                "author": "Catherine P."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-11-28",
                "description": "I fly in from CA to visit my friends and family and this is the PERFECT place to haul back souvenirs. My friend tries to get enough peanut butter to last her the year, I've just discovered their pretzel graham crackers and caramel corn nuggets which are ridiculously delicious. We always make sure to get a slice of warm apple pie and a scoop of their delightful vanilla ice-cream.",
                "author": "Tiffany L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-10-06",
                "description": "Did someone say, \"Apples?\"\n\nMy teenage years were spent every fall at this family apple orchard. The original barn and parts of the property were destroyed by a tornado several years ago. Despite this act of God, the family rebuilt and continued the family business that all have grown to love generation after generation. You'll see remnants of the storm's aftermath hung in the interior of the new barn extension.  Mother Nature doesn't mess my friends. \n\nNo one can come close to an apple cider donut like this place. All kids activities are\nfree, unlike the Apple Holler. Grab some apple pie and ice cream in the cafe underneath the barn, tour the farm equipment museum, or take a ride in the horse and wagon ride. The kids have plenty to do with a small petting zoo, straw jumping barn, and corn maze. \n\nIf you're a lover of orchards be sure to add this one to your list of \"musts.\"",
                "author": "Chris F."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-12-09",
                "description": "My first ever trip to an apple orchard/pumpkin patch.  I went thinking \"this really isn't my type of thing...\"  But I left with the realization that I should've done this much sooner.\n\nWe arrived at around 10:30am on a Sunday morning.  Parking was easy to find.  \n\nThere was something for everyone to enjoy.  A kids play area complete with petting zoo and tractors to climb on.  There's a restaurant.  There's an area to shop for everything from candles to sweet corn salsa to scarves.  And best of all there's ample seating for anyone who may need it.  \n\nThis is a CASH ONLY establishment. But t you won't have to pay an entrance fee.\n\nHere are my my try/buy suggestions:\nApple donuts(sold both fresh and ready to freeze)\nApple Cider\nApples(duh) you can try before you buy\nCorn nuggets(it's like puffed corn covered in caramel and its highly addictive)\nFresh ground peanut butter(my 1st taste and now I can't live without so I make my own)\n\nPLUS there's plenty of samples to go around!",
                "author": "Amber S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-09-17",
                "description": "Edward's Apple Orchard has meant family fun for me since I was a little kid. It truly is a remarkable place to go and spend some time with the people you love. Everything from the abundance of parking, to the new and improved ordering line, to the big red jug seats, to the maze...just...everything. Edwards is perfect.\n\nI've long since moved away from the Rockford/Poplar Grove area, but every trip home I get my first impulse is to go to the Apple Orchard. They've got an amazing play area for kids, accompanied by a decent little petting zoo with the cutest baby goats I've ever seen (I haven't seen many). The walking maze is as fun as ever no matter how old you are, and they always seem to be adding another model building or tractor to the play area. I'm serious, this place is a dream land to kids. \n\nThe donuts and cider haven't changed as the decades roll on, and I hope they never do. I only recently started exploring their other options (like pie), and unsurprisingly I was not let down. \n\nThe shop has expanded exponentially and is a great place to kill a little time out of the sun. Lots of little trinkets and sauces, candies and drinks to buy. \n\nEverything about this place is good memories waiting to be made. I can't wait to go back.",
                "author": "Zach O."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2013-09-23",
                "description": "Visiting this place has been a family tradition since I was a tot! I came here last weekend with my family. Granted it was a lovely day, the place was extremely packed to where it was uncomfortable. Lines to get their delicious apple cider donuts, apple pie, and baked potatoes too over an hour each! There was way too many people and not enough places to sit.\n\nIt took us 30 minutes to park, and exit lanes were blocked. Someone definitely needs to manage the parking better.\n\nMy recommendation would be to add more order and efficiency to everything here. This is why Ive started to dread coming here because I know I will be greeted with chaos and long long wait times.\n\nIf I am in the mood for their donuts, I drive to their west side location and avoid all of the fuss.",
                "author": "Somchai S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-09-14",
                "description": "This place is great!! Friendly staff. Warm, cozy atmosphere where you can shop everything from fruit salsas to Apple butters to cider donuts. Good prices and with every turn comes a new sample to try!  Just a note..they do not take debit/credit cards but have ATMS onsite.",
                "author": "Deb W."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-10-13",
                "description": "An absolutely pleasant experience. A quality gem in the far western 'burbs.\n\nPossibly the best apple cider donuts I've ever had. Served warm with a perfect blend of exterior 'crust', soft chewy inside and sprinkled with cinnamon and sugar.\n\nCharming barn shopping with an excellent assortment of jams, dips and snacks available for purchase to take home.\n\nFriendly staff ready to help, along with the local police on site to patrol traffic and pedestrian crossings.\n\nWill be back!!!",
                "author": "Jason S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-08-26",
                "description": "Best apple orchard ever...awesome experience in apple picking with my family. The apple cider and donuts are yummy along with the popcorn nuts....very addictive. We love going apple picking at Edwards every year.",
                "author": "Claire G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-09-25",
                "description": "Edwards has been a staple in our fall family tradition for years. Theres much more to do than just apple picking. Apple donuts are the best,  fresh apple cider,  apple pie,  baked potatoes.  Very nice barn store with all sorts of items from home decor,  food items,  clothing. The kids love the pony rides,  animals,  and the play area,  and maze. It's awesome to see the kids sharing the same memories I did.  A short video of our visit this year. https://youtu.be/pMTt0pGtTG4",
                "author": "Chris T."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2016-10-01",
                "description": "As with most families in the area surrounding Edwards, we have visited many years. However, this fall season was quite disappointing, as many apples had lackluster flavor. It also seems that every year we come, price increases as customer service and bucket size decreases!! I just wished that the employees Mr. Edward employed were half as customer oriented as he is. Even as the orchard is, it is still an excellent and family friendly orchard for all shapes and sizes. Make sure you try the donuts!",
                "author": "Austin O."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-06-10",
                "description": "This place is gorgeous and amazing. Best apple orchard I've ever been to. Opening day is the second best day of the year, only second to Christmas. The apple cider donuts are so yummy, as is the fudge and all of the delicious foods they sell. We love that they have lots of samples so we can taste test things before buying. We've bought many things we never would have otherwise because we got to try before we buy. The food, the gift shop, the whole atmosphere... perfection. The only downside is how expensive some items are. It's an apple orchard, and we rarely buy apples because of the price. The highest price of any orchard I've been to. Still, it's my favorite orchard and it doesn't stop us from enjoying everything else they have to offer.",
                "author": "Ann S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-10-12",
                "description": "Delicious apples for picking - but $40/basket has gotten a little ridiculous! Still delicious pie, ice cream, cider, and of course the donuts!! It gets so crowded on the weekends! The baked potato is worth the wait. Great time for the family, just come with a lot of money and patience.",
                "author": "Katrina S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-12-04",
                "description": "Cash or check only, NO Credit Cards\n\nThe BEST apple cider donuts ever.  I love going there. I go there at least 5 times during the season.  It is free to get in and my son loves playing in their play area.  On the weekends it is PACKED full of people.  The food is great and the atmosphere is awesome.  The big red barn has tons of crafts and dips.  Love this place.",
                "author": "Melissa D."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-10-11",
                "description": "Edwards Orchard was amazing.Ive been to several orchards in my life ,and by far this one rocked. So much to choose from.Apples,fudge, donuts, cider and much more.Not to mention the wonderful women I went with.We are family & friends who have love for one another thru thick and thin.Very grateful for this experience. Fun times...",
                "author": "Michele K."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-11-11",
                "description": "I've been going here since I was a child. Love the inside and shop where you can find fudge and yummy donuts. Only thing is they didn't have out the variety of samples of all the dips etc. I still bought my fair share. A little pricey but always a fun spot to visit each Fall.",
                "author": "Kristy A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-04-02",
                "description": "We love it... so will you :)  The official start of fall (end of August [Macintosh apples third week of August]) annual family event is at Edwards Apple Orchard.  When we're not able to come my in-laws purchase their frozen [best ever] apple donuts and bring it to us!  You can heat them up in the oven and it tastes so good and brings home memories back. \n\nThis place was rebuilt after the horrible tornado that came through here.  It is a family Event that you can enjoy for a few hours even when it's crowded it's always nice.  The staff is always friendly and there is plenty of parking and it never feels shoulder to shoulder (like in the city).\n\nThey have a really cool gift shop.  They sell home made fudge, fresh apples or you can pick apples from the orchard, there are barns, arts and crafts, pony rides for the kids, small country style outdoors play area for with tractors, slides, trains; there's a eatery downstairs with hot (or cold) apple cider, apple pie, hot apple donuts",
                "author": "Bruno S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-10-04",
                "description": "It's that time of year, again. Force your boyfriend to go apple picking season. \n\nMy girlfriend always spends all of her money buying her version of \"fall crack,\" the Autumn Nuggets. \n\nThe jerkey was pretty good, Cider Donuts (duh) and all the weird things you can buy make it seem like you left with something after leaving all your money in their care. \n\nThe baked potato tent is the first and most important stop. It really sets the tone. \n\nNever pass on an opportunity to feed a goat, either.",
                "author": "Austin W."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-01-16",
                "description": "Edwards Apple Orchard East is a great place to pick apples, take kids to play, shop, and eat delish food!  The best apple pie with ice cream I have ever had. Awesome apple cider donuts & apple cider hot & cold!!  Great place to go during the fall!",
                "author": "Ashley A."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-10-11",
                "description": "This is a fall must! Even though I've moved away from Rockford, I still come back every year for the cider donuts, spiced hot cider, animals and apple picking! love this place, forever!!",
                "author": "Mandy S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-10-14",
                "description": "OMG, OMG, OMG...\nI have been coming here for years...actually, close to 20 years. This place is heaven on Earth. The grounds consist of an apple orchard (duh), shopping, animals, restaurants, and a pumpkin patch. The shopping includes everything from honey, to apple cider, to gloves, to candles, to decorative signs, to stuffed animals, and everything in between. Just make sure to watch prices because it does get extremely pricey. \nThis place has been a part of my life for two decades and on my last trip, I got to bring my husband. I am now starting my own family and I am so excited to keep Edwards Apple Orchard as part of a family tradition!",
                "author": "Chloe O."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-03-08",
                "description": "I can't believe I haven't reviewed Edwards yet but I Love this place! There is soo much to do like apple and raspberry picking, pony rides, big playground with pirate ships to play on and tractor tires to climb on, a petting zoo, and a great grill for lunch. The store inside is great and we never leave without spending at least $100. \n\nApple picking can get expensive here because you have to pick an entire basket full. You can go with up to 6 people so the average per person is only a little higher than a grocery store, plus you get a fun tractor ride to the trees. \n\nMake sure you get a couple freshly baked donuts and cider when you arrive and grab a dozen when you leave. On really busy days they limit the amount of donuts you can buy. During the weekdays, this place is pretty empty but that's because not all of the extra activites are open.",
                "author": "Lindsey G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-10-24",
                "description": "This place is what an orchard should be!  Quaint, cute & charming.  Loved it.  \n\nMet up with friends via the Metra.  The closest stop is Harvard, so plan accordingly.  It worked out perfectly, a quick drive to Poplar Grove and we were off picking apples.\n\nDo you know how good it felt to step outside and breathe really fresh air and not see cement/buildings/filth?  The trip was worth it just for that.  As a resident of the city of Chicago, I felt like I had been transported to another part of the world.  Edwards Apple Orchard is my new \"Calgon take me away\" moment.  (Please tell me you remember those commercials.)  \n\nMy friends and I picked a huge basket of apples ($36).  Pricey?  Maybe.  But I've never picked apples off of a tree before.  They were also very good.  Crisp and flavorful, as all get-out.  This is what apples *should* taste like!\n\nThe pumpkin patch was a little picked over, but we went during the 2nd wknd of Oct, so if you're looking for the perfect pumpkin, go earlier in the month. \n\nAnd now, for the crowning glory--the apple spiced doughnuts.  Served warm and rolled in cinnamon sugar.  My mouth is watering!!!!   I washed it down with hot cider.  And then went back in line for apple pie with cheese.  A la mode.   Don't knock it till you try it.   The line went fast and the counter gals were swift and total dolls. \n\nDon't overlook the doodads and thingy dingys in the gift shop.  Overpriced---yeah.  But why not splurge a little bit?  They even pack up doughnuts for you to take home!  You drove all the way out here, or in our case sat on the Metra for 90+ minutes.  I believe they were cash only, so bring the dollah bills.",
                "author": "Caroline M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-09-05",
                "description": "Chris and I spent a nostalgic drive to the place she and her family came regularly during her youth. Mary Jo was the last parent and Chris had been talking about a place I have never been. We took the back roads from Elkhorn WI and arrived in the middle of no where to me. Well be prepared when you come on a weekend as you will experience a humanity of cultures and colors. Crowded with kids, grandparents and young marrieds, only enhanced my experience. Great apples and donuts with shelves of memories that Chris just had to take home VIA my Franklin plus a few more Yankee bucks. There was a local group playing on a hay wagon stage that overlooked a picnic area. Petting zoo in one of the many buildings with great staff at every turn to help in any way. Hot dogs and pork sandwiches will help balance the fudge and Carmel corn with the apples to keep the kids going. Bring your best smile as they have an alter back drop with the year, to capture to moment. Very clean and well organized; go during the week if you don't like crowds, but for me that is the best part.",
                "author": "Michael E."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-08-24",
                "description": "I absolutely love going here every year. I always have to leave with their apple cider donuts and their apple butter. Both phenomenal!",
                "author": "Taylor L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-11-02",
                "description": "If you love apples this is the place to go.   Once you get out of the car you can smell the Apple Cider Donuts.   They are so good!    Anything else you want apple?   They have it.  Staff very friendly and helpful.",
                "author": "Darren E."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2015-09-15",
                "description": "pull all of the samples early to wash the dishes arrived at 410 they are open until six this is part of the reason I go not to sound cheap but I have 3 boys that wera also disappointed huge wasp nest in play area donuts still good but definitely a let down",
                "author": "C S."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-03-03",
                "description": "Always a family favorite. We have been here twice, last year we did not attend due to the no-picking drought season. We ilke to go apple picking and typically spend $30 on one barrel of apples, one down side is you don't get to pick the kind of apple, they do, you typically get a choice of two-three kinds for picking. Regardless, we enjoy every moment and there are ample amounts for everyone to go around. \n\nDid I mention the doughnuts??? OMG, the best and the apple cider is just a must with the doughnut. FYI it is very hard to get a seat in the dinning area, you are waiting most of the time. They have a large children outdoor play/park area with great props. The store on the inside is nice to browse but extensively overpriced items lurking everywhere. They typically have a band, blue grass like music playing for the festivities that gives the atmosphere a nice touch. They also have small pony rides that are for primarily children 50lbs and under, I seen a poor heavy set child denied a ride. Parking is free and the best time to go is during the week when everyone else is gone. \n\nWe always enjoy our experience here, it has a welcoming atmosphere and has been around for many years due to the great experiences. This is a family must fall tradition.",
                "author": "Rita A."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2016-10-10",
                "description": "I have gone to Edwards Orchards for more than 10 Years and have taken many friends with me, we have always had a blast. The Apple doughnuts, hot/cold cider, pulled pork sandwiches (my personal favorite) are all very good and there's no experience like Edwards but I don't think I'll be going back because the prices have become too high for me and my family of four. Three cups of cider is $6.00, a dozen doughnuts $10, 1 gallon of cider $10 and Apple butter (another favorite) $5. I take the trip once a year and try to buy a little extra to last a while. Couldn't do that this year and doubt I'll be able to go back next near. One of my favorite places may have priced me out. Notice I didn't include any Apples.",
                "author": "Timothy S."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2014-09-21",
                "description": "This place is very well organized but overpriced. \n\nThe staff was friendly and it had plenty of free parking. The prices are high, or at least from what I remember from other \"you pick orchards\", $40 per basket and it's a mandatory basket per group of six (and children count towards the six) but the wagon ride was fun and the apples were delicious and they also have raspberry and blueberry groves you can pick too.  The berries are about $4 per pint, which is ok. The store has a lot of great products at decent prices but the winners are definitely the donuts and the caramel corn nuggets. We went on Sunday and it was super packed so if you can go during the week, the experience will probably be a lot better. \n\nI gave it two stars because of the price and because it was very over-crowded but it was our first visit and our last.",
                "author": "Monik H."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2016-10-13",
                "description": "Visited with friends who vow to not return. This place cages baby animals in small pens for visitors to enjoy. All animals appear relatively content, except for one severely depressed and sickly looking calf. \"Where is his mommy and his friends?\" the children ask with concern. The calf is unable to exercise at all. Manure everywhere, including on the calf. Very sad situation that this organization should answer for.",
                "author": "Michelle W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-09-26",
                "description": "Family fun, and who doesn't love an orchard in fall?  There's a ton of things to do for every age.",
                "author": "Michelle D."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-11-03",
                "description": "I hadn't been to Edward's since the tornado and rebuild of the property, but, boy, was I impressed.\n\nThey built a new animal enclosure, moved the bathrooms to a more central area (though I don't know how many more stalls they added, because the women's line was a long as usual on a sunny day), revamped the barn and shopping area, which are now more open and the line for doughnuts is much more sensible and easy to understand, and redid the cellar to look AMAZING. I always liked the cellar but it was a little cramped for me. The new design and open feel made me want to plan a little wedding ceremony for someone down there, that gorgeous.\n\nFor the first time, I took a look at the cool stuff they had in the barn museum/granary, and was pretty fascinated. Definitely worth a gander.\n\nMy only tip: Go on a rainy day. Drizzling, but not a down pour. I go to see farm animals, eat a doughnut (or three), buy some apples and more doughnuts and I'm ready to go, and all of these are still possible on a rainy day since they are all in barns. As long as you don't miss the crowds of people, live music and wagon rides, this is the type of day to go on. They even have people walking you to your car from the store with an umbrella so you don't get wet- adorable.",
                "author": "Kristen O."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-09-20",
                "description": "This is a great place to check out in the Fall season for delicious donuts, fudge, and of course apples.  I was slightly disappointed that they did not have any pumpkins for sale.  The barn offered a variety of home goods and lots of call favorite foods.  I wish they would also have Apple cider slushies.  Also it is important to know they only accept cash or checks, but have no fear ATMs are available.",
                "author": "Benjamin B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-10-17",
                "description": "Perfect place to spend a Fall Day!  So much to see and do for all ages.  From the grandparents in our group to the kids... Everyone had a great time!",
                "author": "Traci M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-10-13",
                "description": "Lots of family fun here! I went with a friend for apple-picking and found a cute shop with fresh apples and other edibles, a museum, an area with animals, a pony ride, and a small restaurant. Everyone was very friendly and helpful too.",
                "author": "Amanda O."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2015-10-25",
                "description": "Not happy that I sent a message and called- but nobody from Edwards bothered to get back to me.",
                "author": "Susan D."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-09-10",
                "description": "Best place ever! The donuts are delicious and fresh. And the potatoes are so good! It's such a great place to go to. They have apple picking, pony rides, a play area for children and so many other great things.",
                "author": "Stephanie A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-10-09",
                "description": "My family and I drove from Chicago to this apple orchard. We had an absolute great time! I don't know what the apples are normally like but we were pretty satisfied. Everything was impeccably organized. We didn't have to wait much of a line for anything and the place was packed. Loved the donuts and cider too. I would return again.",
                "author": "Jazmin B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-10-09",
                "description": "I can't believe how much I love this place. Its hands down the best apple orchard I've ever been to. It has it all..fun... Gifts... Food....great environment. Take ur Family!",
                "author": "Carolina B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-10-02",
                "description": "I've been coming here for 5 years. This year I arrived at 10am on a Sunday! By the time we left there were lines everywhere! Mobs of people and cars as far as the eye can see! Go early!!!! You enjoy it so much more when your early and there are less people. \nApple picking changed: Now you prepay for a basket around $35 or something...for 1 basket. Must have  1 basket per 6 people the minimum. ( cant remember exact terms and conditons on baskets & price etc ) That kind of sucked I liked it when you got a basket and filled it as much or as little as you wanted. Oh well. And we only picked one kind of apple and the pickens were so slim :( \nBut the doughnuts were just as amazing!\nFun times but I dont think i will be back until I have kids...or something.",
                "author": "Georgina C."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2016-10-03",
                "description": "We had a very unpleasant experience there Saturday.  it's  not worth going. They only allowed us picking up red delicious and some small golden delicious. They screamed at us and at our kids when try to pick one McIntosh apple from a tree . We explain to them that they just want a few McIntosh apples because we really like them  The workers from the orchard  were rude with us, a guy followed us the whole time to make sure we are just taking apples from the appropriate trees. When I question his beaver and told that we feel weird with him following is, he told us to take out business to a different orchard of we don't like it . Very disappointing, !!!!. This was supposed to be a family memory to share...sadly . Definitely yesterday was the last memory we will share with! You have to change the policy , respect people and stop been very greedy with such as high $prices",
                "author": "Ella A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-08-24",
                "description": "Edwards is my favorite place to visit in the fall. Go pick some apples, take a horse-drawn wagon ride, grab a doughnut, and grab some fall goodies inside the main barn! Just remember to bring cash or checks with you! I can't wait to go in a few weeks once the weather is perfect for a visit!",
                "author": "Kara O."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2012-09-23",
                "description": "The cider doughnuts are always good when warm....\nwe went today, we bought 2 dozen, they must be using a new production process, let's see...\npreload 6 in the bottom of the bags and when you want them to think all of the doughnuts are fresh, in the bag and they become cold... place 6 hot fresh on the top....\nmaybe no one will figure it out! WRONG. This is not a great practice @ $9.00 a dozen.\nThanks.",
                "author": "Peter D."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2012-09-03",
                "description": "As someone who grew up in a rural area with apple trees in their yard, the quaint charm of the place is pretty lost on me. And like everything touristy, of course there's a giant gift shop...\n\nThanks to the crazy extreme weather this year, you couldn't go out and pick apples if you wanted to--your options were bags of apples ranging from $9-$11 for what was probably a dozen apples. Going by the tags on the crates, not even sure all of those apples actually came from the orchard.\n\nBut the food was solid. I don't think you can beat getting a freshly fried apple cider doughnut for a buck. Hot, crispy (both from being fried and from the crunchy nuggets of sugar it was rolled in), and a surprisingly light and tender center considering this is essentially a cake doughnut. If I lived closer, I'd probably go out there just to gorge on a few of those every year. But wouldn't buy any to take home--I'm sure you can't replicate the awesomeness with pre-made leftovers. The pulled pork sandwich was also surprisingly good. Generously portioned, easy on the cloyingly sweet sauce, and the pork itself had a great smoky flavor. Good stuff.",
                "author": "D. C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-08-10",
                "description": "This is an awesome place to visit our family has been going here for years. We all love the fresh donuts",
                "author": "Rocio T."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-04-28",
                "description": "Amazing donuts, apple cider and best pulled pork I've had North of I-64. Will definitely be returning each fall with the family",
                "author": "Meg N."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-08-29",
                "description": "This place was so much fun. \n\nA friend and I went and had such a great fall day. We had hot apple cider, split a snack and just enjoyed the weather, the attractions and the Orchards itself. \n\nLike most orchards it is a little $$ but I feel like it is worth it to support local growth and such a fun experience.",
                "author": "Sara B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-09-14",
                "description": "Fun place to go in the fall.  Place has grown over the years.  Were hit hard by a tornado about 8 years ago.  Since then, the place has added and added.  Now there is a band playing-so it may be descending into touristy schmultz.  It you do go, take cash or the old fashioned checkbook.  No credit cards accepted.  Which is a bit absurd in 2014.",
                "author": "W S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-08-11",
                "description": "I LOVE THIS PLACE! I have been to ALLL the local orchards.  This is BY FAR the best one. It has the same as the others.. DELICIOUS Apple Cider Donuts, apple cider, apple pie..a cool store to browse.. but with this place.. YOU GET APPLES... a whole bushel full!  Some other places charge you $18 for a 1/2 peck of apples (about 10.. if you are lucky). This place.. I believe its around $30.. but you get a basket to fill and you get to keep it and bring it next time.  When you bring it back you get a discount. Great place to go if you are really in for it for the apples. No website.. so just call and the answering machine tells you everything you need to know. Make sure its a crisp fall day.. you'll enjoy the hot apple cider that much more!",
                "author": "Anna L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-10-01",
                "description": "Fall officially starts today because we went to Edward's! The donuts are why we go, everything else is a bonus. We rode the wagon ride, my daughter got on the slowest, shortest pony ride ever (that she loved), and we purchased the delicious pantry items that are too good for us to resist: caramel apple fudge, apple cider, caramel apple donuts with and without nuts, mulled cider teabags, and a cool sparkly leaf decoration for my front door!  \nThey have everything for a wonderful family day there, and the smells are amazing. Even though it was extremely crowded, the staff is good at getting people through the lines quickly and I was suprised that we had practically no wait for donuts or to check out, despite the long lines.\nThis year we couldn't pick apples, they said they only had about 50% of their usual crop and we got there the day after a frost, so we couldn't pick berries either.",
                "author": "Jessica S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-09-18",
                "description": "So awesome. Even after being leveled the ground by a freak winter tornado they rebuilt it to look pretty much the same. \nYeah. The crowds are long sometimes but its a seasonal place. What do you expect?\nIf homer simpson was a real person he would only eat their apple donuts. Swear to god, I dream all year about getting them in the fall\nThe pie and ice cream are very nice. The pulled pork is tasty also. \nA lot of their \"food\" is private label gourmet stuff you see other places but that doesn't detract. Its good. \nThe things they make like the cider and fudge etc are the things to get anyway\n\nGreat for kids",
                "author": "Paddy O."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-05-17",
                "description": "The older I get, the less I like my home state of Illinois. It's an expensive place to live, it's grossly mismanaged, and traffic is a nightmare in the summer.\n\nOn the other hand... Illinois DOES have Edwards Apple Orchard. This is a wonderful family orchard with a warm and outgoing staff, excellent food, and delicious apples. Edwards is the kind of place that reminds you how good it is to be alive. \n\nI've been going to Edwards annually since I was very little and it's a ritual I look forward to every year. \n\nThese days, I take a day off of work during the week (because weekends at the orchard are far too busy for my taste), grab a couple of friends early in the morning, and get to the orchard while the apples on the trees are still cold. We'll have a few crisp apples while we pick our 1-2 bushels, drive back to the barn, and have brunch in the cider cellar. The food in the cellar is exactly what you'd expect: hot, cheap, and perfect. I usually get a pulled pork sandwich (amazing), hot apple cider, apple pie, and a few apple cider doughnuts (best apple cider doughnuts IN THE WORLD- you can smell them when you pull into the parking lot...). It is a diet killer, but who cares? You have the rest of the day to wear it off. Unless you buy doughnuts to take home with you. \n\nEdwards also has other stuff that kids love- pony rides, a farm animal petting zoo, a maze, playground, and even a farm museum. The barn also has a country shop that is essentially the shop at Cracker Barrel on steroids. I should also note that they have outstanding homemade fudge in this store. \n\nOver the years, Edwards has gotten a bit more \"touristy,\" and fall weekends (as noted) are insanely busy. With all the apples, food from the barn and cellar, pumpkins, and other crap you might buy simply because you only go there once a year, the cost of your visit can really add up quickly. Just be aware.\n\nWith that said, the experience is entirely worth it. If you live in Illinois and have spent the year stressing over machine politics, taxes, construction and the like, you owe it to yourself to visit this orchard -one of the state gems- take a bite of your doughnut, a sip of your cider, and remember that it's not so bad after all.",
                "author": "Andrew J."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2013-11-03",
                "description": "Pros: Easy parking, good cider, great donuts.  Seriously, the fresh, hot donuts were incredible.\n\nCons:\n\nThe apples advertised on the website were not available for picking, we only had access to three types of apples that were within a cordon of caution tape.  We were trucked there in groups and watched over constantly by a group of staff we started calling the Apple Minders.  The trees were nearly picked clean and we were reprimanded for picking an apple a few inches over the caution tape.\n\nYou are forced to rent a half-bushel basket and are charged $40 for however many apples you can ingeniously fit into the rented basket.  You can't use your own bag and still pay $40 even if you half-filled the basket.  Small bags of very overpriced apples are available in the orchard store.\n\nThe shop was massive, overpriced, and cash only.  Most of the goods were not local, including the produce and preserves.\n\nIn general it was extremely crowded and busy, full of rules (NO SINGLE DONUTS TO GO! How do they enforce that? Will they watch me eat it?), and sort of faux-homestyle in a way that creeped us out.\n\nOverall:\nGood apples, good food, good items from the store. But I wouldn't go again and wouldn't suggest it.  There are easier, friendlier, cheaper, and and more fun apple-picking experiences in the area.",
                "author": "Hannah C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-09-26",
                "description": "Love this place, very children-friendly and their donuts are perfectly made! The weather was perfect so the visit was all the more pleasant with friends.\n\nThe little tourist shop they have is huge. It's not like they sell small or cheap stuff like random t-shirts or postcards but the stuff they have appear to have good quality (i.e. vase, frames, candles, decoration, etc.) and they even have samples to let you taste some of their goodies. We bought pumpkin butter, apple butter, and strawberry jam. I also took one of the discounted Halloween decoration.\n\nOnly a star less because credit cards are not accepted and we didn't do any apple picking since it was closed but we did get to sample the various apples and went home with a bag of our favorite.",
                "author": "Fate O."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-10-17",
                "description": "Great donuts and cider it's just always busy. The prices are not to bad and there's always a good band.",
                "author": "Kevin B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-12-26",
                "description": "If I could spend the rest of my life living at Edwards, eating apples and apple doughnuts and apple pie with cheddar cheese on top.... I would in a hot second. \nThere is so much nostalgia in this place that a stranger would feel at home. \nGo on a tractor ride to pick your apples. Go feed the chubby little farm animals. Go look through the antique farm equiptment and when you're all done with that, eat your weight in warm apple sauce doughnuts. You will not regret it. I promise.\nThe other stuff they sell probably brings in a large portion of money and you might find something that is SOOO cute that you just must by one and another for you sister, aunt, neighbor and coworker. But I don't care for those things. They get in the way of my apple pie. And Fudge. \nNeed I say more? \nI should hope not.",
                "author": "Anya P."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-10-23",
                "description": "I have been going to the orchards since I can remember as a young child every year. This was something we had to do every fall along with getting doughnuts/ I now take my 2 children every year. After the tornado the orchard only improved and continuing bringing an amazing feeling as soon as you drive in. I prefer to go on a early weekday  because then its not super crowded as it is on the weekends. My children love the pony and wagon rides! They also love playing in the ship and feeding the goats. The shop is amazing and I love how they have samples of alot of items. My kids love the bags of candy. The apple barn has great samples! I also enjoy how they added the barn outside for food and the inside eatery becomes crowded quick. This will be something I plan to do the rest of my life as long as I live close",
                "author": "Jennifer E."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-10-06",
                "description": "awesome place donuts are by far the best and best buck for your apples",
                "author": "Jenny G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-10-17",
                "description": "Edward's epitomizes what Illinois fall is all about: Going out into the country through the corn fields and changing leaves with your family and friends to enjoy some good midwestern fun.\n\nI moved to Texas a few years ago, and always made a point to get back to Edward's at least once while they were open for the season (Labor Day - Thanksgiving Weekend). I practically live for that first hot apple cider doughnut of the season. They melt in your mouth, coated perfectly with cinnamon sugar. Awesome. They're still good after they cool down, but the hot-from-the-fryer doughnuts are unbeatable.\n\nAfter being hit by a freak tornado in January of 2008, Edward's took the opportunity presented by having their buildings destroyed to greatly expand their facilities. The \"new\" store and Apple Cellar are probably twice the size of the old ones. As a result, they've greatly expanded the amount of stuff they sell. If you're looking for something \"country,\" you'll find it there.\n\nIn addition to apples, cider, and doughnuts, they have a huge variety of fresh fudge, cheeses, and a canned goods - apple butter, pumpkin butter, jams, jellies, sweet corn salsa, local honey, etc, etc, etc. And kitschy fall decorations for your house, if you're into that sort of thing. \n\nI tried the Dark Chocolate Fudge w/ Carmel & Sea Salt this year and it was awesome. Just the right balance of carmel, nuts, dark chocolate, and salt that kept it from tasting too sugary (an issue I have with fudge).\n\nThey have live music, usually bluegrass, on the weekends. There are pony rides, animals to pet, playgrounds, and other things to keep the kids entertained. If you'd rather eat something other than an apple product, they do sell BBQ pork sandwiches and baked potatoes to eat while you're there.\n\nA couple things to keep in mind:\n- Everyone comes here. And I mean EVERYONE. So, be prepared for huge crowds on the weekends.\n- They don't take credit cards, so have your cash or check book ready. They have an ATM if you're in a pinch, though.\n- They don't have a website. Bizarre, but true. So, call them if you want to know something. They usually have a long answering machine message with the info you're looking for.",
                "author": "Anthea H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-09-15",
                "description": "Many activities and well staffed.  Apples, fresh doughnuts, taffy apples, cider - all great!",
                "author": "D L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-09-19",
                "description": "Ive been coming here since i was a youngster. Still cant complain! Everything is original. Best cider donuts you will ever taste, and fresh too! A dozen is 10$. This family buisness is one of the best! The workers are so nice to everyone. Very affordable in comparison to other places. Also, if you go now you will get a chance to see the baby sheep. For those of you who have children. Take them. They'll enjoy the farm and maze maybe you might too!",
                "author": "Jennifer M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-09-17",
                "description": "Edwards Apple Orchard is wonderful! Our family was so excited for the apple season to begin this fall. We head to the orchard at least once or twice a season.  This visit this year was as good as we remembered it !  The apple cider donuts are warm and delicious and the barbecue pork sandwiches hit the spot. The kids liked the pony rides and playing .  We also enjoyed shopping in the store and bringing home apples and carmels. It is a fun family outing!",
                "author": "Cathy S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-10-27",
                "description": "My family has been going to the orchard for years.  This was my first year in September.  The orchard is SUPER busy and if crowds aren't your thing, I don't know that I would recommend this place.  There is tons to do for children.  The baked potato tent is great.  My family is gluten free so I wasn't able to try the apple donuts but the smelled amazing.  The fudge is great.  The gift shop is great and they do have GF products.  I can't wait to go back next year!",
                "author": "Megan S."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2014-09-30",
                "description": "My family and I have been going to Edward's for years and I don't know if we will be going back.  This year we went out with the anticipation it was going to be very very busy because this past weekend was so nice (Sept 27 and 28, 2014).  It was packed and we did our yearly traditions first - picture on the bench with new year - walk through the barn to hit up the ATM and donuts and then to get apples.  ATM is nothing new and to be expected.  Donuts are getting smaller but still fantastic.  Apples, we didn't get here.  Aside from now having to pre-pay for apples; while standing in line they removed the Jonagold sign to pick and we were only left with Fugi.  This was at 12:30 in the afternoon on Saturday the 27th; and we immediately decided we were not going to spend $43 for one variety of apples so we left.  ($40 for apples plus $3 deposit for basket; which you don't give back and if you do I couldn't tell you what they'd give you in place of the basket as no one was seen leaving this place without a basket).  I even said to my husband we live close so the drive didn't kill us - but can you imagine the people that drove over an hour to get here to wind up being completely disappointed?  I felt for those customers as I knew they were in the massive crowd.\n\nSince all our kids wanted to still pick apples we went to another orchard that is about a half our East of Edwards (and close to Woodstock) and had a wonderful time.  We still spent $40 to pick apples but we had five (maybe six) different varieties to choose from - and they were bountiful!\n\nEdwards may have been around forever and they have many loyal customers but I believe they are getting over priced and have some great competition around the area.",
                "author": "Lisa J."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-12-17",
                "description": "This place is probably one of the most nostalgic places in Illinois for me. Ever since I was a little girl, my parents have been getting me up at the crack of dawn to drive out to Poplar Grove for Edward's amazing cider donuts. \n\nAccording to my mom, you MUST get there first thing in the morning to get the fresh donuts, but between us, they seem to taste just as awesome if you decide to roll in at 10:00 like a normal human being.\n\nEdwards is also the location where I first tried cheddar cheese on my apple pie - and have been hooked ever since. Don't knock it til you try it, it's amazing.\n\nEdwards features the cutest free petting zoo, ponies for the little ones, and hay rides if you're looking for some laid back family fun. There is also a shop filled with every variety of apple under the sun, awesome jellies and jams, and a lovely assortment of fudge and treats. \n\nTrips out to Edwards Apple Orchards are one of the family traditions that we've really hung on to, though - now that I'm older - I can insist that my mom wait until 9:00 to pile us all into the car.",
                "author": "Jessica O."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-12-02",
                "description": "Sadly we missed the apple picking season but my oh my there was Halloween and Christmas decorations waiting for my viewing pleasure! I had a great time, great food and great company. The staff is friendly and helpful the food is simply delicious and fattening. Country music in the fall crisp air with hay rides and goat feedings. I felt like a little kid watching her first snow fall. \n\nThey also make these special donuts no not laced with anything but they are special because no one else makes them. Apple donuts. Delicious. We were lucky to come the day before Halloween and it wasn't even as packed as the claim it gets over the season. Phew thank goodness. I enjoyed everything about this wonderful Orchard and can't wait to return next year.",
                "author": "Nicole L."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-10-20",
                "description": "I would give this place 6 stars if I could.  \n\nI started coming here 3 or 4 years ago and every year I make a point to visit. Once September hits I start getting excited at the prospect of picking apples, selecting my own pumpkin, bundling up in warm clothes, and (most importantly) visiting Edward's Apple Orchard.  This orchard is about an hour west of where I live so the anticipation builds as we leave suburbia for a small town feel and country life.  \n\nThe layout is very well organized.  Ample parking + staff members to direct said parking = no parking headaches for this girl. The apple cider is some of the best I've ever had.  The apple cider donuts are soft, sweet, fresh, and oh so good.  My mouth is watering just thinking about them.  They have a store located inside a barn with tons of potential purchases including freshly made fudge (they let you sample it before you buy it... the amaretto is a must try), apple butter, crafts to make your home feel all cozy inside, candles, and so much more.  \n\nIf you go a little shopping crazy in the store you can easily end up spending more money than you intend to so, unless you're Mr/Mrs Moneybags, be prepared.   They have a variety of lunch and snack options (as a vegetarian I was a little limited to nachos and a baked potato stand with a variety of toppings to choose from but I'm used to it so I didn't mind) at very reasonable prices. \n\nIf \"choose you own\" is more your style you can mosey on out to the pumpkin patch to find your perfect pumpkin.  They also offer pick your own raspberry bushes. I seems like a cool idea (and they are delicious) but if you don't get them at the peak of freshness and before everyone picks them over be prepared to spend a LOT of time searching for decent berries. \n\nFinally, comes apple picking.  A word of advice - if you're looking for a specific kind of apple call ahead to see what  they're letting customers pick that day.  I forgot this and at our most recent visit my friends and I were hoping to get Red Delicious but since they were only letting people pick Golden Delicious we were a bit disappointed.  Regardless the ones we picked were DELICIOUS! There's nothing better than fresh fruit you pick yourself. \n\nThis place is awesome for people of all ages.  I can't wait for fall to roll around next year so my friends and I can go back.",
                "author": "Anna M."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2009-10-16",
                "description": "I used to love Edwards.  Love.  I've been going here for, well let's just say a looong time.  Now it just seems like they've sold out and it's a tourist trip for people from the burbs.  \n\nThey have good apples and their cider and donuts are good.  Their prices are ridiculous now.  $8 for 1/2 peck?  Really?\n\nI miss the old days at Edwards.  Sniff.",
                "author": "Jenny L."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2011-09-17",
                "description": "This place did not come close to living up to expectations based on reviews here. \n\nPluses: easy parking, no admission fees, ascetically pleasing, fairly priced and good food, kind people\n\nMinuses: crowded, lines everywhere, property layout felt tight, kids area lacking, no hay bales, no direct interaction with animals (had to feed goats through a tube), no corn maize, no pumpkins, and the worst of all - the main reason we went - was the pick your own process. You are confined to a minuscule portion of the orchard crowded with people, given a basket you are required to buy ($3) and fill to the top ($30 - $35), and we only had access to a single apple type - gala.  And don't try to walk the 100yrds to or from the orchard. They don't want people clogging the road.\n\nBeen to several other orchards: Jonamac, all seasons, county line, this one was the worst.",
                "author": "Loren A."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2009-10-04",
                "description": "They do have a lot to do here... but expect to wait to do anything. This is the Six Flags of Apple Orchards when it comes to lines. I'm not even joking, there were at least 50 people in line waiting to get into the area where you buy gifty/foody items. \n\nThe actual apple picking was fun and their trees had tons of apples, but the $34 minimum was pretty extreme. I've been going apple picking for years and never seen that kind of a minimum, or paid such a high price. The apple donuts were fantastic, but again, a good 15 minute wait in line (the smell got the better of me and I had to wait!). The apple cider was also good, but oops, they ran out in the middle of pouring our cups. We did have the option to go get into another 20 minute line for more. No way... we drank what we got. Sharing never killed anyone.\n\nIf you can make it here in the middle of the week it might be worth it, but steer clear on the weekends!",
                "author": "Valerie R."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-10-19",
                "description": "I love this place.  I'm 38 years old and I've been going here ever since I was 8 years old.  It's a fantastic place for kids and the apples are always top notch.  AND... if you love apple cider, you've got to try theirs!\n\nEvery October we gather all our friends and family and plan a trip out to Edward's.  I love that they're so family oriented and even though they've tried to expand their place to accommodate more \"variety\", it never seems like they're overdoing it.",
                "author": "Arlyne C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-10-03",
                "description": "Really the best apple orchard experience in the Chicago-land area.  My only complaint is how crowded it gets.  Getting there early or when the weather is less than desirable helps.  The donuts are REALLY good.  We always get a dozen to eat and a dozen to freeze for later.  They have all their available apples ready for tasting.  I found I have a new favorite apple.... the Empire - you gotta taste one!  A slice of apple pie ale mode and hot cider is worth the wait in the long line.  On weekends you can listen to live music while you wait.  My daughter loved the pony rides and we enjoyed the horse drawn wagon tour of the orchard.",
                "author": "Amy E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-09-17",
                "description": "Went there this weekend was packed- way too many people- has lot of stuff for kids, it is fun but try and go on a weekday to avoid the crowds",
                "author": "Lola M."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2009-10-27",
                "description": "I apparently missed the sign explaining where to go to pick your own apples. Had I picked my own, I probably would have gone up a star or two. That said, it was an enjoyable way to spend a couple of hours as long as I was in the area.\n\nAs other Yelpers have recommended, the apple donuts are very good. I enjoyed sitting in the barn, eating a BBQ pork sandwich with hot apple cider while listening to a bluegrass band. \n\nI took a short horse-drawn ride around the orchard for $3. Any opportunity to be pulled around by Clydesdales is fun, and the staff were very friendly, but I had hoped they'd drop us off at a pick-your-own outpost of some sort -- they didn't.\n\nOne of the main attractions appears to be the store. It's disappointing to spend that much time looking at trinkets and jars of jam when I'd hoped to spend a beautiful autumn day outside. That said, I did end up buying a bottle of apple BBQ sauce, caramel corn puff things and a gallon of apple cider.\n\nI had fun, but I'm not sure it'd be worth the drive if I lived in the city.",
                "author": "Amelia W."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2011-10-06",
                "description": "I just went to Edwards Apple Orchard this past weekend (Saturday)and here are the pros and cons:\nPROS:\nBeautiful landscaped grounds\nNice tractor ride to pick your own apples\nFree kids playground and animals to look at\nHorse drawn wagon ride (for a fee)\nOld fashioned corn husking demonstration (free)\nBarn has lots for sale\nGreat cider donuts, apple pie and cider for sale\nNice music band outside (free)\nCONS:\nAbsolutely overrun with people\nHour long wait for a hot dog\n20 min wait for donut or slice of apple pie\n15+ minute wait for a ladies bathroom\nAnimals are for looking at through a fence (no petting or feeding)\nNo where to sit  to eat your food after waiting an hour\nWall to wall people in the barn with a waiting line just to go in and browse\n\nI live in Chicago.  This is not worth the drive from there.\nToo many great places closer and with more attractions.  It may be worth it for people who live near Poplar IL.",
                "author": "Pai R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-11-24",
                "description": "Went here on the last weekend to grab some cider and some apple butter before the official closing for the season.  They have a great selection of decorations for the holidays along with different items for the kitchen like salsa, butters and such.  They also have a small cafe in the basement with hot apple cider, doughnuts, and other sandwiches to consume while there.\n\nThis has been a great place to go with the family for years and I cant wait to go next year.",
                "author": "Jvontai H."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-09-29",
                "description": "A group of girlfriends and I headed out of the city for a day to enjoy some good, old-fashioned apple orchard fun!\n\nFrom my place in the Ukrainian Village, it was about an hour and a half drive.  Not bad!  \n\nWe arrived and were kinda stunned at how crazy it was.  The last time I was there (when I was a kid), it was a small operation.  They've clearly hit the big time since then.  It was packed!  \n\nWe got on the tractor and headed out to the pick your own.  A note for other pickers - if you can, bring your own baskets for picking, otherwise you'll pay $3 for one of theirs.  They were picking Jonathans and Empires on the particular day we went out there.  The Jonathans were great - the trees weren't at all picked over and we filled up a basket pretty quickly!  The Empires weren't as good - the trees were a lot more picked over and there wasn't much left.  But we did well enough with the Jonathans that we were happy.\n\nThey also have a pick your own raspberry patch (which we skipped as my friend is allergic) and a pumpkin patch (where we found lots of little pumpkins for my friend's niece).  I think they may also have strawberries when they are in season, but don't quote me on that.  \n\nThere was a bluegrass band, big barn with lots of lunch-y type foods, a smaller snack shop with apple pie and apple donuts, and a shack that sold cider by the glass and bottles of water.  There were pony rides, hay rides, and lots of playgrounds for the kids.  Their country shop was amazing - lots of apple-themed products and yummy local foods made by farmers.  I picked up homemade vidalia dressing, sweetcorn salsa, and real cheese curds.  Yum!  It also sells pre-picked apples, so I took home two big bags full of honeycrisps.  \n\nAll in all we had a lot of fun here.  Next time I'd probably try to find somewhere that's less crowded and has a better variety of apples for u-pick, but if someone suggested it, I'd happily come back here for more apple fun!",
                "author": "Kim J."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-10-11",
                "description": "What a great place!\n\nLove coming on weekends in October, although crowded, it adds to my experience AND most importantly....baked potato tent!!! Love the apples, the fudge, the cheese, the apple pie, the baked potatoes, the jam, the apple cider, everything!",
                "author": "Cheryl R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-09-22",
                "description": "On Sunday, we took a drive northward towards the Wisconsin border for a day of apple picking and general autumnal fun.  Our original destination was Royal Oak orchard in Harvard but since I couldn't be bothered to actually log onto their website, I didn't realize they don't open on Sundays.  I should've known because if you've ever been to Royal Oak, it's a beautiful place but they do kind-of hit you over the head with the bible the whole time you're there - my mother loves it.  So I tapped furiously on my Tom-Tom navigation device and found Edwards Apple Orchard.  The drive from Harvard, IL to Poplar Grove, IL is nice enough - we saw lots of farms and a handful of little villages; very Norman Rockwell.  Not knowing anything about Edwards and feeling slightly bummed that Royal Oak was closed, we crossed our fingers and hoped for a halfway decent afternoon.  Our expectations were met and exceeded by Edwards.\n\nThe place was hopping for a mid-September Sunday.  The parking situation wasn't too bad - they have parking on either side of Centerville Rd and they have cops there to make sure the whole operation moves efficiently and safely.  Once you get on the property, they have a lot of the same stuff they have at other farms - apple picking, pony rides, petting zoo, country store, tractor rides... you get the picture.  The one thing they don't do is take plastic.  We rarely have cash on us and use our debit card almost exclusively so this was a bit of an inconvenience.  They do have an ATM in the store which charges the very standard $1.50 per transaction.  I hated to do it but we had come so far and there probably wasn't a TCF bank anywhere in the vicinity, so I gritted my teeth and pulled out the cash.  The one thing Edwards does very well, compared with other orchards we have historically visited, is crowd control.  Does everyone go nuts for cider-donuts or is it just me?  Edwards makes you to stand in line and they have sacks of donuts ready to go.  At Royal Oak, Apple Holler, Didier Farms and almost everywhere else I can remember, it's a clusterf*** to get those donuts.  I don't know why we go so crazy for cider-donuts but it's one of those things I wait all year for and when a place like this makes it easy for me to get my fix, I appreciate it.  The rest of the store is like a giant Cracker Barrel which my wife loves - I had to hold my son so he wouldn't break anything.  A jar of honey, four taffy apples, two lollipops and a tub of caramel made our wallet $30 lighter but *DANG* those apples are so good.  So now you're armed with cash and can start 'having fun' - what else can you do?  They have a little area with farm animals - I called it a petting zoo but that's not accurate... you don't go in with the animals... they are in a barn and you can reach in and pet/feed them.  Don't bother buying any animal feed because these guys are so full that they usually sniff your hand and ignore the food.  That 'farm animal experience' doesn't cost anything - that's a freebie @ Edwards.  They have a playground with old tractors and slides for kids - also free.  There are lots of kids everywhere and their respective parents snapping pictures.  Next, we decided to take a Clydesdale drawn ride around the property and follow that up with a pony ride for the little ones - clearly the free fun ended here since both of those attractions run about $4 per person (expensive - no?).  Then we decided to do the actual apple picking.  They get you on a trailer (pulled by tractor) and explain that you must use one of their baskets (which you end up purchasing) and must fill it with at least $30 worth of apples - this is the minimum amount of apples you must purchase - if you take less than $30 worth of apples you still pay $30.  You won't know exactly how much your basket of apples will cost until it gets weighed later, but apparently you have to at least put $30 in there (or else).  I was slightly confused by the system, but it didn't really matter.  They drive you back to the orchard and tell you which apples you can pick - on this specific day, it was Jonathan and Jonagold apples.  Let me tell you these apples were absolutely magnificent.  You can fill a basket full of PERFECT apples in just a matter of minutes... I do like the apples here.  I don't have one of Royal Oak's apples to do a Pepsi challenge but I bet Edwards can hold their own.\n\nSo now we have a giant basket full of beautiful and delicious apples (of which we will sadly only eat maybe half).  I should be thankful that Royal Oak was closed on the day of our lord otherwise we may have never discovered Edwards orchard.",
                "author": "ALFREDO M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-10-12",
                "description": "Edwards Orchard has a history that dates over fifty years, and I think it is because of this that my family and I have been going here for Apple-picking for over 10 years.  Because it is also family-owned, it's family  feel is what brings us back every year!\n\nAs you approach the orchard with the car windows down, you are hit with the smell of their apple donuts.  On weekends, you can find a band playing while you sit in their picnic area and enjoy their hot or cold cider, barbeque pork sandwiches, baked potatoes, etc.  from their restaurants.\n\nYou are brought to the apples by a \"hay-less\" ride, I know some orchards allow you to drive through their orchards, but not this one.  One thing, they do have a variety of different kinds of apples to pick, but you have to know exact dates when they're available to pick or you'll just have to pick what they have on the day you go.  For example, I went yesterday, and we were hoping to pick some Gala Apples, but apparently they were harvested earlier in the month.  Therefore, we had to pick Golden and Red Delicious apples.  I also wish they had a petting zoo, and a corn maze, I know some others do.  \n\nLast but not least, it's not too far from the city, about an hour to an hour and a half.  Also, this place is VERY clean!!!  And make sure to bring cash or your checkbook, they do NOT take credit.\n\nOverall-\nCleanliness:  A\nFood:  A\nLocation:  A\nPrice:  B\nService:  A\n---------------------\nGrade:  A",
                "author": "Andie W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-10-04",
                "description": "The barn was rebuilt due to the tornado in January 2007 I believe.\n\nThe new barn is all I have seen and it is sooo nice. The best are the donuts. Everyone here in this area are addicted to them. The pumpkin or carrot roll is very good too. So many things to buy in the barn. It is warm and welcoming. Cute trinkets, Christmas stuff. Oh, and I love those caramel puffs.\n\nCrowds can be big. Maybe better to go later in the season. Closes in November. My family had a tradition of coming out here even before I moved here. My stepmom buys bags of stuff (maybe too much)!\n\nAwesome place!",
                "author": "Therese F."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2014-09-20",
                "description": "Read the rave reviews, and I'm not feeling it.  This is literally the busiest apple orchard I have ever visited.  They do not accept credit or debit cards...  but do have ATM's on property if you don't mind paying the service charge for getting cash there.  It's big and has a few novelty attractions, but I didn't see much of a difference between this place and some of the smaller orchards in the area.  They all tend to have the same basics (play area, shop with items, fudge, cider, donuts, hay ride, etc.), which are really what most of us go to an orchard for.  I will say though, I didn't see a corn maze anywhere at this orchard.  People often say the donuts or cider tastes better from one orchard or another, but honestly, I'm not seeing it after visiting several orchards.  If we did a blind taste-test, I'm betting no one could tell the difference between any of them.  $30 - $35 to pick your own apples is way overpriced, even if it is \"just for the experience.\"  The place is OK, but if you have a local orchard, you're probably just as well off going there (especially if you are driving any distance to get to this one).",
                "author": "J M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-10-09",
                "description": "A trip to Edward's is one of my most favorite fall activities!!! Spent the day there and I have to say going during 80 degree weather in October seemed rather strange. I'm used to going while its chilly and enjoy a hot apple cider, but I still enjoyed my apple cider just chilled! There is a barn with lots of gourmet food goodies, halloween and fall craft/gift items, fresh fudge, apples galore and of course thier famous donuts which are to die for! I can't imagine leaving there without some honey crisps and a dozen donuts! Just know that they only accept cash and checks although I did see an atm machine nestled in a corner. Outside there is a pumpkin patch, farm animals and play area for the kids, tractors and even a horse drawn carriage trolley rides through the orchard. Check out the farm museaum in the eatery theres some cool things in there. Weekends are pretty busy but its really a great place to be enjoyed! There was also a band playing outdoors which helped add to the atmosphere. Can't wait to go back next fall!\nI wish there were more signs on the road to direct you or show you where to turn because we nearly passed Centerville Rd.",
                "author": "Nicole S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-09-13",
                "description": "LOVELOVELOVELOVE this place. Nothing says fall than coming here during the week, getting 1/2 dozen donuts, gallon of cider, and some yummy Gala apples. Love their pumpkin butter, too. Can't believe they how quickly they build this place up from the tornado! I love both locations, both are beautiful country drives, but this location has them animals! Their donuts are the best. I wanna go now!",
                "author": "Mill V."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2013-10-28",
                "description": "I never have been here and today was my first day visiting. Everything nearly was so over priced! Apples were $8-12 a small bag, apple cider donuts nearly $8 A dozen A $1.50 for a tiny glass of cider, $9.00 for A gallon of apple cider. I went to the basement to order some food it was $3 for a cup of mac n cheese $5 for a piece of pie with a scoop of icecream ontop. I bought food and cider for 2 people costed me over $20 HERE comes the fun part! When I went to the register the women told me CASH or CHECK ONLY! Nowhere in line did it say cash or check only I felt so stupid I left everything. She told me to go use the atm A warning about the atm it charges A huge service fee! I didnt buy anything! Whoever heard of A store not taking debit or credit these days? I came from Chicago and I dont carry more on me then A $10! I went outside and seen the goats and realized you could feed them only 1 problem you need A quarter I went inside to get some quarters the women wouldnt give me change she said she couldnt sorry.If you come here bring LOTS and LOTS of MONEY and dont forget the QUARTERS.",
                "author": "Mike A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-10-05",
                "description": "This place will always hold a special special place in my heart!  I absolutely love it there!! Wish I could give it 10 stars!  We've made it a tradtion to go every year.  My father lived in Candlewick & found this gem minutes away....We've been going a few times a year ever since.  Soo glad they rebuilt so fast! I think a lot of people would have been devastated if it did not reopen.  Their Cider doughnuts are AMAZING! so is their Cider, the BBQ sandwhich & their apple pie with melted cheddar over the top!...who would've known it would taste sooo good!  My family loves to pick apples- The Gala's are my favorite...the atmosphere is just great- we have soooo many people that tell us that they want to go with on our next visit...gotta reserve a charter bus I guess!",
                "author": "Charlene A."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-10-03",
                "description": "A terrific way to spend a nice fall afternoon.  Come have a pulled pork sandwich, a piece of apple pie and some hot cider while you listen to the bluegrass band play.  There's a fairly large area for children to play and climb around, a fabulous gift shop in the barn and raspberries, pumpkins and apples you can pick yourself.  Hot, fresh cider donuts, popcorn balls, homemade fudge, hot and cold cider and of course apples are just some of the things you can pick up to take home with you.  Try it once and it's bound to become a family tradition for you too.  One thing to be aware of is it's cash or check only, no credit cards.  There is an ATM on site but come prepared.",
                "author": "amy j."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2007-10-19",
                "description": "Oh, what to say...Tradition. Heritage.  Location, Location, Location.  A family-owned apple orchard in the middle of rural northern IL.  Just close enough to be a perfect fall day destination for the Chicago suburbs and just far enough from everything to be a local's favorite place for pie.  The cider is made right in the apple barn.  The donuts are made fresh all day long and the fudge is \"just like grandma use to make\".",
                "author": "Sarah I."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-10-25",
                "description": "Terrific!  Easy parking and low lines; when the lines did get long, additional help seemed to be available.  Granted, we did go during a Bears game but I would definitely return.  Easy to get to via 90 (save the construction).  The apple donuts were indeed great!  The apples were a bit pricey at $37/buschel but for a family where you're not paying parking, I think it's well worth it.  Music, good food, apple pickin - cmon, what more do you want!",
                "author": "Keith E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-08-31",
                "description": "The apples are excellent and the fresh apple cinnamon donuts are addicting.  No matter how many donuts I purchase, they rarely survive the trip home.  Placing them in the trunk might be a suggestion for those who actually want to have some the next day. Having gone here for decades, it would seem their prices have increased far beyond the rising prices in today's economy. Perhaps it is supply and demand. I have often said about food 'if it is good, I don't care about the cost.'  Edwards has reached the point where I limit my visits to once a year versus several each year simply because the costs have really gone beyond an acceptable level. Another problem is they use cute baskets which do not hold more than two bags of apples, unless you want to bounce them on the floor several times.  If you are disabled or physically challenged, bring a helper, as you will not be able to manage carrying anything if you use a cane and the very few benches are usually occuppied by donut eaters and kids, so there is no place for the physically challenged.  They do have ample handicapped parking, but it would seem to be filled by those affluent people from the suburbs with handicapped parking permits who seem to be free of disabilities.",
                "author": "Elijah M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-08-30",
                "description": "We LOVE Edwards Apple Orchard and have been going every year for 7 years. It's a wonderful autumn experience. The apples and donuts are out of this world. It's just an overall, wonderful family experience!",
                "author": "Ginny E."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Edwards Apple Orchard",
    "address": {
        "addressLocality": "Poplar Grove",
        "addressRegion": "IL",
        "streetAddress": "7061 Centerville Rd",
        "postalCode": "61065",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/mNZ73FBgw0vhPDsjz8ZH_w/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18157652234"
}