{
    "aggregateRating": {
        "reviewCount": 64,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-12-08",
            "description": "Going to the Evanston farmers market was the highlight of my Saturday mornings. The market is in a great space with lots of nearby parking. The fruits and vegetables all look great and taste just as hood. Usually when I go I buy peaches and peppers. There's also lots of stands for local businesses which is awesome - eating elotes while you browse through the market? Yes please!",
            "author": "Christina B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-04",
            "description": "Coming from the Dallas Farmer's Market where I once got 10 avocados for a dollar, I was prepared to be disappointed. Happily, I wasn't. The produce was less expensive than the store and there were lots of local options. (5 bell peppers for a $1!) I'm not huge into organic, but they had it. \n\nI really just go for the produce but it would also be a nice spot to bring kids or friends and grab a bite to eat. There's a few little prepared food spots, but they're much more expensive. If you're on a budget, stick to the less processed stuff. \n\nPro tip: wear sunscreen! I thought we'd just be there a few minutes. 30 minutes later +my lack of melanin, I was burnt!",
            "author": "Jennifer S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-21",
            "description": "As glorious as a farmers market can be -- there's produce of all varieties, flowers galore, cupcakes, crepes, tamales, pumpkins (at least in October), free parking, and chairs and tables for sampling your purchases. There are more than enough opportunities for impulse purchases (how I ended up with basil pickled mushrooms, I don't know) which I guess is a testament to just how much variety is here.",
            "author": "Jennifer N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-10-22",
            "description": "What a Saturday morning treat to visit this large farmer's market.  It carries so many varieties of organic fruits, vegetables and flowers.  Beautiful eye candy even if you don't want to partake of all of them.  They carry organic meats as well, and there is certainly ample parking.",
            "author": "Ali C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-18",
            "description": "The first hurdle a farmers' market must overcome is accessibility. You could have the freshest, most organic, orgasmic, local, life-changing produce in the galaxy, but if you're asking me to come Mon-Fri, before 7.30pm, ain't happening! How am I supposed to afford locally grown produce if I sacrifice business hours to do so?\n\nEvanston, premier suburb that it is, doesn't force the conscientious consumer to sacrifice productivity for the sake of buying from indy farmers. Opening at 7.30a on a Sat is the way to go. Get going on time, you're out by 8.15a. The boozy brunch places haven't even opened yet for god's sake. I have no choice but to run or workout or something non-detrimental to my health.\n\nAs far as vendors, they have Phoenix Bean, aka Jenny's, Tofu. In all honesty, nuff said. But there's more. They have several hot food options (amazing kale burger, organic taco place, others) to nosh on while perusing. The vendors are stocked w/ staff that knows their shit and enjoy engaging w/ the inquisitive clientele. I'm not hard-core to the point of trying to turn arugula, rhubarb and chicory into the greatest meal ever. I stick to poblanos and other chili peppers, maybe some onions too, that I can use to make Mexican food.\n\nUnless you've rejected capitalism and have weekdays off (in which case all power to you), you won't find a better farmers' market.",
            "author": "Ben W."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-06-30",
            "description": "I was enjoying the nice farmers' market selection, when a woman from the City of Evanston booth yelled from three booths over that service dogs aren't allowed. After arguing that my dog was not actually a service dog (even though she is and I had all appropriate documentation), she responded that didn't care anyway. She kicked me out of the market. DO NOT GO to the Evanston farmers' market, especially if you have a service dog (even if it is ADA certified).",
            "author": "Alex L."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-06-30",
            "description": "This was the worst farmer's market experience I've ever had. I was asked to leave because I brought my dog, even though she is a service dog and I had certification on me. Furthermore, the woman at the Evanston Township booth told me that she didn't believe that she was certified to do anything special and dogs love humans no mater what; she has no idea what my disability is and the certifications my dog has earned to support me.  It was incredibly offensive and discriminatory and I will never ever be returning back to support this organization.",
            "author": "Sara C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-06",
            "description": "Great place. Fresh produces.  I found Organic cage free eggs. Lots of fresh greens even flowers there. I'll comeback for sure.",
            "author": "Maryam P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-27",
            "description": "By far one of my favorite farmers markets in the Chicagoland area. I truly feel like I can do 95% of my weekly shopping here. Great produce, baked goods, and other prepared foods. We always get fresh local produce, meat, eggs, juice (city press!!!), and a few other fun finds every time we visit. Then we end our market day with amazing crepes. Such a great way to spend summer mornings.",
            "author": "Kacie R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-15",
            "description": "Lots of vendors, so the selection is great. The Mexican and crepe stands are where it's at. It's a fairly large market, probably the biggest in the burbs, but parking is a challenge.",
            "author": "Brian F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-23",
            "description": "This farmers market is huuuuuge! The variety of options are amazing, some places better than others! It's more produce heavy than most I've been to which is great! There was a stall in the back that sold 10 zucchinis for $1. I must be in heaven!\n\nLocated right next to the public parking lot downtown, it's conveniently located. In case you're hungry there are a few vendors that sell ready to eat food like empanadas and salads.\n\nGood place to buy fresh produce at reasonable prices! Also great to just stroll around and admire at bustling produce lovers!",
            "author": "Sunny K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-30",
            "description": "Been coming forever. Wonderful way to spend an early Saturday morning. Terrific farmer's/staff. Food demos. Artwork. Ample parking. Fresh, fast, convenient.",
            "author": "Renee R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-11-30",
            "description": "This farmers market was great. Lots of fresh fruits and vegetables,  friendly staff. I will definitely be back",
            "author": "Kamilah S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-06-02",
            "description": "Easy to locate, super convenient garage parking if street is unavailable. \nTip - first hour or two in the garage is free. Nice mix of vendors, honey, cheese, meat, veges, fruits, eggs, herbs, baked goods, etc. \nThe day we were there we scored some really nice asparagus. \nSome simple live music working for tips adds a nice touch.\nPeople watching and the spirit of youth is all around you.\nPlenty of shop and dine nearby if needed.\nTip - not that I witnessed in the farmers market itself, but around the rest of Evanston lots of panhandlers. To the point where they will even walk up to you at a table in a restaurant while you are eating - unsavory.",
            "author": "michael w."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-27",
            "description": "Great framers market! I wish we had a farmers market like this at home! Such a great variety and prices are pretty good.",
            "author": "Elizabeth G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-11",
            "description": "As an Evanston resident, I feel lucky to be so close to this Saturday farmers market. My family looks forward to it every weekend! Its become a tradition to visit the market. There is a variety of great vendors that are warm and friendly. The orifice are fresh and in season, so there is always something new.",
            "author": "Diana S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-11-03",
            "description": "Best farmers market in the Chicagoland area!\n\nGreat food - tamales, elotes, crepes and lots of great baked goods from Sweety Pies in Skokie to Bennison's donuts from Evanston!\n\nOrganic and locally grown produce that while yes it's more than you pay in grocery stores, I'd rather know where my food came from and pay the extra to feel secure it's not a GMO product grown in Mexico then covered in wax and shipped here.  Great meat vendors with grass fed nitrate free meats and allsprts of eggs from duck to quail to chickens!  \n\nThe most variety of apples I've ever seen can be found at Nicol's Farm, they also have rare items like salsify and fresh mushrooms harvested from the woods (chicken of the woods, hen of the woods, etc), they also have a few varieties of gigantic sweet potatoes!! \n\nThis is an awesome way to start any Saturday with a fresh cup of Intelligentsia coffee from Sweety Pies with a scone or croissant or crepe!!",
            "author": "Jason D."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-07-11",
            "description": "I'm going to say that for vendors and quality of produce this market gets a 5!\nBut beyond that it gets a 1 star. Ok first no dogs. Second there is security all over taking away from the whole farmers market feel. Also they need a bigger space it is way to compact. Since there are NO dogs allowed I will not go back!",
            "author": "Laura B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-24",
            "description": "Tomatoes and Berries and Corn, Oh My! \n\nAll that and a whole lot more! I came to the Farmer's Market to get some fruits to bring as a snack to the beach.  I read its reviews and knew there would be lots more than fruits available. I didn't get any fruits, but ended up having a nice lunch and browsing the stalls. I'll be back here for sure and here's why.\n\n*Lots of fresh produce. some of the stalls carry the same thing, but sample when they offer, that might make a difference when you're ready to buy. \n\n*Spacious. Lots of room for browsing without feeling claustrophobic, totally wheelchair and stroller accessible. \n\n*Kid Friendly. I was so surprised to see small tables and chairs for the little ones to sit. There were also coloring pages offered and a huge bin of crayons.  And sidewalk chalk! Oh my sidekick had so much fun with the sidewalk chalk.  I don't know if that's the norm, but I totally appreciated a fun diversion for him. \n\n*Food stalls like crepes and tacos. The crepes stand is a favorite of mine--I think they were at another Farmer's Market I visited in Portage Park last year.  I also spied elotes from another stall but I was too full from the crepes to try one. I spied smoothies and coffee, fresh baked items from Bennison's. You could really have breakfast AND lunch here!\n\nA fun way to spend some time before checking out other things Evanston has to offer.",
            "author": "Aimee M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-13",
            "description": "This is a quaint little farmers market. I don't know what to say except to throw some shout outs to my favorite booths. Holler at the place that sells adorable mini orchids at $15 for one or $25 for two. \n\nAwesome Mexican stand with Tamales and tacos. \n\nAnother place has empanadas which hello, yes please?\n\nAnd I can't forget the smoothie stop where they serve blueberry, strawberry, or mix with cider made with honey crisp apples and blended with ice in a vitamix. The only thing is the dude spilled the smoothie all over the cup when he tried to pour it out of the blender. Come on, butter fingers! :p",
            "author": "Patrick T."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-08-22",
                "description": "Nice market with lots of good local selections.  Great for lunch as well. Good for kids. Lots to taste from.",
                "author": "Tamir G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-11-16",
                "description": "Of all the farmers markets I've visited in Chicago and other suburbs, the one in Evanston is hands down my favorite. They have a wide selection of all sorts of seasonal fruits and vegetables including organic.  Having enjoyed fresh, locally grown produce from here all summer long, it's hard to go back to the regular stuff at supermarkets and even Whole Foods which now seem tasteless by comparison.  \n\nPrices vary from one vendor to another.  Some stalls can be a little expensive but there are also several with very reasonable priced ones, about the same or even cheaper than grocery stores.  Make sure you survey the entire market because many vendors are the selling the same produce at different prices.  \n\nIn addition to fruits and veggies, many stands sell fresh flowers, artisanal cheeses, breads, baked goods, and specialty items like balasamic vinegars.  There are street food vendors too selling things like tamales and crepes.  \n\nOther useful information to know:  The market is cash only.  Easily accessible via the Purple line and there is parking  lot nearby for those driving.  It can get a little crowded later on so come early.",
                "author": "Ali Z."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2014-06-13",
                "description": "I just went there, early June, and they had tomatoes.  This should be enough said, but just to clarify: there is NO WAY that tomatoes are harvest-able(not listed as hothouse or anything) in Michigan now.  These were supermarket tomatoes, straight up: round, pink, supermarket tomatoes, and lots of stalls had them. All you should see in early June is like lettuce - but these guys have peppers, tomatoes, eggplant, green beans - all the stuff you get in deep August.\nSo:  if the tomatoes are a scam, and everyone's in on it, what else?  $5 for four potatoes, for one; $8 for a pint of strawberries, and so on.\nLettuce is good.  Cute atmosphere for very well-heeled hippies and their long-locked children.  Vendors are great at making you feel like a foodie; you'll come out $60 lighter.",
                "author": "Sally W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-06-03",
                "description": "Wow, the market is back and better than ever this year!  Being early in the season, you don't expect much produce yet.  But they have expanded the market into a new row and are now pushing the boundaries of that big parking lot.  The newcomers on the eastern edge are mostly craftspeople and high-end foods such as a fancy cookie vendor and a pie vendor.  But also there are now hot-food vendors!  You can get crepes made to order at one end and tamales at the other.  (The crepe menu was so tantalizing--next time we will skip breakfast before coming!)  There are at least two more pastry-type vendors too, including Sweety Pies of Skokie.  One outfit selling smoothies may have been there last year, I think, but is still relatively new.\n\nSo now you can get all the produce, herb plants, and flowers that you need for your summertime domestic adventures, plus see all your old prepared-food favorites such as the baked cheese guy and the cider guy, AND have a delicious snack (or three) while you do it.  They even added tables and chairs in the shady area right by the parking garage doors!\n\nAll the expansions are great, but thank heaven for old reliable Stover's because I had run out of pickles from the winter.  As long as the market is open, I don't go anywhere else for pickles, jams, and salsas.",
                "author": "David R."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2016-08-13",
                "description": "We were so excited to drive up from Chicago and spend the morning at the market. My husband checked  on the website and did not see anything about dogs being prohibited. So we brought our dog, with the idea that if they were actually not allowed, one of us would take her for a walk while the other supported local farmers. So, we parked in public parking and came with the dog. We didn't know the stairs let right out into the parking lot that houses the market. In any case, this woman who was somehow associated with the market got right up in our faces and said \"No dogs allowed!\" I said, \"Ok, we looked it up online and didn't see that.\" I started to walk towards the street to take our dog out and my husband stayed back a moment longer to say that he had looked on the website. Then I started to take our dog for a walk on public streets while my husband shopped. About a block away, someone started yelling, \"Ma'am!\" So I finally turned around and the same aggressive/angry woman was running after me down the block with a cell phone held up! I started walking faster because now that she was stalking me, I felt threatened. She was trying to get me to come look at her phone, to prove that it says dogs aren't allowed. I said \"We left, what more do you want me to do?? Go away!\" And she kept after me, and yelling something about that they do have it on the website that dogs aren't allowed. I was like, \"You made your point, leave me alone!\" But she kept up, so I finally told her to f-off. And she still kept after me, this time saying something about getting a police officer. I mean, she was the one threatening, harassing and stalking ME! What kind of psychos does the Evanston Farmers' Market hire?? Who was this nut job? She followed me almost two blocks away! I've been to a lot of farmers' markets in my life-- Santa Fe, Madison, WI, Chicago, etc...Never have I been so mistreated and harassed, all over a dog who didn't even do anything? I called my husband before he could buy anything there and he came and got us. We wound up going to the Willmette Farmers' Market, which actually has organic and natural produce (unlike Evanston), allows dogs and doesn't have crazy people who try to attack you for making a mistake working there. Needless to say, we will NEVER go back to the Evanston Farmers' Market again. I suggest the city of Evanston conduct background checks before allowing people to work there, as well. It was anything but welcoming or relaxing.",
                "author": "Mopsie B."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2014-06-24",
                "description": "Maybe it's because I grew up in Oregon, or maybe it's because I've never been to a farmers market so close to a big city, but I was pretty disappointed by the size of the farmers market. I expected more vendors, more stalls, just more of everything. \n\nThat being said, it's always pretty fun walking around, grabbing breakfast, sampling fruit, and shopping. I think it's a fun, energizing way to start out the weekend.",
                "author": "Samantha M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-07-06",
                "description": "Over 50+ vendors and an amazing selection. I personally love getting the duck eggs here, fresh peas (if they have them) and cherries. All the vendors are super nice and let you try all the produce. There is even a knife sharpener vendor and some even take credit cards. I will say though that this place is pricey! It doesn't seem like a lot at first but $60 goes by quick! I am willing to pay more for the fresher ingredients. Really love the atmosphere, the variety of vendors (from cheese to cherries to scones), and also the free 1 hour parking in the lot.",
                "author": "Eugene F."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-08-13",
                "description": "I really like this Farmers Market it is a manageable size with a nice variety of vendors. I can always find what I need. Some markets have resellers but not here.\nI also buy eggs and meat here and they vegetable stands give you the best of the Illinois/Wisconsin/Michigan farms. \nThere are plenty of baked goods and foods to snack on. There are usually vendors selling empanadas etc.\nBeing a dog lover and owner I understand wanting to take your dog along. I also understand why this is just not a good idea. I have been to markets that allow dogs. Not all dogs socialize well with other dogs or children and I have witnessed some tense moments. I have seen dogs relieve themselves on table legs and baskets. I have seen dogs just being miserable in the crowded spaces while their owners are trying to do business and can't pay close attention. I am sure this might some people unhappy and claim their dog is well behaved. Well unless this is addressed on a dog by dog there needs to be a blanket policy. The Farmers Market is not a dog park; it is more like a grocery store.\nEnjoy the market and all of its seasonal splendor!",
                "author": "Annie S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-02-11",
                "description": "I do this every summer. How did I not write a review? This is the most bad ass summer market you can possibly go to. I have found things like rare vegetables, actual rosemary trees (as in 5' tall), and other awesome things. This is hands down the best place to go in the summer. There are so many businesses and things happening it is absolutely awesome. \n\nCome by, get food, get vegetables, meet people, see the awesome hipster evanston fun stuff. There are too many different things to even try to sum it up with a review. There are about 10 different food stalls highlighting local good, but really the wealth of how amazing this place is can be more accurately summed up by looking at the wealth of photos. You have every option from flowers to vegetables to baked goods to goat cheeses to organic meats to organic fruits and vegetables to plants. This is the one stop shop for anything food in the summer.\n\nOh, and they validate parking and sharpen knives, too.",
                "author": "Matt R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-08-20",
                "description": "We had an excellent omelet (well priced at $10) at Azteca Cocina's stand - their classic Azteca omelet, which came with fried potatoes, diced tomatoes, onions, and three tortillas. Came with spinach, cheese, mushrooms, onions and chorizo sausage and enchilada sauce. Delicious! We were tempted by Sandy's corn, which is have shaved roasted corn covered with taco fixings. Azteca Cocina also offered Mexican street corn on a stick, and fried Mango on a stick.  All in all, a great addition to a great Farmers Market.",
                "author": "Patricia P."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-08-03",
                "description": "Really nice farmers market. There are so many stands selling fresh fruits, veggies, eggs, meat, flowers, honey, olive oil, baked goods, and more. There is validated parking for the parking garage next door.\nMore expensive than MN markets (where I'm from).",
                "author": "Anya A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-07-05",
                "description": "There are very few things that drag me out of bed at 7am. Seriously. I'm rarely conscious before 10am (it used to be 2pm - baby steps!)\n\nThe Evanston Farmers' Market is a special place though. Usually on Friday, I see Seedling Farms tweet about what delicious fruits they will be bringing to market and spend that evening, tossing and turning in my sleep - Will I wake up in time? Will there be any WILD strawberries left? How much longer will strawberry season last?\n\n(Isn't my life so exciting?)\n(I dig manage to buy some WILD FRAMBOISE - $7/pint but so worth it!)\n\nAnyway, this market has a Seedling Farms stand and much, much more!\n\n- Bring knives and get them sharpened.\n- Treat yourself to a stellar iced coffee or latte (...from a place that begins with P - Puerto Rico? Peru? I don't know.. it was early)\n- BENNISON'S BAKERY (I live down the street from the storefront. I love these guys)\n- Great Harvest Bread Co! (They are further away, and I love being able to buy apple scrapple and their popeye loaf at the market)\n- Produce, produce, produce! (Fruits galore, many many greens - I spotted shiso leaves last visit!)\n- Farm Fresh Eggs\n- Grass Fed Beef\n- Cheeeese, glorious cheese. \n- The Stover's guy sells the best things in jars - jams, salsa... the bread and butter pickles are divine. \n- Plants and flowers (hint: I really like peonies. Buy me some!)\n\n\nTips: \n- Come early.\n- EFM is located right next to a parking lot. Life couldn't be easier.\n- Cash is king.\n- Make sure to browse the entire market and shop around. Many stands sell the same things, so taste and price compare. \n- Make friends with your vendors!\n- Say hello to the Yelp sunglasses wearing girl drinking iced coffee while juggling a half flat of fruit (that'd be me!)",
                "author": "Yanyao N."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-08-23",
                "description": "My girlfriend and I both lived in Madison, WI for 4 years while going to school up there and the farmers market around the Capitol is pretty legendary. That said, this is the best farmers' market we have been to outside of Madison.\n\nVery good produce and a good mix of other booths/tents (tamales, crepes, scones, smoothies, etc.). You can in fact find some very good deals here as well. At one place you get 10 items of any combination of zucchini (green and yellow), eggplant, and green bell peppers for $1.\n\nVery nice people for the most part. While I like the scones for the price ($3) the people at that booth have not been the friendliest.\n\nIt is also much appreciated that they validate parking for the parking garage next to it. Well done!",
                "author": "Andy S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-08-21",
                "description": "Evanston has a lot of positives which make living here a treat, and the downtown Farmer's Market is one of the positives. There is a wonderful selection of fruits & vegetables to choose from, not to mention flowers, organic meat, poultry, and eggs, and some delicious empanadas. Parking in the Evanston city garage is free if you get in & out in under an hour.",
                "author": "Daphne L."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-07-06",
                "description": "Definitely smaller than most farmers' markets, but still a good selection! I came to look around and grab a bite to eat, and this market satisfied both. There's a really good crepe station and a stand that sells baked goods like scones, which was a huge plus. Lots of berries, cheese, flowers, and herbs. I do wish they had more stone fruits though! Overall, cute little market and fun to walk around.",
                "author": "Erin Y."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2011-10-16",
                "description": "The Evanston farmer's market is overrated. It's pricey and the food is not local - don't be deceived. The vast majority of it is trucked in from Michigan, which to me seems to defeat the purpose of buying local.\n\nI guess if you want to buy produce it makes sense, but overall it's kind of just like buying corporate. I've been a couple times and basically left disappointed every time.",
                "author": "Tommy J."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-10-10",
                "description": "Okay, I changed my mind.  This farmer's market is an asset to Evanston, and such a nice alternative to dragging yourself to Jewel or Whole Foods.  It's refreshing to get to handle the produce yourself and know that it actually came from the ground not so far away.  Definitely love the vendor (Nichols Farm) with like 20 bins of different apple varieties, all at $2/lb.  Today I found the greenest napa cabbage I've ever seen.  I also bought string beans and daikon that make the supermarket's look diseased.  \n\nTo boot, there are kiosks everywhere with community organizations and the like, and everyone is always just SMILING!  Any Saturday morning I come here is always a pleasant one.  I'm going to be sad post-Halloween when the space is filled with cars again.\n\nStill miss NY's and hate the hours, though.",
                "author": "Ju L."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2011-12-14",
                "description": "Pros:\n- Good selection, fresh stuff\n- Nice samples\n- Unlimited zucchinis over the summer. Basically there's this one stand that lets you stuff all the zucchinis you can fit in a plastic bag for $5, which is like 20 zucchinis. And then you go home and make zucchini everything - stir fry, fritters, bread, pizza - until you're sick to death of zucchinis (until next summer). \n\nCons:\n- Can be pricey, some of the stuff is more expensive than Whole Paycheck even :/\n- Where is the kettle corn? Wah\n- Not open yearlong, which is understandable, but I wish they could just move to an indoor location or something.",
                "author": "Helen S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-04-04",
                "description": "The Downtown Evanston Farmers' Market opens May 4th and runs through November 2nd from 7:30 am to 1 pm.  This wonderful Saturday market is tucked behind the Hilton Gardens Hotel at Maple and University in downtown Evanston.  There is free parking in the Maple street garage but don't forget to get your ticket validated at the City of Evanston tent.  Or take the purple line and jump off at Davis and walk a block north. However you get there, just get there.  This is the market to be at! Almost all of the farmer vendors have been selling at this market as second generation vendors. There are the traditional farmers, organic farmers, free range, no chemicals- just ask them cause they are happy to tell you all about their growing practices.\n\nCome to the market hungry because there is so much to eat there now!  There are Crepes, tamales, breakfast sandwiches, bakery items, smoothies- it's a Saturday  morning destination spot. Bring your spouse, your kids, even the mother-in-law!! There is something for everyone! New this year for the kids - the Spud Club! Join as a tater tot or a small fry. There will be weekly activities for all to enjoy- music, food demonstrations, giveaways!\n\nSo put the Downtown Evanston Farmers Market in your planner, in your calendar, on a post-it note on your frig! There is nothing better than to know where you food comes from and the farmer that picked it the day before.  You can't get fresher than that!\n\nStop bye the City of Evanston tent and say hello! \n\nHope to see you soon!\n\nYour Market Manager",
                "author": "M G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-03-24",
                "description": "Every city I've lived in I check first where the local farmer's market is once I get settled. And I'm so pleased to find that Evanston has such a great one! Unfortunately, I am usually at work when this one is going on but my friend always takes my list and picks them up for me. Rosemary and Sage plants. Pistachios. Apples. Green Beans.  Fresh cut flowers. It's so incredibly important to support the local market, folks. This is literally grassroots at its best.",
                "author": "Tracey B."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-11-05",
                "description": "Great selection of produce, flowers, meat, cheese and all kinds of other goodies!! For the past month or two I've been picking up weekly flowers here. Lots of great vendors with potatoes, brussels sprouts and even a few meat vendors. I'm so sad that this past Saturday was the last farmers' market of the season. Can't wait for Spring already!",
                "author": "Kate M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-08-12",
                "description": "People you want to know something horrible about me?  I actually HATE Evanston.  Seriously I do & when I tell people that, I get truly awful looks from my friends who adore it.  I have no idea why, sure it is pretty & such, but ick--it is the burbs!  \n\nBUT, every Saturday morning, I put my personal feelings aside & attend their weekly farmers market.  Why? you ask, well the answer is simple--BECAUSE IT IS FRICKING FANTASTIC.  Yup, I swallow down my city pride & head up here to partake in the greatness of this market.  This season while we have had some cold weather, the market has been warm & inviting.  Another huge plus, is that they have parking in a garage--holla!  \n\nThis is my go to market & it gets my highest recommendation.",
                "author": "Unity O."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-04-03",
                "description": "Best fresh produce in the area!!  Seasonal too, so you know everything you get hasn't been shipped across the globe or sat in a freezer in the middle of nowhere.  Kudos to the hard workers that keep this going!",
                "author": "Mick M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2007-08-13",
                "description": "The Evanston Farmer's Market is one of my favorites in Chicago, despite its location in Evanston. There are so many good things about this market:\n\n1. Relative to the other markets in Chicagoland, it is HUGE\n2. There is parking. Lots of parking. \n3. A few of the farms here don't go to other markets in the city - so you are getting something special when you come here.\n\nMinuses:\n1. Some of the musicians are godawful\n2. Prices are high relative to markets in other states like California (but come on, we're in Illinois...2000 miles from California. Like it or not, you're stuck here, fella).\n3. Evanston people can be incredibly rude, especially when racing for the specialty produce in one of the organic booths (cough cough)\n\nSome folks like to complain that our farmer's markets are nothing compared to those in California. True, they are smaller and don't have as much to choose from. Illinois may not be the nation's garden, but during the months that the market is open, the produce is lovely, tasty, and abundant. We don't have the climate for everything you can find in CA, but what we do have is delicious for five months of the year.",
                "author": "Lindley E."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-08-03",
                "description": "I officially eat more produce than anyone I know.  Seriously, I'm not a vegetarian, actually quite carnivorous, but I own like 10 vegetarian cook books because I'm always looking to find new ways to prepare veggies and fruits.  I thank the Borders clearance section...for some reason its always packed with cook books.  \n\nI normally hit the little farmers markets near me on the weekends and last weekend I decided, after reading these reviews, to try the Evanston market.  So, last sunday I hop in the car and head over there.  I get there and \"Where the fuck is it???\"  I ask myself.  Well, apparently I didn't read well enough because its only there on Saturdays.  OOPS.  So this weekend I am destined to get there.\n\nSo this Saturday I hop in the car (sound familiar) and hed over there.  I drive around and find it.  I didn't have to park too far at all and besides, there is a parking garage if you need.  WOOO HOOO!!!!  Score....I'm in produce Shang-ru-la!  There is a quite a selection and a good amount of vendors.  Farmers market produce is always amazing.\n\nIts always a good idea to cruise the market first and check out the selection and pricing.  Often times there will be a difference in price and no one is looking to purposely overpay for their produce.  I leave the market with some drip-down-your-face Michigan peaches, a bushel of fresh basil, some purple and orange carrots, some super sweet thin-skinned tomatoes, green peppers, white egg plants, swiss chard, zucchinnis, cucumbers (one that was a little organge ball shape that I've never seen before) and a yerning desire to head back there next Saturday morning.  \n\nThey had one fresh bread vendor, one meat vendor and one cheese vendor.  I would have liked to see more, but hey...I don't eat cheese, I work for a meat company so don't need to buy it, and I don't buy much bread or pastry, so I'm not sure what I'm complaining about.  One vendor did have fresh eggs, But I forgot to grab some on my way out.  Oh...and the flowers were fabulous.  I also noticed a venedor with baked goods from a church and another for some children's organization.  Shame on me for not paying more attention to these NFP organizations, but I was on a veggie mission and couldn't eat their baked goods anyway.\n\nBottom line:  if you love produce and fresh air markets, you wil not be sorry visting the Evanston Farmers market.  Just don't go on Sundays, you'll be the only one there.",
                "author": "Jessica C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2006-06-18",
                "description": "This is probably the best farmer's market I've been to.  The selection is amazing, and the people are so nice.  When I was here, they also have live music.\n\nMy favorite things to get at farmer's markets:\n-- spinach\n-- kale\n-- tomatoes\n-- green onions\n-- fresh spices (like basil, mint, etc)\n-- radishes\n\nI can't wait for cherries.",
                "author": "Urszula H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2006-07-04",
                "description": "I think that I'm in love and so happy that I moved to Evanston - it makes me almost not miss living in the city anymore.  The fruit was so fresh that I couldn't resist eating them as soon as I bought them.  The spinach was another fresh item that I couldn't wait to go home and start making food with it (spinach quiche, spinach/feta cheese omelettes, etc)\n\nI'm definately coming back soon!",
                "author": "Dee W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-05-08",
                "description": "I LOVE LOVE LOVE my farmer's market in Evanston... plenty of produce, much of it organic... and even the farms who are not 'certified' often use minimal to no chemical pesticides.  It is worth talking with the farmers and understanding their methods... many of them cannot afford the process of becoming certified.  \n\nVegetables, fruits, berries and flowers... not to mention there are often local artists playing their instruments and singing... and several times a year the market hosts 'art show'  where I've purchased several 'must have' one-of-a-kind pieces.\n\nThe garage parking is great because #1 you ALWAYS get the 1st hour free, and #2 the farmer's market validates parking! (The market is located behind the Hilton Garden Inn on Maple, adjacent to the parking garage.)\n\nHere's to another succulent, health*filled, & delicious summer!",
                "author": "lindy s."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-10-19",
                "description": "My Saturday mornings are filled with banjo music, little kids dancing around an accordion player, CHEESE SAMPLES, mini pumpkins (I got 3 for $1!), apple cider, RASPBERRY RHUBARB JAM, caramel apples, lettuces for my Russian tortoise, JUICY PEACHES, and other glorious delights. Love the Evanston Farmer's Market.",
                "author": "C Z."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-08-13",
                "description": "This isn't my regular farmer's market, but I love to go here when visiting family. I think this market is notable for its astounding variety of interesting produce: ground cherries, wild plums, Asian braising greens, purslane, sour cherries, and wonderfully colorful heirloom tomatoes. I've found some really interesting foods here. The selection of greens is particularly good. I also love the musicians tucked in between the produce stands. \n\nThe blind spots? Evanston isn't exactly farming country, so things so have to be driven in from relatively far away. That means that they do not have a good selection of fruits that are very delicate when ripe like peaches or blackberries. Animal products are also scarce- the cheese, while good, is tightly packaged, and the meat is only notable for being relatively local, otherwise it's the same grain fed beef you find at Outback.",
                "author": "Melissa M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-06-02",
                "description": "vegan tamales - check. nice produce. good size. wish there were more vegan products",
                "author": "Sophia T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-08-13",
                "description": "The best farmer's market in Evanston. We especially love seeing our friends from Seedling Farm and Neighborwood there. Friendly people and wonderful products",
                "author": "Sophie K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-12-13",
                "description": "Favorite farmer's market in the Chicago area. Good selection of produce, but without the huge crowds at the Green City Farmers Market in Lincoln Park.",
                "author": "Jennifer W."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2010-05-15",
                "description": "I guess I was really confused by all the positive reviews for this market. I thought it would have much more to offer. I normally go to the Green City Farmers Market in Chicago, which is huge, but was in Evanston and heard good things about this one so I thought I check it out.\n\nI had a list of of fruits and veggies to get and only found about a quarter of the veggies on my list. What was worse was that there was no fruit anywhere. No berries, apples, pears, etc. nothing! Which I thought was really strange given what time of year it is.\n\nThey have the space for more vendors, since it's a really big parking lot that they are located. I guess I just expected more based on how everyone rated it. Perhaps if I try again in a few months they will have more to offer, since this is only the second week they have been open this year.\n\nThey do offer a lot of plants and flowers.",
                "author": "A A."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-11-04",
                "description": "Buy Local, support the farmers!\nThis Farmer's Market is great- be sure to get there early. Great produce, generally good prices.\nLove the multiple colors of produce :)",
                "author": "Jenny S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-07-24",
                "description": "Gotta love the Evanston Farmer's Market!  There are always a ton of booths with a WIDE variety of veggies, fruits, flowers, herbs, and homemade jams/jellies/relishes/etc.\n\nThe market is easily accessible with plenty of parking for those who need it.\n\nPossibly the only downfall is that it is only open one day a week and closes early in the afternoon.  But it's the closest thing this country girl can get to the farmer's market back home.",
                "author": "K F."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-12-28",
                "description": "I'd give the EFM five stars, except that it pales in comparison to the market in Madison. Still, as far as I can tell, it's the best weekend farmer's market within a five-mile radius. Sometimes some of the prices take me aback a bit, I don't always personally dig the folky musician vibe (wouldn't a hep jazz clarinetist serenade the arugula as well as a hairy fiddler?), and not every single vendor is consistently wonderful, but there's always some interesting, fresh, tasty stuff to be had, and I'm glad it's there.",
                "author": "ann s."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2010-09-29",
                "description": "This is a nice little farmers market that certainly suits its purposes if you live in Evanston. I definitely don't think it is worthwhile to make a trip all the way up here though if you live in the city. The actual market itself really isn't that big. It MIGHT take up half a parking lot and that's pushing it. There are certainly a lot of stands but I can't really say I am ever impressed with the variety of produce that is available. It seems as though about 80% of the stands are selling the exact same things. Also, the produce is quite pricey as far as farmers markets go. In NYC and LA, the farmers markets offered a bargain on delicious produce so this gave me some sticker shock. Everything is great quality though. I am also a huge fan of the fact that Benison's Bakery sets up a stand here. I love buying a fresh croissant or muffin and enjoying it while checking out the rest of the market. Another irritation though is that they don't allow dogs. Every other farmers market I've been to lets you bring your dog in with you! I prefer the pooch friendly!",
                "author": "Marina P."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-07-05",
                "description": "I absolutely love the Evanston Farmer's Market, and I'm there every Saturday morning that they're open - I go through withdrawal the other half of the year! If you want to buy fresh, locally grown produce, this is the place to go. Be sure to arrive early for the best selection. And, if you're new to buying at a farmer's market, be flexible....the selection varies by what's in season. I have my favorite farmers, including Henry's (check out the wall of lettuce!), and the farmer at the first stand closest to the garage for strawberries, raspberries, blueberries, etc.(not sure of their name! they're from Michigan).",
                "author": "Joanne L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-05-23",
                "description": "How do I survive the winter months with no Evanston Farmers Market?!  Not only does this market have amazing selection (relative to what is in season), there is FREE PARKING ON THE SAME BLOCK!  Halle-f'in-lujah!",
                "author": "Martha M."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-05-18",
                "description": "I hit this market this past Saturday, when it opened.  Since it was opening day, still fairly early in the season, and a bit nippy, it seemed a bit sparse, but I was assured that it will fill out very quickly.  Lots of really great looking produce.  I picked up some rhubarb (made a pie last night, folks today said it was wonderful!), asparagus (had some tonight - delicious), fingerling potatoes (also had some tonight - yum), and cheese curds (been snacking on those and they're not the greatest I've ever had but they are good), and some frozen blueberries from last year's harvest (haven't tried those yet but it' son the list!).  The gals I was with picked up some jarred salsa stuff and some bread.  There was plenty of spinach, plants, and other stuff already.\n\nCan't wait until we get into berry season, full-on..... but I'll be heading back this coming Saturday!",
                "author": "April F."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-06-12",
                "description": "Only one complaint.  For a market this size it is amazing that on most weeks nobody is selling (good) coffee.  \n\nOtherwise, great stuff and a fun way to start off the weekend.",
                "author": "Jason M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2007-07-18",
                "description": "but, scope out all the possibilities before making decisions.  one of the first vendors when you come in has really great stuff, but last week they were charging $2 for a single bell pepper, of any color (3 for $1 in licoln square, and 2 for $1 at the stand diectly across the way)\n\nThe old man selling peaches on the far west end is quite the salesman. every single stand had them for $5 but my boy heard his pitch and insisted he was our man---\"so juicy you'll need to eat 'em with a paper towel.\n\nshitty bakery option though.",
                "author": "melinder b."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2010-07-15",
                "description": "Okay, so this has the staples but it is just okay. I know, I know, it is early in the season but it wasn't very full. Hopefully it will grow as the harvest does.",
                "author": "Sarah L."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "City of Evanston",
    "address": {
        "addressLocality": "Evanston",
        "addressRegion": "IL",
        "streetAddress": "University At Oak",
        "postalCode": "60201",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/VaMO5wcNj-KfBzTBstf3gw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18474488045"
}