{
    "aggregateRating": {
        "reviewCount": 7,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-09-14",
            "description": "I eat lots of fruit and vegetables. And this market saves me $$$!\nI take advantage of their weeks specials and plan my meals around the fruit and vegetables that I purchase that week",
            "author": "Andre J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-06-19",
            "description": "I was introduced to this market by a friend.  I now buy all of my vegetables from here.  Sometimes there are items that are not in good condition, but very few.  The prices are always lowered then grocery stores.  This is basically a market that buys surplus from suppliers.  By cutting out the middleman( grocery stores) you get a price reduction.  I have to admit, it's now one of my favorite places. I give it four stars simply because they don't have corn the way I like them too.",
            "author": "The Grapevine W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-05-25",
            "description": "I must come here on off days. I cannot alway find the veggies I need. It's touch and go because more times than not the fruit is mushy, bruised or over ripe. A lot of my friends love this place. I must have bum luck. \n\nI do have luck with the pineapple and love the fact they core and slice it right there. You can keep the core if you let them know you want to keep it!!",
            "author": "Leslie L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-05-09",
            "description": "Great selections on there produce and plenty to choose from! Great prices friendly staff.",
            "author": "Arthur S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-09-16",
            "description": "We visit the farmers market quite frequently, at least twice or more a week. Yes the prices are fair and yes the produce is descent at times. My issue is on several occasions due to wrong prices on the boxes, or just incompetent cashiers myself and my fiance have been treated very poorly. He owns a restaurant and uses this market for some of his menu because unlike having produce delivered - here he is able to sort through the produce. There is a cashier there by the name of Ophelia and she is absolutely rude, nasty and loud! After ur wife some few altercations with her I am completely shocked that Jimmy the owner continues to allow her to carry on in this manner towards his customers. I am NOT saying the customer is always right but there's a way to deal with a customer when the discrepancy falls in the hands of the business. Until something is done with this woman we will not be returning! Not only will she cursed you in front of the other customers she will loudly gossip to the customers about you as you are standing there! Being in a business where I have to deal with customers and the public I would never imagine to do this to anybody! Hey Jimmy figure it out - when you have so many complaints about one employee and your other employees complain about her as well it is time to clean house!",
            "author": "Nette B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-07-01",
            "description": "I came in with the family and was pretty surprised at the amount of different items they have, and the diversity of their products.   In addition to the produce market, they have a very well stocked Middle Eastern,  Indian,  and Mexican section.  They also carry some products from Eastern Europe.  Prices are reasonable.  Never saw buckets of Feta cheese, lol.  Come in and explore, you'll be back.",
            "author": "Jim B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-29",
            "description": "Great fun place to go. Great produce. They will even core your pinapple when you buy one.  very friendly and well priced.",
            "author": "L L."
        }
    ],
    "priceRange": "$",
    "name": "Evans Farmers Market",
    "address": {
        "addressLocality": "Merrillville",
        "addressRegion": "IN",
        "streetAddress": "8201 Taft St",
        "postalCode": "46410",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/pQeMo0TG6Fsefa3gON5O-A/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}