{
    "aggregateRating": {
        "reviewCount": 28,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-11-11",
            "description": "What a great treat outside of the MCA. I usually opt for Gayles Best Grilled Cheese Sandwich or a savory crepe. They have a good amount of fresh produce and have bought many apples that I've used in apple pies. The flowers change throughout the summer into fall. The vendors are very friendly and knowledgeable.  Once you get your lunch or produce, you can sit on the MCA steps and do some people watching.",
            "author": "Maria H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-08",
            "description": "This Farmers Market is run by the Streeterville Organization of Active Residents (SOAR).  It should correctly be called the \"SOAR Farmers Market at MCA.\"\n\nThe Details:\nLocation-Museum of Contemporary Art Plaza which is in front of the museum itself\nDates:  Tuesdays June 5-October 30, 2018\nTimes:  7am-2pm\n\nA substantial and diverse farmers market with fresh fruits and vegetables, plants, a cheese stand, a soup stand, flowers, and an incredible fresh baked artisan bread stand!\n\nThe local Alderman also has a table there.\n\nA real gem that not many people know about....will not disappoint!\n\nFYI-SOAR also does all of the plantings and up keep of the gardens at the Lake Shore Park down the street!  Amazing organization!  Thank you for keeping the neighborhood a neighborhood that everyone can enjoy and be a part of.",
            "author": "Christina S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-17",
            "description": "Our city markets are always amazing. Depending on the day of the week you can find a market in a neighborhood.\n\nI like this market because it is located directly in front of the Museum Of Contemporary Art on Tuesdays. Just off Michigan Avenue you can find all that local farms have to offer.\n\nThe vendors are varied and very friendly. The crepes are a nice treat while shopping for healthy veggies & fruit.\n\nStreet parking near by and bring cash.",
            "author": "Rhonda F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-28",
            "description": "The food s yummy and the flowers are beautiful! Picked up some incredible soup today. Always something new! The prettiest farmers market in the city !",
            "author": "Diane B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-17",
            "description": "Really enjoy the fresh farmers produce and baked goods on Tuesday. What a great addition to the north Michigan Avenue experience",
            "author": "Natasha Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-10",
            "description": "Tuesday is a jam packed day of activities for the MCA.\n\nFarmer's Market, free admission for Illinois residents, and Tuesdays at the Terrace (free jazz music with a great buffet set up for $25/person).\n\nI love picking up a tamale with portabella mushroom salsa and parking it on the steps of the MCA as I people watch.  I've picked up full gorgeous bouquets from one of the stands to brighten up the house on occasion.  Bring cash!",
            "author": "Dianne S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-16",
            "description": "Disclaimer: You are reading a review of a Farmer's Market by a girl who spends quite a bit of time in the Metro Phoenix area, but I enjoyed many aspects this market. Plus, you can't beat the location - steps from Michigan Avenue, with contemporary art interspersed among the tents.\n\nI tend to mostly dine out in the city, but I can always go for some fresh peaches and mushrooms and it's not too much trouble to cook up an ear of corn! \n\nI arrived here at 7:15 when some vendors were still setting up - others (flowers courtesy of \"North Wichert Gardens\") were already sending the earliest of risers on their merry newly acquired fresh flowery way! (me included ~ see pic!) \n\nThere's even a vendor offering made to order crepes in case you want a treat on the spot.  I found there was a decent selection of fresh and packaged items and everyone was pleasant. What a joyous way to begin a Chicago Tuesday. \n\nPS ~ Nearby street parking: on Pearson or Chicago Ave (FREE until 8am)\n\nPSS - When I met up with a friend at Lake Shore Park, we decided to go back for more ~ the pic shows all my loot!",
            "author": "Bonnie E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-16",
            "description": "They have a Farmers Market right outside the museum every Tuesday in the summer! They had so much stuff. A ton of fresh fruits and vegetables, few lunch stands, and some drink tables. Such a great idea. You can get some fresh produce and have lunch on the museum steps. Great change of scenery!",
            "author": "Nancy N."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-07-11",
            "description": "If you are Streeterville area, this is a great market to check out.\n\nThis morning to early afternoon market is just couple blocks east of Michigan Avenue so it is very convenient to visit before work or during your lunch time,  The market has certainly grown from the past years.\n\nThe market is good amount of vendors selling local grown veggies and fruits.  I will say, this market has one of the best flower selections.\n\nThe prices are comparable for being in the loop area.  I can find better deals in various neighborhoods.",
            "author": "Ken O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-12",
            "description": "Love love love Farmer's Market.  They're open every Tuesdays in the morning until 3pm? from Memorial week until the end of October. Great place to buy gorgeous fresh bouquets and in the Fall, pumpkins and squash.  The crepes stand is very popular.  Sometimes I just stand near it to smell the wonderful aroma of the crepes as they're being made.  If I'm not browsing and buying flowers, I'm usually sitting on the steps of the MCA and eating my lunch/people-watching.",
            "author": "Irene G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-14",
            "description": "What a nice little market this is! Yes, it is small, but they have just about everything. I went looking for a mix of mushrooms, and I was also hoping for some planted herbs--so much easier to grow your own than buy them every time. \nI went on my way to work, so close to their closing time and they still had both things I was looking for. And a lot more, so I spent a little time just browsing everything.\nI blanched a little bit at the cost of the mushrooms, but then I got them home and got a good look at the quantity and quality and realized what a good deal I had gotten!\nWill definitely return when I have a some extra time to look around at everything",
            "author": "Jules L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-04-26",
            "description": "This was an unexpected treat for me when I went to go to the Museum of Contemporary Art. At first I was wondering if I was lost or not in the right place until I saw the towering steps of the Museum and realized ... this IS the right place.\n\nThe market has tons of fresh produce and for those nay-sayers ... this is in the middle of the city, in the middle of what I would call the financial district of the city ... for you to be able to find this kind of market here is rarer than other farmer's markets in Chicago. Plus it's nice to grab a small fresh snack right before entering the museum or while on your way out of it. It's extremely convenient and the vendors are so nice!\n\nIt's a great stroll if you're planning to visit the museum anyway.",
            "author": "Lorrie M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-08-25",
            "description": "My supervisor told me about this farmers market last year, and I've been here every Tuesday (that it's there) ever since. My love for farmers markets sprouted from visiting farmers markets in Santa Cruz, California, and ever since, I've always been on the look out for farmers markets wherever I go. I mean, you've gotta love organic vegetables. \n\nThere isn't much of a selection, that's true, but you gotta keep in mind that this is Chicago, not California. There's plenty of corn and flowers, that's for sure. \n\nThis year, Saigon Sisters sells Vietnamese sandwiches and spring rolls here. It's about the only time of the year AND location close to work that I get to have my Vietnamese sandwiches for lunch. I think that makes it that much more special for me, even if I do have to pay twice as much as I usually would. \n\nThe fruits and vegetables are fresh though. I love getting fresh produce that are in season. Oh, and it's the perfect opportunity for me to use my Yelp tote bag. ;)",
            "author": "Jennie T."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-06-15",
            "description": "I just stumbled upon the MCA Farmers Market after a showing. It's humid as all get out today which may explain the sparse attendance. \nThere isn't much of a selection. Maybe it's the time of year? \n\nThe flowers looked beautiful! Although $$$$ I scored some super sweet and succulent little strawberries ($3 half pint) and fresh eggs ($5 a dozen)! If you have never had eggs right from the farm there is a HUGE difference. Try it!",
            "author": "Katrina S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-05",
            "description": "The best use of this huge, open plaza in the shadow of the John Hancock Center since this particular outside installation there: http://tinyurl.com/3tcs3u8\n\nIt's ideal for foot traffic moving from all directions in this busy strip, with people going between Chicago Avenue and Pearson Street, and a very pleasant park to the west. Plenty of CTA bus stops nearby as well.\n\nOn my last visit, I sampled a small container of Nancy Silver's delightful rhubarb-creme fraiche sherbet at the Snookelfritz table (http://www.snookelfritz.com/) and bought a \"buy-3-get-4\" special from dried fruit and nuts purveyor, Lehman's Orchard. I wanted very much their cinnamon flavored dried apple slices, so went for the dried cranberries, and two mixes of fruit with nuts as well. A friendly Grant Wood-inspired couple from Niles, Michigan were at the table (http://www.lehmansorchard.com).\n\nThere are a half-dozen more merchants here selling fresh veggies, fruit, fresh cut flowers, cheeses, and baked goods. It's all the good stuff you won't find on the Mag Mile, just steps away. Support the small farmer and handmade products. They're your neighbors.",
            "author": "Weisun C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-10-27",
            "description": "Today was the last day for this market till next year. I have gone every Tuesday for my fix of fruits and veggies. It is a small market, but the prices are way better than Lincoln Park's Green City Market. \n\nI love the cashew butter and apple cider from Lehman's Orchard and the stand in the south corner had the LARGEST cantaloupes and summer squashes I have ever seen!!! \n\nI actually don't know what I am going to do with myself on Tuesdays at lunch...",
            "author": "Carlene S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-09-20",
            "description": "How lucky am I to live within blocks of the MCA neighborhood market.  I wish I could give it 4.5 stars but I'll settle for 5.  There are several vegetable stands, 1-2 flower shops, a cheesemonger, breadman (from Naperville), several bakeries, and each year something new and different.  This year was the crepes, which were a welcome addition for the Children's staff due to the relocation.  Overall, this is a wonderful stop for the neighborhood.  It is a Tuesday staple...just wish the weather could sustain it all year!",
            "author": "Andrea A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-06-25",
            "description": "Every Tuesday morning in summer I wake up and realize \"HEY! It's Farmer's Market Day!\" and I rush off to work just in time to get the first lineup of fruits and veggies. I work at the MCA, so it's such a delight to be just steps away from yummy foods and sweet smelling flowers. \n\nEverything is super fresh and CHEAP CHEAP CHEAP! I love the lady who brings in the rice wrapped in grape leaves or the farm that makes its own peanut butter from cashews. The sweetest lady brings in pies, cakes, and other treats for not much money either. Flowers (either potted or picked) can be grabbed up by the bunch for less than $20...I admit I debated to buy a nicely potted calla lily for only $6, but realized I had no place to put it. My boyfriend loves the pickled mushrooms I pick up for him and the cheese table is to die for. Last year one stand had fresh duck eggs on sale. Yes, I said duck eggs. I didn't buy any, but you know...in case anyone was wondering...\n\nI love this Farmer's Market. Everyone is friendly, welcoming, and will answer all your food/flower/cheese/cooking questions. Trust me, I've asked some stupid questions before, and I've got nothing but the most helpful and sincere answers. YAY!",
            "author": "Andrea B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-09-13",
            "description": "One stand has vegan strudel, and other pastries with clearly labeled ingredients.  Otherwise a pretty standard (and good) green market.",
            "author": "Egan V."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2009-09-09",
            "description": ":Meh, I've experienced better.\" is spot on.  \n\nThe fruits and vegetables and even flowers just don't seem as good as say, the Division street farmers market, for some reason. (Even though some of the same vendors are at both; maybe it's the Tuesday crew...?)  I've gone here for a few years now and just always walk away disappointed. \n\nI was there yesterday and was buying about $20 worth of fruit from Smith's and a man only wanted to buy a pint of blueberries. I knew just what I wanted and was fast about it:  as the girl bagged my last item, I asked for the next, quick-like.  This guy is really close behind me, shuffling his feet & huffing and puffing; then the girl keeps looking at him sympathetically and says \"I'm sorry, I'll be right with you.\"  EXCUSE ME!! I'm spending $20, he's spending $2.50 and you're irritated with me for taking your time???? Not ot mention, there was no one else at their tables when I walked up, so it seemed perfect timing to get a bunch of stuff.  Sorry dude! Thanks Smiths, but no thanks... I'll wait until Thursday for the Daley Plaza Farmer's Market...",
            "author": "Jenn R."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-09-14",
                "description": "Lovely market!\n\nhttp://goodiesandbesties.blogspot.com/2010/09/mca-farmers-market.html",
                "author": "Amy M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-08-19",
                "description": "Food glorious FOOD!!!  This summer has been all about shopping for fresh produce at local famers markets in an effort to be local & green.  So, today I thought I would check out the market at the MCA since it is within walking distance to my job & let me tell you--it paid off.  This market has LONGER HOURS (10 AM-6 PM--Tuesdays) than many others run by the city & very well laid out.  There were 16 vendors in all today, offering a variety of fruit, veggies, herb & spices, baked goods, and flowers.  I stopped & spoke to several vendors--each was polite & very knowledgeble about their offerings--it is extremely refreshing to buy food from people excited to give you the best!  Prices are extremely fair & competitive to other farmers markets (ie Green City & Evanston).  Since this particular market is not huge, you do not feel overwhelmed with the offerings, but you also do not feel like you do not have choice.  My only regret is that I did not have more cash on my to buy more food.\n\nSo, if you have some time on Tuesdays from now until the Fall, go check them out--it will be well worth the trip",
                "author": "Unity O."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-09-04",
                "description": "Been going every Tuesday. Love!! Great prices for produce and some of the best tomatoes I've eaten in the Midwest. Love the super sweet lady that sold me a too-good-I-ate-in-one-day chocolate chip cheese coffee bread.",
                "author": "Cary G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-08-19",
                "description": "Drat!  I could have been 1st but noooo...ah well!  I adore this market!  If I lived closer and could get here on Tuesdays I would.  Their market was such a treat for me when I worked retail hours and usually had Tuesdays off.  It was much larger than I had anticipated.  There was a local honey vendor, which when I first moved here I was not sure where to go purchase local honey.  The flowers are beautiful and an enormous amount of them from the vendor.  Baked goods...mmm...always my weakness at the farmer's markets. Tuesday's are such a great day at the MCA between this, the tea and jazz on the front steps, and then you get inside for free until 8PM!  A perfect Tuesday and a great excuse to play hooky from work to get to enjoy it.",
                "author": "Lindsay S."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2009-08-11",
                "description": "The market here is convenient but not that exciting. There is a lot more space dedicated to flowers than I would expect, and it's really not well priced. I bought 6 for $2 corn (which is well priced) but it wasn't as good as my Trader Joe's corn. Disappointing! I really want to get behind local growers and such, but alas, not through this market.",
                "author": "Da J."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-02-19",
                "description": "there's a lady who makes pumpkin bread that I would kill for! this was the highlight of my first year of med school. I would stop by and grab a loaf and take it to class to share with the lucky people in my row. goes really well with a cup of coffee! the veggies are fresh and cheap. they have heirloom tomatoes too that are way cheaper than if you went to whole foods. you can get fresh herbs and cheeses too. the amish apple butter is delish and actually just writing this makes me sad because i miss the FM so much, can't wait for it to come back!",
                "author": "Kara M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-10-01",
                "description": "This place is fabulous. Fresh fruits and veggies. Also find fresh cut flowers here. Most of the stands are reasonably priced.",
                "author": "Liz D."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-06-26",
                "description": "I work right by this Farmer's Market in front of the MCA and love coming here on to just get away and buy some fresh goodies. They set up the market only on Tuesdays from, I believe 9AM to 6PM. There are plenty of fresh vegetables, fruit (strawberries and peaches are my fave, especially when in season), baked goods (zucchini, pumpkin, and banana loaves, danishes, upside down cake, ham & cheese croissants, chocolate croissants, cookies, etc.), fresh salsa (the habanero one is my fave), pasta sauces, and spreads (FIVE CHEESE GARLIC SPREAD!!! MY FAVE! and fresh peanut butter) and flowers (peonies, sunflowers, lilies, snapdragons, etc). Just exploring everything that this market offers is enjoyable in itself. Make sure to check out the booths where you can taste the yummy salsas and spreads. The selection will vary depending on what's in season. But I usually come back to work with something good to munch on for the rest of the day.",
                "author": "Diana T."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Farmers Market at the Museum of Contemporary Art",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "220 E Chicago Ave",
        "postalCode": "60611",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/fOZPgfORa8QKacw0dm5n9g/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13122802596"
}