{
    "aggregateRating": {
        "reviewCount": 1,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-07-12",
            "description": "The Market is sponsored by the WUSM Wellness Council.  It occurs on Thursdays from 10:00 am - 2:00 pm and is located in the Plaza outside of Barnes & Noble .\nI like to pick up stuff for lunch and the night's dinner here since I work in the adjacent building.   During inclement weather, the market is held in the lobby of the MPRB---the building that houses the Barnes and Noble.  This location is close to the CWE Metrolink.  Some of the prices are high, but the quality is there including organics and unusual varieties.\n\n Vendors include: \n \nWindcrest Dairy: Greek and regular yogurt - serving plain, vanilla, raspberry, blueberry and peach  (no preservatives added) and assorted cheeses. \nThe Raspberry Greek is out of this world.  I never cared for Greek style until I tasted Windcrest.  Now, I stock up for the week.\n  \nStringbean Coffee Company:  Providing locally roasted coffee with beans sourced from organic farms!\n \nVeggie Boy Produce :  Tomatoes, broccoli, zucchini, squash, cucumbers, asparagus, potatoes and green beans. Get some fresh, basil, lettuce (Boston, green and red romaine), kale, spinach, pea shoots and baby Swiss chard\n \nOriental Veggies: Featuring fresh produce: Chives, onions and cucumbers\n\n Eilerman Brother's Orchards and Produce: Offering fresh fruits and vegetables that are in season\n \nGrandma's Nuts: Trail mix and other nut selections for a healthy snack and other foods as well including an all natural premium mixture of nuts, fruits and seeds - very delicious and nutritious\n\nTraveling Tea\n \nOlove Oil: Featuring delicious olives, extra virgin olive oil and vinegar=====This oil is sublime.  It's expensive, but worth the splurge.\n\n Great Harvest Bread Company: Featuring items such as:apple crumble bread, oatmeal raisin bread, cinnamon raisin walnut bread, Dakota bread, high five fiber bread, cinnamon chip bread, Challah bread, rosemary garlic bread. Also raspberry cream cheese scones, Grandma's Nuts scones and reduced fat fruit muffins - \n \n \nBaetje Farms: Baetje provides farm fresh goat cheeses.  They also sell $1 cold packs so you can keep your cheese fresh until you get home.",
            "author": "Susan S."
        }
    ],
    "priceRange": null,
    "name": "Farmer’s Market Washington University Med School Campus",
    "address": {
        "addressLocality": "Saint Louis",
        "addressRegion": "MO",
        "streetAddress": "660 S Euclid",
        "postalCode": "63110",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": ""
}