{
    "aggregateRating": {
        "reviewCount": 27,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-23",
            "description": "Hey, five stars to these guys aka vendors as they are \"real troupers\"=brave and determined.  \n\nIt is pouring rain today and the vendors still are friendly with a positive attitude despite the weather.  Shoppers can find fresh seasonal produce, plants, cheese, bread, cookies, bagels,etc. (Key word is \"seasonal\" with the produce.)\n\nI decided to take a walk down to the Federal Plaza Farmers Market to see what was fresh.\n\nFresh Asparagus by the pound-you pick it-(out of the basket) and they weigh it! \nLeeks!  \nHerbs!\nPeony flowers!\n\nI am looking forward to tomato and cucumber season.  \n\nFor now it is asparagus, fresh \"Siam Queen\" Thai basil from Smits Farms is of a much better quality with larger leaves than I have found in other places in Chicago. Plus reddish-pink peonies.\n\nLook for the Alexander Calder \"Flamingo\" Sculpture-then you know you are in the right spot!\n\nFYI-Not all vendor's from one market go to other Chicago City Farmer's Markets during different days of the week.  Which makes it all the more interesting to market hop.",
            "author": "Christina S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-07-16",
            "description": "My obsession with Do-Rite Donuts' buttermilk old-fashioned has led me to the Farmers Market on a few occasions.  Granted, the actual shop is technically still on the way to my office, but the market allows me to take a more direct path literally making a donut a stop I can make on the way to work.\n\nThe stand is fairly small and does not offer nearly as many options as the storefront.  A buttermilk old-fashioned will set you back $2.15.  Sometimes, depending on what time you go, the pickings can be slim.  I arrived one morning and did not see any buttermilk old-fashioned donuts, much to my heart's dismay.  The friendly workers told me they've have a fresh batch in 10 minutes.  I didn't want to wait.  My waistline (and thighs) thanked me for leaving.\n\nThere's plenty to choose from at the market, including produce, flowers and tons of bakery options to satisfy any sweet tooth.  Another favorite of mine is Rise 'n Roll, the Amish food stand, which carries some delicious cookies and granola bars.\n\nThe market is located on the corner of Adams & Dearborn and is open from 7am to 3pm.  It's definitely worth checking out.  There are some benches by the Divvy bike stand that's facing Adams.  You can sit and enjoy your food there.",
            "author": "Jennifer L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-06-18",
            "description": "Great location and a well-rounded selection of products.\n\nAs far as farmers markets go, the Federal Plaza market is relatively small (maybe around 20 vendors?) It's Bike Week in Chicago, so I don't know if Heritage Bikes is always there, but I grabbed an iced coffee (very strong!) and some cookies for Africa, that tasted very good.\n\nAs I walked around, I liked the overall selection of vendors. 2 or 3 for produce, bread, donuts, several clothing... and most importantly, people were actively walking around, talking and shopping. Not bad for South Loop!",
            "author": "Robert G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-05-25",
            "description": "This is such a great location for Loop workers: I come here every Tuesday (in season) before work or on my lunch break and stock up on produce.  \n\nThey have a lot of the same farms that appear at Green City Market (like Mick Klug Farm from Michigan), and several prepared food stalls as well (like Rock 'n Roll Noodles and Do-Rite Donuts).\n\nI've been disappointed several times by Golden Rise Bakery's pastries (spinach cheese pastry with very little filling, and a not-fresh, too-sweet apple fritter), but always enjoyed everything else.",
            "author": "Brianna B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-22",
            "description": "Nice place, wide variety, fresh from the farm (the guy we talked to was at his barn loading up at 2:45am) for what we looked at. Raspberries, strawberries, etc. Baked goods as well. You could easily work a family breakfast here. Open Tuesday only.",
            "author": "Chris K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-02",
            "description": "Great farmers market. They have about everything you could ask for. \nIf you have a notch or two left in your belt, try the Omish ladies donut holes.",
            "author": "Justin F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-09-20",
            "description": "Smallish in comparison to other markets, but everyone we came in contact with was extremely friendly and the produce looked great.",
            "author": "John C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-05",
            "description": "This is a small but fun farmer's market that I am planning to go to every week this summer!  The highlights for me are the Amish food stall (amazing cookies and cheese - get the habanero cheese) and any fresh produce.  I do wish the produce was more plentiful - it is early in the season so maybe more will come later?  So far there's only one major produce stand, and a few other stands that sell jam/baked goods/salsa and also sell a bit of produce too.  I got some really lovely purple asparagus, the first Michigan strawberries of the season, and some great spinach that stays fresh for a looooong time. Tons of flowers and plants that make me wish I had a porch.\n\nRight now they've got spring onions, green garlic, rhubarb, and other spring goodies.  Can't wait to check it out again in full summer!",
            "author": "Meredith A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-10-29",
            "description": "I discovered this farmer's market towards the end of summer beginning of fall - and was disappointed I didnt come here sooner! Its a nice walk, and you can find some reasonably priced, and delicious items. I found a few favorite vendors I went to frequently. Can't wait till next year!",
            "author": "Hina Q."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-05-19",
            "description": "Yay it's back!!! Stopped by today and bought some portobello ravioli, salsa and banana bread. The only stand I was looking for and sadly didn't see is the pasta one. But I'm never disappointed with the products I get at this farmers market. The jams and jellies are just the best. Makes me so happy that it's summer!",
            "author": "Paige W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-12",
            "description": "I dig it!\n\nI was skeptical about this farmer's market after visiting the Sears* Tower \"farmer's market,\" walking away sorely disappointed. I don't know if it was a fluke, but the Sears market had about 5 vendors in total - what a sad excuse for a market. But I digress...\n\nFederal Plaza farmer's market is the real deal. A veritable maze of vendors set up in the plaza with everything from baked goods to produce to cheeses to soaps.  In my opinion, the produce is the gem and real draw of this market; there were at least 4-5 vendors with extensive fruit and vegetable choices. \n\nI've been trying to make a point of heading here on my way into the office on Tuesdays to grab some fresh items and baked goodies. It's well worth the trip and getting up a littler earlier than usual.\n\nTIP: Pick up some baked goods at Misericordia's Hearts & Flour Bakery; not only does it support a good cause, but their cookies are pretty damn awesome!\n\n* That's right I called it the SEARS Tower, as it is and forever shall be in my mind.",
            "author": "Mary T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-28",
            "description": "Mmmmm, fresh produce a block away from the office!  How could I not love that?  I haven't been to a lot of farmers markets in the city, but this one is nicer than the ones I've been to in the 'burbs. \n\nIt's not huge, but the vendors that are there have nice, fresh, produce for reasonable prices and good selection.  It's also nice that it's not all smooshed into a small space.  \n\nI now plan on working from the office every Tuesday.",
            "author": "Kate M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-12",
            "description": "I am still excited every Tuesday to go to this farmers market.  There are such a great variety of vendors, and I love the organic booth a lot.  Its so much cheaper then the neighborhood markets, and its just such a nice visual site on this corner.",
            "author": "Julie A."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-08-01",
            "description": "I'm always happy to see this market when I'm in the loop on a Tuesday.  There is a decent selection of produce, plants, breads, and cheeses.  My only qualm is that it is a little pricey.  But I guess you are paying for convenience.",
            "author": "A. M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-28",
            "description": "This is definitely a smaller farmers' market than the others that I usually frequent on the weekends. Yesterday I noticed that I had absolutely no healthy, fresh fruit or veggies in my apartment; I found this market that was close enough to work so I could stop by before coming into the office.\n\nThere were roughly eight different vendors today. I thought the mushroom tent was unique, they make their own mushroom veggie patties that are soy-free and (I think) are gluten-free as well. I really wanted to get some, but we don't have a lot of refridgerator/freezer space right now in our office. He also said they are at the Division St farmers' market, my normal Saturday spot. Two vendors had fresh baked goods, I got a chocolate croissant as a breakfast treat for waking up so early! (Again soy-free, and most of his products were vegan as well, like the Nine Grain Bread I got today!)\n\nThe majority of the other tents were fresh fruits and veggies, plus a lot of tents had homemade jams and honey.  It's Honeycrisp season right now, so I picked up a basket and some great Heirloom tomatoes, butternut squash, basil and a couple small yellow squash. I would say get here early in the morning, the tomatoes were already looking picked over at 8:30 am.\n\nI give this three stars as a market, but add another star because of the convenience and location. Most of these vendors looked familiar, and if you usually shop around on Saturday, you'll recognize them. Sadly, there is only about a month for this market and before the cold arrives.",
            "author": "Hillary L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-06-18",
            "description": "Strawberries and Asparagus - a lovely start to the Summer Farmer's Market season!\n\nWhile not as popular as the larger Farmer's Market in Daley Plaza, fewer people means less competition for the produce you are eyeing.  It's still early, so variety of produce is more limited than it will be come August, but I make a point of picking up asparagus and spring onions on a weekly basis.\n\nIn addition to the standards, there are stands selling baked goods (one of which, Hearts and Flour, benefits Misericordia - one of my favorite local charities), honey, and all the flowers you could ever need.  There are random other stands that flit in and out throughout the market circuit, so every week brings something new to check out.",
            "author": "Helena S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-10-09",
            "description": "I was pleasantly surprised to realize it was Tuesday and business had brought me to Chicago when I turned a corner and saw this familiar market. Produce take center stage, with baked goods, flowers, and cheeses to complement the fruit and veg. We grabbed some great bags of mini cookies for 2 dollars to bring to our afternoon meeting. The coconut cookies were especially tasty.\n\nThough I don't live in Chicago, and thus am not in a position to take advantage of much of their offerings, I'm of the mind that these markets should be mostly about brussels sprouts, corn, strawberries, and the like. Having a selection of prepared foods makes it something that a nomad like me can take participate in.  But the produce is the thing, and this one seems to have that in spades.",
            "author": "Jeff G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2006-08-21",
            "description": "Definitely one of the better farmers markets in the Chicago area. They have everything you could ask for.  Baked goods, Produce (Vegetables and Fruit) flowers, meat and also items that I haven't seen at other farmers markets like fresh roasted nuts and also sausages.  It's on Tuesday's at Federal Plaza in Chicago from \n\nFederal Plaza \nAdams & Dearborn (230 S. - 50 W.) \n\nTuesdays \n\nMay 17 - Oct. 25, 2005 (24 Total Market Days) \n\n7 a.m - 3 p.m.",
            "author": "Alan R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-28",
            "description": "I just went here for the first time and absolutely loved it!  I finally buckled down and made the decision to start shopping local after seeing a disturbing documentary on food.  \n\nThe vegetables and fruits were so fresh and most had been picked the day before according to the farmers.  I bought fresh sweet onions (the smell amazing), a huge bunch of fresh basil, zucchini, raspberries and strawberries, along with arugula lettuce.  I also got a bag of dried cranberries and cherries from Michigan--YUM!  The fresh fruit tastes amazing.\n\nI love that the food is free of chemicals and all the crap that gets put in it from commercial vendors.  Not to mention--the prices were comparable to the store if not cheaper anyway.\n\nI plan to go the rest of the summer!  Also, next time I want to buy a potted basil plant.",
            "author": "J R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-05-27",
            "description": "This isn't a large farmers market.  So if you are looking to replace your weekly grocery store visit with this market you are looking in all the wrong places.  That being said, you can usually find about 10 different booths that have a nice selection of items.  I've seen fresh fruit, veggies, dried fruits, baked goods, jams, sandwiches and other items that can be purchased.\n\nThe last two Tuesday's I have stopped here around 8:30 in the morning before work.  My purchases have included jars of very berry jam and apple butter, dried apricots, and a nice big bottle of honey.  All products I purchased came from either Michigan or Indiana so very close to Chicago.  I noticed they all list the ingredients in their jams and even dried fruit to let you know all of what goes into making their products.  I really like the attention to detail.  The jams were delicious!  The apple butter smells like apple pie in a jar and apples aren't even in season right now.\n\nI'm looking forward to visiting this market each week throughout the summer to see what new booths will bring.  It's definitely worth a trip if you haven't been before.",
            "author": "Dusty K."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-02-20",
                "description": "My office is moving out of the Loop, and I'll admit that one thing I'll miss most is the Farmer's Market at Federal Plaza.  Once farmer's market season is up and running, I visit as much as possible.  \n\nI usually go wander around during lunch time and come back with some sort of afternoon snack- usually blueberries.  Even though I could go to the grocery store and get a pint of blueberries cheaper, I love the farmer's market atmosphere, and I like the idea of helping out local (ok so Michigan isn't exactly local) vendors.",
                "author": "Erin N."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-06-25",
                "description": "Some of my favorite past times in the Windy City.\n\nThis farmer's market offers a variety of goods, ranging from organic honey to baked delicacies to handmade jewelry.  Vendors are extremely friendly and don't seem to mind answering a billion questions about their products.  My first time here was when I had just gotten out of a nearby El station and saw this pleasant sight.  I was immediately drawn to the scene and somehow forgot my itinerary for the afternoon.  2 hours later, I left with bags of honey, fresh asparagus, blackberries (oh!!), a bundle of precious daisies, and a freshly baked croissant in my hand.   \n\nSure, the prices are a bit steep (compared to the standard products found on regular grocery stores), but still cheaper than buying them from organic food shops ----- no middle man!\n\nMinus one star b/c it closes too early - 3pm!",
                "author": "Claire Y."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-07-08",
                "description": "In reality, the number of stars this market gets awarded depend a bit upon the time of the summer I go.  Early on, there are fewer vendors and not a lot to choose from.  As the summer progresses and more crops mature, it gets better and better.\n\nThere are your typical vegetable stands at this market and the prices are always pretty competitive - especially seeing what the energy crisis has done to the price of groceries these days.  \n\nThere's one stand that sells all herbs at very reasonable prices.  I live in a high-rise condo and have no outdoor space to grow things.  Indoors, I have two curious cats and nothing green and potted lasts long.  As a result, I love being able to buy fresh herbs each week.\n\nThere are also breadmakers and soap makers and other assorted vendors.  But you can't beat the veggie and fruite selection and prices.  I can spend $15 and leave with bags of asparagus, peaches, broccolli and golden beets.",
                "author": "Julia T."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-05-22",
                "description": "One of my favorite ways to start my morning is with a stop at the Farmers Market. This morning I picked up some purple asparagus and am looking forward to berry season!! It is great to buy produce directly from the growers. Unfortunately right now it is primarily flowers and plants right now- which smell and look great but probably do not taste too good! I can't wait to shop here all spring, summer and fall.",
                "author": "Linda K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-05-08",
                "description": "I am so fortunate that my office  is across the street. The mushroom vendor and all the fruit and vegetable vendors are so nice, and the produce is so fresh. Can't wait to scoop up some morels May 13 - they are worth every penny of their $44/lb. price!",
                "author": "Chris D."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-10-21",
                "description": "I like to stop here on my lunch hour on Tuesdays to check out the fresh produce.  There are definitely more vendors and more selection later in the season.  There are usually plenty of hotties looking for some fruit too.  If you miss this place during lunch it will be closed before quitting time.  I see them taking down the stands by 2:00.  Stock up for meals for the week or an after lunch snack.",
                "author": "Kevin J."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-07-28",
                "description": "More details to come... I have been shopping here for almost three years, and I keep coming back for more. Everything I get is good. Go for the Wisconsin cheese!! I get a block of chipotle cheddar every week.",
                "author": "Phillip M."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Federal Plaza Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "50 W Adams",
        "postalCode": "60606",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/CHrU_lfWrlEiCCZ-2okB3w/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}