{
    "aggregateRating": {
        "reviewCount": 8,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-14",
            "description": "Tropical Heat Advisory Today, July 14th. Still had to go into Ferguson and had yet to remember to visit on a Saturday.\nVendors doing business despite the heat.\nGot a REALLY NICE HUGE FRESH Tomato. Had the hard or firm ones. This one was nice and luscious.\nAlso tried a young man's BEAUTIFUL Fried Pies. Cherry and Cream Cheese, THEY WERE AWESOME. Will go back for these every Saturday Morning. He also had, Apple, Apricot, Blueberry and more...at least a dozen kinds. I shared w. him that me me-maw used to make the best Chocolate Fried Pies. My uncles would call to see if mum had cooked and would drive in for lunch. Maybe, he'll try the chocolate and have it, but if not, trying the Blueberry and Apple next week. \nEssential Oil lady spritzed my face.\n2 stands with FRESH HUGE produce, melons and more. \nA man was also serenading us with some GREAT Folk Rock Music. \nImagine whom might have been there without the Dangerous Heat. \nIf you haven't been, support this w. a visit. We must keep this Good Stuff going. \nOn the Main Drag, you can't miss it. \nI may be crazy, but I think there were carts to roll the kids around in. I saw 3 families with carts of well-behaved children.\nLots of Diversity in the crowd, ol' folkes, young-ins, pink and blue hairs et al.",
            "author": "Cecil D. M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-03",
            "description": "This is a great place to spend a Saturday morning. I volunteered at a booth here and people are very friendly. Listen to live music and pick up some fresh veggies. Enjoy hanging out local and supporting your community.",
            "author": "Cheryl H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-06",
            "description": "I love this place!  A wide variety of garden fresh produce, flowers, food, drinks and handmade crafts.  I hate the Saturday mornings that I'm forced to miss the Farmer's Market.  Some of my favorites include the cheeses from the Creamery and canadian bacon but love the seasonal fruits and vegetables.  Today's haul included strawberries, zucchini, tomatoes, lettuce and asparagus.  Live music, kids crafts and weekly events make this a great place to be!  Come on out and have some fun and eat fresh!",
            "author": "Carol S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-04-21",
            "description": "Something that some people may not know is that they have an indoor market once a month during the winter months.  \n\nAside from some winter veggies, you can expect the usual baked goods from Cose Dolci.  \n\nMost recently, they were smoking up some pork steaks that were making my mouth water.  Alas, we were on a schedule and I wasn't able to snag one to gnaw on.",
            "author": "Allan C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-10",
            "description": "My wife and I went here recently to see what the Farmer Market scene is about. \n\nWe also have been getting GMO's (Genetically Modified Organisms) out of our diet and wanted to see if they had any organic produce.\n\nMan did e hit the jackpot! This place is rich with Healthy foods and other products. We got a 4lb bag or Organic Corn for popping, a 3lb jar of Local Florissant Raw honey, organic green beans and a bunch of other things I cannot remember. \n\nAlso we found a meat company that has grass feed beef for a pretty reasonable price, I think we will be making a purchase soon to freeze in our big freezer.\n\nI really enjoy the atmosphere here and how everything is setup, I will be branching out to other farmers markets soon but this one is so close and worth going to. \n\nA word of warning though, get there early because some of the venders run out of the good stuff quick.",
            "author": "Jeremy C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-07-04",
            "description": "Not sure how you rate a farmers market but here goes.\n\nFriendly atmosphere. \nPlenty of open space with the room to walk and socialize. \n\nLive music, which I was told changes from week to week.\n\nFound craft and food booths but also some formal business booths. By that I mean folks selling things like branded scented candles and other items. This is a big negative for me on market style places.\n\nNot enough edible food vendors but there were booths offering samples.\n\nPlenty of nearby parking.",
            "author": "Todd J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-07-19",
            "description": "Yes and yes...with only one trip, the Ferguson Farmers' Market has become our one and only. My wife and I recently decided to try our hand at becoming more 'locavore conscious' and finding a great farmers' market is a HUGE step in that process. Our goal is to get 'most' of our essential meal items for the week at said farmers' market...and this one got the job done. \nOnly local (Missouri and Illinois) farmers are allowed to be vendors, as this is a 'farmers only' market, so you don't have to worry while shopping that something may not be local or fresh. Everything is straight from the farm. For those that would say that is their biggest beef with Soulard (which it was ours), Ferguson will put your mind at ease. A few of the farmers, including 'Earth Dance' where we got green beans, basil, and red onion, are from Ferguson! That was cool...urban farms at an urban farmers' market. \nThe whole experience was enjoyable...which really, it should be. You don't feel cramped or forced to make a decision (ahem, certain farmers' market) and all of the people are just really nice. They were quick to inform of their goods, but not to sell you on it, just to let you know if you really need it. My dork moment came when upon purchasing peaches, the dude threw in a couple more of a different variety just because 'we should try them.' It actually brought a little tear to my eye...no joke. I have no idea why...I think it was just because we had finally found our market! \nSo...we made out like bandits...green peppers, blackberries, peaches, green beans, fingerling potatoes, goat cheese, honey, summer squash, zucchini, red onion, basil, tomatoes, corn...all for about $28. Which brings me to this...it is cheap also. Our two 'splurges'...the goat cheese and honey, were the two most expensive items, at $6 and $3.50, respectively. That was also refreshing, as places like Tower Grove and Kirkwood FM can be a little pricey. \nAll in all, it's like a festival every Saturday! There's live music, bbq, and just great neighborhood people. You don't feel like you're not 'in the in crowd' if you're not from the neighborhood either, which is nice. \nGo check it out! It was worth the long-ish drive from South City, and will continue to be worth it every Saturday through October.",
            "author": "Steve O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-03-20",
            "description": "I go every saturday and love it! you can find just about anything you need here including crafts, fruits/vegies, baked goods, and flowers. Every one is so friendly and there is always good live music playing. at first glance it might seem small, but its bigger than it looks. I do beleive that they plan on moving it b/c it keeps getting bigger and bigger every yr, but i dont know when.",
            "author": "Matthew C."
        }
    ],
    "priceRange": "$",
    "name": "Ferguson Farmers Market",
    "address": {
        "addressLocality": "Ferguson",
        "addressRegion": "MO",
        "streetAddress": "501 S. Florissant Rd",
        "postalCode": "63135",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/bIXA6W897MAFIVUK7qArRw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13145241820"
}