{
    "aggregateRating": {
        "reviewCount": 18,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-15",
            "description": "I've decided Farmers Markets are good date spots. This one is even better for me because its close to home. I can walk around and get to know someone (sober) and not worry about blowing my diet on a long dinner. Its perfect! \n\nEven if you aren't here for a crazy reason this is a great market! I would arrive early. I notice some of the really popular things start selling out as it gets packed. I love buying my fruit and salsa here. I tend to stay away from the baked goods even though the look and smell delicious. Those donuts are seriously torturing me as I walk by. \n\nI have not been to many of these but people tell me all the time that Frankfort is one of the best. I believe them. Now I just need to remember to walk over on Sunday mornings. There's a few restaurants right near the market if you'd like to make a whole day of it too.",
            "author": "Melissa B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-05-28",
            "description": "This is a fantastic spot to spend a nice Sunday.  If you are out for goods (in and out), come early and move quickly.  The hoards of people start moving in around the noon hour.  Maybe this coincides with church?  \n\nLive music, ready to eat food, fresh veggies, coffee bar, on demand donuts, and organic/grass fed meat.  This market is well put together and is spread out well.  Being in the center of Frankfort allows it plenty of public parking and an opportunity to visit the local shops.  The prices are a bit high for what is offered but we are willing to spend a little more on homemade local goods.\n\nWe look forward to this Sunday market and will continue to support the vendors!",
            "author": "Douglas K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-19",
            "description": "Went to the farmers maker today and thought it was by far the best farmers market I've ever been at.\nLoved all the vendors, food and music in the park.  It was a great way to spend a Sunday morning.",
            "author": "Valerie D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-13",
            "description": "Love the Frankfort Farmer's Market. And it is on Sunday from 10-2pm? Score!\n\nImpressive size and variety of available products. No flea market art craft stalls = more room for food booths! \n\nLove the bruschetta bar and the mini donuts.\n\nGot my knives sharpened while I shopped. Price was right and they were done on time.\n\nCan't wait to get back.",
            "author": "Julie O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-08",
            "description": "Need your knives sharpened?  Want to buy baked goods from French speaking nuns?  How about fresh fruits and vegetables from Michigan?  Plus pie!  Cooking demonstrations and snacks!\n\nHomemade pickles!  Flowers and plants!  \n\nIt's a cornucopia of food, people and fun. You can bike, walk or drive here. Bring some money and feel all artisan and sustainable even, dare I say it , hip and cool?\n\nI forgot to mention the popcorn.  There's too much for me to remember, you just have to come here and see. Just be aware that apparently Frankfort dogs are big Farmers's Markets fans because so many people bring them. Not quite sure why, the dogs are into fresh food?",
            "author": "Kathleen M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-10-12",
            "description": "First time last weekend the best market I attended this year so sorry I discovered this gem at the end of season. Market located in the middle of town surrounded by quaint shops and cafes with patios. So relaxing.",
            "author": "Tee P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-01",
            "description": "I adore the Frankfort Farmer's Market.  Every year it gets bigger and better and it is a great way to enjoy the town in the summer/early fall months. \n\nYou could do most of your shopping for the week as you can pick up fruits, veggies, pies, organic meat, cheese and canned veggies and preserves.  Everything is fresh and of high quality.  \n\nAs the market has grown so have the crowds, but, no worries, the vendors have plenty to go around and the village has added parking over by the old Fox Lumber.  If you get hungry from all of the shopping, you can grab a pizza pop from the Parmesan's booth or some kettle corn and a lemonade shake up from yet a different friendly vendor.",
            "author": "Emily B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-20",
            "description": "This is just a great Farmer's Market! The kids enjoyed it and there was a great mix of fruits, veggies, food, and refreshments! Downtown Frankfort is such a quiet, tranquil area and the people are so friendly. I can't believe this is my first time here!",
            "author": "William B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-12",
            "description": "By far the best local farmers market in the area!  Fantastic local produce, flowers and goods. Lots of great food and surrounded by thriving local small businesses. Great live music and always fun activities for the kids. Definitely a must during the summer months!",
            "author": "Nicole G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-15",
            "description": "Awesome market. There are lots of vendors and fresh produce. There is a parking lot and street parking. The place is pretty crowded. There is also plenty of room for sitting on the grass or enjoying a picnic. The market is divided into 3 sections. my favorites include the Hawaiian shave ice, fresh shaken lemonade, and kettle-corn popcorn! They also have a vendor that makes fresh green smoothies, which I will have to try next time. Lots of food (didn't get to try the paella this time! :( will try next time as well!) Love this market!! Also I like the fact that lots of the vendors accept credit cards. \n\nCome check out the market every Sunday from 10-2pm!",
            "author": "Alisa M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-05-07",
            "description": "By far the best farmers market around. Even has a crepe & paella booth from Naples Florida !!!",
            "author": "Patrick F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-07",
            "description": "Great market and sometimes dog show (so many people with their dogs) which is fine.  Come hungry!",
            "author": "Joseph P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-22",
            "description": "New year and this Farmers/Country Market has gotten even better!  I have to go from four stars to five stars.  Outstanding job Frankfort, are you paying attention New Lenox, Mokena and etc.  It seems like you are not.\n\nYou must stop at Katies Passion Kitchen booth.  Every week this place is GREAT.  All we need is for the Paella booth to show up more often then it does.\n\nDefinitely stop and give this one a walk through on your Sunday mornings this summer.",
            "author": "Jerry W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-21",
            "description": "My favorite Farmer's Market in the area.  We travel here from Oak Lawn at least a couple of times during the season.  Since there is a wonderful bike/walking trail, I like to bring our therapy dog Golden and do a nice day out.  Great vendors, dog & kid friendly.  Can't wait to get back soon!",
            "author": "Julie R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-08",
            "description": "The Frankfort Country Market is alive and well again this summer, emphasis on summer.  Fall is around the corner and since the best stuff is grown locally, get here now or you will miss out.\n\nThere are great peaches right now, green beans all over the place, the best sweet corn of the year and red all the way through tomatoes.  The rest of the year you rarely get a tomato that is worth eating, these are.\n\nIf you wait a month they will still have pie, pickles and pop corn but you will have missed the ripe fruits and vegetable.",
            "author": "Clifford S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-07-20",
            "description": "Frankfort, like New Lenox, used to have a Farmers Market with a good amount of vendors and variety, but those both seem to dwindle from one year to the next. I remember going to this lovely cookie stand where you could either get a single cookie or a pack of delicious snickerdoodles, sugar cookies, peanut butter cookies, etc. I also remember a vendor that sold pulled BBQ pork tacos, and Buddy's Biscuits, who had a great assortment of dog treats, all at affordable prices! \n\nNow it seems all that's left are a small collection of local vendors, charging high prices, without much variety. I've heard here and there that anyone who wasn't from Frankfort was pushed out, which I think is how New Lenox's went downhill so fast. \n\nOh well, time to find a different Farmers Market!",
            "author": "Kranitz L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-04-26",
            "description": "Just returned from opening day at the Frankfort Farmer's Market...the best Farmer's Market South of Chicago.  There is a new vendor this spring called Bakewell Bakery Inc.  It is an outstanding bakery!  Every item is made fresh with all natural ingredients.  My niece and I bought the Cinnamon Apple Coffee Cake, Shortbread Cookies and the Morning Bun.  They were super delicious...thank you to the powers that be in adding another top quality vendor to our market!",
            "author": "Teresa S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-03-29",
            "description": "Much like the other reviewers, I love this farmers' market. Really it's a testament to Frankfort, which as a municipality, just does things right. Whether it's the tree lighting or the summer concerts or this, they just have a style of doing things that is far more elegant than most neighboring towns. But I digress.  This farmer's market has a wide variety of products for sale and it's a lovely place to wander on Sunday's. The prepared food offerings offer a bunch of alternative choices which are enjoyable to try.",
            "author": "D H."
        }
    ],
    "priceRange": "$",
    "name": "Frankfort Country Market",
    "address": {
        "addressLocality": "Frankfort",
        "addressRegion": "IL",
        "streetAddress": "Oak St",
        "postalCode": "60423",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GByRURx3DCRS4iGQ9ENxkw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18159549788"
}