{
    "aggregateRating": {
        "reviewCount": 20,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-23",
            "description": "Summer is finally here, and that means it's farmers market season at last! The Freight House Farmers Market runs year round, but shines particularly brightly on Saturdays from May to October when the outdoor stalls are open. \n\nThere's a little bit of everything here - from produce and plants to artisanal breads and cheeses to food trucks to handcrafted goods of all shapes and sizes to live music and more. It's a dog-friendly market and my dogs love to come and be adored by the general public and pick out some fresh-baked treats. The booth I never skip is the one with the African lady who sells awesome-smelling/working loose incense.\n\nLove the Freight House Farmers Market and will do my best to come shop here every week that I can!",
            "author": "Haley B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-17",
            "description": "\" Indoor And Outdoor For Everything You Don't Need \"\n\nWhat a Great Shopping Venue. The Freight House Farmers Indoor Market is open year-round. You'll find a variety of vendors selling crafts, jewelry, vegetables, meats, breads, artisan cheeses, and much more. Some vendors can be found both indoors and outdoors. The Outdoor Market is open from May 5th to  October 28th on Saturday from 8:00 am to 1:00 pm. They are open on Sundays from 10:00 am to 2:00 pm. Also open on  Wednesday's from 8:00 am to-1:00 pm. The Indoor Market is open year round on Saturday from  8:00 am to 1:00 pm, and Sundays from 10:00 am to 2:00 pm, and Wednesday's from 8:00 am to 1:00 pm.",
            "author": "David M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-01-09",
            "description": "While this farmers market is open year round, our visit in December was a bit underwhelming to be honest. Not much fresh produce which I kind of expected but in general not a lot of foot traffic or much to choose from. \n\nFor the most part, lots of vendors selling hand made goods and items, some food and beverages ranging from sausages to cheeses and even kombucha. Aside from that not much I was particularly interested in. However we did end up purchasing some sausages to enjoy on the road. Probably didn't spend more than 15 minutes walking around and browsing. There's two main rooms that were indoor to visit, but like I mentioned kind of underwhelming in general to see. \n\nI'm guessing it's probably worth a visit during the warmer months where I'd assume there's more vendors and foot traffic and all around liveliness.\n\n'Til next time, cheers!",
            "author": "Francis R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-01-05",
            "description": "I came into town during the winter, which may have put a damper on my experience here. The biggest plus about the Freight House Farmers Market is that it is open year round! But I was a little disappointed to see almost no fresh foods. Lots of small, extremely nice and welcoming vendors with their inventory but for the most part, saw soaps, kumbacha, beef jerky, meat, and hand carved objects. Where are the veggies and flowers at? (probably frozen over, but still...when you think Farmers Market...)\n\nWorth mentioning though is that parking is extremely easy, and that this is right next to the beautiful Ferris wheel!",
            "author": "Jean L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-07-01",
            "description": "It's a fun walk around and there is enough to check out the crafts and products. We were from out of town so we didn't really buy any fresh produce.",
            "author": "Jaci Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-06-14",
            "description": "Saturday morning in Farmer's market was a good experience.\nThere are a lot of fresh produce, plants and flowers, and food trucks. The prices are reasonable and the vendors are friendly. You can get pizza, crab rangoon, egg rolls, etc. if you are hungry. Some of the produce is higher priced than big stores, but it is fresh. There are artists who play to entertain and make some money too.\n\nParking can be a problem on the weekends at the Farmer's market.",
            "author": "Hemant T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-01",
            "description": "I really liked this farmers market. There is def a lot to see or purchase. I even learned a couple of things while I was there. The only thing that I didn't care for was it seemed like every other person there brought there dog/dogs with them. I felt like I was at a dog park (which my children loved). But being a cautious parent with strange dogs around my kids was my only concern. The people were friendly, the food was fresh, and go their hungery cause u can snack along the way.",
            "author": "Camille S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-04-05",
            "description": "My favorite spot to go on a Saturday morning in the Quad Cities. There's always something new and exciting to look forward to each week. I was always a regular before I left the QC and this Easter weekend was my first time back since the indoor expansion of new businesses. \nThe addition of a Front Street Brewery was a spectacular idea, especially on the riverfront for festivals and baseball games. But it also adds another dimension to the freight house and greater appeal for all kinds of market goers. I know my dad really enjoyed sampling a few new craft beers and a bloody Mary. \n\nSampling new things before I buy is one of my biggest selling points throughout the market. I love trying new cheeses, salsas, breads, dips, candy, wine, fresh fruits and vegetables. I know I'm leaving with a product that I'll really enjoy and savor later. \n\nThis visit to the freight house was extra enjoyable because they had a room set up with Easter activities for kids to make Easter hats and baskets and have their faces painted and then they lined them up for an Easter parade. They also had baby goats and bunnies outside to pet and hold which was lovely. All around a very enjoyable morning at the farmers market,  as usual!",
            "author": "Theresa S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-18",
            "description": "I love local farmers markets, and this one blows the ones in the Chicago suburbs out of the water. You can tell this place is popular because it is ridiculous to find parking...and it's the Quad Cities. There are tons of different stands to visit. Everything from meat, cheeses, wine, vegetables, flowers, food trucks, crafts, herbs, and more! You could probably do most of your grocery shopping here. I love supporting local, and of course everyone is very nice and very thankful for the support. I was impressed!",
            "author": "Danielle S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-04-01",
            "description": "I LOVE this place.  Plenty of fresh locally grown organic  fruits, veggies, free range poultry and beef.  There are also many food vendors giving free samples, and selling different foods.  Check out the brat stand.  They have some crazy flavored brats.  \n\nAlso it is very dog friendly.  You are more than welcome to bring a well behaved dog on a leash.  \n\nThey have everything from fruits, veggies, meats, arts, crafts, toys, jams, salsa, honey, to even homemade dog treats.\n\nOverall great food and it supports local small farmers, not some huge factory farm.",
            "author": "Jeff S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-01",
            "description": "Open Saturdays and Tuesdays, the Farmers' Market in Davenport is the place to be to get farm-fresh produce and purchase locally made products such as jewelry, honey, soaps, candy, tamales, and more! Both indoors and outside, there are over fifty venders selling their wares. Some vendors take credit cards, some checks, but some only accept cash, so bring some money or use the ATM inside the Freight House building. Whether you are shopping for something specific or you just want to browse around for an hour or two, stop by the Farmers' Market and check out the produce!\n\nIf you found this review helpful, please take a second to compliment it, rate it as helpful and become a fan!",
            "author": "Kenneth B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-06-30",
            "description": "Variety of foods, crafts, and people. It's the place to be every weekend. \nI enjoy the fun, family-oriented atmosphere with the playground and live music. It just seems to be a big get-together.\nBe sure to check out The Crepe Guy while you're there!",
            "author": "Kristin K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-14",
            "description": "Not sure where else you could go to get dog biscuits, beets, kettle corn, salsa, soap, plants, and fresh pasta in one place. Honestly, this place has it all!\n\nI was in town for work and stumbled upon the market and was impressed by the size of the market (HUGE!) and also by how many people were there. It was packed! \n\nYou really can find a little bit of everything in the market. If I lived in the area, I know I'd be a frequent shopper. \n\nShop local!",
            "author": "Roxanne O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-03-17",
            "description": "This is a well rounded farmers market with most vendors producing all their goods within the region. There are organics farms with in-season produce, grass fed beef, free-range organic chickens, honey, jams, etc. They also have many artisan and crafted items with obviously more choices in the summer months. That is what root cellars are for here in Iowa :) One caution, watch out for the sellers that have shipped in products if you are trying to eat local produce.",
            "author": "Christine W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-07-25",
            "description": "This is my favorite Farmer's Market. Ever.  That is a bold statement.  I\"ve been around the block in terms of Farmer's Markets.\n\nSo, there are two parts to the market: indoor and outdoor.  The indoor market has mostly baked goods, candy, jewelry, crafts, soaps, etc.  The outdoor also has some of the aforementioned vendors but just not as many.  \n\nThe produce here is very high quality.  I cannot speak to the eggs and meat but I've heard through the grapevine they are wonderful.\n\nThere is a guy who sells lawn art made from old bottles, canteens, tools and I just love his stuff!   Definitely taking recycling to the next level- love it and own a couple of his pieces.  There are a lot of dog bakeries too.\n\nThe best part: Most, if not all, vendors accept debit/credit cards.  I think this is awesome in case you forgot the cash at home.\n\nthere are plenty of food vendors as well if you get hungry for a snack.\n\nHighly recommend if you are local or just visiting- it is a fabulous market and great way to support your LOCAL farmers!!",
            "author": "Melanie B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-23",
            "description": "The best farmer's market for variety, vendors, friendliness, and community support between Chicago and Des Moines.",
            "author": "Robin R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-10-01",
            "description": "I've been to better Farmer's Markets, sure, but for the Quad Cities it's probably as good as can be expected.  There is produce, meats, cheeses and baked goods available for sale all year long (obviously peak season is June-September, the offerings in the winter are slim, but still there).\n\nLocal vendors plus good prices means I'm a fan.\n\nGet there early, the good stuff goes fast.\n\nIt also pays to price compare, don't buy the first bushel of apples that catches your eye b/c I've noticed the prices vary vendor to vendor.",
            "author": "Stephanie Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-07-31",
            "description": "Best apple cider doughnuts on the planet!  Fresh Deli cafe is delish!  Huge Variety and usually several things that make my kid smile.  Last year I would have given 5 stars, but lately there has been a little much on the side of flyers about how I should live..no thanks :)",
            "author": "Lindsay M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-07-08",
            "description": "Not the best I have ever been to.  It's still a little bit carnival.  2 people in this world, carnies and rubes.  Reasonable prices, and ok quality to great quality.  Much variety.  You should eat bfast at the market, just a recommendation.  Or don't.... Jerk",
            "author": "Justin H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-12-03",
            "description": "I love this farmer's market! Being from Chicago I find the selection of fantastic! I have brought many visitors to here and they all ask if they can go again when they come back in town! It is very large though, so it does take a little time to find your favorite vendors.",
            "author": "Molly M."
        }
    ],
    "priceRange": "$$",
    "name": "Freight House Farmers Market",
    "address": {
        "addressLocality": "Davenport",
        "addressRegion": "IA",
        "streetAddress": "421 W River Dr",
        "postalCode": "52801",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/uztEEq7ObtodZcWE7OMQQg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+15633226009"
}