{
    "aggregateRating": {
        "reviewCount": 9,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-09-01",
            "description": "This is a lovely little market that you could easily navigate in 10 minutes or linger for an hour chatting with the vendors. Walk up one side, then turn around and walk down the other side back to your car. Many people jog or bike here or even take the Metra. \n\nProduce prices vary widely between vendors, so if you don't have a favorite farmer, walk up and down the aisle before buying anything.  Don't forget the Mirai corn  off to the side - not sure why they were pushed out of the main strip, but his business didn't suffer from that location. \n\nLots of bakeries, crafters, fresh cut flowers, and produce.  Today there was a doughnut/ crepes vendor, cheese, Ten Thousand Villages (the cute downtown Evanston store).  \n\nAtmosphere was friendly, but very quiet. Live music would make a lovely addition here.  \n\nPlenty of parking.  Bring cash and your own reusable bags.  And a smile.  That always helps.  :)",
            "author": "Elaine M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-05-27",
            "description": "Loved perusing this market full of enticing fruits, vegetables, flowers, baked goods, cheeses, and unique items! Parking is plentiful over in the metra lot, especially if you get there earlier. Prices are not cheaper then the grocery store, but the freshness and quality are better. You can also feel good you're supporting local farmers. The strawberries I purchased were so red, plump, and bursting with flavor! We also had a filling breakfast of crepes. My kids shared a Nutella and banana crepe and I had the ham with cheese and mushrooms. We enjoyed both. \n\nMy daughter and I came across this stand where a woman made the prettiest kids aprons with matching apron for dolls out of recycled materials, like old shirts. It was very cute so I bought a set for her. Another thing I must recommend Gindos hot sauce at the market. I'm the kind of person who shys away from spicy things, but I found his hot sauce to be delicious and addicting! My favorite being the garlic scape, with a perfect blend of heat and sweetness. Make sure you stop by to try some!  It was a wonderful way to spend Saturday morning with my family and will be back another day.",
            "author": "Angela N."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-09-01",
            "description": "Nice farmer's market although not as broad variety of vegetables as other markets.  There are lots of vendors selling clothing, jewelry and knick knacks taking away from the supposed \"French\" feel of it.  The crepe vendor and coffee purveyor had a lot of attention though.  The nuns are there selling their baked goods.  Those fruit tarts are quite tasty.  It would be nicer if there are more organic vegetables featured, but in all it's an interesting place to visit.",
            "author": "Ali C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-06-20",
            "description": "I breezed through this one last Saturday after hitting up Evanston Farmers Market. This one was okay.  It's right next to the train tracks and is a hodge podge of vendors selling everything from veggies to baked goods to bed sheets.",
            "author": "Maria A."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-06-11",
            "description": "It's not very French, and it more of a bazaar than a market.  That said, it's a fun way to spend 30 minutes on a lovely Saturday morning.  Vendors including jewelry, clothes, soaps, lotions, dog biscuits, and plants.  There were also breakfast foods and a few produce stands.  It is small and not overly crowded.  There is ample parking nearby.",
            "author": "DeAnna P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-09-26",
            "description": "Small. Convenient parking. Lots of people, dogs (although not allowed), children. One aisle to walk through.\nAside from the usual market offerings, there are wonderful artistic vendors selling scarves, tablecloths from France, jewelry, handmade items. Freshly made food as well. Not a market I go to every Saturday but a fun alternative to the bigger markets",
            "author": "Renee R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-06-03",
            "description": "In the summer, I am able to do enough shopping here for weekly meals, including fish, cheese, bread, a wonderful variety of vegetables, and fruit. There are also delicious, condiments, sauces, and other products available. The food is much fresher and even less expensive than the store. Yes, there are dogs and children, but it is part of the culture of the neighborhood. The French Market is smaller than most farmers' markets, but it has a nice variety of everything we need. The fresh made crepes are delicious, too!",
            "author": "Karen W."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-05-31",
            "description": "Where oh where are the organic produce in this area?  Limited selection of regular produce and didn't see any organic.  If you're in the market for some jewelry or flowers come here.  If you want organic produce well- I don't know where to tell you to go in this area but This is not the place.",
            "author": "Jenny R."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-07-11",
            "description": "Giving a one star! No dogs allowed. Bad idea. Many people love to shop outdoors with their dogs.",
            "author": "Laura B."
        }
    ],
    "priceRange": "$$",
    "name": "French Market - Wilmette",
    "address": {
        "addressLocality": "Wilmette",
        "addressRegion": "IL",
        "streetAddress": "1200 Wilmette Ave",
        "postalCode": "60091",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/u_n222IuxYXE8sDZoBMyHQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13125750286"
}