{
    "aggregateRating": {
        "reviewCount": 18,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-05",
            "description": "LOVE IT!\n\nLafayette is, in my opinion, very lucky to have a store of this nature. Not only will you find foods (like their greet olive bar) that you won't find elsewhere, but you'll also find fresh produce and a GREAT selection of meat and fish. Sure, you might find something similar at Payless and pay slightly less, but to me, the quality and selection make a trip to this store worthwhile. I've always received friendly, helpful service here, and was surprised at another review that spoke otherwise. I often purchase sourdough bread (which you won't find at Payless) and when I ask them to slice it they are always very willing to accommodate my request. As well, they have a better selection of wines that any of the other grocery stores. All in all, I am very satisfied and glad that they chose Lafayette for a location.",
            "author": "James W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-05-09",
            "description": "Great little store for the area. The deli features fresh sandwiches and pizza, along with soups. Great place to catch a quick bite. They have a good selection of fresh fruits and vegetables and keep it stocked. In comparison, the Payless on Maple Grove by the mall looks picked over most of the time and not stocked.\n\nAs this is a smaller market, this store does not have the selection of fresh baked breads that some other locations have. Watch for sales, there can be great bargains made here.",
            "author": "Steve P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-06",
            "description": "Nice store with a lot of organics. Better supply of organic meat than I'm use too.  Fresh clean veggies nice variety.  I am happy to find this store and will buy all organic meats and veggies here as well as other organic food products. They have a nice spice section with bulks. Honey and olive oils good supply.",
            "author": "Sam S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-09-04",
            "description": "Does not deserve to be called a farmers market. \nBiggest dislike: \"Farmers market\" is in the name, but not anywhere in the store can I find food that is local or the source of the food is available to the customers. \nI've asked which milk is local more than once, and no one can give me an answer. Same thing for the meat. \nI've never been extraordinarily impressed by the produce section. The chicken never looks fresh. \nBest store around, but certainly not the best I've ever been to. I JUST WANT LOCAL FRUITS AND VEGGIES. Why ship in things from far away, like strawberries, when they can be purchased locally?\n\nPros: Fresh squeezed juice. But for some reason this store hasn't caught on that every single Sunday they sell out by 3 in the afternoon. \n\nNew to the area so I am slowly making connections with farmers to get my meat, milk, and other produce from them. Once I do I probably won't come here for much",
            "author": "Kara P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-24",
            "description": "Lafayette is lucky to have a store like this. There is a great selection of deli foods, produce, and other groceries. It is possible to get some good deals here if you watch for their weekly ads. The store itself is open and inviting and the staff is always very nice.",
            "author": "Julia B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-09-30",
            "description": "I love that Fresh Thyme offers bulk goods that can be refilled. Since I am trying to cut back on packaging, this appeared to be the perfect option for me. However, when I arrived, I met several problems. First, I could not find any non-packaged fruit, besides apples. Second, I could not find a scale to weigh my dried goods jars before and after adding dry goods. Third, I was treated poorly at checkout. Rather than graciously informing me where the scales were and requesting that I record the 3 number code per dry good, she spoke down to me in her corrections. Also upon checkout, I said \"This is my first time here. I'm trying to cut back on plastic so figured I could use all my reusables here.\" She replied \"so no plastic bags then?\" whilr gesturing to my reusable bag on the checkout belt. I confirmed and panicked through finding my dry good codes. When I returned, all of my goods were packed in plastic bags with my reusable bag next to them, empty. \n\nI have never had such poor service from a grocery checkout. In no case is it right to blatantly ignore the customers' wishes while speaking down to them. This employee will make me reconsider ever returning.",
            "author": "Kira F."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-01-21",
            "description": "Everytime I go to a fresh thyme for a Wheatgrass shot, no one is able to make me one. Not just this location. Either they don't have the grass, no one is able to do it or no one is willing. Where else can you get Wheatgrass shots in Lafayette?",
            "author": "Derek W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-23",
            "description": "Fresh Thyme is a wonderful grocery store with a great bulk selection. The prices are comparable to every other grocery store, and they always have great deals!",
            "author": "Marissa H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-01-18",
            "description": "This is a great place to get alternative, hard-to-find food items. However I am able to find quite a few of these items at the Payless on Greenbush and often at a cheaper price. Overall I do love having a store like this in Lafayette. Now, to my major grievance: the unfriendly staff. Yesterday the cashier did not say a word to me and actually threw all my items into the bag. The rest of the staff were not much better, all with their heads down and sullen expressions on their faces.",
            "author": "Susan S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-04-01",
            "description": "We've always gotten great, above and beyond, exceptional service from this location. Thank you for providing such amazing customer service and always having helpful employees around. We love shopping here and go here for most of our produce and meats!",
            "author": "Jenny N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-12-26",
            "description": "Their deli has some good food you can take to go. The staff is very helpful. Although it can be pricey you can catch very good deals with their weekly ads. They also carry some products that other chains nearby don't. It's a weekly trip for me.",
            "author": "Amanda S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-03-25",
            "description": "I am so happy that Fresh Thyme came to town. We are already on a first name basis with most of the cashiers. I love making my own cashew butter. Their produce is fresh, and they have a good selection.",
            "author": "M D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-03-18",
            "description": "I think it is a great concept and can be a great addition to Lafayette, There can be some great products to be had at great prices at times. However, when I visited last week, I had the most difficult time finding any loose onions that seemed suitable for purchase. The cookies and muffins are really good, just a bit overly sweet. The deli has a great selection but I would like if the staff could pay a little more attention to the counter. Takes awhile to be acknowledged. Also, whatever coffee was available by the cup at the sandwich counter, was outstanding.",
            "author": "Kelly J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-08-11",
            "description": "I love this place!  The fresh produce, packaged Indian food, olive bar, and the bulk items: bulk coffee, bulk grains, nuts, dried fruits/vegetables, and candies and snacks are great. The liquid bar is clever (honey, other liquid food items) and the nut butter bar (make your own nut butters\nfrom various nuts) is great, although I haven't bought anything. They also have a pretty good deli, butcher (with exotic meets like elk available in the pre-packaged section), and pre-made/prepared fresh foods (they have a really excellent vegetable soup).\n\nThey have an amazing selection of exotic (non-alcoholic) drinks and packaged foods - both\nrefrigerated and frozen.  Prices on the the fresh produce are GREAT.\n\nThe employees are always nice and it's a fun place to shop.  \n\nThe only minus is that I wish their bakery items were nicer (higher end, with decorated cakes, etc).",
            "author": "Jenny R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-01-12",
            "description": "I drive an hour because I love this store.\nI use unique items (Stevia, erythritol, Zevia, oolong tea, almond milk, Ezekiel bread) most stores near me do not carry (or are crazy high in price) and they have these things at reasonable prices or if they don't... \nI have requested Lily's chocolate bars and low and behold, they now carry those! (I LOVE a store that listens to their customers!!!) They have a suggestion box after the checkouts. \nI appreciate their bulk foods so I can get just a tiny bit of any odd thing I need.\nGood prices on fresh veggies. AND I believe their veggies are fresh. \nThey are helpful and friendly. \nThey have samples many times.\nClean, trendy look makes me feel special. ;-)\nThey carry lotions and lip balms and creams and they have testers of these things.\nGround turkey.\nSome things are a tiny bit pricey but not as outrageous as some other health food stores I could frequent. \nTheir sales are good and ultimately that keeps me coming back.",
            "author": "Lynn K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-11-14",
            "description": "My wife and I tried the Pizza at Fresh Thyme Farmers Market based on the review submitted by Julie D. We ordered a 12\" pizza with extra cheese, glad we did, and sausage. The amount of cheese on our pizza was nothing more than we would expect on a regular cheese pizza. The sausage and one other meat selection in the  display of selectable toppings did not look fresh. Seven minutes later, our pizza came out of the little box oven. The cheese on top was done well, however the super thin crust was under-cooked. The fellow that took our order and made our pizza was very nice. I did-not find any salt, black pepper or grated cheese to put on our pizza. If I'm not mistaken, the pizza cost #6.99, one dollar less than their regular price for that 12\" pizza. I can't give as high a score as Julie D gave her pizza, but the pizza was tasty. The Fresh Thyme Farmers Market is new to Lafayette and seems to be doing well. The staff is very helpful and accommodating. I'll probably do an overall rating of the store  after I've shopped there a few more times. Today, I am only rating their pizza. The opinions expressed in this review are mine alone.\nI will try their pizza again in a few weeks to see if they have made any changes/improvements. Razor1313\nPS; The popyee saying the employees are wearing on the back of their tee shirts \" I am what I am \" is almost the same saying I put  on my business cards 35 years ago. My logo actually stated \" I am what I am-that's why I am what I am. I Like it.  \nI have been in touch with someone at The Fresh Market and Whole Foods for 2 years, shortly after my wife and I moved to Lafayette, In., begging them to open a store in Lafayette. I gave them each a dozen reasons why Lafayette would be a great viable location. It never happened, but I am glad that Fresh Thyme reccognised Lafayette's potential. I hope The Fresh Thyme Market Place does well in Lafayette.",
            "author": "Ray H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-11-02",
            "description": "Surprisingly tasty pizza, built fresh, while you watch.   Generous, tasty toppings.   I only tried it once so I'm hoping it's always that good.",
            "author": "Julie D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-03-16",
            "description": "First, I already liked them prior to this review. Their employees are friendly, the meats are amazing, the store is clean, the pizza and sandwiches are very tasty. Great place. This review is for what happened the other day. My sister and I went in to grab pizza for ourselves. The employee behind the counter ignored us at first, then cussed at the other girl working there, then cleaned up a spill behind the counter that was on the floor while wearing gloves, then without changing gloves immediately went to fixing other orders. Gross. Really gross. Change your gloves. We turned in our pizza order then found a manager and told him. He  immediately apologized, made our pizzas himself, then gave us a discount when we purchased the pizzas. His customer service was top notch and his handling of the issue was well above expectation. I would highly recommend this store to anyone. They obviously care about their customers.",
            "author": "Rose C."
        }
    ],
    "priceRange": "$$",
    "name": "Fresh Thyme Farmers Market- Lafayette",
    "address": {
        "addressLocality": "Lafayette",
        "addressRegion": "IN",
        "streetAddress": "220 S Creasy Ln",
        "postalCode": "47905",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/B62jgeyF5WE4c8myyvnlGg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17654461351"
}