{
    "aggregateRating": {
        "reviewCount": 61,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-01-12",
            "description": "Only recently have I started shopping here regularly (it's now part of my \"grocery shopping circuit\"), and I'm really pleased with the quality of their produce and the selection of frozen goods.  Their deli, the salad bar, and their prepared foods section is also among the best in the area.  The selection can vary widely, though, so there will be the rare trip - here and there - where I don't find something I'm in the mood for.  Whenever they have chicken pot pies, tough, I'm definitely getting one.  IMO, one of the best store-bought pot pies I've had in decades.\n\nTheir butcher counter and meat/seafood selection is pretty solid, for the price.  They have one of the best selection of dairy and non-dairy vegan goods in their refrigerated sections, and fair-to-good prices (definitely keep an eye out for specials).  They are a little limited in their selection of paper products and cleaning supplies, but they have the essentials.  Their selection of canned and boxed dry goods is fairly good, though you need to keep an eye on the prices (they seem to vary month-to-month).  They have a great selection of beauty and wellness products, though their prices can vary a bit too (keep an eye out for coupons and specials).  The store is very well maintained, the staff are all very good, and their checkout lines are often pretty quick.  \n\nI think Fresh Thyme's best feature, which I decided to save for last, is their Bulk Foods section.  They have an excellent selection - everything is super fresh, and their prices-per-weight are often among the best in the area that I've found so far for the quality.  They have the best local honey here, at any price (and their happens to be quite reasonable), based on my tastes.  Their assortment of bulk snacks and candies are exceptional, and the prices are great, as well.  Fresh Thyme's Bulk Foods section fuels my gummy candy addiction. \n\nFresh Thyme has now become a permanent stop on my \"grocery shopping circuit.\"  No one store in the area has everything I need, for the right price, but Fresh Thyme covers 2/3rds of what I need.  If the other stores in my list suddenly disappeared, I could probably get 90% of what I needed from Fresh Thyme, and I'd be okay with that.",
            "author": "Peter S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-02",
            "description": "One of the better Fresh Thyme locations in the area. Prices are a bit high on non-produce and non-sale items, but extremely competitive if you're searching for these specific items. As the name implies, this is one of the best places to look for fresh fruits and vegetables in the area with tons of selection of all different types of apples, grapes, squash, etc. If you visit on Wednesday, you can take advantage of the current and previous week's sales on the same day.\n\nThe selection of premium dry items, coffee, ice cream, and meat is also impressive as well. Prices are a bit high for these, but very competitive when it comes to very premium items (such as Jeni's Splendid Ice Creams). Cooked food is similar in quality to other local restaurants, for a much cheaper price.\n\nThe store is very well kept, clean, and organized. It is well lit with generous aisle space and easy-to-read labels. Good grocery store for a wide variety of staple and premium items.",
            "author": "Sherwin C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-03",
            "description": "I really like it here! I come for fresh veggies and meats. Their organic veggy section is slim, but I usually go for non-organic produce, which is priced much lower here than at most other stores in the area. Their meat is priced pretty well too, and they have nitrate-free deli turkey and ham, and a pretty cool selection of sausages/brats made with pork or chicken on the other side of the store.\nThe staff at the deli and meat counters are always nice and knowledgeable, as are staff in the produce sections and vitamin & body care section. \nA bonus- I always had back to their discontinued items section back by restrooms and score good deals on interesting items like tiny tupperware, protein powder, and skin care items. \nThe only thing lacking seems to be friendly cashiers.\nI come here about twice a month, and I'd say half the time, the cashiers seem like they'd rather be somewhere else. It might be for lack of something to do, as there frequently aren't a lot of customers. It'd be a shame to see this place go, though, as the products are good value and quality, a match that I'm hard pressed to find elsewhere around here.",
            "author": "Katharine M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-05-13",
            "description": "I have been going to the Deerfield location since they first opened. There are a lot of changes for the worse. Their prices definitely went up, their sales are not as good, their customer service got a lot worse, their coffee is old and stale, even on the Saturday mornings, and to top it all of, you have to check you receipt because they charge wrong prices often. They don't have many  customers, and I think that if the Fresh Thyme does not change for the better, it will loose remaining few that are still left.",
            "author": "Maryana R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-23",
            "description": "Some people I have talked to have had mixed reviews on this place and not sure where it fits into the market. I say think trader joes meets whole foods. Or remember before whole foods bought out fresh fields back in the day...yah it's been a while but fresh fields was soooo...much better and more affordable. \nAnywho the staff here is friendly and helpful. The store might not have everything you need (like the comparison stores I mentioned) but what they do have is a really nice selection of healthy options and a great prepared food/deli/vegetable area etc. Nice selection of wine and craft beer. I am very glad this opened in the area and will be back again soon.",
            "author": "Dylan M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-08-28",
            "description": "My favorite place to shop for produce! I don't know how they're still in business because it's always near empty when I'm there, but I love the short lines and it's great that I can zip in and out without fighting a crowd. They also have a great selection of natural and organic foods, some that I haven't been able to find at my other regular stores. My only complaint is hey stopped carrying kosher chicken. Please Fresh Thyme, don't go away!",
            "author": "Karen M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-09-25",
            "description": "Friendly and helpful staff!!  Everything they sell is fresh and afordable!! I Love this store!!!",
            "author": "Sherry A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-03-01",
            "description": "Wonderful new grocery entry in the area.  Good produce selection.  Great bulk offerings (tho area has been cut back lately.  Regular sales in meat and dairy departments with great values.  Lots of wood/nice ambiance.  Natural food influence without the high cost/snobbery of whole foods.",
            "author": "Gail F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-04-07",
            "description": "This place is my new favorite store for fresh produce and meats.  It's not as big as a typical grocery store so their selection is limited, but they make up for it in quality and weekly ad sales.  I also love getting their sushi.  It is always fresh and delicious...their crunchy California roll and shrimp tempura roll are better than most sushi restaurants!  Just wish they opened one closer to me.",
            "author": "Grace Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-11-11",
            "description": "I wanted to wait until I had enough visits here to write a solid review. Now that I have been here nearly 4 days a week for the last 2 weeks I think we've got a big enough sample size. \n\nThe place is really well lit and well laid out. Groceries that are dark make me think, are they hiding something? This one is impeccably clean and well organized. It will take no time at all to find items in this store. Terribly intuitive.  \n\nThe produce is beautiful and well priced. Cheaper than Whole Foods by a mile. The produce is extremely well laid out.\n\nHot items: One of my favorite thing about his place is the lunch. Their hot lunch items are excellent and well priced. Daily, they have a sandwich of the day that is $5. They also have a nice soup and sandwich combo. I have the Vietnamese sandwich last week and it was excellent. \n\nDairy: the dairy is well priced. They have the standard brands, but they also have lots of clean eating/organic choices. I purchased butter, yogurt and milk and was happy with the selection, price, and amount of time before the expiration date. \n\nAlcohol: luckily, I came at the right time and there was a wine sample. Excellent wine with a nice display. All the wines I liked were under $10. Nice beer selection, lots of bomber bottles to choose from. \n\nDeli: I bought the premade pork tenderloins. I bought one with wild rice and another with broccoli and cheddar. These were fantastic and inexpensive. Makes it difficult to be motivated to make yourself when the premade tastes better than your own and there is no chopping involved. \n\nLotions and herbs: good place to go. Lot's of options and not all will hurt your wallet \n\nBulk foods: I don't buy a lot of bulk foods but the granola was fantastic. Great place to buy rice. \n\nOverall: I haven't found any negatives with this place. It's never crowded, helpful service, and excellent food for the price",
            "author": "Liz T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-08-05",
            "description": "I don't know, I just don't know what I think about this new grocery in the area.\n\nTonight, an hour before close, there were four cars in the parking lot and only three of us in the store shopping. It felt sad! I've been wanting to check this store out for awhile, and tonight I decided to stop in. \n\nHere's the deal:\n* It reminds me of Whole Foods, but smaller like a Trader Joes.\n* The organic produce selection is pretty small.\n* The decor is really cute, and guides you to think you're at a farmers market.\n* There is a most substantial natural vitamins section.\n* The yogurt is super expensive, but they sure have a nice selection.\nNote: Chobani here. You won't find this at Whole Foods.\n\nWould I go out of my way to come here? The answer is only if I needed to. If I want pricey I'd head to Whole Foods. If I want produce I would go out of my way to go to Marianos. For the basics, it's Jewel for me. \n\nIt's not that I don't like the store, I just think I can find what I need elsewhere.",
            "author": "Angela S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-02-01",
            "description": "Pretty decent food and prices. good selection. Nice store and pretty good staff. Not sure yet what i think of the quality of some of the deli food. I have gotten the rotisserie chicken salad twice and both times i have hurt my teeth biting onto a bone. \n\nI'm sure i'll try them again in the future, but it might be a bit.",
            "author": "Dave V."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-11-17",
            "description": "For me it's all about the deli counter along with the cooked to order pizzas. Their subs and muffulettas are really tasty and they don't skimp on the lunch meats. Loved the Italian beef and cheese. Order a pizza with as many ingredients as you like for no additional charge on wheat or regular white flour dough. Ready in ten minutes. Love the brats and the wide variety of fresh made sausages. Hell I even had sushi there and I'm not really a raw fish guy but it was tasty. Excellent fresh made daily breads.",
            "author": "Jay K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-18",
            "description": "Fresh Thyme rocks, especially on double ad Wednesdays!  If you really want to save a ton of money, go on Wednesdays and grab the low prices from both weekly ads for (mostly) organic and healthy food.  I'd put it in between a Traders Joes and Whole Paycheck.  The produce is the jewel of Fresh Thyme.  The employees are friendly. Another thing is they offer samples all over the store and kids get to snack on free produce!  You can't beat that!",
            "author": "Pat B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-12-29",
            "description": "Now my favorite market for meat! A few weeks ago I noticed the store was having a sale on beef tenderloin.  I had never shopped there before but the sale price was too good to pass up.  I ended up buying tenderloin for Christmas Eve dinner.  The tenderloins were delicious - beautifully trimmed and tied - and super tender! I've been serving tenderloin for over 30 years and everyone said it was the best ever!! Thank you to the butchers at Fresh Thyme!",
            "author": "Anne M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-02-22",
            "description": "A hidden gem!\n\nGreat produce at reasonable prices.  The deli is second to none!\n\nA must-try for anyone in the area.",
            "author": "Scott S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-08-21",
            "description": "Last week drove over to pickup some items that are unavailable any where else. \n\nGave the fruits and veggies another chance because I was there and out of each item. \nWell, unfortunately those turned to mold in two days: grape fruit and peaches- its apparent if you dont eat them right away they go to mold- refrigerated or not. \nWarning: if you buy these item, eat them day of purchase.\n\nI will now only purchase dry or frozen goods. \n\nHope they can figure out the problem!",
            "author": "Foodie A."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-04-21",
            "description": "This store is like quadruple in size of the store down in Fairview Heights, Il. Unfortunately, it is also like quadruple in slowness in the check out line. \n\nWe were third in line, and it took 10 minutes to get through the line. Despite another checker coming to help, it didn't change the wait at all. The checker didn't know any of the bread prices or any of the maybe fruit? bulk? stuffs...without any SKU numbers, she stood there with the person in front of us consulting a list. The customer finally had to tell her how much each item was...and she rung it up accordingly. So management definitely needs to train their staff more before sending them out to the wolves.\n\nOther than that...it's your typical Fresh Thyme store. The meats and deli counter are larger in size than the one down in Fairview Heights, but they are pretty comparable to what Jewel and Whole Foods have. It was also almost deserted in the store, not sure if that's typical on a Tuesday night. They also do not have a fresh juice bar, like the Fairview Heights one has...but they have more variety in nut butters.  It's still a good store providing competition to the ever-changing grocery scene in Chicagoland.",
            "author": "Cherie O."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-04-30",
            "description": "I recently went to this location. I had gone before and had a good experience. I had never reviewed it before, but after yesterday's visit it was a must.  The location is not so great but cute decor. It was really clean so that's nice. The customer service at the fish department was plain awful yesterday. Very rude. With the guy bumping me without an excuse me and the same guy not asking  if I needed any help. Clearly I was standing there waiting for him to acknowledge me. So when that didn't happened, I said \"excuse me sir could you please help me?\" Again no answer, but he got what I needed. (With burp included) I don't know if I'll be back, but I like their sales and most of the other employees. So maybe I'll think about it. (Really hard)",
            "author": "Gaby R."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2015-01-17",
            "description": "This isn't a farmers market. It's a rather small grocery store in the vein of Whole Foods or Sunset Foods. The price points, selection, and atmosphere were nothing special. The deli stuff I bought were mundane and bland. The store was also weirdly empty and had an interesting spacious layout in their aisles. That earned them a second star because I get anxious at grocery stores due to the tedious waits and milling idiots wandering aisles. A lot of those places like Jewel or Target have an already seedy vibe and eerie aura and their crowds make that shtty feeling worse. So this one is noteworthy as a contrast.",
            "author": "Adriane P."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-12-22",
                "description": "I do some volunteer work for an organization in Lake Forest, so I pass Fresh Thyme along my route to my appointed rounds.\n\nMy wife saw their ad and asked me to pick up a few produce items they were featuring, which I agreed to do.\n\nWalking into Fresh Thyme, I feared that this might be another faddish and overpriced cutesy store that appeal to rich dilettantes, but I was pleasantly surprised.  Although the store is slightly more expensive than the mainline groceries, it was reasonably competitive and nicely maintained.  \n\nThe store has an ambience of a toned down Trader Joe's with faux blackboard signs, odd brands, and a mildly whimsical flair.  Most of the produce is of standard to above-average quality - and the pricing is a bit high, but not like Whole Paycheck.  Every week they do offer special promotions that are pretty good deals.\n\nOn my most recent trip, I bought coffee, various types of fruit, and some specialty Oriental veggies that cannot always be found at major supermarkets - all of which were on sale (of course).\n\nFrankly, I am a very cost-conscious old phart, and I will probably not visit this store very often, but I think it serves as a nice alternative to some of the more pretentious produce places popping up around here.\n\nWell, I have to go now.  It is thyme for me to run my daily errands.",
                "author": "Richard B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-03-25",
                "description": "I love this place!\nThe produce is always fresh, the store is kept very clean, and the prices are amazing.  Better quality produce than Jewel or Whole Foods, and better prices.  Huge selection of bulk coffee and nuts, dried fruit, etc. The store is kind of small, which I like, and the employees are always friendly and helpful.  Just park, shop, and go.\nIf I could change one thing...  it would be the overhead music.  Too much '70's for me.",
                "author": "Becky S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-09-16",
                "description": "I can't say enough Great things about this place !!\nThe costumer service is OUTSTANDING !!\nSoooooo many perks , where do I begin ??\nGreat weekly specials !!! \nBest prices on organic produce !!!\nAwesome sushi (& generous samples during the day )\nMake your own PIZZA bar & Sandwich bar !!\nGreat uncrammed layout & ample parking !!\nHelp yourself by the lb bins with massive selection!!!\nYes a few minor kinks to be ironed out but that is to\nBe expected !! So hopefully people will catch on\n& realize u get a lot more bang for your buck here\nThan you do @ Whole Paycheck !!! Oops hate to bash\nAnother place but that ones just too hard to pass up !!\nMy only request is that they add a juice / smoothy \nBar !!!",
                "author": "elizabeth t."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2016-07-18",
                "description": "Cute little market...don't bother with the \"fresh\" sandwiches. Stale bread and all white bread. At a place like this? That's a joke.",
                "author": "Jenny L."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2016-04-24",
                "description": "I stopped into the store for the first time this week and I have to agree with the shoppers that question freshness.  I picked up fresh sliced fruit only to get it home and see that it was two days past the expiration date and smelled.  I have never had Mariano's or Whole Foods have bad food on the shelves--they check for those things.  I also bought mashed potatoes from the deli that made their way to the garbage disposal that evening--really tasted awful.  The bread looks old and stale.  I am not sure what the marvelous specials are that people keep referring to--I thought their prices were higher than Mariano's by a lot.\nThis store was nearly empty--it was weird.  This store is a Mariano's or Whole Foods wannabe that will never be.  I give 6-12 months if that.",
                "author": "Pamela S."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2014-06-25",
                "description": "I couldn't even get in today.  Terrible parking lot layout and not nearly enough handicapped spaces.  Everyone driving was waiting for the couple of  handicapped spots and it backed up traffic onto Waukegan and Lake Cook.  \n\nMaybe they were giving away free Metamucil? I saw hoards of Centenarians trampling others to get into the store.  If you were born after WWII, avoid.",
                "author": "Gordon G."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2016-04-28",
                "description": "high prices, bad customer service. No wonder why the place is always empty.\n\nThey are often sold out of sales items in less than 24 hours.  Perhaps you should be better prepared and have more on order",
                "author": "Foodie W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-08-08",
                "description": "Went here for the fist time today.  They also sell the flax milk I like.  And they sold me salmon wild sockeye I think it was but definitely wild for 13.99 a pound.  Cheaper than whole foods.",
                "author": "kavan s."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-06-29",
                "description": "I'm glad a place like this choose the location it did because my go to is Whole Foods, however WF doesn't offer some produce that's less expensive like this store and that's a huge plus. Not EVERYTHING at Whole foods is organic and they still charge high prices for conventional fruits and veggies. The prices were great here (perhaps bc they just opened) and they have Boars Head deli. I found the staff friendly however, there were way too many corporate staff members lingering around that aisles in the way on opening day.\n\nHope this place stays strong.",
                "author": "Diana P."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-10-21",
                "description": "Their weekly specials are often great deals (especially 2- or 3-day sales)!  Even if Jewel has similar specials, I've had much more success actually getting the items here since Jewel seems to have difficulties keeping items on special in stock.  The store also has a much less crowded and cramped feel than many other stores in the area, which makes shopping more pleasant. This has been our go-to spot for specials (though regular-priced items can be a bit on the expensive side).",
                "author": "Kirsten H."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-04-28",
                "description": "Delicious wraps and chicken salad, bakery is just okay though,  bountiful of organic drinks including zevia and Honest Tea. Good produce, love their spicy ahi tuna poke. Tastes very fresh and tender. All types of imported and natural goodies here. Prices are pretty reasonable vs whole foods. They also have a nuts, candy and churn your own peanut butter section. Fruity candy tastes like real fruit! Just love this neighborhood gem of a grocery store.",
                "author": "Suzanne D."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2015-10-16",
                "description": "Love this place (well the Mount Prospect location) but Deefield is a JOKE.  I've ordered the same sandwich every day this week and everyday it has been COMPLETELY DIFFERENT and well....WRONG.  I had to actually explain how to make it on Tuesday.  (really?!?! its turkey and cheese and bacon on wheat toasted...not rocket science people).  Super frustrating, I'm beginning to wonder the application just asks for your name and whether you've ever experienced and major head trauma.  Geeze get it together people!!!",
                "author": "H. W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-11-04",
                "description": "Really helpful customer service and good produce.  Their persimmons were on sale and outstanding.  Cashew butter can be ground on demand and half the price of Whole Foods.  I plan to return.",
                "author": "Ali C."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2017-02-15",
                "description": "They have great deals on produce, meats and fish, although I've noticed you have to use pretty quickly for freshness.  Most items are pretty pricey, but they have a good selection of higher-end products.  I always spend more than I mean to, as they have some fun stuff.",
                "author": "Allison C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-06-30",
                "description": "I am a little surprised on how negative the first few reviews are about this place.  I know that there were some Deerfield residents who got their panties in a twist that a store was opening near their house and it would be loud (http://deerfield.suntimes.com/2014/02/25/fresh-thyme-prepares-to-open-as-lawsuit-ruling-awaits/).  But what did people expect to happen with a shopping center?\n\nWell I got there and had no issues with parking at all.  And yes the parking lot was full and yes there were old people there (plus families, and people in their 30's..... so not sure what the age meant in the previous reviews).\n\nOnce I was inside, there was definately some prices that are much better than other stores.  But not everything was priced like that.  Milk was relatively expensive with the cheapest milk over $4 per gallon.  But there were 0.97 per # of cherries, less than $2 per # of boneless chicken breast....\n\nThe organic section is not as big as Whole Foods, but the prices are much cheaper on the organic foods they have.  \n\nI think this place will easily be added to my grocery stores as if you shop based on the flyer it will be a great deal.",
                "author": "Jonathan C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-08-31",
                "description": "Great store clean, good prices. the vitamin area reminded me a little of Whole foods with more of Trader Joes prices. Went on a Friday evening so it was nice not a big crowd and easy to navigate around.",
                "author": "Susan S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-09-12",
                "description": "This boutique market has large selection of beautiful fresh flowers and hanging plants. The flower manager is so particular and careful! Although small, it's the best floral department I've seen in years.   \n\nI also like the fresh house made sausages and the grass fed beef selection is huge considering the size of the store.   Quality over quantity should be on the sign out front.",
                "author": "Jean Z."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-02-11",
                "description": "Excellent across the board! LOVE LOVE LOVE the Produce Department and all that it offers. Exceptionally fresh looking at all times. Been there several times and will be coming back a lot more in the future! Thank you for this wonderful addition to the area!",
                "author": "Angela O."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2017-09-08",
                "description": "We shop here at least once a week or every other week, but this past weekend experience has finally made me decide not to shop here anymore. Products itself are fine as they have a great variety at competitive prices. It's the staff and employees that has annoyed me, particularly at the checkout, that has made me decide not to come here anymore. They are \"zombies\" (expressionless) with no proper customer service training. We were waiting and waiting in line at the checkout and cashiers were playing musical chairs (leaving their posts) and lines were building up with customers ready to checkout. As they come back to their post they say I can help some one here (instead saying next person in line step over here please) which then you see the last person go jump right (skipping) to their counter. The vibe that I feel there at the checkout is that these employees don't care about their jobs nor the customers experience of shopping there. I have shopped at nearby groceries (jewel Whole Foods Mariano etc) all of them greet you, ask if you found everything you need, or if you need help loading groceries. Fresh thyme, on the other hand, just doesn't care about these. No wonder this place looks empty when we drive by at times. Maybe they will close-down as they realize they're losing customers to the other nearby groceries that care about better customer service!",
                "author": "Jeris Z."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-07-16",
                "description": "My husband and I went there last night to pick up a couple of sandwiches.  I had been there about a week ago and really liked the store.  My husband was very impressed with the store.  We sample some of their fresh bread and they were both amazing!  \nIt is not the place for all of my weekly shopping but will be on radar when looking for produce, bakery and meal ideas.\nWelcome to the neighborhood.",
                "author": "lisa a."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-09-09",
                "description": "This store reminds me of Whole Foods in product offerings, but it was less snooty like Trader Joe's. I enjoyed shopping the produce -- great prices and nice selection. I got some really great deals with most produce much less than Jewel prices. The store was fairly busy on Sunday afternoon, but the employees were very friendly and went out of their way to welcome me. \n\nThe meat looked nice, but it was quite expensive. The bread selection was rather small. The deli had some good looking sandwiches, but I did not try the deli yet. They have frozen foods and shelves of natural, vegan and specialty foods, but I prefer mainstream brands particularly since we are on a budget, so I'll be shopping elsewhere for frozen and pantry foods.\n\nI  would return for the produce without hesitation, and I plan to return to try the deli sandwiches. I doubt I'll be shopping the other half of the store.",
                "author": "Tina B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-06-28",
                "description": "Very impressive. Very clean and very courteous staff. I am a fan. Prices are very competitive with others in the neighborhood.",
                "author": "Ricardo K."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-08-13",
                "description": "I am a grocery-a-holic.\nThis whole healthy lifestyle I've chosen, means I'm a frequent shopper, with an intense ingredient scrutiny.\nWhy do you need to know that I'm mildly health consciously insane? Because it'll help you under and why I appreciate this store.\nFresh thyme is new to the area. It's set in an old shopping center that's been mostly vacant for as far back as I can recall. This equates to adequate parking even on a weekend. (Score!)\nIt's a smaller grocery store, but high quality.  They carry the oddities that us 'clean eaters' go ga-ga for and some for a tad less, while others, a mound more. \nKale chips here are super overpriced, while the chia pods are less than Mariano's, and other grocers. Ice-cream section (I looked, didn't buy) was on the high side as well.\nThey have a nice selection of fresh produce, and great selection of grassed meats. Huge plus! \nI picked up two pre-made selections. Potato/brussle sprout side (cooked with bacon) and a vegetable medley. Healthy ingredients, great flavor, little more expensive than I'm used to, but overall quality was worth it to me. \nThey had watermelons for $1.49 each, great buy and they were perfectly ripe.\nStaff was helpful and attentive. I'll add Fresh Thyme to my regular list of great grocers, but I'll still be shopping elsewhere for the items that are a tad overpriced here.\nStore was very clean, and well stocked and clearly caters to my kind!",
                "author": "Megan M."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2014-07-17",
                "description": "This store is a joke moldy blueberries at the entrance romaine on sale 88 lb great price oh but  wait they don't have any. I came in with an open mind and a desire to shop parking was not not an issue the produce was below fair only decent department in this store is their deli  this store won't last unless some major changes are made  I was hoping  someone new would come to give whole foods some competition I can't understand how anyone gave this store a good review maybe they have never been to whole foods or fresh farms",
                "author": "Green G."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-12-20",
                "description": "Decent assortment of produce. Some may not be really fresh and some overpriced. They wanted $6.99 a pound for Pablano Peppers as an example. The nice thing about this store is if you need what is on sale, it's usually a good deal. The layout is good, staff is friendly. I'd be more of a regular if the regular goods were priced more fairly. There's no reason to have Kashi cereal over $4 or Deans milk north of $4. I'll continue to support them as much as I can since I appreciate the location and staff.",
                "author": "Richard B."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2014-06-26",
                "description": "Huge disappointment. Prices aren't great and it's no competition to Whole Foods in my opinion. It's advertised as something it isn't. It's probably more like Sunset than any other store but with much less quality customer service. Very few organics. Nothing great about the meat dept. \nYou're not going to save any cash by shopping here - so stick with the real deal if you're serious about  clean food. Whole Foods wins. Hands down.",
                "author": "Cindy F."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-10-23",
                "description": "To Jessie T.\nThe Deerfield Police were called because the 3 customers, one African American, one Caucasian, and one Hispanic, were intoxicated and smelled of alcohol and marijuana. The police were called to make sure they were ok to drive a vehicle once they LEFT the store. Apparently, you have been misinformed.",
                "author": "Jeff M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-06-29",
                "description": "The store is very bright and inviting. The staff for the most part needs more education as to the products. I asked a man in the produce section if they had ruby red grapefruit and he'd said \"only yellow and I have never seen another color\".  The prices for the produce was very competitive for the area with a few real winners. The cheese section and wine area are laughable but the beer is impressive. The milk prices are outrageous but otherwise I was impressed. I hope that the prices are more than just for the opening and some of the education comes quick.",
                "author": "Brad S."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2014-09-30",
                "description": "F*** this place & its s***** people who work there when in today to get a pizza was harassed and got the police called on me and my two buddies as we SAT there and ate our pizzas that we purchase from them spend just about 40 $ in the last 25 minutes before closing had the worst experience in a grocery store ever in my life tonight at that location couldn't believe the manager had called the police on us seeing is how it was in a white prominent area and me and my two friends were minorities black and Mexican did nothing wrong just wanted to go in for a good reasonable cheap organic pizza end up with horrible anxiety and an urge to call corporate justice shall be served",
                "author": "Jessie T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-07-06",
                "description": "$1.47 for a huge watermelon, sweet corn from Georgia was 5 ears for a dollar!  Cherries were $1.99 a pound. The place was very busy and for a reason!  This place is going to be a great place to go to for \"deals\" on produce as long as you are ok with variety.  A few other items which were a stellar deal:  vine ripened tomatoes .99 cents a pound, my friend got a premium steak for a great price as well.  Trader Joes, Whole Foods, Sunset, Garden Fresh and others all hold their niche here in Chi town and burbs,  this place is unique on it's own and will be able to make the locals happy.  This area is populated with picky and sometimes demanding people, this is more a no frills grocery store.....  If you are looking for more service over stellar prices I would suggest Sunset or Whole Foods.  This place does have more of a farmers market vibe with lots of bulk foods as well as produce.",
                "author": "Vishal B."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2014-08-11",
                "description": "Nice store but  I got yelled at by an older lady in her 70's for putting my hand under the self  serve honey roasted peanuts dispenser to try a few peanuts to see if they were fresh  . She was not shopping and did not work at the store ? She was just watching people and giving her opinion.  My wife and I bought some items and left asap.  I guess an older crowd hangs out there . I am sorry to everybody for trying the peanuts and wont do it again.",
                "author": "Bill J."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2014-09-21",
                "description": "Came to Fresh Thyme to try it out. I'm on a restricted diet at the moment and can't have certain things, thankfully this place has a lot of boxed baking type foods that I am able to eat which is awesome! Prices are average (I usually shop at sunset and prices are pretty much the same). Only complaint I have is their seafood. It doesn't seem that fresh. I purchased some clams and asked before hand if they would make it till tomorrow and was reassured that they would. Took them out of the fridge to cook them and they were all dead. On the plus side I called the store up right away and they were upset that I had this experience and told me to just chuck them and the next time I shop with them show them the receipt and they will refund me which is good!",
                "author": "Rei M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-07-14",
                "description": "This place is wonderful. I usually shop at Whole Foods and I buy wine at Trader Joe's. I drive from east HP to get here. I used to live near the Niles, IL Fresh Farms. This parking lot is FINE. It's really not a big deal to get in and out of it.\n\nI'm a regular perimeter-only grocery shopper with occasional eggs/dairy.  There's plenty of organic produce in the CENTER of this store (blueberries and raspberries)--so if you usually shop the perimeter, you'll find yourself drifting into the center for some things, including those pesky preservative-laden foods.  Very sneaky sneaky!!\n\nFor those who eat fake meat products--they have plenty! Those 7-grain fake tenders were there. They had a great selection of GF. Ugh, I left with a $25 alcohol free essential oil diffuser. Damn, this place is going to get me every time in the personal products area. All of my favorite essential oils, natural sponges, Toms products, and even a few baby things as well. The organic scraps doll was a huge hit with my son.\n\nThe flowers were decent. The organic ice cream was $3.99 so a great price. I did notice the regular organic milk seemed about Sunset Foods priced so a bit higher than Jewel, TJ, and even some of the ones at WF. \n\n\n****I'm pretty sure the fish and meats were combined in the corner back part of the store. I hate fish and meat being placed together. A dedicated fish space is key for a nicer store like this--point off for that.**** \n\nLike any new store, you have to learn the layout. It is true when I went people were still unsure of the store and how to shop there. With time that will become a thing of the past. FYI the huge overheard sign that says \"dairy\" doesn't have cheese. Annoying, the cheese is to the right when you walk in. Isn't cheese dairy? Not good as I had to schlep all three kids back over to the other side for my dairy. However, those big glass doors were so lovely and no frost was on them. I could actually see the products. They carry Koloma milk which is a natural type of milk with a cream base on top. Very good quality.\n\nBottom line I used to have to go to like 6 stores, and now I can go to this ONE or maybe two. By the way, it is across from the Deerfield drive-thru Starbucks. BONUS",
                "author": "Sarah H."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2016-11-03",
                "description": "I'm moving to Deerfield for work. I visited this so called fresh thyme farmers market. The produce looks disgusting a lot of rotten fruit and vegetables. The selection of fresh meat and fish isn't anything really that special and looks low grade better off buying fresh meat at Walmart. The packaged chicken salad you can buy near the deli looks like they used really old chicken and stuffed it in and smells weird. The deli counter with prepared foods is just so low quality and poorly made with ingredients right off the sales floor as I witnessed the deli worker take something off the shelve in the grocery aisle open the package up and put it on my sandwich. I just about then refused to take it and just walked away. I thought the sandwiches were gourmet well I guess NOT!! You could make a better one at home really.. All the employees looked so disappointed like they didn't want to be there. No customer service what so ever. I work for a really big corporation in Deerfield and some of our employees go to fresh thyme for lunch. Well, that will change after I tell my employees in my board meeting next one that shops at your store will be fired.",
                "author": "Joe N."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2014-10-20",
                "description": "I am concerned. Sunday about noon, went to another larger store first . . . I got home realized that I forgot the fresh herbs. Fresh Thyme is kinda sorta closer, they had the herbs at a fair price, but was not very busy, kinda slow actually. The first larger store was crazy busy. I would love this center to succeed, but not sure what Fresh Thyme's place is in the \"Grocery Store Food Chain\" is.",
                "author": "Bruce S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-08-20",
                "description": "First time reviewing a grocery store but I think it's deserved. The employees here are friendly and very helpful. I am fairly impressed with their selection of trail mixes and bulk items. I bought a couple pounds of various chocolate covered nuts for a BBQ and they all went quick. The meat and fish section features an awesome array of various chicken sausages and fresh fish. Grilled up some sausages and burgers I bought and they were great! Chicken breast were inexpensive and high quality. Some things here are expensive, but they have a lot of unique items. I'll be back from time to time.",
                "author": "Rob S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-08-03",
                "description": "I give it 5 stars for the meat and prepped food section. The other sections are quite significant. The produce, preprepared foods, and sushi encourage me to come back. The organic sections and the bone in cuts along with the marinated meats encourage this over Jewel. Mariano's is not close enough to justify a regular trip.",
                "author": "L D."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-08-07",
                "description": "This sets the bar. With all the new versions of a smaller Whole Foods opening around here, it's a bit confusing. This is the best. Prices that are competitive with mainstream grocery stores, good sales, excellent meat, and a nice atmosphere. Even the grocery store sushi that they sell is better than everyone else's. Huge variety of chicken sausages. A little weak on the bakery and deli salads keeps them from getting that last star.",
                "author": "N E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-07-27",
                "description": "Worst aspect out of the way first:\n\n1. The main entrance is a stoplight near the intersection of Waukegan and Deerfield Road. This is a very busy intersection to begin with. This is not going to be a problem on an off hour, but during busier periods when this intersection is backed up, I can see this being a mess. I feel like there had to be a better choice for location.\n\nThat out of the way:\n\nThis is a cute, attractive store. It's not giant and I'm beginning to wonder whether or not that's the way of the future in terms of groceries. Do you need a thousand cereal options or just a well-curated selection of a couple of dozen? That's really a big theme in the future of groceries I think: differentiating yourself by not just offering everything that someone else does but an interesting mix of unique products.\n\nSolid produce section with great product and really appealing prices.The rest of the store is, again, on the smaller side, but liked the mix of products and prices were reasonable. Great bath and body section.\n\nOverall, I'd definitely go here again, but would really try to go on off hours primarily.",
                "author": "Scott B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-08-25",
                "description": "Meat and Produce are really very good and decently priced. Store is always clean and staff very courteous. Grocery, deli, and dairy items are pricey ... so save money on the meats and produce items by studying the Email ads on their Weekly Specials.",
                "author": "Terry B."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2014-06-29",
                "description": "I don't even know how, with a straight face, Fresh Thyme can claim to be such a great  value -- it is a very expensive grocery store.  Trader Joe's is infinitely cheaper; pricing is on par with Whole Foods and possibly even more.  Moreover, for a store claiming to offer so much organic produce, their selection was quite meager.  I will be sticking to Trader Joe's, Whole Foods, and Mariano's.",
                "author": "Howard H."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Fresh Thyme Farmers Market",
    "address": {
        "addressLocality": "Deerfield",
        "addressRegion": "IL",
        "streetAddress": "35 Waukegan Rd",
        "postalCode": "60015",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/26FJ0B_T3PrevAtrNQjVdQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18479488237"
}