{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-07",
            "description": "Self serve stand on the side of Old Hwy 100. There are in-season fruits and veggies and a freezer stocked full of pork products and fresh eggs. I regularly dream about the juicy, flavorful strawberries. Yum. Anyway, sometimes you can find random country items like apple butter and honey, too. \n\nTodd Geisert has become somewhat of a local celebrity now that trendy farm-to-table STL restaurants advertise his swine on their menus. But you can usually find him conversing with customers at the stand.",
            "author": "Meghan L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-22",
            "description": "We passed through and picked up veggies, herbs, and sausage for a stew and found great, cheap seasonal produce! The pick your own herbs garden includes basil, Thai basil, purple basil, Greek and Italian oregano, sage, mint, chocolate mint... the list goes on. Well-priced frozen pork products of all kinds, all-natural and made on the farm (large ham hock for only five dollars). Open during all daylight hours during the summer - its a pay by weight honor system, so be sure to leave what you owe, good citizen!",
            "author": "Alex M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-10-31",
            "description": "Delicious all natural pork products and fresh produce in season! If the sun is up, they are open. The new Pork Jerky is fantastic, you will never eat better. Ditto the brats, sausages and snacks!",
            "author": "Curt D."
        }
    ],
    "priceRange": "$",
    "name": "Geisert Farm",
    "address": {
        "addressLocality": "Labadie",
        "addressRegion": "MO",
        "streetAddress": "4851 Old Hwy 100",
        "postalCode": "63055",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7Mk2FxPsq8HIVnughfm2Tg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13147916942"
}