{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 2.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-06-14",
            "description": "I've lived in Glencoe for almost 5 months now and become more excited about living here on a daily basis. It's a small town, but I'm constantly impressed by my surroundings. For this reason I was psyched to check out the Glencoe Farmers Market on their very first day last weekend (it's continuing throughout the summer every Sat morning). I strolled my 6 month old to the metra station where the Farmers Market is  located. I  was sure to bring along my wallet to load up on fruits, veggies, baked goods, flowers and more. \n\nWhen I got there I was disappointed to see that the Glencoe Farmers Market consisted of 3 stands. I asked one of the women working the stands if there would be more added as the summer continued (afterall, it was the  first day). She wasn't sure, but said probably not...and nicely recommended the Wilmette French Market if I'm looking for something larger.\n\nNothing here excited me, but I wanted to support them so bought a box of peaches and made my way home. I have to admit that these were the best peaches I've had in a long time. Even my hating peach husband was a fan of them. And if I could get my 2 1/2 year old to actually eat a piece of fruit I think she'd like them too.\n\nI plan on heading back tomorrow and future Saturdays for some more peaches and possibly other produce as well. I still wish there was more of a variety, but am satisfied with the quality.",
            "author": "Andrea R."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-08-23",
            "description": "This is really sad - what happened here?\n\n I am not writing this review about the people who are selling here and I hope the best for them and hope that people support them. This is more about the Farmers Market itself. When I was younger, Glencoe had a very nice Farmers Market in the town that had a pleasant assortment of different merchants. For a while, the market was moved for no apparent reason over to the train station area. That clearly seems to have been a mistake, as it has been moved back to its old location and seems to have lost the majority of the merchants over the years. On a very recent weekend, there were maybe two stands selling.\n\nThe few people left at this market are very nice and sell great stuff, but with 2-3 stands here in recent times, I really just can't see enough interest if it continues like that. There are plenty of other great markets in this area, although I think it's kind of remarkable that absolutely tiny towns like Ravinia (which is not really a town as much a sub-section of Highland Park) and Lake Bluff offer farmers markets that are absolutely remarkable in what they offer. The Lake Bluff Farmers Market is INSANELY good and, as a result, it's not a surprise that that market is crowded every Friday - waiting to buy things at that market is not unusual and it's fantastic. I miss the Lake Bluff farmers market in the Winter and the first weekend it opens can't come soon enough. In terms of farmers markets this area, I'll say that the Lake Bluff one is the best - and probably still the best kept secret. Who'd expect tiny Lake Bluff to have such a lovely, packed farmers market, but it does.\n\nGlencoe recently started asking citizens to write in suggestions about what they want to see in Glencoe and I suppose at least that's a step in the right direction. The town is ABSOLUTELY very nice overall, but has been lackluster from a planning standpoint for years now. The fact that this Farmers Market - which used to be great - has been allowed to dwindle down to a couple of stands - is another example and it's really unfortunate. If anything, Glencoe should take a look at what Lake Bluff is doing, managing to turn a downtown area that was not much of anything not that long ago into a cute destination that has, little-by-little, offered more in the way of great restaurants/cafes and little shops.",
            "author": "Scott B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-08-21",
            "description": "Small but definitely functional. They sell what you would expect.  Fresh flowers and produce and also baked goods.  They also had a stand with honey products including candles that was very good. The cookies we had were excellent.  I was very excited that I was able to get fresh cilantro.  Not all the farmers markets have it.",
            "author": "Alan R."
        }
    ],
    "priceRange": "$$",
    "name": "Glencoe French Market",
    "address": {
        "addressLocality": "Glencoe",
        "addressRegion": "IL",
        "streetAddress": "675 Village Ct",
        "postalCode": "60022",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/elu30NgiuQt_5BOkx-I1zw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18478353333"
}