{
    "aggregateRating": {
        "reviewCount": 2,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-07-09",
            "description": "Visiting the Glen Ellyn French Market was a bit of a surprise, since my family and I are used to the bustling Saturday market in Wheaton.\n\nFrom what I gather, this market is newer, maybe still getting rolling. It happens on Sundays, from 9am to 2pm, in the parking lot at the corner of Crescent Blvd and Glenwood Ave. It's expected to continue until the end of October.\n\nOn our visit here, there were a couple farms selling produce, several bakeries, stands selling granola, tea, iced coffee, sausage and cheeses. A lady was selling Usbourne books (love those!). Hmm what am I missing? Oh yea, two guys were making the most delicious chicken tacos.\n\nThe amount of vendors and the crowd size are definitely more manageable than the Saturday market in Wheaton. I didn't care for the iced coffee I tried, which had me missing my Saturday cup from I Have A Bean. I'd skip that next time, but the rest of the market is worth checking out. If you see the guys grilling chicken, you must try a taco!",
            "author": "Sam P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-10-12",
            "description": "I've just returned from a shopping trip to the Glen Ellyn French Market.  I arrived at about 12:30 on a spectacularly beautiful fall day.  Despite it being close to closing time, every vendor's booth was well stocked.  Not a lot of vendors compared to Wheaton and even little Warrenville, but there is a decent choice of \"farmers\", meat purveyors, bakers, and random sellers of jewelry and olive oil.\n\nThat said, the biggest negative is the lack of shoppers.  I am not exaggerating when I say that I could count them on one hand- (and I think that 2 of them might have been vendors looking for something to do)  Every time I've gone this summer I've been shocked at how unsupported this market feels.  It's like going into a store where I am the only shopper- the help just stares and hovers it's all I can do to keep from bolting out the door.\n\nI'm not sure why this is the case.  Maybe the move from Friday to Sunday wasn't such a great move (not that Friday packed 'em in either).  Perhaps moving it to Sunday AFTERNOON would be better?  At least then a few downtown stores would be open too.  Add some music or something to give it a more festive buzz?  Right now it feels awkward and just plain dead.",
            "author": "Kathy L."
        }
    ],
    "priceRange": "$",
    "name": "Glen Ellyn French Market",
    "address": {
        "addressLocality": "Glen Ellyn",
        "addressRegion": "IL",
        "streetAddress": "460 Crescent Blvd",
        "postalCode": "60137",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/A7R1DUQ2QAcQD56_cxkTng/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13125750286"
}