{
    "aggregateRating": {
        "reviewCount": 29,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-16",
            "description": "Love the options here. Everything from Mushrooms to Goat Cheese to Soy \n\nVENDORS: Everything from Organic tomatoes, berries, wheatgrass, mushrooms, pastes and spreads, jams and jellies, cheese, tofu, soy noodles,  fresh flowers, etc.\n\nACCESSIBILITY: The market is right below the Morse Red Line Station and is one street level\n\nPRICING: Pricing is reasonable, $2 for a wheatgrass plant, $7 for spiced tofu, $5 for a medium sized container of blueberries. LINK card is accepted here, and they have a program that will match any LINK purchases in order to increase access to fresh food and organic products for LINK holders. Very much appreciated.",
            "author": "Devyn H T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-12",
            "description": "My neighborhood Farmers market \nAlways good selections and great people bringing a wonderful selection of food; flowers and yummy options",
            "author": "Robert S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-08-29",
            "description": "Now that I live around the corner, I enjoy making my weekly visit to the market. I pretty much only buy Elsie's pies (2 for $10). There's a lot of nice options but it's really too expensive for me. I wish I could afford a half dozen of farm fresh duck eggs, but I'm on the 99cent budget.  \nDue to the prices, I mostly just window shop and smell the soaps, but it's a nice way to spend a Sunday morning, nonetheless.",
            "author": "Alissa S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-07-30",
            "description": "I typically love this place buying fresh vegetables and talking to the vendors and friends at this weekly event; however today was an exception. I'm at the Farmers Market this morning in Rogers Park I innocently asked a vendor what kind of tomato were these bunch of brownish tomatoes? The girl behind the table stone cold smugly said and I quote: \"I don't know what it is, I just sell it.\" Being a sales guy I was sickened by her tone and unprofessionalism.",
            "author": "Andrew O."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-11",
            "description": "Great market with a convenient location.  Here you'll find a broad selection of produce, cheese, meet, baked goods...you name it!  If it grows within 200 miles of Chicago, chances are it's for sale here on Sunday morning!\n\nIn addition to all kinds of fresh fruit and veggies, you can get your weekly supply of empanadas, popsicles, cookies and amazing fresh-cut flowers.  Many weekends I can do most of my grocery shopping right here.\n\nMany vendors take credit cards and you can always swipe your card at the payment table for market tokens to make shopping easy and convenient.\n\nDog and kid friendly too! \n\nWhat some people may not know is that this market also supports much needed food access programs in the community. So you can fill your 'fridge and give back at the same time.\n\nMy favorite farmers market in the city",
            "author": "Troy B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-05",
            "description": "I am so excited... Woke super early and getting ready for opening day at the Glenwood Sunday Market!!! I'm eager to check out the new lineup the Council worked so hard to gather.  It's so wonderful that the most organic market in Illinois is opening for the season.\n\nEarth's First Harvest...Midnight Sun...Fresh Tomate...Dirt Girl...Hardin Family Farms...B True...Katherine Anne...  The list goes on!! I can't wait to see old friends and meet new ones!!\n\nGetting late gotta run. Bringing bags for scads of lovely fresh food. \n\nWorth the wait",
            "author": "Mary B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-17",
            "description": "The market is in the small street Glenwood next to the Morse train tracks.  You can find miscellaneous items from kale, strawberries, raspberries, whole wheat espresso brownies which I thought were excellent.  I purchased an herb, lime basil and can't wait to see it grow. \n\nThe people are super friendly and they do take credit cards. I wish they would have more fresh fruits...",
            "author": "Maria H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-10-12",
            "description": "Yes i still shop at the Glenwood Sunday Farmers Market. My latest discovery is already done and marinated tofu. One container is $6 or two for $10. I love that the tofu is already cooked and flavored for me and ready to go. I get the very spicy flavor. I eat it for lunch or dinner. I also like the fresh pesto stand again same price, one container is $6 or two for $10, very garlicky so watch out, don't eat it before a date or job interview. I find the vegetable stands very expensive and the tomatoes don't have that rich tomato smell so I am not too sure about them.",
            "author": "Moni K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-06-16",
            "description": "Take away the degenerate alcoholics, the hazy cigarette musk, and the basement indoor housing, and you have a place where everyone knows your name.  I true neighborhood farmer's market with a surprising variety of vendors (given its size) that should keep your fridge stocked for the week. Dogs and kids galore, and strangely easy to find parking. Come say hello.",
            "author": "Joe P."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-02-11",
            "description": "Eh, you know? This is just one of those \"eh\" places. It's way, way too crowded for the amount of vendors. On one hand, it's a lot of the vendors people are familiar with for a lot of the things you want. On the other hand, they have about 1/3rd of a card table to put their stuff on (and you have about the same amount of room to move around.\n\nI'm happy to explore farmers markets as I love them, but this is just blah. After making the short loop around everything twice, I wanted to get out of there more than I wanted to even stay and take in the experience. I don't get what the charm is of this place - I really don't see any.  It's not horrible, but it's just not....good.",
            "author": "Matt R."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-08-16",
            "description": "On the one hand, it is a weak version of a market.  On the other hand, it's their first year, and as with ice cream shops and used bookstores, you can never have too many.  (You could also apply the \"pizza and sex\" rule here.)  So I am glad to have them in the neighborhood.  I would like to see some more variety or simply more quantity of vendors, although I realize that the alley/train viaduct space is limiting. Let's see how they evolve and improve over the next couple of years.\n\nI've visited twice so far this season, once right after 9am and once around noon.  On the first occasion, I was disappointed to see several vendors not yet ready for business, and in one case not even present.  Another early criticism that I had read, however, was dispelled during my second visit--that some vendors run out of goods too quickly.  Every stand that I saw yesterday was well stocked.\n\nSadly, I don't see too many actual farmers at this market, but there are a few non-leafy highlights.  For example, the practically ubiquitous Bennison's Bakery and Mint Creek Farms will outfit you with breads or sweets and sheep or goat meat, respectively.  But also there are a few places that you've probably never heard of, such as Sweet Attila's Bake Shop, available only online or at the market.  They make a pretty darn good lemon sandwich cookie, but some of their other stuff is a little too pedestrian for the price.  Or check out Crafthouse Market Goods for sausages:  they have a decent bratwurst and an odd, fascinatingly overspiced \"pirate wurst.\"\n\nThere was an outfit sampling drop-dead amazing Italian apple-cider doughnuts.  Uh-MAYzing.  It was too warm to buy any, or their pizza or other hot food, but I am keeping them in mind for a Sunday lunch (and dessert) when cooler weather arrives.The market runs until October 17th, and I will definitely be back.",
            "author": "David R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-07",
            "description": "Awesome market with friendly vendors, great organic products.  They take credit cards and Link. So happy it's in my neighborhood!",
            "author": "Maria W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-11-10",
            "description": "Glenwood Sunday Market is a fairly small farmer's market, but it has the necessities of any good farmers market: seasonal fruits and veggies, meat and dairy options, a bakery, and a few other options sprinkled throughout. \n\nI'm not sure of individual vendors names (I only know where they set up their booths), but here's what I make sure to get almost every Sunday in the summer:\nEggs\nFrench Baguette (we'll either do bread, cheese and fruits for lunch or we'll eat it with pasta that night)\nVeggies (zucchini, kale, squash, green beans--all whenever they're available/in season)\nFruit (blueberries in the early months, apples in the fall)\nCider (when it is available)\n\nIf we don't buy meat, we'll drop ~$20 for the week's haul. Not cheap, but not awful (fairly comparable to buying organic at Mariano's). \n\nLess often, but when we can, we'll get meat for the week from the vendors there: bacon, pork loin and shoulder, steaks, etc. It's certainly not the most economical way to buy meat, but it's incredible quality. I also finally stopped by the mushroom vendor at the end of this season, and really regret that I hadn't before. The cheese guy that's there all the time is also wonderful. \n\nBring cash.",
            "author": "Sarah P."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2011-06-16",
            "description": "Came here at 8:15 last Sunday. Had no idea they opened at 9. All the tables were set up. The people were sitting there with wads of cash in their hands. And they wouldn't sell us anything.\n\nAlso, we're all about supporting our neighborhood, but the prices at the Glenwood market are $1-2 more than the Daley Plaza Farmers Market on Thursdays. When Rogers Park is more than downtown, something is very, very wrong.",
            "author": "brad p."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-06-05",
            "description": "Summer has officially started now that the market's back! Organic & locally grown veggies & meats & goodies. It's a great little market. No it's not the biggest, but there's a great variety of produce and meats. This year they're doing lots of events too. Last weekend was all you can eat BBQ. They did a chili cook-off during the winter market; I can wait to see what else they'll be doing.\n\nAlso, there's a truffle stand with free samples. Need I say more?",
            "author": "Ciel D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-06-06",
            "description": "Hear ye, Hear ye, Hear ye...come one, come all to the newest farmer's market in town.  The right honorable Rogers Park invites you to the city's greenest market in the fair city of Chicago!  All of the farmers are organic growers or are in the process of transitioning to organic. \n\nBeing the FM fanatic that I am, I just had to check out this brand spanking new one.  I am telling you...I have a problem.  Upon arriving at the corner of Glenwood & Morse...you could just feel the excitement (truly it was palpable).  As I arrived about 10 mins before the opening, a crowd had already gathered...people eagerly waiting with the reusable bags for the ribbon cutting ceremony (nice touch!).  The Alderman was there with his wife to say a few words and then poof the flood gates opened.   \n\nNow the market...well, being the 1st day & all, there are definitely some kinks that need to be worked out.  For instance, it should open on time, the vendors should be there & ready BEFORE the market opens, the cars should be moved way before the market opens, the information booth should be set up & ready to go at least 30 mins before opening time, and most importantly, the vendors should have their booths well manned...poor ladies working the bread booth, it was swamped!  I am sure as the weeks go by, the kinks will get smoothed out and the market will be top notch.\n\nThis is the definition of neighborhood FM...it is small and quaint.  Now, I am bit spoiled with the Evanston Market...it is spacious and well stocked.  However, the people are friendly & the vendors are super excited to show you what they have.  They should be as it is quality stuff.  I got a few things here, but I know that it will not satisfy my list of needs for FM food...so this will serve as my supplemental FM.  \n\nOverall, I do recommend checking this place out, however it is not going to stock you pantry just yet.  Plus, this is a great neighborhood to check out and the market is just off the Redline at Morse...pretty sweet!",
            "author": "Unity O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-24",
            "description": "Just want to comment on some of the comments so far. Full disclosure, I am the Marketing Chair for GSM and am on the board and I am an unabashed fan of our lil' ol' market. Personally, I call it the little market that could!\n\nIt is true that the first day, our vendors were taken by surprise with the turnout. There were 1000+ people there that first Sunday. We got feedback that they had never seen anything like this on an opening day of a new neighborhood market. Rogers Park just went and exceeded their expectations! The other thing our vendors have told us they have not experienced before is the level of enthusiasm and community support. We have volunteers showing up at 7am Sunday to help vendors unload!\n\nThe truth is we have a farmers' market desert in RP and the demand is huge- we and our vendors are doing our best to meet that demand. We are actively seeking organic fruit growers, however people looking for fruit should keep in mind that it is still early in this region for fruit. More will be coming as the season continues.\n\nSince opening day, we have added several more vendors and the block is now full. Also, vendors have increased supplies and far less people are going away empty. \n\nThe first day we did have an issue with cars being towed but that has improved greatly also.\n\nSheree Moratto is a fantastic Market Manager with a can do attiude and generous spirit. \n\nI know the board appreciates your constructive feedback and I will pass it along to them. We are working hard to meet the demands of the community and raise awareness about what local food means. \n\nI can tell you all one thing. You will not find a market with greater heart in the city than this one!",
            "author": "Jocelyn G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-06-21",
            "description": "Good, fun  market. However, for now I'd call it a neighborhood market rather than a farmer's market. So far, there is less produce and more processed products (chocolates, jams, cheeses etc.). Stuff seems to run out quickly (chicken eggs were gone when I arrived at 9:20), and a lot of lines. Everyone is friendly, though, and the market is a fun place to be on a Sunday Morning.\nIf you're looking for tons of great produce sold by farmers with dirt under their nails, go to Evanston. However, if your in Rogers Park and looking for quality local food products, the Glenwood Sunday Market is good, and hopefully keeps getting better.",
            "author": "Adam S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-14",
            "description": "As a Rogers Park native, I couldn't be more thrilled when I started seeing the \"Glenwood Sunday Market\" flyers spring up around the neighborhood.  \n\nI've been there the past two Sundays, on the early side, and it's been bustling.\n\nYes, the meat is frozen, but that is nice for those of use who live alone and can't go through that much meat at once!  I snagged some preserves, salsa, and granola for my first market harvest.  Next week, I hope to branch out a little more.\n\nSome of the vendors offer samples, which is always fantastic.  I'm much more willing to shell out the $ if I know I'll enjoy the product.\n\nRandom - last week there was a knight challenging people to fight.  I wish someone would've taken him up on it.",
            "author": "Ellie F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-04",
            "description": "Love this market I can walk out my door and buy fresh fruit and veggies for far less than I would pay at the grocery store.",
            "author": "Charles H."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-06-19",
                "description": "Okay, the five stars are based on the fact that it's practically a stumble from my front door AND that it's a fantastic presence in the community. \n\nI finally went for the first time today - around 9:30 - and loved it.  My top pick is DEFINITELY the Crafthouse booth.  I got two mammoth beer brats that just rocked my dinner world.  2 for $6? Not cheap, but after eating them, I declare them a helluva bargain. \n\nEvery vendor was friendly with tips on how to cook stuff (rainbow chard? saute with onions and garlic, turns out) and while the produce prices aren't a steal, it still beats the big grocery stores for organic, and it's great to find items like garlic scapes, red kale, and other varieties that don't show up everywhere. \n\nI have also noticed that the foot traffic in the neighborhood is way up (I see LOTS of families walking by my window sunday morning) and I'm sure the local coffee shops and restaurants are reaping the rewards.\n\nI love this market!",
                "author": "Lacy C."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2010-06-13",
                "description": "Probably the worst run farmer's market in the city. Market manager Sheree Moratto is incompetent. There are hardly enough stands to call it a market and the meat being sold is frozen. The venders don't have enough inventory. This thing is a joke. Don't waste your time. There are plenty of good farmer's markets in Chicago. Check those out instead.",
                "author": "Benny D."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-04-12",
                "description": "Skip the other overly crowded markets in Evanston or the Green City Market as this has a lot of the same vendors, plus others that we have not seen anywhere else.  Located on a side street, this market has lots of space and an excellent assortment of vendors.",
                "author": "Edward D."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-10-17",
                "description": "I'm so sad the farmer's market season is over! I spent every Sunday morning here between June and now (October) and it feels like home! We come here to pick up our CSA share and always leave with a bunch of goodies (tofu, sausage, baked goods...) It is a great friendly environment that I am so happy to be a part of. I will come back and check out the winter market when it opens!",
                "author": "Elizabeth M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-07-25",
                "description": "A great little market, and right around the corner from my apartment. I agree with other reviews that downplay the ' farmers' aspect here, as there seems to be very little produce. Because this isn't southern California, we actually have seasons and that means you can't find apples in July. That said, some great baked goods, unbelievable cheeses, and some of the friendliest vendors, neighbors and local business owners anywhere. It's always worth a trip.",
                "author": "Tom F."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2010-06-06",
                "description": "Today is the first day and it seems that the vendors were unprepared for the traffic that came through. I got there at about 10:30 am and there was a pretty good crowd, but there didn't seem to be much in the way of product. What I saw was a table of honey at one end of the block and a table of Romaine lettuce at the other end with a bunch of unstocked tables in between. The bakery tent was filled with empty baskets and racks. There was not a tomato or onion in sight. I have high hopes for this market, so I'll go back again to see how things progress as the summer goes on.",
                "author": "Abbe W."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-10-20",
                "description": "A nice market, which really seems to have potential -- the produce and meats looked good and the prices seemed on target for small markets with local, organic/sustainable type products.  Another plus is that it really seemed to have a friendly neighborhood kind of vibe unlike some of the farmers markets here in Philly.  Good luck --- Glenwood's off to a great start!!",
                "author": "D K."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-06-11",
                "description": "A great start to what I hope is a very successful green market in Rogers Park.  Like previous posters mentioned, most of the products were sold out fast but it was due to a great turnout and good vibe.  I'm sure things will improve with each new Sunday.  I look forward to supporting this venture in Rogers Park!",
                "author": "Alexis B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-07-18",
                "description": "We love this market because it encompasses everything we enjoy about Rogers Park. It's close by, welcoming to all, very entertaining, and uses great conscious in vendors. It's all organic!!!!!!",
                "author": "c t."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Glenwood Sunday Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "6960 N Glenwood Ave",
        "postalCode": "60626",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/4a5-2eNVNewt4MKMeewj-Q/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+17735085885"
}