{
    "aggregateRating": {
        "reviewCount": 7,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-08-30",
            "description": "My favorite farmers market!! Right in my lovely Florissant hometown! In and out with all the fresh essentials.",
            "author": "Gaby M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-06-28",
            "description": "This place features low quality at high prices (with the exception of a few loss leaders to get you in the door).\nThe fruit is way past its eat by date let alone should be out for sale.  \nThey are also not a credit card friendly establishment.  They require minimum of $10 to use credit. Who is going to spend $10 on produce that is going to spoil before you can eat it? \nWith silly credit card policies, you should avoid this place and head to Thies'. Or the Dierbergs around the corner.",
            "author": "SuzyJax J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-03",
            "description": "Love this place! I always stop here before heading to my usual grocery store. The last new recipe I was trying, called for about 5 different spices I've never heard of. I found all of them here for a great price. Glad to have this little store right around the corner!",
            "author": "Jenn R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-14",
            "description": "Cute market in Florissant around the way. Their prices for produce are cheaper than your local supermarket and locally grown I believe. Really great spice section! You can find anything in there and assorted grains, rice, etc. I usually just look at their sign when driving by to see what is on sale, friendly staff and I think you have to spend $9 or $10 to buy with debit.",
            "author": "Saucy G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-08-23",
            "description": "The produce is good and fresh. Everyone is very nice and helpful. Would be nice if they posted what types of payments they took and would be really nice if they took EBT.",
            "author": "Amanda W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-02",
            "description": "You may be here a while.  There are so many spices that you may lose control.  You can find ghost pepper here which is a good thing.  Lots of plants and veggies and produce as well.  Pretty reasonable prices and a lot of inventory",
            "author": "Brett M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-22",
            "description": "This mom and pop grocery store has fresh fruits and veggies at a reasonable price. My favorite thing about Goeke's is their herbs and spice section. They have the largest selection I have ever seen, and they even have custom blends for marinating and making dips and dressings. If you are looking for healthy snacks, they have containers of nuts and dried fruits. All in all it's a cool little store.",
            "author": "M E."
        }
    ],
    "priceRange": "$$$",
    "name": "Goeke’s Farmers Market",
    "address": {
        "addressLocality": "Saint Louis",
        "addressRegion": "MO",
        "streetAddress": "449 St Ferdinand St",
        "postalCode": "63031",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/w-ecin8tfv0ULLfDW5kLcw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13148311931"
}