{
    "aggregateRating": {
        "reviewCount": 7,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-29",
            "description": "Best farmers market in area.  I'm able to visit after work unlike the other farmers markets in the middle of the day.   And they have so many vendors.  Cheese is me favorite",
            "author": "Mike K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-08-12",
            "description": "Had the best fresh Salmon there as well as melt in your mouth cheese!  The baked goods are plentiful and delicious. Its so worth the trip. Highly recommended.",
            "author": "Joyce M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-09-21",
            "description": "I don't go to many farmers markets, and the first time I went to this one I was underwhelmed. It was in very early spring, or maybe it was early summer actually, and there were very few vendors there. So my next visit wasn't until the summer and boy what a difference. Once the summer kicks in, there is quite a variety to choose from.\n\nThe produce itself can be really really good or really underwhelming. Sometimes it is hit or miss. The other things of the farmers market, like Lesters Bison and Nana's Rum Cakes and Wildflower Bakery and the wine tastings they have really help to balance out all of those nutritious fruits and vegetables-makes it worth it. It's all about balance, right?  ha ha\n\nOne of my friends turned me onto the Lesters Bison vendor, and I will say if you're trying to cut back on fat and calories and cholesterol, this is the way to go. So now instead of using ground beef, I try and pick up some ground bison. We also tried the bison patties already formed and they were really great. We weren't sure what to expect but I kid you not, very flavorful and  juicy. If this was regular ground beef and it was that thin, it would have been dull, tasteless and dry- the difference was very surprising. They also have tons of cuts of steak (ribeye was of course delish), and other choices like elk, etc. \n\nLet me just say this for the record: get your ass to Nana's Rum Cakes! You will not regret this. This is rum cake on a whole nother level. The couple that sells them, one of which is Nana, is charming, delightful. And I love supporting local business, but the spectacular taste of these rum cakes is what keeps you going back. I'm an addict for life now. I like the plain-vanilla or  the plain-vanilla with nuts, but my husband is a drag and doesn't like the nuts, hehe, so I sacrifice for him. ha ha While the chocolate rum cake was okay, we both agreed it was not as special. But the plain-vanilla and with nuts is not to be missed. \n\nThe market is especially lovely in the late summer or early fall. Two days ago it was just gorgeous. And there are a lot of vendors to choose from. You can go to their website and see which vendors will be there which week. It's very user friendly. \n\nSummer hours are 3-7 on Wednesdays, but they are soon switching for the new fall schedule which is on Saturday (mornings, I believe?), so hit up the website for hours.\n\nWhy aren't you there yet?? Nana's waiting for you; don't disappoint Nana, people.",
            "author": "Christina S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-05-19",
            "description": "Small, but packs a punch!  Great spot to get things like smoked fish, grass fed beef, local produce (somewhat limited, don't expect to get all your groceries, but things like mushrooms and potato are definitely here!).  There are a couple hot food stands, and some great local things like soaps, candles, granola.  Check it out!!!",
            "author": "Mad I."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-05-20",
            "description": "It's taken me a while to write a proper review for the market, but here I go...The farmers' market is one of the highlights of this town.  In the summer, the market is on Wednesdays from 3-7pm, and this past winter was the first ever winter market, approximately one Saturday per month.  \n\nThe summer market seems to get bigger every year.  There is, of course, lots of local produce and flowers, but there are also baked goods, candy, pasta, cheese, meat, fish, snack food, honey, soap, olive oil, tea, wine, as well as food vendors selling snacks to be eaten at the market.\n\nThe winter market, despite the cold/snow and being much smaller than the summer market, was surprisingly good for its first attempt.  There was a good sampling of the above vendors, minus the produce.  I give the vendors that stuck it out in the cold a lot of credit!\n\nAnd now, for some of my personal favorite market vendors:\n-peaches and berries from the fruit vendor from Michigan\n-the cheese vendor from Wisconsin\n-the organic produce vendor from nearby Prairie Crossing\n-all sorts of apple goodness from an orchard in Harvard\n-addicting snack mix from Gurnee\n-yummy toffee from Cynthia's Sweets in Grayslake\n-baked goods (especially the olive rosemary bread and cinnamon buns) from Wild Flour Bakery in Milwaukee\n-pasta from Pasta Sue (especially the gnocchi) \n*and my most favorite: traditional French pastries made by a religious order of French sisters in Chicago.  The nuns spend hours in the hot afternoon sun in full habit selling the pastries to help fund their charity work in Chicago.  They are lovely, generous, and excellent bakers!",
            "author": "Laura P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-03-28",
            "description": "great Job!  It takes a great effort to keep a high quality market going year after year.  Congratulations!  Looking forward to the 2010 season.\nIf you reading this then you are interested.  It will be worth it!",
            "author": "Scott H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-04-07",
            "description": "Always fun and always great vendors. Would prefer if there was some vetting - like local produce only and none shipped in (which just seems decieving at a farmers market, no?) and they really need to move the vendors further into the street to keep it less crowded if they keep the same setup as last year but all in all it is a million times better than a grocery store any day!",
            "author": "Tadashi F."
        }
    ],
    "priceRange": "$",
    "name": "Grayslake Farmers Market",
    "address": {
        "addressLocality": "Grayslake",
        "addressRegion": "IL",
        "streetAddress": "201 Center St",
        "postalCode": "60030",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/qdqJ9n07Qh-18xgjZ4IrXA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}