{
    "aggregateRating": {
        "reviewCount": 6,
        "@type": "AggregateRating",
        "ratingValue": 2.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-30",
            "description": "Took my elderly mother for the morning and everyone was so nice! We purchased some apples and veggies then sat in the Amish furniture and chatted with workers and experience...thank you",
            "author": "Linda R."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-10-12",
            "description": "I really wasn't impressed with this place at all. It's basically a shack off the side of the road that sells produce and items that were grown at other farms in Missouri and Illinois. \n\nWe did take a hayride... which led us to one pony to pet. We couldn't pick any apples or pumpkins, or run around in any fields. There's a small playground for kids to play on, and they can ride around the inside of the barn on tricycles. \n\nYou're better off just going to your local Schnucks, and visiting a local playground.",
            "author": "Marissa R."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-07-15",
            "description": "I have purchased fresh produce here and been pleased with the service and produce. Last year, we picked suburb blackberries for a reasonable price. They have u-pick berries this year, but charge each person $2 just to pick. (Ekhert's in Grafton charges $1, which probably covers the cost of berries some people eat.) \nLast week I bought a 1/4 peck \"#1 peaches for $12. Peaches were from Calhoun county, IL and were all very good except for one which I had to throw out.  I stopped by a couple days later to purchase the same kind of peaches for my daughter. Three of the peaches (out of 10) were at least seconds. Foolishly, I returned for another bag for myself. This time I laid each peach out to examine it, saw that several peaches were of very poor quality ( bruised beyond eating, split at the stem to expose rotting flesh, and other significant damages.  I spoke to the attendant; she offered to replace two of the peaches. I left, very disappointed will return, but will inspect all fruits and veggies more carefully before I buy them.\nIt is a barn, farm market, not a fancy set up for city people to play all day. The do have some cool pedal tractors that my grandkids love as well as a huge corn play pit, sandbox filled with corn. with large toy loaders, trucks, and bulldozers.  Again, the grankid love to play there and will return for their home grown tomatoes, pumpkins, and play time.\nI'm hoping that hiding 2nds among the #1 peaches is a fluke which will be corrected. The bags of seconds were $10, not really enough reduction for the quality.",
            "author": "Donna C."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-10-05",
            "description": "We had a terrible experience.  The owner was yelling at one of the employees and then they started arguing right in front of us.  The young boy working out in the orchard repeatedly told us that he had no idea what we were supposed to do because \"nobody ever told him anything \" and we were told at least 20 times..... You pick it you buy it.  We got the point.\nThere were NO good apples, they were all over the ground, but if WE picked any rotten ones we were expected to pay for sure.",
            "author": "Mom Of 3 H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-27",
            "description": "Our family loves this place! The people who run it are so nice and have made it a great family destination w/a huge play area for the kids. We come for berry picking, apple picking, mums and pumpkins.",
            "author": "Debbie M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-11-01",
            "description": "I wasn't sure what to expect when we went here last weekend, but I was disappointed. There were only a few apple trees and everything had been harvested already. The pumpkin fields were a mess with small pumpkins and, in my opinion, everything was on the more expensive side. I guess it's fine if you live in the area, but not a destination I would recommend.",
            "author": "Stephanie B."
        }
    ],
    "priceRange": "$$",
    "name": "Herman’s Farm",
    "address": {
        "addressLocality": "St Charles",
        "addressRegion": "MO",
        "streetAddress": "3663 N Hwy 94",
        "postalCode": "63301",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/WCRAzR26B6-UNAdckHpw3w/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16369259969"
}