{
    "aggregateRating": {
        "reviewCount": 2,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-26",
            "description": "Descriptive phrase:  Small, useful farmers market in the middle of historic downtown Janesville\n\nThis was actually my first time at the Janesville Farmers Market, but mom has been here many times and always brings back goodies. My two favorites are the kettle corn and corn on the cob. I would say there was 20-25 vendors on Wall Street, ranging from handmade soap to home grown squash. Market is open Saturday mornings from 8am-1pm.  Vendors came from all around the area from cities such as Monroe, Milton, Edgerton, and Bardstown. \n\nThis is by no means an all day event. We probably spent 20-25 minutes and looked at nearly every vendor, stopping for a quick talk. Nearby the market are my two favorite restaurants in Janesville, Cozy Inn ( Oldest Chinese restaurant in Wisconsin) and O'Riley & Conway's Irish Pub. If you are in the Janesville area, it might be worth a stop!",
            "author": "Erick B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-09-05",
            "description": "Meh. \nThere isn't too much variety here. \nHowever, the items that my husband and I have bought have been delicious. \nI wouldn't travel out of town to come here, but if you live in Janesville, you might as well stop by. It isn't an all day thing. My husband and I were here for about 20 minutes and saw the whole thing. \nThe prices are decent and it's always a good feeling to know you're supporting local businesses.",
            "author": "Chloe O."
        }
    ],
    "priceRange": "$",
    "name": "Janesville Farmers Market",
    "address": {
        "addressLocality": "Janesville",
        "addressRegion": "WI",
        "streetAddress": "200-298 W Wall St",
        "postalCode": "53548",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oXbSMUWhLCMtSAuEgxPUSA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}