{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-01",
            "description": "All I can say is; why hasn't this farm stand got it's own Yelp page and following? This review was hard to find. Hopefully this will change because it deserves more.  \n\nThis place is a hidden gem in Tinley Park.  What looks like a little stand with a few items, it has a surprisingly large selection.  From fresh picked (hence the name) corn, to some of the best looking tomatoes I've seen in a while.  \n\nAlso one of the rare places to get local, and I mean LOCAL (Orland park) harvested freshly made Honey.  Wow, this stuff is amazing. Almost buttery in flavor.  Also great to build up tolerances to seasonal allergies.  \n\nI will never buy my produce in the store again - well, on days that they are open.  They are open till the end of October and open everyday which is GREAT since \"Farmers Markets\" are only short time events.  (Sad really)\n\nHere is just a brief list of what you will find. \nCorn, tomatoes, onions, peppers, potatoes, Garlic, Sugar babies!!! Watermelon, green onions which also appear to be fresh picked, locally produced honey and some of the best apples I've ever tasted. \n\nIt's cash only so leave the credit cards at home. \n\nDo you and your body a favor and skip the overly preserved produce at stores some rest.  Check this place out and find out how good food REALLY tastes when it's truly fresh. I saw people eating the corn right there and worshipping it.  I have to try that Tuesday when we go again.   \n\nThis will be at least twice a week visit. It doesn't hurt that they are right across from the gym.",
            "author": "Dave N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-23",
            "description": "Drove by around 4:30 as it looked like they were closing and they told us to come right in. There were a lot of people there and some of the fruit and veggies were already put away. We asked for a few things that were put away and they grabbed it from the back happily. When we rung up our stuff my dad mentioned that we came just in time and the lady said they actually closed 30 min ago. They didn't rush us once. I'm writing this as I eat the peaches and cherries from the market and they are absolutely delicious and fresh. Quality you can taste. I can't wait to try the rest later. Will definitely be shopping here again.",
            "author": "Samantha D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-03",
            "description": "I still have to get something that is not fresh from this place the corn cantaloupe among others are exceptionally SWEET",
            "author": "Mandy M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-14",
            "description": "I can't believe this local gem hasn't been reviewed yet.  Tom, the farmer extraordinaire, is a great resource for all things produce.  The bi-color sweet corn is amazing.  So amazing, in fact, you can eat it raw off the cob.  I was skeptical at first, but when Tom split the ear and ate half I thought to be nice I will try this and try not to make a face.  It is amazing.  Also, for grilling fans, the corn they grow is ideal for whole cob grilling.  Just soak the corn in water, ice water is even better, for an hour with the husk on.  When done soaking pull off any fine hairs or dangling husk to prevent a fire, put on the grill, rotate a quarter turn regularly, and in 15 minutes you have maybe the best ear of corn you have ever tried. \n\nOn to other stuff they have.  Great bright red tomatoes, plum for sauce or regular for whatever.  Perfect watermelons and cantaloupe are usually in stock as well.  Great sweet onions, perfect green peppers, peaches, plums, garlic, and smaller peppers.  Typically there are great tasting cubanelle peppers, hot banana peppers, and firm and easy to roast jalapenos.\n\nPeople come from miles around for the corn alone.  Any locals who haven't been here need to get on it right away.  An added bonus is Tom and the other people who work here.  Usually I stop on my way home.  After a long day, two hours on the Ryan and 57, the thrill that is westbound 159th in the evening, and the heat I am usually in an outstanding mood.  While I dont look in the mirror to see myself I am certain I radiate smile after the hellride home.  Like any clown, however, I am crying on the inside.  That may be why I love this place so much.  No matter the heat, wind, long day farming and driving, doing all kinds of farm stuff like miling chickens and picking up cow eggs, and dealing with people all day long, Tom still has the time and smile on his face to say hi and to help pick out the right corn, peppers etc (no idea what good v. bad looks like) for whatever I am doing for dinner that night.  All of the people who work here are great, and are very helpful.\n\nNow the best part.  Cash only, I think, but it really doesnt matter.  A dozen corn, picked same day, for $5.00?  Usually when I leave I have to make two or three trips to the register.  Corn, check.  Green, hot, jalapeno and a couple banana peppers, check.  A couple garlic bulbs, plum tomatoes, a watermelon, usually a couple onions, etc.  All this and I can't remember the last time I spent more than $15.  Small trips, like a half dozen corn and four or five tomatoes never exceed $5.00 ..\n\nThis place is amazing, the people are great, produce us unreal good, and the price is far less than you can imagine.  This is the ideal place to shop and support local farming.",
            "author": "Robert K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-10-15",
            "description": "The people are friendly I love coming to this place, I can get enough of their corn .Yum-yum. yummy!",
            "author": "Janet K."
        }
    ],
    "priceRange": "$$$",
    "name": "Just Picked",
    "address": {
        "addressLocality": "Tinley Park",
        "addressRegion": "IL",
        "streetAddress": "8200 W 171st St",
        "postalCode": "60477",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/FfS7KKEHlXXrCaJwFKbWdA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}