{
    "aggregateRating": {
        "reviewCount": 2,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-01-01",
            "description": "I am just a very infrequent visitor, but I LOVE THIS PLACE.  My grandparents come almost every week just to see what's for sale, and when I'm in town, I jump at the chance to accompany them.\n\nMy grandparents go mostly because they enjoy the small animal, produce, etc. auction on Wednesdays.  When I've gone in the early summer, there are scores of baby goats, baby chicks, and other baby farm animals to see and purchase.  Also plenty of full sized poultry and rabbits ready to be butchered.  Inexpensive, farm raised eggs and seasonal produce are there throughout the year.  The smaller auction also features things you might find at a yard sale, estate sale, or thrift shop.  Everything is numbered and the auction starts at around 10:30.  \n\nSimultaneously, a livestock auction takes place in a different area of the sale barn.  Various animals are auctioned throughout the week.  I was there on a Wednesday, which is sheep and goat day.  There are days set aside for specialty auctions, which feature draft horses, farm machinery, and carriages.\n\nThe sale barn also has a small cafe, where my grandparents often end their trip to Kalona with a slice of homemade pie.  It is run by local Amish women and is pretty good.\n\nOf course, Kalona, Iowa is also home to one of the larger Amish settlements in America.  At the sale barn, Amish families place bids right alongside the old farmers.  There's a field set aside for carriage parking. It's a great opportunity to interact with people whose way of life is completely foreign to the average American.\n\nI love the sale barn because it's such an amazing way to observe a regional culture that is rapidly disappearing.  Corporate farms and urban sprawl are taking a toll on small farms across the country, but a morning at the sale barn provides insight about what life might have been like in the Midwest before these new ideals took root. Honestly, this place is so cool.  If the opportunity ever presents itself, you should go.",
            "author": "Haley B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-18",
            "description": "This is a great place ran by great people. If I find myself in need of a cow, horse or any other type of farm animal this is the place to go.",
            "author": "Luke L."
        }
    ],
    "priceRange": null,
    "name": "Kalona Sales Barn",
    "address": {
        "addressLocality": "Kalona",
        "addressRegion": "IA",
        "streetAddress": "121 9th St",
        "postalCode": "52247",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/y_XzMawr63C_SPXeeUZBAQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13196562222"
}