{
    "aggregateRating": {
        "reviewCount": 18,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-06",
            "description": "A true gem to have in Kenosha. The vendors are trustworthy, the food is amazing, and the produces you really want.",
            "author": "Jo W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-25",
            "description": "Not sure why the ban on dogs reduced some people's rating. It was simply too crowded-potentially dangerous for the doggies. With that out of the way...... I went 3 times already this year and it is just as happy and colorful as every year. It is quickly becoming less and less of a best kept secret and there are more vendors and public there but still the venue is so open and beautiful and the variety of goodies is amazing! Fresh honey, bright flowers so colorful they look fake, crafts, scented soaps, freshly tossed kettle corn, wood work, cheese, fudge, metal art, fresh baked breads, warm tacos, jewelry, live music and much much more!  Don't forget to sample the empanadas and the African dishes! Overall, it is a refreshing and stress relieving place to go. If the crowd is a bit much, walk right over to the waterfront which is visible from any angle. You may have to walk by the beautiful fountain surrounded by bright flowers or the children playing with the giant bubbles on the lawn.",
            "author": "Sonia L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-05-12",
            "description": "This market has everything...fresh food, coffee, juice, veggies and fruit, plants, and more!  Love coming across the border to this market!",
            "author": "Barry W."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-11-30",
            "description": "TL;DR: KHM management chooses favorites for vendor and customer. This was evident before my family got involved as vendors, but now, it is basically a proven fact. We will not be coming back next year!\n\nAs a customer: It is a very busy market, some days so busy it is hard to get through. It makes for an unpleasant experience. The people at the market table can be quite the pieces of work most days if you see them interact with people. I also recall Glass Cheese, she is sweet to your face, until she turns around! Very judgmental. Most people are very nice, want to sell their items, but you can tell that the market management has an agenda. They seem to be pushing it as a \"farmers market\" rather than a \"European Market\" as they advertise because they will give end spots to farmers and food, rather than place them strategically to help draw people in. Then there is when they have a string of the same type of product all in a row. Really? Direct competition? It makes the crowd bunch, rather than flow. The management really needs to educate themselves on how to lay these things out, or maybe do a survey of vendors. They handled this summer's \"Dog Ban\" quite poorly, with a lot of people saying they are going to ban the market due to it. The only people that they are hurting are the vendors, they didn't make the rules, so they are just as bad as the people who caused the situation. \n\nAs a vendor: I am related to vendors, let me tell you, the market management is a bit like Hollywood. You either are the right ethnicity, right religion or are sleeping with management to get a good spot. All you need to look at to know this is where the lemonade goes, and who ends up at the end of the Place. I look each year to see the maps, and know that craft vendors, who, in terms of revenue, bring the most value (market did research that they are trying to hide because they thought food would win), is AT RISK EVERY YEAR of losing their spot to food, because the management has a clouded mind, does not understand their value, and is biased. The indoor market and winter market is invite only, and guess who gets the invitations (again, Hollywood, and the food vendors who kiss CC's booty). We have asked several times about indoor, and just get told it is invite only... never once got in, not even a call if there are cancellations. We never were even allowed on the vendor facebook page, guess we didn't kiss enough booty. The Family and I looked at the winter market map. Booty kissing food vendors get the prime tent, and the booty kissing crafters get the back tent. Being a holiday market, you would almost thing CC would prioritize the crafters and non-food vendors for gifts, but no. I guess everyone should be buying celery for christmas. Stupid. Not even giving priority to self-crafted vendors this year, no, straight to Chinese/Indian imports. REMEMBER SMALL BUSINESS this year people, they are who you should be helping, not some maharaja in a past life. It is almost to the point of the standard KENOSHA PRO-ITALIAN RACISM AT THE KENOSHA HARBOR MARKET (as to who gets what spots and who gets in at the summer and indoor market. You can definitely tell what is up when your favorite crafter gets bumped around, their loyalty means nothing to the PAID market management (who doesn't really manage or enforce their own rules). We will not be coming back just to be pushed around and treated like garbage, so long KHM, hello Mileagers, Lincoln Park, and  State Fair!",
            "author": "Geneva A."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-11-01",
            "description": "Was a nice place for a dog walk but when people bring dogs not Suitable to be in public it really ruins the atmosphere For good dogs Too bad really enjoyed the weekends down there will have to find a new place to enjoy dog walks were people respect each other",
            "author": "Todd B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-20",
            "description": "Kenosha Harbor MarketPlace Farmers Market is located in Kenosha on Lake Michigan. This Farmers Market has plenty to offer families, pets, and single people. From cheese to flowers, vegetables, donuts, and even chips that are sure to please. A lot of places offer samples before taking the leap and committing to buy their product. The smells and the view of the lake makes the experience all worth while.",
            "author": "Alisha M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-19",
            "description": "I look forward to visiting the Harbor Marketplace every year! They have lots of great shops and variety of products to try. Also the fresh flowers are sold at a great price, and not to mention organic vegan dog treats! No complaints love this market.",
            "author": "Brenda J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-16",
            "description": "This open air market has grown with more vendors every year. Fresh produce & crafts all reasonably priced. Get there early because parking is a bit hard to find.",
            "author": "James C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-07-16",
            "description": "With the new ban on dogs, I had to reduce my rating.  The market advertises as a European style market.  No market in Europe would ever ban dogs from the premise. I wish there was a 3.5 star rating. I always enjoy myself, but the dog ban was soured this event for me and I will be going less in protest. If you are not a dog advocate, the rest of my review stands. Finding new delights and old favorites. The produce, flowers, bakeries, food and beverage vendors and other merchandise is all worth looking over.  Days like today, in particular, in southeastern Wisconsin (mid 70's and low humidity) are so delightful to go walk around the market and harbor. However, I so enjoy going on a crisp fall morning as well.",
            "author": "Chris P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-07-07",
            "description": "Love this place! Kenosha HarborMarket is beyond a habit in our household. It is a ritual, and a place that we go to enjoy sunny, breezy harbor-side surroundings where we can buy top quality locally grown and produced (a requirement for vendor participation), fruit, vegetables, flowers, plants, baked goods, cheese and meats. It also is a place where one may purchase artisan-produced goods; hand crafted scarves, jewelry, soaps, lotions, candles, even fine, master-craftsman hewn wooden bowls, pet accessories, whimsical birdhouses, bird feeders and garden ornamentation to name just a few; all very reasonably priced, and in some cases, negotiable.\n\nHarborMarket also is a place where one may have something to eat, wander about and linger to listen to live musicians or take a few moments to visit with vendors to talk about their crops and products, about what they believe is of exceptional quality that day, what could stand to be better, and what you can expect over the upcoming weeks. Some vendors have sold at the HarborMarket for years, so they subsequently have developed a loyal customer following, and they care about the quality they offer to their loyal customers. This is not a flea market type farmer's market manned by transient vendors, who sell overstock items, cheaply made single use junk, and out-of-state produce that chain stores passed over a few days earlier. Product quality and vendor adherence to HarborMarket guidelines and quality standards are key here.\n\nWe have farmer markets in communities closer to our home. They are very nice, very convenient, but truth be told, none appear to be as well regulated, nor feature the number of vendors, nor variety and quality as HarborMarket does. None of them have comparable surroundings on a public square next to a scenic harbor on Lake Michigan that features old-fashioned, circa 1940-1950 streetcars, brightly colored lighthouses, beautifully planted and manicured garden beds, a teeming cooling fountain, benches and picnic tables, also where, just a few feet away, one may visit Kenosha's Natural History or Civil War Museum. That combination, fellow Yelpsters, cannot be rivaled. \n\nSuggestion: Make an effort to visit your local cash station before hitting the HarborMarket, since some vendors may not accept plastic or personal checks for for items that cost, $1, $2, $3, under $10 or so dollars.\n\nKeep in mind that a term of vendor participation is that produce must be locally grown. So, if you note that tomatoes and sweet corn are not offered, know it is because it still is too early in the season for their harvest. As a result, the only produce that will be offered is at its height of freshness.",
            "author": "Thomas K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-08-09",
            "description": "I was very surprised at the size of the market and variety of items being sold. There are of course tons of fresh fruits & veggies, but also a lot of prepared foods being sold. \n\nI ate at an African food vendor, which I cannot remember the name of unfortunately. I got the goat curry and fresh juice - it was delicious. I was so glad that they accepted credit cards through Square, because I dropped by this market on a whim and didn't have any cash with me. Unfortunately a lot of other vendors only accepted cash so I didn't get to buy much else.\n\nI was also very surprised at how busy the market was. I dropped by around noon on a Saturday, and it was bustling. There was barely any room to walk. \n\nOne plus is a lot of vendors give samples, so you can try a lot of stuff in case you forgot your cash (like me). Overall I'm pretty impressed that this market is so thriving in Kenosha. Oh, and it is walking distance to Lake Michigan, so I just walked down to a picnic table by the Lake to eat my food. It was a really great way to spend an afternoon.",
            "author": "April L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-27",
            "description": "Major highlights:\nTASTING: My mom and I tasted several herbal teas, sweet buns, cheeses, organic salsas, apple butter, parmesan garlic crispy bread, kettle corn.. I'm sure there was more but it's \nEDUCATIONAL: After speaking with many of the friendly vendors I left much more knowledgeable about types of garlic, how paper beads are made, dying German glass, what happens to the market in the winter (it moves to a downtown theatre and only about 15 vendors can fit.)\nVARIETY PACK: There were many different artists with their work for sale.  Many families selling fresh fruits, veggies, and herbs.  A man playing acoustic guitar.  Farm raised meats, jerky, and free range chicken.  Coffee, teas, hot dogs, snacks, dog treats, herbs and spices, even egg rolls.\n\nWe left with cilantro, Mexican bread, organic salsa, sticky bun, molasses cookies, and an ice coffee - I'd say a morning well spent.  Next time I'm in town it won't be so warm, but I'm interested to check out the winter indoor version as well - I bet they'll have some great locally grown and crafted holiday treats.",
            "author": "Amanda H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-06-24",
            "description": "I have not been yet but hope to attend the market in these upcoming weekends.  To check out the businesses and vendors visit their website.\n\nThe market runs every Saturday from 9 am until 2 pm, rain or shine.  It's located behind the Kenosha History Museum & Civil War museum (this is temporary until 2009, then it will return to the Place de Douai once the plaza reconstruction is complete).\n\nA perfect way to enjoy the weather while it's nice out!",
            "author": "Richie D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-04-02",
            "description": "My wife and I go each weekend during the summer.  Love all the fresh food and the fenders.  Everyone is friendly and helpful.  The continue to grow, and for the last year or so have been on both sides of the street.  Go and experience one of the good things that Kenosha has done.",
            "author": "Bob H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-10-19",
            "description": "For a small area, this market is great!! The veggies are fresh and the African cuisine stand is amazing! The flowers are fresh and the crafts are original. What a wonderful place to go for an afternoon.",
            "author": "Jennifer M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2012-05-14",
            "description": "As a customer I have really enjoyed bringing my daughter downtown Kenosha to attend the Harbor MarketPlace. The products and vendors have been really great - from the flowers to the food. Each spring and summer it's a highlight for me.\n\nAs a vendor, I've recently experienced a completely different side of this company. I recently applied to participate as a vendor, which was approved. I am a new business owner and was extremely excited to market my products at this location.\n\nI received a letter today that explained that my approval was withdrawn because the credit card I used to apply was declined. I called immediately upon receiving the letter to explain that my credit card number was stolen and the card was cancelled. I was told that I wasn't really ever approved (even though I received a formal written letter stating my approval) and that I basically needed to get over it and move on. This is what I was told in so many words....\n\nThis communication and decision left me feeling as though as a customer and personal business owner I wasn't valued. There was no benefit of the doubt offered. If asked, I would've brought cash or a check to show that I was a serious and credible vendor. No such option was offered. I understand that some vendors may not be credible, but I'm not one of them.\n\nI'm very sorry to say I don't think I'll be visiting this year or in the future.",
            "author": "Lori P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-10-09",
            "description": "This is awesome and has a festival feel to it when outdoors. There is live music and tastings of various foods, drinks and sauces. Lots of amazing, delicious fresh local produce. Some of the shops take cards but most of the farmers and bakeries take cash only so don't forget that. Just had some of the tomatoes and they were AWESOME. My husband and I are definitely planning on becoming regulars.",
            "author": "Juliet L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-03-15",
            "description": "I finally made it to the market.. after many failed attempts. I only wish I would have brought more money! I walked out with a beautiful loaf of sourdough with asiago and peppercorns, some incredible croissants and a jar of raspberry jam. I was disappointed I wasn't able to take home some of the great cheeses or fresh eggs. I can't wait till it all moves outside and the fresh produce starts rolling in.  During the winter the market is inside the Rhodes theater downtown.",
            "author": "Billy M."
        }
    ],
    "priceRange": "$$",
    "name": "Kenosha Harbor MarketPlace",
    "address": {
        "addressLocality": "Kenosha",
        "addressRegion": "WI",
        "streetAddress": "56th St 2nd Ave",
        "postalCode": "53140",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/dFCxFZxRk2ikA0kW-aGPYg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+12629141252"
}