{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-05-24",
            "description": "This was a wonderful getaway for our family!  The accommodations were perfect, the hosts were very kind, and the food was amazing!\n\nOur daughter had a blast feeding the animals, collecting eggs, milking a goat, and playing with all the other kids there.  My husband and I had a great time relaxing, enjoying the beautiful setting, and mingling with the other guests and our hosts.\n\nIt's a vacation like none other and a great way to build unique and fun family memories.",
            "author": "Julia B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-27",
            "description": "Our vacation at Kinnikinnick farm was hands down our favorite family vacation to date. We stayed there Thursday through Sunday with our 2 daughters aged 2.5 and 3.5 and everyone thoroughly enjoyed themselves.  The girls to great pride in feeding the animals, collecting the eggs, and milking the cows   While we adults enjoyed being able to let our kids roam with minimal supervision; while we sat in the tent reading a book.  The girls also enjoyed walking around the field collecting flowers.\n\nSusan and David the owners are very welcoming and do their best to insure a wonderful stay.  I highly recommend taking advantage of the meals they propose.  On the day you arrive you can select to have dinner made and we had a DELICIOUS roasted chicken with farm fresh green salad and watermelon and cookies for desert.  While Saturday night is Make your own Pizza night made with fresh dough and cooked in their brick oven.\n\nEveryone left Kinnikinnick farms rested and relaxed, though very sad to leave.  Looking forward to our future visits.",
            "author": "Stephanie P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-11-07",
            "description": "We've been to Kinnikinnick 3 times in the last 5 years and always enjoyed it.  The kids from the different tents all play with each other along with doing farm chores.  I would recommend going weekdays to really experience the rhythm of the farm.  Get the dinners that Miss Susan prepares - best food you will ever get to eat!  Miss Susan, Farmer Dave, and everyone who works there are always happy to answer questions. If you're wondering whether you should go - it's a definite yes!",
            "author": "J M."
        }
    ],
    "priceRange": null,
    "name": "Kinnikinnick Farm",
    "address": {
        "addressLocality": "Caledonia",
        "addressRegion": "IL",
        "streetAddress": "21123 Grade School Rd",
        "postalCode": "61011",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/WLBAp2xFVHiCirFJOJ68Iw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18152923288"
}