{
    "aggregateRating": {
        "reviewCount": 9,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-08-15",
            "description": "I absolutely love farmer's markets and the downtown Lafayette market is definitely a must! If you're visiting Lafayette and it's Saturday morning, definitely give a drop by. \n\nThere is free parking in the garage located right across the street from the farmer's market making it easily accessible.\n\nWhat I love most about the farmer's market is the variety of booths. There are booths selling anything from jewelry, to baked goods, to fresh fruits and vegetables, to flowers and plants, and coffee as well! All of the pastries I have tried from the booths have been phenomenal and very well worth the costs. I enjoy supporting locally grown goods, and visiting the farmer's market is a nice start to your Saturday.",
            "author": "Sophie S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-06-06",
            "description": "The Lafayette Farmer's Market is a great place to start your Saturday morning.  Grab some coffee and a pastry from one of the local vendors to take a casual stroll around the market tents.  A solid mix of Amish, organic and regular farm produce.  Baked goods and anything from the Harvest Bread Company are always on the list.\n\nParking is free.  Typical time spent is 0-1.5 hours.  Crowds not too large.  Friendly vendors that take the time to offer prep/use selections but not hover over you.  As with any market, compare prices because the will vary drastically.  If coming from out of town it is great as a stop rather than a destination.",
            "author": "Andria G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-30",
            "description": "This market is as fun to just hang out in as it is to buy produce or baked goods or even handmade soap. This is a place to see the community in action and often is the site of musicians and street performers and community activists as well as lots of baby strollers and of course that fantastic produce from the Italian gentleman who seems to grow everything with extra extra flavor.",
            "author": "Foster F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-05-05",
            "description": "Me and the family went for some fun and enjoyed every moment the food is great it is just wonderful to see all the farmers",
            "author": "Samantha S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-08-27",
            "description": "Lafayette has a great farmer's market on Saturday mornings. They had two booths making breakfast burritos, one that had homemade beef jerky, flower bouquets, and homemade soaps and candles you name it they had it. It's located right in downtown Lafayette. They have one one Wednesday's in West Lafayette too! ‍ ‍",
            "author": "Kara M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-04",
            "description": "Once you're in the downtown Lafayette area, it isn't hard to locate the Farmer's Market with the sound of live music or the hustle and bustle of people. It is a great destination for those wanting to buy high-quality food directly from farmers and producers or food not readily found at the local supermarket. \n\nFresh fruits and vegetables. Meats. Baked goods. Succulents. Honey. Homemade jewelry. You name it-- you'll find it there. The prices are reasonable, and the selection is huge. I also love striking conversations with the sellers, who are all so friendly and proud of what they've grown. The entire Farmer's Market only spans a block, but there are enough vendors there to keep you shopping for at least half an hour. \n\nI highly recommend going with an empty stomach because there are more than a few tents selling hot, ready-to-eat food like breakfast burritos, sandwiches, etc. And you definitely won't be able to resist any of the baked goods like coffee cake or sticky buns as you go down the street!",
            "author": "Rebecca T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-07",
            "description": "Wonderful selection and great variety. I do really miss the lady from Cutler, Rainey Farms. It is nice to support local businesses and see such higher quality produce.",
            "author": "Kelly J."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-06-03",
            "description": "Live music, hot/prepared food, coffee.\nOrganic and chemical-free produce and fruit.\nArtisan cheeses, milk, meats, jams, plants, flowers, soaps and baked goods.\n\nA great way to spend a Saturday morning.\n\nSome benches and tables would be nice.",
            "author": "Jeremy S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-09-23",
            "description": "The LFM is a great Saturday morning tradition.  Great fruit and vegetables abound, and I always buy my tomatoes here.  I really miss it in the winter...",
            "author": "John T."
        }
    ],
    "priceRange": "$$",
    "name": "Lafayette Farmers Market",
    "address": {
        "addressLocality": "Lafayette",
        "addressRegion": "IN",
        "streetAddress": "5TH And Columbia",
        "postalCode": "47905",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Lsl_r3FW3MlRnjadsXeW1Q/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}