{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-22",
            "description": "Looks promising!\n\nParking was a tad confusing, but LZ PD were there to keep it organized.\n\nWell-behaved dogs allowed.\n\nOnly saw fresh fruit & veg at first 2 stands, then it turned into canned & baked stuff....although they had a sign out saying that a lot of stuff wasn't there because of the extreme heat today.\n\nI'll give it another shot soon.",
            "author": "Marie S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-07-22",
            "description": "Very cute, small market. Fruits, veggies, knife sharpening, kettle corn, bakery (cookies mostly), pie place that has AMAZING lemonade in mason jars, a coffee place that has quite a variety for a farmers market stand! Some meat stands too. It was a VERY hot day so some stands were not present so not sure what we missed out on. As always with farmers markets...parking gets crowded, and prices are above prices of grocery stores. But what a wonderful location, right in Paulus Park!",
            "author": "Jennifer N."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-20",
            "description": "Warning: Road rage may lead to farmers markets.\n\nLemme 'splain. On the way home today, I was experiencing the horrific lane closures on Rand Road/12, and before that, a guy doing 30 in a 50 mph zone, and he received the DOUBLE long honk from my horn, twice actually for another offense. I gave the requisite dirty glare as I passed by- how will they learn if I don't? ;) And naturally it was a cute little family, adorable girl in back. I was IMMEDIATELY filled with intense remorse. I suck. A few minutes later, I saw the LZ farmers market sign and said to myself, \"maybe it's best you chill and check that out.\"\n\nIt was fate. The market is right next to a nice little park with ample parking. At just after 3, there were maybe 20 or so booths set up. Their summer hours are Fridays 3-7, and bear in mind some places are cash and check only, while others do accept credit cards. (Thanks Apple Square.)\n\nSometimes farmers markets can be disappointing in my experience; bad produce, lack of vendors, etc. This one had a pretty nice mix of fruits & veggies, popcorn, a Mexican food booth, jams & condiments, meats, bread, soaps and a few other items. Some of my favorites I've seen at other FM in the area, like Lester's Bison Farm (good quality meat, lean and inexpensive comparatively), Mama's Jams, and Wild Flour Bakery. All good stuff! Some others were new to me like Meyer Farm who had nice looking and inexpensive offerings, and to boot, they were extremely nice folks. \n\nBy the time I had wandered through, my road rage had subsided and was replaced by hunger, so I was pretty happy to see a banner off in the distance with one of my favorite words: tamales. Well, no, don't mind if I do. :)\n\nThis was how I discovered Pupusita Express. Yup, that's the name and it sounds funny to me, too- and not necessarily associated with something too pleasant- but they make quite a big and delicious spicy pork tamale. It was pork with green sauce (the filling) and not what I'd call spicy at all, but it had great flavor, proportions, and texture- very moist! I was also able to try something called a pupusa; 1 with cheese and jalapeños, and 1 with pork. It's kind of like a Mexican flat bread or thick tortilla with stuff mixed into it. The cheese and jalapeño one was really delicious- but super spicy so try a different flavor if you can't handle heat. And they give you curtido (pickled slaw) and a tomato sauce to throw on top. It all worked out nicely together. They have a restaurant in Lake Zurich which upon the occasion I have enough courage to battle Rand again- and further risk road rage- I plan on visiting with my husband.\n\nThis could very well be my favorite farmer's market so far. I mean, it's not very big, which I kinda like, and it's a lovely park location with interesting products and produce. I might like the Woodstock one more, but that's a good drive for me and this one just popped up in my path. You may not want to drive out if your way for it, but if you find yourself in the LZ area on Friday next week, well it's their last one of the season, so stop by and check it out. \n\nAnd please drive responsibly and keep the demons at bay. :)",
            "author": "Christina S."
        }
    ],
    "priceRange": "$$",
    "name": "Lake Zurich Area Farmer’s Market",
    "address": {
        "addressLocality": "Lake Zurich",
        "addressRegion": "IL",
        "streetAddress": "200 S Rand Rd\nPaulus Park",
        "postalCode": "60047",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/CtKeBhdQtWHlgFoSWnlBPw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18474385146"
}