{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-22",
            "description": "I LOVE the LSL farmers market. We always get the tamales, the Companion Bread, and veggies. It's so awesome to support the local farmers/vendors. You pay a little more sometimes, but you know it's not coming from Mexico!",
            "author": "Kathy H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-06-16",
            "description": "Finally making it to a Farmers Market of course on the hottest day so far!!!  it wasn't what I expected tho :-( There were more crafty vendors than the standard 'fruit, veggies & meat' vendors. I did buy some honey, beeswax chapstick, healing ointment and a fresh tamale!!-YUM!! \nSo we were excited to buy some fresh farm eggs yet disappointed we had to pass!!! Is it me or would anyone else pay 7.00 a carton?? I can get cage free HMO free at the grocery between 2.59-4.00...I'll stick with the farmers being at my market! \nSaw some amazing handcrafted jewelry, stones and beads from all over the world! \nOne place I will now visit Becuz of here is an all natural store in Wenztville which make soaps, lotions, sprays, candles etc ALL NATURAL OILS! Go lemongrass healers!!!!",
            "author": "Jaimie S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-04-03",
            "description": "I'll be honest I'm not a big \"farmer's market\" person so I've only been to a couple.  We hit this one on opening weekend here in 2017 and I was fairly impressed.  Plenty of vendors, *everyone* was incredibly nice and friendly (shout out to the \"Tamale Guy\").  Everything we bought was excellent and we'll definitely be making this a regular Saturday outing.",
            "author": "Madison B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-05-26",
            "description": "The Lake Saint Louis Farmers and Artists market is really great for local produce and goods. The produce and meat at the market has to have been grown or raised within 100 miles of the market which means you're getting local goods. This limits the shopping a bit to only the items in season but I'd rather have local than more selection. In May, there were a lot of produce stands with asparagus, greens, zucchini, squash, and tomatoes. Lots of vendors with farm fresh eggs and a few meat vendors. There were also bread and dessert vendors. \n\nI'm not as interested in the artist goods as the produce but there were a lot of vendors. Everything from jewelry to flowers to wood products. I also saw local honey and mushrooms (morels!) around. \n\nThe market is located in the front parking lot of The Meadows shopping mall and there's plenty of parking for everyone. Most vendors are cash or check only.",
            "author": "Melissa C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-04-06",
            "description": "This is a pretty solid farmer's market with a good variety of vendors and thus, a variety of produce to be had.  Also, this is a producers only market so you won't be seeing some vendors dumping stuff out of a bag they got off a produce train.\n\nIt's quite a bit bigger this year than last year with a lot more \"artisan craft\" vendors.  I'm not interested in those in the least, but it should count for something.\n\nI would say this place is about the same as the Ferguson Farmer's market in terms of variety but in terms of the produce and plants we've gotten the quality's been excellent.\n\n*Edit* - Apparently yelp liked to change the business location over the Glen Carbon.... yeah no it's over in Lake St. Louis :P",
            "author": "Allan C."
        }
    ],
    "priceRange": "$",
    "name": "Lake St. Louis Farmer’s Market",
    "address": {
        "addressLocality": "Lake St. Louis",
        "addressRegion": "MO",
        "streetAddress": "20 Meadows Cir Dr",
        "postalCode": "63367",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/xn-va1kchQ9R18mjbgH8tw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16366952626"
}