{
    "aggregateRating": {
        "reviewCount": 39,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-24",
            "description": "I was really surprised to see that there are few farmers markets on Saturdays in Chicago.  It's probably because few can hold a candle to Lincoln Park Farmers Market.  I was impressed by both the vast variety as well as the signage that shows where each vendor is located in the Midwest, including Illinois, Michigan, Wisconsin, and Indiana.  During my visit, I bypassed my usual \"get 12 pastries\" M.O. and opted to try a tamale from one of the vendors.  It was a GREAT choice.  Whether you're looking to stock up on fresh produce for the week or munch on brunch, Lincoln Park Farmers Market is THE market to check out on a Saturday.\n\nPS: LPFM is dog-friendly.",
            "author": "Allison F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-07-29",
            "description": "You can feel the difference between this Farmers Market and every other Farmers Market I've been too namely Geneva, Wheaton and Logan Square. This is Lincoln Park right by the Zoo. Quaint yes, makes you feel like you're in a Nora Ephron film (mainly the ones with Meg Ryan) yes absolutely!! - why else did I come here. \n\nIf your looking for organic, free range, grass fed, they have it.  My only complaints that it's a little pricey.",
            "author": "Ernie H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-27",
            "description": "Lincoln Park Farmers Market is set in a park. Perfect location to indulge in what the earth has to offer. Walking through the grass under the shade of trees made me forget I was in the middle of a big bustling city. \n\nThe variety of items available was diverse. All the venders are friendly. A cooking demonstration was fun and informative. And the pastries were de-lish!\n\nI loved my experience and will return soon!",
            "author": "Rhonda F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-21",
            "description": "This is the best farmer's market in the city, in our opinion. It's a little bit of a slog to drive through the city instead of it being right next to a highway, but Lake Shore Drive is right nearby and that is good enough for us. There is a very solid attempt to make sure that all the vendors are organic, local, and at least healthy. The vendors are all chatty and love to explain the benefits of what they're selling, which I really like. They're connected and deliberate instead of cold and cash oriented, like some other other markets we've sampled. They all have very interesting wares to sell and most of them have samples to try. It takes about an hour and a half to walk all the way around which includes a few stops and conversations, so allow yourself at least that.\n\nHere is the calendar where you can find the date that they open for the warm season: https://www.cityofchicago.org/city/en/depts/dca/supp_info/farmersmarkets0.html",
            "author": "Dan H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-16",
            "description": "Definitely a down-to-earth, try before you buy, eclectic place in the city. It opens on Wednesday's and goes until Sunday usually from 8am - 1pm. I've made it point over the years to try to stop by at least once a week to check out the selections of flowers, fruits, veggies, berries, salsa's, breads, paninis, coffee, smoothies, and of course, their homemade donuts. Sometimes the donut vault mini van park along the side the festival too for you to grab a donut as you walk around the market. There's always a ton of people, dogs, strollers, toddlers, and young folks but you never feel like you're too squished walking around. Almost all the vendors have samples and there are signs to let you know how far some folks have traveled to get to the market! It's one of my highlights of warm weather to be able to visit the Farmer's market!",
            "author": "Chelsea S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-29",
            "description": "I have been to a few different farmers markets in the city and this one is my favorite by far! \n\nThe vegetables in particular are plentiful! Some other farmers markets in the city just have standard corn, lettuce and tomatoes, however the Lincoln Park Farmers market offers a plethora of vegetables. \n\nThere is also a crepe station and these are amazing! I like the blueberry goat cheese crepe in particular. There is some seating at the market so many people will sit and eat their crepes and continue on shopping. \n\n1 stand in particular has maple bacon cookies and we love to get them because they are not only delicious but unique as well. \n\nSome s rands only take cash while others take credit cards so come with both! There are lots of dogs here and there is even a stand that sells dog treats and bones.",
            "author": "Rachel A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-28",
            "description": "This is a vibrant market with an exciting variety of interesting vendors.  I'm enthralled!  The bright, eye popping colors of fresh vegetables turned heads and I saw produce not common in grocery stores, including scarlet turnips and, new to me, lemon cucumbers.  \n\nIn addition to the farm booths there were unique food vendors feeding the hungry crowd.  They included a portable wood fire pizza oven and Gayle's Best Ever Grilled Cheese Sandwich.  Gayle's only uses products from the market and when I returned for lunch I ordered The Duke.  Superb.  The real clincher was the rhubarb mustard I chose as a condiment. \n\nAs a fan of farmer's markets in my home town and when I travel, there were two things that stood out and were unique to this market.  Each booth has a small poster on the front with the name of the business, a description, plus a state map showing where it's from and how many miles they are to the market.  Brilliant.  Talk about eating locally.\n\nThey also had an area for trash, recycling and composting.  Recycling has become pretty ubiquitous but offering a composting bin is a wonderful idea for city dwellers, one I wish was available at my market.\n\nI wanted to pack everything in my suitcase, but was limited because I was flying.  But I managed to bring home a jar of raspberry jam from Bushel & Peck and I put together a goodie bag for the bride and groom of the wedding I was attending - goodies like a jar of homemade organic Bloody Mary mix, strawberry/rhubarb jam, organic popping corn and wheat berries to make pancakes with.\n\nI really couldn't get enough of this market.  You should check it out.",
            "author": "Will T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-09",
            "description": "I stumbled across this during my morning walk.  Quite a large selection of fresh produce.  I have been to several smaller ones in the local neighborhoods and this is the largest I've been to the area.  I was surprised to see a lot of breakfast foods and pizza being served instead of just vegetables and flowers.  There were places making fresh crepes and sandwiches.  There was also decent selection of honey and cheese between the different stands.  It's not too far of a walk from me.  I\"ll be back to get some ingredients.",
            "author": "Scott B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-09-28",
            "description": "To clarify: Many of these reviews on this page seem to be for the Green City Market, also in Lincoln Park, which is held in between Clark and Stockton. The below review is for the Lincoln Park Farmer's Market, which is indeed held at Armitage & Orchard, in the parking lot of Lincoln High School. \n\nThis farmer's market was great, if a bit on the small side. Very affordable and you can get what you need regardless of size. There are 10-15 vendors, with the majority of the stands selling produce/fruits, with a truck selling meat/Amish butter/fresh eggs, a mushroom stand, pasta stand, bread stand, flower stand, crepe stand, etc. \n\nA note on Green City Market: this is the market with standardized laminated stall info placards, chef publicity, etc. It's much bigger and in a park setting, with lots of interesting vendors, and I love going there too. I find it a smidge more expensive than LP's farmer's market, so when I want to buy produce on Saturday without masses of dogs and strollers, I go to the LP market (crepe access is still available!) When I want to wander a bit more while shopping and stumble across interesting things, I go to Green City Market.",
            "author": "Leeda W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-05-13",
            "description": "This may be one of the best farmer's/green markets in the country! We used to visit it when we lived here. We always visit when we come to town. You can visit Wednesdays and Saturdays. Challenge yourself and walk over from your Michigan Avenue hotel. It's really a beautiful and good walk. Flat. Lovely architecture, foliage. OR from Michigan Avenue, you can take the 151 and get off around Orchard. It's near the zoo.\n\nLove the variety of fruits and veggies. The crepes are always good. New food vendors are always showing up. There are now more varieties of hot food/freshly prepared items there. Dog friendly, lots of strollers. Fresh flowers. You probably could shop and make a meal with the fixins there. Don't forget your reusable shopping bags. There are always Chef demonstrations, sometimes well known city ones. Haven't seen one in a long time though, personally. Summer is a great time to visit, too.\n\nLook for the squeaky cheese curds from the Brunko family, fresh pork \"meat sticks\" or \"slim jims\" if you call them that. Also, the honey producers are amazing. I like the ones in the glass octagonal jars. They used to have gold lids. The honey is almost clear. It is so delicious and actually refreshing.\n\nStreet parking near the zoo can be difficult. There is a lot just south of the zoo at North Avenue. You should just cab it over or take the bus.",
            "author": "Steph G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-09-11",
            "description": "Great Farmers Market \n\ndecided to make a pot of soup today as my partner has been filling sick so we headed to the Farmers Market to get veggies \n\nbusy place it was too, but plenty of parking on the street, close to the El also and we got all the veggies and some potatoes for the soup, wandered around and checked out the fresh fruit salsas one booth had and checked out the beautiful fresh flowers, but a little hard to take home on a motorcycle next week may have to ride the train to get stuff \n\nlisten to some fine music being played by 5 people with violins, and got a couple Crepes from Flip  Crepes http://www.yelp.com/biz/flip-crepes-chicago I got the Cheese Trio it was very good and filling plus some fresh squeezed lemonade \n\nHoney Crisp Apples are in season also \n\nthink we will be hitting up this market on Saturdays till the season ends",
            "author": "Robert S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-18",
            "description": "I really enjoy this farmer's market. It is nicely done, quality produce/cheese/etc and a lovely flower selection. \n\nThe crepes looked delicious and whatever sausages were on the grill looked amazing! \n\nDefinitely worth a trip. I'd suggest a walk or bike ride there - parking is a bit of a challenge.",
            "author": "Kathleen C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-19",
            "description": "This is a real deal farmers market--a perfect amount of small farm stands, and great variety. There's been a rumor that Green City is stealing the business and hurting this community gem, which is a real shame because there should be a place for hyper-local spot like this. There are a half dozen produce tenets, a dairy and butcher truck, a flower market, two bakeries and two creameries, a mushroom stand and a really fun crepe seller! Make sure you make it to the market Saturday mornings, folks :)",
            "author": "Maryam S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-10-11",
            "description": "The Lincoln Park Farmer's Market is my favorite new discovery.  You can get farm fresh local produce at very reasonable prices.  I don't know if the farmer's market can fufill all your grocery needs, but it will come close.  I spent about $40 and bought fresh bread, local cheeses, several squash ($1 each!), corn (40 cents), flowers - basically as much as I could carry.\n\nThe market has food stands that cook up sandwiches and crepes in addition to the produce and bakery stands.  I noticed a coupel stands that sell meat.\n\nBig a big tote bag with you because otherwise it will be a struggle carrying everything home.",
            "author": "Kit G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-21",
            "description": "This is on Lincoln and Clark, which is a half mile from armitage and orchard listed on this page",
            "author": "Carol L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-26",
            "description": "Love this on Saturday mornings! My golden retriever loves coming too. There is a great stand that sells antlers a his favorite treat!",
            "author": "Katie K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-10",
            "description": "Best thing going on Saturday mornings in Chicago :)",
            "author": "Lucy K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-05-19",
            "description": "There is something very serene about meandering your way through fragrant plants, flowers and fresh vegetables.  The aroma intoxicating.  I discovered herbs that I did not know even existed!\n\nChocolate mint.  Yes, it tastes like chocolate mint.  It's a plant.  Wow!\n\nI only wish I had bought more...",
            "author": "Kathleen P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-07-30",
            "description": "One of my favorite things to do is wake up on Saturday mornings in the summer and take a leisurely walk to the Lincoln Park Farmers Market. No need to worry about breakfast because I have so many option right there...crepes, fresh fruit, scones, muffins. It seems like the vendors doubled from last year which just gives me so many more options. Atfer eyeing it all, I finally decide upon a few fruits and vegetables and I always pick up some fresh flowers to admire on my walk back. \n\nThis is a great way to spend a Saturday morning and then you also have plenty of fresh items to eat the rest of the week.",
            "author": "Kay S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-09-24",
            "description": "Fresh produce, cheeses, flowers, sunflowers, jams, smoothies and apple cider. It's a perfect way to spend a Saturday morning and support the local farmers. Prices are decent. It may not be as cheaply priced as a a supermarket, but you can expect to get some quality produce. There are also a handful of tents providing free samples such as cheese curds straight from the skillet, aged cheeses, cookies, and more. Then when you're done with all the shopping and sampling, stop by Zullo's for some delicious zeppoles. And don't forget to come early enough, as the market wraps up around 1 PM.",
            "author": "Jason P."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-05-17",
                "description": "Is there anything better than buying a big ol' bucket of fresh, ripe, lush tomatoes and making sauce from scratch? \nI don't think so... and if you wear your brightest smile you get samples!\nExcellent quality produce, fair pricing (flirting gets better results than traditional haggling LOL) and if your dog has some cute tricks (Princess does) there are yummies here for them too! Go!",
                "author": "Kat S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2005-08-23",
                "description": "This market has a nice variety of produce, with some of it being organic.  You can also find flowers, jams, dips, and baked goods.  Parking is very difficult.  They are open from May 19-October 27 from 7am to 1pm.  This is a great way to support smalller farms and to enjoy fresh, locally grown foods!",
                "author": "David F."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2006-07-10",
                "description": "The best produce in all of Chicago, plus you get warm fuzzies supporting local farmers.  I live on the border of Lincoln Park & Lakeview, so I make it part of my weekly work-out by walking to the Farmer's Market & hauling all my groceries home.\n\nI love the honey crisp apples, which I can't find in any of the grocery stores.  Shopping here inspires my inner chef!",
                "author": "Jenny M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2007-08-21",
                "description": "I tried the Farmer's Market for the first time this year, and I'm definitely a fan!  The veggies available are fantastic!  There's also other cute vendors.  \n\nOne cute one was for MK Cookies, and they sold really delicious homemade cookies.  They had samples too.\n\nAlso, I bought Fair Trade coffee at the booth for the Chicago Coalition For The Homeless and it was good! (And I'm a Dunkin Donuts lover!). \n\nThis is definitely worth going, but go EARLY (think 8 a.m.) to get good parking and a good selection and the cookie stand will still have free samples!",
                "author": "Rachel C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-02-06",
                "description": "Cute little farmers market, lots of personality and a little bit of everything. Just weird being in the middle of one of the biggest cities in the US. When I think of a farmers market, i dont imagine seeing huge buildings surrounding me.... Was in a very cute park near Lincoln Park though.\n\nTried some apple ciders that i have never even heard of before. Many people with their dogs, made it kind of interesting. Some of the produce ive never seen before! Makes a wonderful morning walk. Good place to stop before a day at the zoo. \n\nBeing a Michigander, i thought it was funny that all apples were \"Michigan apples\". I didn't know it was such a big deal to have apples from Michigan. Maybe I'm just spoiled.",
                "author": "Kate H."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2009-06-04",
                "description": "The Lincoln Park Farmer's market has changed since last year. If I had written this review last year I would've given it 5stars- no doubt. But the two Saturdays Ive been there in 2009, the market has been filled with flowers, bread, cheeses and TONS of asparagus. Not that there is anything wrong with any of those selections, but where are the berries, the broccoli, the tomatoes, the potatoes the PRODUCE I loved last season.......... \n\nI'm going to check out the farmer's market at 61st & Woodlawn and see if I have better luck.",
                "author": "Natalie M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-06-19",
                "description": "While I would agree with the previous review on the market being a little thin with goods, I believe it is more because of all of the wet weather delaying the growing season and have no doubt that the LP farmer's market will return to its glory in a few short weeks and what a glory it is. I've been to a few other farmers markets and this is by far the most uncluttered and least pretentious. The Green City market which seems to be the jewel of Chicago thanks to Top Chef is much more cluttered with stands and people and doesn't offer a variety to offset the cost of the aforementioned. The LP market has, for the most part, the same delicious and fresh goods sans the abundance of Rick Bayliss/ Jamie Oliver wannabees and aggressive dogs. \n\nThe fresh produce is wonderful. While writing I can remember delicious melons and sun kissed tomatoes. The vendors are friendly and the pre- made goods are delicious as well..the cheese stand is a must, a great assortment of fresh flowers and I highly recommend the \"shroomshetta\". Come early for the best pick and come a little later for the clearance sales.",
                "author": "Ryan S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2005-12-01",
                "description": "the parking is so hard to get around because the Lincoln Park school kids park their cars there to. it's like you have to park a block away and then walk all the way back to your car with everything.\nThe foods are fresh, nothing is forced riped, and it's all locally grown.",
                "author": "Lee-Han H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-10-23",
                "description": "Really love this market.  Its small enough to know everyone and still has so much to offer - veggies, fruits, cheeses, meats, breads, pastries, and of course flowers and plants....  and this year they added parking.  As always I'll be sad to see the season go, but happy again in the Spring when they are back.",
                "author": "B K."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-08-04",
                "description": "Yes, I get the warm-n-fuzzies from the vendors.  The prices are a little steep ($7.00 for a carton of blueberries - which is the same price as jewel or dominicks, but yes, WAY better quality.)  It still beats the hell out of Whole Foods, TI and Sunflower Market for freshness.",
                "author": "Anne M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-09-15",
                "description": "Welcome to the land of the hot mom.  If you come, bring your baby, designer stroller, and aviator wearing husband.  The produce is only a little more than what you'd pay at Jewel but they're not dealing in volume and most of it is higher quality.  Crepes were excellent, as was the cider.  Bottom line - great place to munch on healthy stuff while people watching.",
                "author": "D L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-01-17",
                "description": "Fresh and local produce?  Sign me up.  And two steps from my apartment?  Super bonus.  Everything from vegetables, to every apple imaginable, to fresh flowers, pumpkins and yummy baked goods.  Way better than a grocery store and always nice on a beautiful sunny Saturday morning with a good cup of coffee!",
                "author": "Erin S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2005-09-25",
                "description": "Enjoy organic and heirloom produce and feel great about supporting local farms in the process.  Located in the parking lot of Lincoln Park High School, it's a feast for the eyes and nose, and the sales people are interesting to talk to.  The fruit and vegetables are so fresh and delicious.",
                "author": "Ellen M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-08-23",
                "description": "The farmers market may not be as big as the one in Lincoln Park itself, however it has all the same types of fresh produce. If you need some mushrooms, zucchini, or whatever happens to be in season (and not a large selection of locally grown meats and whatnot) this is the perfect place to go. It's cheap, the produce is excellent, and its not as crazy as some farmers markets.",
                "author": "Nick N."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2005-09-30",
                "description": "I love this Farmer's Market in the summer! I lived very close, and usualyl will wake up early and walk over to pick up fresh produce. You can get soo much for your money and it is all soo much more fresh then if you buy it at the store. They even have a lot of really pretty flowers that you can pick up to add a little something to your living room.",
                "author": "Julia B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-10-22",
                "description": "I dropped by here twice this fall and I love it.  There is a cheese stand that sells a pistachio loaf that is awesome!  I bought it the first time and HAD to buy three more the next time.  I gave them to my mom and within a week she had gone through two of them when she had people over.  I made her promise to keep one for thanksgiving when I will be there to enjoy it!",
                "author": "Lynn C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-06-17",
                "description": "2008 started off a little slow but probably because they started a few weeks earlier this year.  First day there were probably half of the usual vendors but now that we are in mid-June, it's starting to fill back up.  Great selections of tomatoes, strawberries, breads, cheese, and flowers.  Looking forward to a great growing season.",
                "author": "Todd C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-12-30",
                "description": "The farmer's market is Oarsum. My daughter adores it because of all the dogs that come by, and of course the produce! we especially dig the guy who has about 20 varieties of apples - just great. Beautiful flowers and other fresh fruit just make this a perfect saturday stop when the weather is nice, on our way down Armitage to the zoo or the lake.",
                "author": "Joseph B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2007-10-02",
                "description": "i love this place. my favorite thing to do sat morning is to wake up and go to this farmers market. okay so i hate the fact that everything isn't in season like it is in CA but this is really cute. there is a cheese stand that has to die for smoked string cheese. great selection for berries and peaches. also the bakery is great too. there is also a stand where you can find chinese broccoli and eggplant. love it. will be sad once winter comes.",
                "author": "Miss O."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Lincoln Park Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "Armitage Ave & Orchard St",
        "postalCode": "60614",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/hUy4Rv6wi8IcA1yhdonsjg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}