{
    "aggregateRating": {
        "reviewCount": 13,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-12-23",
            "description": "This is not your typical farmer's market. You'll find food items like meats and vegetables, but you'll also find cookies, jams & jellies, jewelry, clothing, artwork, books, coffees, special teas and a number of unique items from various local vendors. \n\nIt's a fun event hosted at Schlafly's Bottleworks.",
            "author": "Keith D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-03-12",
            "description": "This is a great winter and summer season farmer's market. I scored some great goods, like a whole wheat pancake mix and a great roobois chai. They have veggies and fruits, apple butters, honeys and jams and home goods and clothing. One of my favorite jewelery vendors, Beqi clothing, was there the last time I went. I also bought a great wintertime shea hand cream from BelleJournee. I love stopping in to the market because you never know what you'll find.",
            "author": "Katherine B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-10-01",
            "description": "Farmer's Market mid-week, in front of one of my favorite breweries?! \n\nPlease and Hell Yes and Thanks. \n\n(weekly growler fill-up and cheese stop)",
            "author": "Sal E."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-04-14",
            "description": "The best thing about this farmer's market is the addition of the Pie Oh My lady.\n\nWe always spend some time to just talk with her... and get a slice.  \n\nOther than that I think this palce is only worth checking out if you live in the area and can't wait until Saturday for one of the larger places.\n\nThere is a guy selling beef heart though if you're on the lookout for that sort of thing.  Those things are delicious.\n\nKalimaaaaa...",
            "author": "Allan C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-05-30",
            "description": "This farmers market is puny compared Tower Grove and Soulard.  There is indeed a variety of vendors, but just not enough.  This market clearly lacks a variety of fresh fruits & by that I mean watermelons, strawberries, etc.  They just only have tart cherries, raspberries, gooseberries & blueberries.  Some of these vendors are organic.  I support local farmers & meat producers.  I just wish there were more of them at this market.",
            "author": "Kat V."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-06-24",
            "description": "I've become a weekly visitor to MFM and it's really grown on me. There are more vendors, and I have gotten great produce here, as well as eggs, meats (for the hubby), jam, plants, and bread. Companion is here and a weekly stop, for sure. The gal who works there always knows what I'm going to get so it's nice to be recognized. I got some great tomato plants that I just couldn't resist that are growing great! I like the vibe this year. Parking is usually ok too. Worst case scenario, park on a the street and visit some other awesome businesses in Maplewood.",
            "author": "Sarah S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-03-27",
            "description": "What's that, you say?  You say it's still too cold in March for the Maplewood Farmers Market?  \n\nWell.  I would've said the same until I realized that the good folks at the Bottleworks allow the farmers to sell their goods indoors during the chillier, off-season months.  Having had lovely weather earlier this week, they decided to hold the market outdoors this morning, which, in my opinion, was still a bit too early.  Brrrr!  But, there was hot coffee and other belly-warming goods on hand, so all was well.\n\nCheery, freshly-cut Spring daffodils waved at us as we checked out the farmers' wares.  Farm fresh eggs!  Grass-fed beef!  Fresh pasta!  Amazing goat cheese!  Overwintered spinach and fresh arugula and kale!  Baked goods, jams & jellies and all sorts of things to make tummies happy!\n\nI love farmers markets and the Maplewood one is pretty great.  Even better when it's warm and sunny outside, because then the harvest is particularly diverse and bountiful.  Once it's growing season and the market is in full-swing, I recommend showing up when the market opens.  Lines will already be forming.  And I *will* elbow my way through the crowd for a few pints of Biver Farms strawberries.",
            "author": "Julia W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-20",
            "description": "Goat cheese. Goat cheese. Goat cheese. You can't go to the Maplewood Farmer's Market and not buy it. Unless, of course, you happen to be lactose intolerant - and the thought of that just that makes me sad. \n\nThis stuff is simultaneously creamy and fluffy. It's rich and light in one bite. It's miraculously delicious - and it's shaped like a heart, which puts it on all new levels of awesome.\n\nIs that the only reason I go to the Maplewood Farmer's market? No. But it's typically the primary one. And I always have a lot of fun browsing after I've secured my heart-shaped piece of cheesy heaven.\n\nWe bought a few tomato plants there in the spring that served us well all summer, and we've stopped by on several occasions to pick up local meat for grilling on the 'que. \n\nThe downsides? It's pretty small, somewhat pricey as far as farmer's markets go (though, there's always haggling), and any meat that you buy there is typically frozen for selling - so you can't always throw it on the grill right away. But the people are friendly, the location is great, and chances are, you'll find something that you just HAVE to bring home.",
            "author": "Kate E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-19",
            "description": "Right by my work.  Love that it's on Wed and not weekends like most because I work weekends.",
            "author": "Cassie C."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-08-20",
            "description": "It may not be the biggest or have the most variety of the local farmer's markets, but I love that it occurs during afternoon/evening hours on a weekday - it is the perfect place to swing by after work and pick up some fresh produce, bread, cheese, or meat to create or spruce up my weeknight meals.",
            "author": "Kyle K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-08-11",
            "description": "Farmer's market? Check.\nAmazing produce? Check.\nFresh baked goods? Check. \nFresh, organic jams? Check.\nBest goat cheese I've ever had in my entire life? Check.\nBeer on tap provided by the ONLY St. Louis owned brewery left? Check.\n\nI feel like I don't need to say anything more...But I will..\n\nA bit pricey, as farmer's markets tend to be, but worth it. Stopped here for yumminess before heading over to the Botanical Gardens for their Jazz festival. Best idea ever!\nThe Maplewood Farmer's Market gets a big YUMMMMM from me!!",
            "author": "Rebecca K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-06",
            "description": "I know that Soulard is really the be all end all of St. Louis farmer's markets, but sometimes you just want something a little less daunting. Not to mention a market where you don't have to be there at the crack of dawn to get the good stuff. And Saturday markets that end at noon? Please. Don't make me set my alarm. Weekends are for sleeping in! \n\nBut, it's ok, because I've already stocked up on farm-fresh produce by hitting the Maplewood farmer's market on Wednesday evenings. That's right. 4-7. And it's oh so conveniently located in the Schlafly Bottleworks parking lot. Happy hour and farmer's market. Now, that's a winning combination. \n\nI've got to give a shout out to Baetje Farms whose cheese has become pretty ubiquitous among the farmer's market circuit. I think they hit all of them, but they are fast becoming one of my favorite vendors at Maplewood. They are just so darn nice and the cheese is melt-in-your-mouth good. They also take credit cards which is a huge plus for a stall where prices are in the $8-12 range.",
            "author": "sarah c."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-05-24",
            "description": "The Maplewood Farmer's Market takes place every Wednesday from 4-7p.m. during the seasonal months. I love that I can go here after work, pick up fresh vegetables and fruits (they have a TON of other wares and foodstuffs, too), and go home (no waking up early to go here). The Maplewood Farmer's Market takes place in the Schlafly Bottleworks parking lot and benefits local farmers and growers.",
            "author": "Jennifer H."
        }
    ],
    "priceRange": "$",
    "name": "Maplewood Farmers Market",
    "address": {
        "addressLocality": "Maplewood",
        "addressRegion": "MO",
        "streetAddress": "7260 Southwest Blvd",
        "postalCode": "63143",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/pUjSVHFglZM49BFGjThXmw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13142412337"
}