{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-12-04",
            "description": "I've been shopping here for years and the staff is always courteous and helpful.  25 cents per pound of bananas,  69-89 cents per pound tomatoes when they are like $2.69/lb. in your local grocers.  Sometimes the food they have is ORGANIC(if that matters to anyone.)  Their prices rarely change- if they do, it's only by cents.  I LOVE IT!!!  I don't understand why its marked with 2 dollar signs because food here is super inexpensive...plus, every so often they hook you up with free food (I guess if stuff isn't flying off the shelf it's best to give away than let food go to waste.)  It's sad to see anything less than 5 stars for this place.  I have saved sooo much money shopping here!  If you think a mistake had been made on your order, then it would be kind to ask them to re-ring it instead of running home to write a nasty review when it was probably an honest mistake...but you'll never know because you don't give people a chance, you just suspect and judge.  Ask for a receipt! I always do, and they always oblige:)  God bless!",
            "author": "Julie R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-02-03",
            "description": "Always fun to discover what Mark has! I like variety and surprise. Staff are wonderful and like their customers. EAT MORE VEGGIES!!",
            "author": "Maria M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-05-18",
            "description": "Vegetables and Fruits are fresh.   Never know what to expect.  Prices are good.\n\nSometimes, it appears that a person is getting over charged because there are no receipts.  It would be nice to have the cashier announce each items price as it is being entered into the cash register.  Currently, one just hears a final Total Amount.  Customers should receive an itemized total for the items.   Recently, went home and added up the items and felt the amount paid was to much.\n \nCannot give a higher rating because of the no receipt policy",
            "author": "Judy Z."
        }
    ],
    "priceRange": "$$",
    "name": "Mark’s Produce",
    "address": {
        "addressLocality": "Whiting",
        "addressRegion": "IN",
        "streetAddress": "Indianapolis Blvd",
        "postalCode": "46394",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": ""
}