{
    "aggregateRating": {
        "reviewCount": 2,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-07-25",
            "description": "What great offerings today. Everything was seasonal and smelled perfect.\n\nI got sweet potatoes, tomatoes, red potatoes, cantaloupe and a red pepper.\n\nAlso available: cucumbers, zucchini, cherries, peaches, okra, radishes, cauliflower, plums, celery, carrots, lemons, limes, huge tomatoes and potatoes.\n\nMuch more there. It's a great place to shop for fresh fruit and vegetables.\n\nFind them at: https://www.facebook.com/Midtown-Farmers-Market-655879797806495/",
            "author": "Patt C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-14",
            "description": "It is officially farmers market season and what an amazing find this farmers market truly is! The Delmar Loop isn't just for cool trendy restaurants, places to grab a drink, entertainment and people watching; now there is a mainstay that will help with our nutrition, health and that emboldens the local community. Discreetly tucked away in The Market on The Loop in the middle of the Delmar Loop (between Enigma Tattoo & Body Piercing and Market House Pub) is The Midtown Farmers Market. Please be mindful that in this same space, on Saturday you will also find what appears to be farmers market participants but they are not (Long Acres Farm). The actual farmers here are producers/growers; meaning the farmers and artisans grow or make the products they sell. These MO and IL farmers drive one - three hours to bring their goods to market.\n\nSince these farmers are nearby, some bonuses are less fossil fuel is used (that's great for the environment) and the farmers pick their produce at the very peak of its flavor (not weeks before like retail grocers). I will say at least one of the organic growers was insanely high.  I have been to other places (farmers markets and national organic chains) and never spent $5.50 for two summer squash. \n\nMy most recent trip found me with organically grown summer squash, freshly popped kettle corn, empanadas made locally, the freshest cheese and a delightful sense of comradery with fellow shoppers and an appreciation for the local farmers. Another cool stand out for this farmers market is that unlike most Saturday markets that close at noon, this market is open until 12:30! Come check this place out on a Saturday before going to an independent movie at the Tivoli or noshing on lunch at a locally owned restaurant; it will do your budget, your health and your conscious good - Support Local Food!",
            "author": "Kay X."
        }
    ],
    "priceRange": "$$",
    "name": "Midtown Farmers Market",
    "address": {
        "addressLocality": "University City",
        "addressRegion": "MO",
        "streetAddress": "6655 Delmar Blvd",
        "postalCode": "63130",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/kneJXb0JVOFzpBcYwRBANQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13149136632"
}