{
    "aggregateRating": {
        "reviewCount": 66,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-05",
            "description": "Same thing other people have said: awesome French market, but it gets crazy crowded, especially later in the day. That being said, there are a variety of vendors, from produce and flowers to baked goods to meat to clothing and jewelry to books. It is a pretty stable group of vendors, that is, it's pretty much the same vendors in the same place each time.\nEveryone I've met is really friendly. Prices do vary quite a bit from one vendor to another, especially with produce. \nOur favorite thing is to ride our bikes over on Saturday morning. There's a fair amount of parking, especially in the garage (across from the DuPage Medical Group building), but it's really easy to bike there since it's right off the prairie path.\nConvenient access to downtown Wheaton for whatever else you may need/want (i.e. the library, Carlson's hardware, etc.)",
            "author": "Christina A."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-09-28",
            "description": "When I lived in Illinois, I loved this French Farmers Market in Wheaton. It had to be one of my first stops when I came back to town. My favorite memory about this market was buying a huge tropical beach painting from one of the vendors. It was one of my hubby and I's wedding presents to each other.\n\nThis time around it was as great as I thought it would be. They have tons of little local vendors selling their crafts, food, popcorn, ice teams, clothes, flowers, jewelry, and home décor. \n\nThere's a lot to see and several rows of it. It has a nice location by the train station and steps from Downtown Wheaton.\n\nOne thing that I noticed after the fact when I had already been through the market is that they are not dog friendly. My dog was walking all throughout the market with no problem. Than at the end, I see the small sign that says no dogs allowed. I don't understand how that could be the case when this is outside. Either way, no one stopped us with him walking around and it was fine.\n\nAnother thing is that there really aren't that many food vendors as I thought that would be. there was a popcorn vendor, a bakery, some coffee, and maybe about 2 or 3 more food vendors. There was not much selection, so if you are hungry just keep that in mind and check out something in downtown Wheaton.",
            "author": "Rachel M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-03",
            "description": "I'm taking one star off simply because it gets PACKED! As in you can't move while attempting to walk through the aisles. And then people bring their kids, strollers, and dogs, and you think all hell is about to break loose.\n\nThe assortment of vendors is great though. Flowers, produce, meats, bakery, coffee, jewelry, skincare, etc. It's all there, and it's all beautiful and wonderful. I love it when vendors give out samples - we bought several things we otherwise wouldn't have!\n\nDefinitely get there early! By 10am, you could see inventory had already starting to decline. Plenty of other shops and restaurants to visit while your in the area, and a beautiful little walking path by the library as well!",
            "author": "Katrina S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-05-05",
            "description": "Overrated and overcrowded. Go here when they open and a lot of stuff isn't set up. Go here late and a lot of stuff is sold out. Go here in the middle and the parking lot on Willow is really backed up and precarious. Totally crowded at 10:30AM, can't even move. Now here's where my complaining really begins:\n\nI know it's a \"French market\" and not a \"farmers' market\" but the fact that this place is 9-10x more jewelry and pastries than produce is ridiculous. That's kind of depressing, and the little bit of farmer's stands is not super great either. Out of this whole place, only one is organic produce. Just one stand. And they sell out of stuff QUICK.  \n\nThe other places have been mostly disappointing. Instead of growing and selling spring crops locally in the spring, they'd rather sell summer crops from Florida. And they all had these southern Illinois strawberries that were all bruised and looked like they were going bad. It seems like they all got them from the same distributor/farm or whatever. They aren't selling things they grow for the most part. The one nice thing I got was some Michigan hydroponic tomatoes that were very fresh and broccoli. Let's hope they taste as good as they look, and let's hope the southern Illinois strawberries (which I got out of curiosity) taste a whole lot better than they look. I thought local food was supposed to be fresher than grocery store food? Not always. Maybe those tomatoes will bring me back to fight the crowds next week but they'd have to be pretty damn good.",
            "author": "Me Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-05-21",
            "description": "Came here for my first time today as it was beautiful a outside and wanted to check out the local fare.\n\nTasted some locally produced honey, breads and kettle corn. \n\nThey had pretty broad selection of clothes, crafts and foods available from different local vendors. \n\nFound some fresh model mushrooms available that had been picked in Wisconsin and considering I didn't find any this year, 10 bucks for a seasonal delicacy wasn't a bad deal!!",
            "author": "Coq R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-05-10",
            "description": "Indulge much?  I had such a great time choosing my indulgences at this market!  And most were within reason. It was a win-win!\n\nWe went earlier in the day to avoid the crowds that gather here in downtown Wheaton. But by the time we left, it was getting crowded and the strollers had made their way to the aisles. So yes, come early. \n\nI started making purchases almost immediately. I think that may have been a mistake. Similar vendors had similar products at a lower cost as I moved up and down the aisles. If you have the time, I would encourage you to look at everything and then make your decisions. But if there's a limited supply of things - get it while the getting is good!  \n\nLet's talk about some of my favorites...\n\nWe tried some honey. It was marvelous!  Different honey combos jarred up and ready to go. They even had mini jars available so you could take home a variety. I loved that I could taste the options before I purchased. Thank you, Bron's Bee Honey!!\n\nSt. Roger Abbey was there complete with nuns and baked goods. Another win when we ate that chocolate tartlet.\n\nDenny's Acres supplied me with Yukon gold potatoes that I split over two dinners and some gorgeous baby asparagus. They had a nice variety of produce to offer and I wouldn't hesitate to purchase from this local vendor again!\n\nI tried tea from two different vendors. Both were good, but I preferred The Tea House. The gentleman working that booth really knew his stuff and I was sold on the Tea-Vine without even tasting it. I've since tasted it and it's exactly as he described. Nice!\n\nThere were at least two meat vendors, but I was wooed by Farm Fresh Foodstuffs. Yet another knowledgable man in the crowd. He had a lot to say and I ended up a big fan after a few minutes of chatting. I bought two different types of bacon. My girlfriend bought ground beef. And it looks like they may be able to help with a raw diet for a special Princess I know. :-)\n\nHahn's Bakery from Geneva was here. I am already a day of Hahn's, so I was on the hunt for a kitchen sink cookie, but alas they did not bring those for the day. Although, I did hear they were asked by multiple people, so it may make its way into their French Market inventory in the future. You never know... What they did provide were fresh baked pretzel rolls and still warm donuts. No, not warm from the sun...but warm from the onsite fryer. They're making that magic happen on the premises. It was a perfect way to wrap up a delicious morning at the market!",
            "author": "Jennifer S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-08-14",
            "description": "This French Market is everything a French Market should be, so it's very crowded!  Here you'll find fresh crepes, beautiful flowers, fruit and vegetables, handcrafted soaps, jewelry, knick knacks, it has it all.  \n\nThere's 4 aisles of local fare and most of the vendors are friendly, save the jewelry lady who was extra snarky.  My top pic for jewelry here is Adorn512.  Such a delicate and unique but trendy selection. \n\nAbout the crowds though.  I'd recommend either coming early to avoid them and have first pick of the best produce.",
            "author": "Amber S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-07-11",
            "description": "I love spending my Saturday mornings walking around Farmer's Markets. I've been to the Wheaton French Market three times already since moving to Wheaton. \n\nThe vendor offerings are pretty good and I always find myself leaving with at least a few goodies. You can find expect to find macarons, coffee, pastries, bread, olives, pickles, dog treats, jewelry, gluten-free goodies and don't forget about the fruits and veggies. \n\nThe good:\n-You're supporting small business owners and farmers\n-It's a good way to discover new products or items you haven't tried before\n-All your favorite Wheaton businesses are in one convenient location\n-Lots of vendors take both cash and cards! Huge pro\n\nThe meh:\n-No dogs allowed. Although my dogs aren't well behaved enough to visit such an event, I always love meeting other dog owners and seeing the pups around. \n-The space itself is incredibly narrow-- which probably has a lot to do with why no dogs are allowed.\n-Parking is tough unless you get here right when it starts or a little before. You might find yourself driving in circles for parking for awhile. I was here at 745 one morning and had my share of parking spots. \n\nThe bad:\n-No real cons that would keep me from coming\n\nI'll continue coming to The French Market as long as the weather and my work schedule allows. It's a great way to spend a relaxing Saturday morning.",
            "author": "Courtney C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-12-13",
            "description": "My favorite Saturday morning destination!\n Lots of vendors:\nLoose teas, Thai Food, crepes, fresh donuts, gluten-free cookies and scones, fresh vegetables, artison's treasures, jewelry, soaps, local honey, fresh-squeezed lemonade, pies, woven baskets, puzzles, puppets, gorgeous plants and fresh-cut flowers, etc.!\nGet lost in the crowd!",
            "author": "Lauren F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-06-11",
            "description": "This market has a variety of things! From fresh veggies, fresh fruit, fresh crepes, fresh coffee, fresh smiles! Just a lovely place to be on a Saturday morning. Plenty of seating and people are so pleasant.",
            "author": "Glorimar S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2016-09-29",
            "description": "Maybe this market has declined since the previous reviews. It is messy. The vendors are crammed into, too small of an area making it uncomfortable to navigate THEM AND the patrons who feel it necessary to bring strollers or walking dogs.  I LIKE kids and dogs, but the little ones get bags in their faces, trip people up and see only butts and legs (and dogs). Both are safety hazards.\nThere are also too few garbage bins and it is common to see used toothpicks from samples littering the food product tables. This market has 3 notable vendors, cheese; pretzel/bread and knife sharpener. All others are price-gougers and slopping messers!",
            "author": "Brenda M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-08-29",
            "description": "A wonderful and pretty large farmer's market. Great choice of local and seasonal veggies, fruits, cheese, pastries, breads, coffee, tea, crepes, jams, jellies, mustards, jewelry, accessories, etc. There was even a little live music. The only downfall was that there was only 1 booth containing any meat or eggs, and by 10:30am the eggs were sold out.",
            "author": "Kelly B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-10-09",
            "description": "I purposely wear a scarf whenever i come here to get the true FRENCH market experience.  Just kidding.  (No I'm not).  Oh, that, and pretty much dodging all the bees flying around all the vendors with sweets and produce.  \n\nThis is one of the best markets in the Illinois suburbs.  4 rows of local arts and crafts and also baked goods and produce.  Love the fall season especially because of the squashes.  My favorite so far are acorn and butternut.  It's decently priced...you may find it to be cheaper at the grocery but hey, its a french market.  My Saturday mornings have been spent here for the past 2 weeks.  \n\nMy advice: stop by the vendors with the baked goodies.  Best find so far among the bakery vendors was a loaf of Chocolate chip pumpkin bread.  Pair that with a hot mug of apple cider and you're seriously on cloud 9.\n\nOh and yes, they have a crepes station!",
            "author": "Kat D."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-05-29",
            "description": "Wow!  LOVE this French Market!  Plenty of goodies to look at and buy from a variety of vendors:\n-several \"farmer's market\" produce stands overflowing with fresh seasonal fruits & veggies\n\n-several bakeries - both sweet & savory offerings\n\n-homemade canned pickles, dilly beans (pickled green beans, yum!), relishes, sauces & other condiments\n\n-a few folks selling several kinds of CHEESE!  \n\n-Many vendors of handcrafted jewelry, handbags & scarves @ affordable prices\n\n-a couple people selling the most gorgeous (and pricey!) hanging baskets and planters (both BIG and small) of flowers and other greenery\n\n-flowers & greens available by the stem/stalk to make your own bouquet\n\n-Several food, ready to eat, vendors as well including the local Pad Thai restaurant, Jolly Posh, a gourmet popcorn stand (White Cheddar & Rosemary Popcorn?!? OMG, YES!), a grilled cheese shop, and others I can't possibly remember.\n\nThe earlier you get there the better as there is a lot to see but it's all crammed in a very small area - and once those mommies wielding their double-wide ankle destroyers, um, I mean, strollers, get out & about, it's a bit cramped.  I wish it was adjacent to a park so you could take a break from the crowd and sit down to enjoy your lunch, breakfast or snack you will inevitably buy while there.  At least there is parking garage next door so parking is a breeze!",
            "author": "Rose D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-05-22",
            "description": "The local farmer's market is my go to place for my local honey. This farmers market is really great, however, it can be difficult to navigate with the crowds while finding a place to park. For parking and convenience I usually opt for parking in the parking garage just south of the train tracks. While at the market the are two main aisles that have vendors of all kinds. You can find anything from tea, to homemade dog treats, to flowers for your garden, there are even a couple of food truck/vendors. And if you are fortunate to walk the aisles during the month of May, the fragrance from the lilac bushes located between the farmers market and the train tracks waft thought the aisles, it's truly a great experience.",
            "author": "Amanda K."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-09-28",
            "description": "Cool concept, very poor experience though.  As others have stated this market has wonderful variety.  Tons of vendors and many types of goodies to buy.\n\nBut...get ready for my rant...\n\nPeople I have a dog that I adore and we take him lots of place with us but I make sure it's an appropriate place like a park.  Why a bunch of you think it's cute to bring Fido with you to an over crowded outdoor market with very cramped quarters makes no sense to me.  I loved the lady with two dogs trying to navigate the super narrow aisles.  Next, leave the damn stroller at home!!!!  If your precious child cannot walk on their own, than don't come or leave the baby home with dad or mom.  Seriously!  One woman had a double-wide stroller AND a dog and was sipping on  her Starbucks oblivious to the traffic jam she was causing.\n\nSorry Wheaton, other burbs and Chicago neighborhoods have got the Farmers Market thing down.  Yours needs some help.  Hint, move it to an area that is not so crowded.\n\nWe won't be back.",
            "author": "Karma K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-09-29",
            "description": "This was perfect on this cool, fall morning.  There are great stands with a wide variety of items.\n\nThe fresh baked goods are wonderful, a large selection of large and unusually shaped and colored pumpkins, fresh and locally grown fruits and vegetables, fresh flowers, some craft items, honey from a local farm, cheeses, popcorn, canned salsas and pickles, homemade jams and jellies, it goes on.  I have not yet tried the strawberry banana bread, sounds like it will make a great lunch.\n\nStop and take a look around.  It really is one of the better local farmers markets.",
            "author": "LOIS B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-06-03",
            "description": "The Wheaton French Market is a good place to go if you're looking for a variety of food, not all of it French.\n\nI suppose the most French thing about this market is the crepe stand; the crepes there are freshly made and taste fantastic. There's a *lot* of bread as well, and there are some nuns sell both savory and sweet bread. \n\nVegetables and fruit can be hit or miss. If it's out of season in the midwest, expect the fruit you find to be trucked up from Florida. Nothing wrong with that, and the peaches *were* good... but next time I'll wait the extra month.\n\nIt's conveniently located in downtown Wheaton and there's always a bustle of activity, live music, many pounds of frozen blueberries (which we did get one year; they were very good)... in generally, this is what I would expect a farmers' market to be.",
            "author": "Robert G."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-06-28",
            "description": "I would consider myself a farmer's market junkie. Today we missed Naperville's due to yoga so we ventured out to Wheaton which is open till 2pm. Long and short of it: we won't be back. \n\n1: the aisles. Everyone has done a great job punting out they are too narrow. It's horrid! We aren't in Paris! Spread it out a little more. \n\n2: the non-food vendors: while I understand this is a French Market, the numerous vendors peddling various other goods just cramps up the area. We only came for food!\n\n3: the \"grocery\" produce: perhaps my biggest irk. We go to farmers markets to buy local, supporting the local farmers, to eat in the season and get the freshest, whole foods we can. How in the world are tomatoes from Arizona(as it said on the box) fit in that? Some purveyors had so any different varieties of produce that it was obvious that they are not growing them but purchasing them at wholesale and turning a profit on people none the wiser. Talk to the vendors people! I found a certified organic farm from Michigan that was able to fulfill my need for cucumbers, tomatoes and kale but some of you may of bought the same stuff being sold at Mariano's down the street! \n\nA few reviewers said that the food was more expensive than the grocery store. It can be. But we pay more to support the local farmers and sometimes it's a better deal than the chemically enhanced, grown in a lab, cross bred stuff found at the grocery store. You pay a premium to eat good the way it looks grown from a seed with little to no human intervention!!\n\nIn the end we won't come back. There are so many farmers markets now and this one for the reasons above is just not worth the time.",
            "author": "Laura L."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-08-09",
            "description": "Hmmmm... Parking is rough, the crowds are absurd, and I can't say the selection is any more amazing than I can get in Naperville. I'm glad I went but I don't think I'll go back anytime soon.",
            "author": "Alyssa J P."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-07-31",
                "description": "I finally made it to the French Market in Wheaton!!  I really enjoyed spending a couple of hours perusing the stuff for sale.  It was very crowded and there were a ton of vendors.  I'm glad they don't call it a farmer's market, because I feel like there's more other stuff for sale than veggies, but the few veggie vendors had a huge selection of delicious looking stuff.  I knocked off a star because I do think it was fairly overpriced.  For example, I bought some bread for $8.50, which looked delicious, but was a little underwhelming for that price.  All in all, I'd still recommend it as a fun thing to do with lots of treasures to be found!",
                "author": "Kelsey K."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-05-24",
                "description": "Great variety with very good prices for the most part. \n\nMy big knock on it is how closely they have the tents facing each other.  The walking aisle is way too narrow to get through easily.",
                "author": "Brian C."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2015-05-13",
                "description": "Naperville is nice and carries real local farms, a bit limited, good flower market.\n\nDowners Grove market use to require the stalls to state where the produce came from. A real market.  Local Midwest.Good selection,not  so many craft from China.\n\nWheaton market is good but very commercial. Vegetables are sold installs in April that claim to be local. A tomato or corn is not local in April.Many stalls sell crafts from China. Laura L. posted this comment a year ago vegetables from Arizona? Do they buy in bulk in Chicago and sell as a farmer?\n\nPlus have a dog area, not much room for shoppers, strollers and now dogs on leashes. Forget taking your dog to Wheaton small aisles crowded.\n\nGo Early and yes it has become very expensive!!!!",
                "author": "Lwood M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-05-03",
                "description": "I love the French market Downtown Wheaton! I must say not being from here the first time I went a few years ago I didn't know what to expect and boy did I feel silly when I realize a French Market is a what I would call a Farmers Market! \nEverything is fresh and yummy but can be a little costly especially the grapes. You can buy anything from produce to honey to kettle corn to clothes here. Kettle corn has become a must for my kids every time we go and the couple making it is so nice. It's delicious. Also there are homemade chocolate croissant from Suzette's which are amazing, I'm totally in love with it. Trust me and try one!\nThe farmers market gets pretty crowded and I found to be a little stressful navigating a stroller through for me so I try not to bring mine. Also it's street parking but there are parking garages (for free) close by so don't let that discourage you from stopping by!",
                "author": "L F."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2013-09-01",
                "description": "We've been to the French Market a lot this summer. Our favorite time to go is around 12:30 or 1, when things are calming down and the vendors are starting to relax. It's less crowded, with everybody acting less eager and more relaxed. Just our speed.\n\nIced coffee from I Have a Bean is a favorite of ours. There are usually two booths selling flowers, as well as two businesses selling kettle corn (one tent and one truck). I bought a floppy sunhat from the floppy sunhat vendor, only to have the brim fall apart a few weeks later. When I brought it back to them, they were really nice about exchanging the ruined one for a new one (the new one has held up fine, so I think the first one was a fluke).\n\nWe really enjoyed Annalee, the singer/guitarist who performed here often earlier in the summer. Her music added to the vibe of the market. As far as upkeep, we've noticed the trash cans overflowing a few times, as well as the connection to the fire hydrant leaking. It would be nice if they stayed on top of that (\"they\" haha...I don't really know who \"they\" is in this case, but hopefully \"they\" see what I'm saying).",
                "author": "Sam P."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-10-24",
                "description": "This is definitely not your ordinary \"Farmers Market\" Sure there's a great selection of fresh produce, beautiful flowers and tasty baked goods, but we can't overlook all the hand crafted and specialty products offered every week by local vendors. We find ourselves picking up the fresh breads, cheeses, hand crafted jewelry (love the Karma Cords and Chicatolia products). In fact, we discovered a cleaning product for our granite (Supreme Surface) that we absolutely love... This market is the bomb!!! However, if it were my market I would call it something other than \"French\" because to me it's all American at its finest!!",
                "author": "Will D."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2015-04-04",
                "description": "Winter market was a bit depressing, and I'd like to go back to the summer market to give it another try with better hopes. However, mid-January, there were no good produce pickings, and only limited vendors. After driving to see what the legendary French Market had to offer, I was disappointed to only see five booths in a cramped station space.  Again, I'd like to give the summer market a try; but a disappointing initial exposure.",
                "author": "C C."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2010-08-23",
                "description": "My sis-in-law and I go to the french market in Wheaton every time we get a chance. It's a nice little french market but I'm not super impressed with it. \n\nThey do have a good variety of different booths; produce, leather goods, jewelry, crafts, flowers, bread, kitchen gadgets, olives, etc. Since it's so small there isn't much selection though. Also, since it's small it's crowded and hard to navigate. A double stroller took up the entire aisle just as we were leaving on Saturday. \n\nThe free parking in the nearby parking garage is definitely a plus.  It's just a short walk to and from the market.  \n\nIt's ok, but not great. I'd be happier if it was bigger or just a bit more spread out.",
                "author": "Kate M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-07-02",
                "description": "Such a great way to spend a Saturday morning! Nestled in downtown Wheaton right by the metra tracks, so you don't even have to drive. Great ambiance with live music, local food vendors, a huge variety of fresh produce and flowers and a mixture of specialty booths. Lots of different craft booths, jewelry, different kinds of sauces, marinades, balsamic vinegars and olive oils, items for your pet and cheese stands. \n\nLove it!",
                "author": "Aimee N."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-07-30",
                "description": "Have lived here my whole life. Always a good time to wake up and run to the fresh market :)",
                "author": "Thea A."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-07-08",
                "description": "While there is nothing remotely French about it, this is a really neat market. My mom has been coming here for years, but this past weekend was my first experience. We bought some fantastic bread, some great produce (both fruits and veggies), and pastries that were divine. There were also jewelry stalls, soap stalls, even dog treat stalls. And food vendors ranging from crepes to Pad Thai. It's a great place to spend an hour or more. \n\nI do echo the frustration of those who mention how TIGHT the place is, especially with strollers (but even without). There seems to be room to expand a bit, making the aisles slightly wider...why isn't this done? It makes the experience a bit unpleasant.",
                "author": "Zach G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-08-01",
                "description": "Thought going early between 8-9am would beat the crowds....wrong!  Tons of people, and yes crowded aisles.  Although its a common complaint,  I think it creates an energetic vibe that oftentimes doesn't exist in the suburbs...so I actually didn't mind it so much.\n\nLots of tasty treats to eat...so try not to come on an empty stomach!",
                "author": "Genna B."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2012-09-15",
                "description": "I've wanted to check out this market for awhile....finally had that opportunity today since I was in Wheaton (came from a meeting in another suburb).\n\nThere seem to be a good number of vendors in there but they seemed jammed in (its 2 rows about a block long).  It can be hard to walk around this market if there are a lot of people standing around and strollers.  There also seems to be a wide variety of vendors from bakers (a nun selling her baked goods along with some other bakery type vendors) to farmers with their vegetables to other knick knack kinds of items.  \n\nIt is something worth checking out, but only if you are going to be in the area for one reason or another as it seems there are other similar kinds of markets in the area.",
                "author": "Mike P."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-05-22",
                "description": "My wife and I had a fun time checking out the farmer's market or French market :) It was nice to get out of the house and check out the fresh food and flowers. It was also nice to explore the sights and smells of the market.\n\nThere was a variety of things to examine. We tried some apple doughnuts and cinnamon covered almonds. We tried samples of juice and slices of bread! And oh the flowers, lots and lots of flower! In the end we bought some local honey, a baguette, some of those honey sticks (multiple flavors) and a bottle of juice.\n\nWe can't wait to go back, when there are more fresh fruits and veggies!!",
                "author": "Erik T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-04-29",
                "description": "The place isn't big, and we were hoping for more organic produce, but it was still a fun place to spend an hour with hubby & 2yrs old. Will def. be back!!",
                "author": "yoku s."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-08-27",
                "description": "This was a wonderful Farmer's Market to visit.  My in-laws have been frequenting this market at least twice a month, but I went there for the first time last weekend. It was great.\n\nThere were about 3 long rows of vendors with their goods. I couldn't believe the variety of items that were being sold: produce, pastries, breads, jewelry, purses, dog treats, cheeses, jams, honey, pickled beets, flowers, shrubs, popcorn, crepes, coffee, roasted nuts, wine, and the list goes on and on.\n\nWe ended up with quite a haul: sweet corn (the best I've had), mix for a dip (just add cream cheese), artisan bread, and some yummy garlic and dill cheese curds. We even ate breakfast there - a crepe! mine was lemon curd and blueberry and was delicious.\n\nWe had no trouble parking at all - there was street parking, a garage, and a parking lot to use.  We brought our dog, who was allowed outside of the rows of goods, but not inside. It was pretty packed at 10am on a Saturday, which I expect is fairly typical.\n\nMy one gripe: the rows are too close together. It was a hot day made hotter with many people in a small space. There were times when I couldn't even get by someone in the aisle. Just a little more space in between, please.\n\nOverall, I really enjoyed the morning. People and vendors are super friendly, and there are samples galore.",
                "author": "Christina G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-04-30",
                "description": "Although this market may be tiny, it is full of produce, homemade goodies and more! Will definitely be going back many times this summer!",
                "author": "Morgan C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-06-21",
                "description": "Most likely the BEST market in the suburbs and probably in comparison to many of Chicago's neighborhood weekend markets.  They have everything and anything you can think of, here's what to not miss out on:\n\n\n-Yummy pretzel bread from Hahn's Bakery pretzel bread pastries\n-Kettle corn from the older guy at the far corner\n-Michigan grown strawberries, asparagus and cherries\n-Nuns with Mustaches who sell absolutely delicious fruit tarts\n-Fresh honey (if you got seasonal allergies, here's your cure!  See my Pilsen Farmer's Market review: http://www.yelp.com/biz/pilsen-farmers-market-chicago#hrid:XwilyY9RHxnOFCK_kdKsnQ)\n-Colorful blooming flowers\n-Suzette's crepes\n-Resale books galore\n-Thai food made right in front of you (hint: spring rolls and coconut shrimp)\n-International olives\n-Only some of the best cooking ware, Pampered Chef\n-Artistic night lights (if you're scared of the dark like me)\n-Knife sharpening (sometimes can be hard to find)\n-Cheeses up the wazoo\n-And there's more...\n\nOf course you find it hidden in yuppy, Bible-thumping Wheaton, but well worth a weekend trip.  8 a.m. to 2 p.m. each Spring Saturday through November 1st.",
                "author": "Richie D."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2013-11-16",
                "description": "I rarely go to this market anymore. the produce is ok, but the experience just goes right down the toilet with the cramped aisles. people....don't stop and stand in the middle of the aisle, so that no one can get around you. the aisles need to be waaaaaaay wider. it's the most frustrating farmers market I've ever attended.",
                "author": "Lisa S."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2012-07-25",
                "description": "Cute little market, with some kick ass finds! Can't say they had an over abundance of fruits and veggies, although, the booths set up had some delicious treats - me and peaches normally don't get along, but the peaches I purchased from a small farmer were absolutely devine! Made some pancakes out of those beauties ;)\nGrabbed a bouquet of flowers and some Pad Thai for lunch at a small local business who had a booth setup. People around the fair were very friendly and I found myself enjoying conversations with a few people I met while eating. \nOverall, it's a good way to spend a morning, I've been to bigger markets, and was done with this in about an hour - not including lunch or listening to an acoustic band for a few minutes. Worth a check out!",
                "author": "Jean K."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-10-06",
                "description": "This is an awesome farmer's market. Lots of veggies and fruits. Lots of unique stands, too. Plenty of dessert to go around as well.\n\nTHere is a great variety of 'things.' I would rate it a 5, but I need to be objective, and this is the only farmer's market I've been to.",
                "author": "Joe E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-07-26",
                "description": "We've been going to the French Market in Wheaton for years now, however this year it seems like EVERYONE has found the market and decides to go at 9am! If you're looking for a leisurely experience, walking through the stalls, I'd go as early as possible! This year I was a little disappointed because our favorite butcher did not come at all! I'm not sure if it's because of the increase in price of meats in general, but they were one of the main reasons we came. The produce, however, can't be beat here. It's a little more pricy than going to Jewel or Dominicks, but it's much fresher and lasts longer, so it's worth it to me!",
                "author": "Melissa C."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2011-09-10",
                "description": "Decent fall veggie selection - tomatoes, squashes of numerous varieties. Various flower stands, probably greater variety of flowers than Naperville's Saturday farmer's market, didn't pick any flowers up in Wheaton to compare scent/freshness/longevity. Variety of baked goods. A little on the pricey side; a bit pricier than Naperville's, it felt, for most of the produce.\n\nThe tight aisles are a pretty big annoyance, especially when people with strollers get involved, as others have noted. As this market is much closer than Naperville's, might alternate between this and Naperville market remainder of this season, next season.\n\nDrove through/past this for many weeks, thinking Wheaton's \"farmer's market\" was on Thursdays only. Thought this was some kind of street fair with people milling about and the tightly-packed white-awning'd stands. What makes this a \"French\" market? Seems like any other farmer's market to me. Is \"French market\" a Chicagoland or Midwestern thing? I'm a transplant from upstate NY ...\n\nWe noticed the Thai food stand while walking back to the car, loaded down with veggies. We unloaded at the car and came back for the Thai. Great pad thai tofu, could use more sprouts; pretty decent peanut sauce. Mango salsa has little to no heat. Chicken-on-a-stick (chicken bangkok?) was ok but nothing special; a bit dry.",
                "author": "Andrew B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-04-20",
                "description": "I've been going to the Wheaton French Market for years. I love the atmosphere...the live music, fresh flowers, delicious pastries and unique specialty items.  In fact,  yesterday I bought the best granite cleaner from a local merchant called Supreme Surface Granite Cleaner and Conditioner. I can't wait until next Saturday!",
                "author": "J K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-04-24",
                "description": "\"I'd bathe in this olive oil\"\n\"No, no!  Get the HOT giardinera!\"\n\"Oh my god, FEEL this bread.\"\n\"Wait...wait...CHOCOLATE cheese?!\"\n - \"Oh yeah.  Cut it up and put it out and no one will know it's cheese, they think it's fudge\"\n\nThis is the first farmer's market to open in the burbs and I couldn't be happier!!!  It was rainy and the first day of the market so I know there weren't as many vendors as usual especially when it gets further into the season but what a great atmosphere. \n\nWe went to just check it out and ended up spending all our cash.   There's a MUCH closer farmer's market but this one is always the first to open in April (out of all the burbs) and it's just a great time.  I can't wait until it blows up in a couple weeks - I'm all over the cheese so watch out people!",
                "author": "Erin D."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-07-14",
                "description": "Bushels of fresh produce, plentiful fresh flower bouquets, homemade apple donuts and pastries...all things that I expect and enjoy at a farmers' market.  Pampered chef booths and tables selling Silly Bandz...not so much.  Though I skipped over the tables selling scarves and, um...roombas (?), I was delighted over the ripe peaches and cheap zucchini that I walked away with.  And a giant basil plant for a mere $5...score!  \n\nNext weekend, we'll be sure to get here early.  I thought that by strolling in around 10, we'd beat the crowds (market goes from 8-2).  Ha!  We could barely move down one of the aisles.  It was PACKED.  But a small price to pay for ripe, organic, local produce.",
                "author": "Tracy V."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-06-06",
                "description": "I can't compare to other farmers markets, but I've been going to this one for years.  Flowers & plants, seasonal (and mostly local/regional) fruits & vegetables, arts & crafts, meats & cheeses, prepared foods.  They recently added a donut stand that makes them on site.  Don't leave the market without one (or 2)!  Yum-o!\nIt's likely more expensive than most area grocery stores, but it is a fun place to browse, and can make you feel good to feel like you are supporting your local businesses & farmers (even if its not really).\nIt certainly can be crowded, so go extra early, and leave the strollers at home (though I've been guilty of bringing one).",
                "author": "William B."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2012-08-11",
                "description": "I find this market to be the most infuriating.  Lots of great stuff - produce, bread, meat, crafts, you name it.  But why does it have to be crammed in such a tiny space?  Holy cats!  It's almost impossible to move.  I'd be a fan of not allowing strollers or widening the aisles or something to keep people moving along.  It's just really hard to shop when packed in that tight.  Makes me cranky because there were things I wanted but couldn't get close enough to them to actually make a purchase.",
                "author": "Jessica G."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-08-24",
                "description": "Four stars because of the crowd.. Other than that it was great ! All the choices .. Organic vegetables , organic bread .. Flowers , croissants with chocolate !! Yummy! Also the cannolis  were awesome .. Bought some carnations .. Very pretty ..",
                "author": "Christin N."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-10-06",
                "description": "The French Market in Wheaton seems to me to get better each year.  I am fortunate to live close enough to walk there and do so just about every weekend.  During the summer it can be crowded and hard to move around as people stop to look at merchandise and chat with the storekeepers, so if you're the impatient type you may find it frustrating.  But if you go equipped with patience and the right attitude, I think you'll find it fun and well worthwhile.  Tip: arrive early in the morning, before it gets too packed.  \n\nYou can find everything from handmade jewelry, clothing and home decor to all kinds of edibles including flavored olive oils, to produce and baked goods to fresh milk, eggs, delicious handmade granola and more.  Not to mention most amazing flowers, so fresh they last so much longer than those I've purchased elsewhere.  The local \"I've Got a Bean\" coffee producers have a stand and you can see many people sipping a cup of their brew as they stroll.  I am a big fan of Hahn's Bakery that has a great stand here each week--wonderful breads and pastries.  \n\nNow that the season has changed from summer to fall, the crowds have thinned out a bit and it's easier to get around.  This is the time to get wonderful apples.  I particularly like the Honey Crisp apples from a Michigan grower--crisp, tart and much more flavorful and less expensive than the grocery store variety.  Also, huge pots of mums in every hue, reasonably priced, to decorate your doorstep. \n\nThe French Market is open until early November.  How I miss it when it closes but its re-opening each year is one of my favorite signs of spring!",
                "author": "kerry c."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2012-10-27",
                "description": "I like this farmer's market, but I think it's a bit of a stretch to call it a \"French Market.\" It is a smaller market, and that's fine but I come to a farmer's market for fresh, local produce, flowers, baked items, and maybe some unique, hand-made crafts. Instead, I find this market to be a little thin on produce and heavier on snack items and things to win over all the kids in strollers.\n\nAt this market, there's not much variety of produce and many of the stalls are for random \"craft\" or \"specialty items\" (e.g. Pampered Chef, imported scarves, children's tutus??). And, what really made me suspicious was the one time I went and a vendor had tangerines! Tangerines? At a Midwest farmer's market?? Plus, it's pricier here than the markets in downtown Chicago, which does not make sense to me.\n\nBut, it's not all bad--there are definitely some gems out there, like the doughnut stand, Lynfred Winery, and I like that grass-fed beef is available. There are several baked goods stands that look awesome. Wheaton has a nice atmosphere (despite the high school kids wandering around giggling and the strollers that can block the small aisles) and I love all the unique food shops. It's just that I would expect more from their \"French Market.\" No tangerines, please!",
                "author": "Okko O."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-07-11",
                "description": "A fabulous summer tradition, with a great variety of fruits, veggies, meat, cheese, baked goods, flowers and so much more.\n\nWe've gotten everything from cherries and blueberries to fresh-baked foccacia, and there's always so much I want (the husband has to put a kibosh on the spending:)).\n\nIt IS a bit crowded, but prices are reasonable, there's a lot of selection, and everyone was friendly and eager to answer questions and offer samples. Fantastic.",
                "author": "Renita M."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2014-06-14",
                "description": "I'm torn on whether or not to give the Wheaton French Market three or four stars. Everyone was complaining about the narrow aisles, and yes, they are, but I think it creates more an environment that you are at a farmer's market and it keeps the pace busy. I loved that there was already wine sampling at 8:30AM, a paella/crepes stand, lemonade stand, and a musician. For ambiance and environment, I give it a four, however for the food that was provided I give it a three. There were not as many organically certified produce as I would have liked. The options are limited as well, I could not find all of my leafy green vegetables. Some stands had reasonable prices and I did buy some produce there but there were other stands that were outrageously expensive! A small bag of spinach that was not even filled up all the way was seven dollars! I was under the impression that this place was going to be cheaper than Whole Foods, but not even close, in fact, they were more expensive! I did appreciate the beautiful flower stands, and found a little polish bakery stand where I bought my boyfriend kolaskis that reminded him of his grandmother's. I will return but it will be once in a while, definitely not a weekly or bi-weekly event.",
                "author": "Kristen H."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-04-28",
                "description": "The Wheaton French Market opened today and we were there!  We love the rows of flowers, specialty foods and other goodies nestled under covered tents.  We tasted cheeses, buffalo steaks, favored oils and sauces, purchased bits here and there, then decided to buy a dozen beautiful roses for $15.  \n\nThere are food huts, including a thai place and a hot dog stand for the kids. Today a vendor was serving fresh strawberry crepes.  Most people wander around with gigantic scones in their hands from Suzette's Creperie or cookies from one of he other bakeries that peddle their goodies.   (Try a kitchen sink cookie...yowsa!)  Don't get your coffee before you go as you won't have an empty hand to fondle things on tables.  Take a hip basket from which to dangle your newly purcased flowers, so others can ask where you bought them. \n\nWhy 4 1/2 stars then?  It's become a victim of it's own success.  The market gets very crowded and can be a pain to get through.  The stroller crowd arrives about 10a and that jams up the place fast.   The market runs this year from April 29th through October 28th.  Get there early...it's open from 8 a.m. to 2 p.m., but most of the vendors are packed up and loaded by 2.  Dogs are no longer allowed in the market area, but you and Fifi can sit on a bench and share a snack.\n\nMany of the other local suburbs have tried to copy our French Market but none have captured it as well as Wheaton.  But please, Wheaton, please...dplacez-vous  un plus grand endroit, s'il vous plat!  Or in layman's terms, please move your ass to a larger location.  It's getting crowded down here!  It may have been all those scones...",
                "author": "Robyn C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-02-21",
                "description": "Awesome, great veggies and bread selections, as well as AWESOME CHEAP COFFEE!",
                "author": "Pat E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-10-06",
                "description": "I'm not sure what makes it \"French\" (or not) but this is one of our favorite Saturday morning things to do.  There's a little something for everyone here.  Each week there seems to be something a little different.  Check out the guy selling the plants (plants are top quality, reasonably priced & always do well in my yard), Hansen's Bakery (crumb cake is delicious) & the necklaces/bracelets are Seize the Bead though pricey are great quality & creative.  A few complaints: for such an interesting little market to explore, the set up absolutely stinks.  The rows are too narrow, too crowded & dare you bring a stroller you will run over feet (plus get the stink eye - many times, understandably, because you're running over feet - sorry!).  The fact that they allow dogs in the market is also a disappointment.  It would be so much more inviting & enjoyable if they would move it to a more spacious area.  Wheaton has some beautiful parks within walking distance of this site - why not there?  If you attend closer to the afternoon, the crowds are much thinner.",
                "author": "L F."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-02-06",
                "description": "I love this place! I walk in with my friend, and we buy lots of fresh corn as she praises the low prices. All the vendors are very friendly, and love what they do. We stop to get bread, and are kindly explained how the bread is made and what is in it. As we pass by I wave to my friends, and stare at the pretzel bread hungrily. We look at pretty scarves and fancy jewelry, then stop at a grass fed meat stand. You can order a burger, or just purchase meat to cook at home. I am hungry, so i ask if we can stop at the (Korean?) food station. i orders me pot sticker and coconut shrimp, and it is wonderful. As we eat i stare at a stand with beautiful recycled shirts. On the way out we order a Hawaiian lemonade, and it is my favorite thing on earth. We carry the produce to the car, along with some Wisconsin cheese curds and some muffalata. Every thing is so delicious.",
                "author": "Mary Rose T."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-08-12",
                "description": "Since I had nothing else to compare it to I had to give Wheaton's French Market 4 stars instead of 5 - that's the only reason why.\n\nI can't say enough about this market . . Great selection, good, fresh food.  From what people have said, I was suppose to have a hard time finding parking, but I didn't - maybe I just got lucky!  \n\nAll in all, I highly recommend you check out Wheaton's French Market.",
                "author": "Tracey M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-06-16",
                "description": "I rolled out to the suburbs to meet a friend and hit the Wheaton French Market - it was great.  As much of a farmer's market fan that I am, the French Market had many of the elements of the farmers market - tomatoes, green onions, broccoli, nectarines and asparagus - damn you late growing season!\n\nBut it also has all these wonderful things that farmers markets don't - works of art, clothes, jewelery, the BEST SCONES IN THE WORLD, tons of bread, fresh cheese, organic meat, fresh lemonade, Thai food, flowers that last forever - sigh and yum.\n\nIt's kind of like a hodge-podge of just lots of stuff.  And although I love dogs and own one, I like that dogs are not allowed - there are enough people and strollers to trip over.\nI can't wait to go back  - I need more scones.",
                "author": "Julie A."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-07-20",
                "description": "I love  Farmers Markets and go to many different ones. The Wheaton one is very good. EXCEPT for the very tight aisles. I suppose it makes you shop slower? It just makes me come early, or turn around and go to another one nearby. There are times I am trapped and can't get out, or am not able to get to a vendor. The quality is good, I love the baked goods, crepes, veggies and plants too.",
                "author": "Rita G."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2011-06-05",
                "description": "Like the market. A lot to choose from. Just do not like the aisle room especially when people have strollers.",
                "author": "Juanita Z."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-04-02",
                "description": "The French market in Wheaton is my favorite way to spend a Saturday or Sunday morning. A nice hot coffee and sifting through all the lovely and fresh vendors. I LOVE the wonderful and bright flowers! I have never seen tulips so big! Probably the best place to buy flowers.",
                "author": "Mrs. B."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2011-08-13",
                "description": "The market itself is good...however people should leave their strollers and animals (unless an assistance animal) at home. I am going to stop going today my foot was run over by a mom with a double stroller. Give me a break!!! I am stick of people who think that because they have a stroller they can take up all the space, it is crowded as it is. I have two children and would never consider taking a stroller. It is a Farmers Market not Gymboree.",
                "author": "Heather D."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2010-07-07",
                "description": "Maybe we came too early in the season.. we showed up at the beginning of June.  What a disappointment!  Compared to the Arlington Heights and Mt Prospect farmers' markets... this is just ridiculous.  Half the stalls were for MLM products.. e.g. Pampered Chef.. there were maybe 2 stalls that actually had produce and all of it was overly priced for the quality of the merchandise.  I highly doubt I'll be back.. seems worth the drive to go somewhere where they actually have several stalls of produce!",
                "author": "Natasha O."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-10-03",
                "description": "We try to go every week and we usually find something new every time. It can get crowded at peak times since the aisles are rather narrow. We recommend going through the whole thing once before buying anything since you can easily blow your budget after a few booths.",
                "author": "Michael R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-09-26",
                "description": "I love the French Market. It's full of vendors hawking fresh veges, bakery items, arts and crafts, botanical things...It's really wonderful and my only complaint is it's way too crowded. I don't see why they can't space the stalls just a couple feet further apart so I don't have to put up with elbows in my back and strollers nipping at my ankles.",
                "author": "Diane H."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Midwest French Markets",
    "address": {
        "addressLocality": "Wheaton",
        "addressRegion": "IL",
        "streetAddress": "Main & Liberty Dr\nDowntown Wheaton",
        "postalCode": "60187",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/sD3-mtc2v-bjcwJpbS2OXw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13125750286"
}