{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-14",
            "description": "The Saturday FM on the square is the Grande Poobah of FMs, but it's an event. And after a long work week, I'm not always up for an event to include finding a parking spot and dodging crowds. The Monona FM is my wish come true, offering everything from my favorite cheese - shout out to Farmer John! - to bakery and coffee, fresh fruit, veggies and herbs, seasonal flowers, dog treats, popcorn, even some fresh meats and canned goods. If I'm in a hurry I'm in and out in 15 minutes or less, or if I want to stroll and enjoy the music and take in the joy of the market, there's plenty to see. It's conveniently located in Ahuska Park on the south side of Broadway between Menards and Pick n Save. Go visit Farmer John, but I won't tell you which of his cheeses is my favorite because he sells out of it often enough the way it is! Gotta keep some things to myself! ;) He has plenty of samples so you can taste for yourself which ones you like best.",
            "author": "K S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-12-28",
            "description": "One of the smallest farmers' markets in Madison, but also one of the friendliest. They have live music every week and picnic tables where you can snack, enjoy the music, and soak up some sun on an easy Sunday morning. Of course they have fruits, veggies, popcorn, interesting looking mushrooms, jellys and jams, salsas, and flowers, but Farmer Johns' Cheeses, Stalzy's Deli baked goods, and Stella's famous cheese bread is represented here too. You can even score some rare items like ghost and fatali peppers toward the end of the summer. \n\nThey even have a Hmong family that have a stall that pumps out egg rolls, stuffed chicken wings, bubble tea, and chicken for there or to go. Feel free to hang out and make the rounds, talk to the farmers, have a bite, and listen to a few tunes. If you are pressed for time before football starts on a Sunday, simply park in Ahuska Park, grab what you need, and be out in less than 5 minutes. Enjoy and support local businesses and families.",
            "author": "Abram H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-07-22",
            "description": "Lots of good markets in Madison, but Monona is good choice if you want to get in and out quickly.  Small, relative to other markets, but they've also got some a vendors including Java Cat (gelato) and Café Social (brewed coffee and beans)",
            "author": "Tanya C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-03-26",
            "description": "This is my favorite farmer's market in the Madison area. It's big enough to have just about everything you'd want to buy, but small enough that you can actually get some shopping done without fighting the crowds. Lots of veggies, some meat and cheese and fruit, other interesting things. I love the gentleman who sells seedlings (all through the summer! which is a godsend for a brown thumb like me who accidentally kills off her plants on a regular basis) and the family that sells scratch-and-dent tomatoes by the large box for a reasonable price. Plus Stella's and Farmer John are there! (It wouldn't be a farmer's market without Stella's and Farmer John!) You'll see me there just about every Sunday during the season.",
            "author": "Elizabeth R."
        }
    ],
    "priceRange": "$",
    "name": "Monona Farmer’s Market",
    "address": {
        "addressLocality": "Monona",
        "addressRegion": "WI",
        "streetAddress": "600 E Broadway Ahuska Park",
        "postalCode": "53716",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/uxV0oaPcfl0nE1NX7o157g/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}