{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-20",
            "description": "Ever since this market opened a few years ago, my parents and I have been active supporters and shoppers. We try to come every Sunday, and we cherish the relationships we have built with the vendors in the Edgewood parking lot. \n\nEven though this farmers market is smaller than the one at the capital, it contains everything I would need for produce. They have everything from produce, eggs, flowers, bread from Madison sourdough, and honey. \n\nI also have a fondness for the connivence of this location. I like the fact my family and I can walk here every morning after we have breakfast.",
            "author": "Lucy M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-06-07",
            "description": "Fairly small farmers market but most neighborhood farmers markets are like this. It's nice to get your staple veggies. Also a honey stand and meat and egg stand. Madison Sourdough also comes to this one so you can get a pastry while you browse. There is also usually a food truck and a Mexican restaurant set up, El Sabor de Pueblo I believe. They have tacos, tamales, and quesadillas. \n\nWe like to come here Sunday mornings on our way to the zoo. It's in the parking lot of Edgewood high school.",
            "author": "Ali E."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-08-10",
            "description": "Excellent neighborhood farmers market. If you are looking for something like the one on the square, don't bother. That doesn't mean it's less desirable, just very different. Nestled in the Edgewood HS parking lot on Monroe Street, there is easy parking at the other end of the lot. This is a smaller version of what I typically think of when it comes to farmer's markets. Big focus on veggies. Most stands are selling veggies but there was also honey, cheese, meats, eggs and some pastries. Oh yeah, and some of the BEST tortillas I've had in this area. The tortilla guy was a one man show who will proudly tell you they are all handmade with organic, non-GMO corn. The smell through the packaging was divine. I picked up a pack and wish I had gotten two. There was a food truck at the end as well as live music. If you didn't stop to chat with the very willing to chat sellers, you'd probably be able to breeze through it in about five minutes. But, go, stop, smell, chat, linger. Odds are you'll find something delicious.",
            "author": "Beth W."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2016-07-06",
            "description": "A relative newcomer to the Madison scene, this market is still fairly small and the selection is limited.  I was happy to see Creme de la Coulee there-an artisan cheesemaker that puts out some great cheese.  I don't know if I would drive across town to visit but if you are in the neighborhood, I would recommend checking it out.",
            "author": "Bobb S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-08",
            "description": "First Sunday for the Market (June 7, 2015) and the neighbors turned out in droves. Madison Sourdough was there (mostly sold everything they brought by 10 am) and Underground Butcher too. About 8 farmers brought in beautiful asparagus and radishes and greens. There were farms that sold native plants also.\nI love that this market is open in my 'hood. Sundays 9 am to 1 pm.\nWe'll be back to update this review as this new market gets going with more vendors and gets ever more popular.",
            "author": "Scrantz L."
        }
    ],
    "priceRange": "$",
    "name": "Monroe Street Farmer’s Market",
    "address": {
        "addressLocality": "Madison",
        "addressRegion": "WI",
        "streetAddress": "2219 Monroe St",
        "postalCode": null,
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+17342419570"
}