{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 2.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-06-17",
            "description": "Fun market, lots of plants, veggies, fruit and flowers. I especially loved that 4 Elements Bath products was there with their eco-friendly luxury spa goods. Jester Juice is there with his hydraulic pressed lemonade. Jilly Cakes is there with her amazing cakes as well. Free parking and easily accessible.",
            "author": "Charise C."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-06-21",
            "description": "Does ANYONE tell the truth at any time any more, ever?\n\nDefinition of Farmer's Market; a food market at which local farmers sell fruit and vegetables and often meat, cheese, and bakery products directly to consumers.\n\nHow stupid of me to think that this applied to the Mundelein Farmer's Market. Of the 30 or so vendors, only two had what appeared to be locally grown products, and, BTW, house plants don't count as produce.\n\nA Farmer's Market is NOT a goshdarn flea market.\n\nI guess I was fooled again. Maybe the trustees will care. NOT! As long as the fee is paid, I don't expect the mayor or five of the six trustees to care.",
            "author": "Sludge R."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-06-22",
            "description": "Very disappointed!  \n\nDon't waste your time!  There was only ONE booth selling fruits and vegetables which were highly priced for not even being organic.  It took a total of five minutes to browse the whole market.  \n\nIt seems like the north suburbs are severely lacking in any kind of decent Farmer's Market.  That's really too bad.",
            "author": "Brenda M."
        }
    ],
    "priceRange": "$$$",
    "name": "Mundelein Farmers Market",
    "address": {
        "addressLocality": "Mundelein",
        "addressRegion": "IL",
        "streetAddress": "SW Corner Of Park St And Seymour Ave",
        "postalCode": "60060",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Z8Y76kHNeSx_CJ2NboLxsQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18479709235"
}