{
    "aggregateRating": {
        "reviewCount": 6,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-10-14",
            "description": "The best farmer's Market around!\n\nLets just put it this way...I live in Andersonville. and I drive allllll the way to this one.  Why you ask?  Because they have everything.  Great selection, friendly people, the cheese people, meats, amazing pastries, beautiful flowers.\n\nSeriously, this is a great market....so much to choose from!",
            "author": "Jenny S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-08-11",
            "description": "They have relocated to Winnetka due to construction and now it's even more limited than before.  Nice people and good produce, just smaller with less variety than previously.",
            "author": "Ali C."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-05-10",
            "description": "I know this market is just about to open so my review is about the market during the 2017 season.\nI had to write this having read reviews about how people come from all over to come to this market. No two ways about it, this is the most sorry excuse for a farmer's market. Wilmette French Market is no better. Nothing fresh. All pretty bad. You are better off at Whole Foods. Seriously.",
            "author": "Kim H."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-06-25",
            "description": "This market is a quick one to navigate - must do's - falafel tent, and the cheese guys. \nLots of parking available. Most of the vendors are local shops that represent, but there are a few non-shop vendors to be had. \nLatest find - the hippy wheat girls from wisconsin - reasonably priced goods - will let you know how that turns out.",
            "author": "michael w."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-06-14",
            "description": "Went here to check out if things are cheaper here versus a supermarket. By the time I arrived around 11:30am, I think most of the kind of stands I was looking for were gone. I was looking for produce and meats. There were 2 left that were selling strawberries, asparagus, and meats. It was such a hot day, almost 90 degrees outside, I didn't see how the strawberries and asparagus were ok in that weather? The meats were in the trailer kept frozen. But anyway I ended up just getting breakfast sausage for 7.99 which is pretty pricey. The other meats were like if you bought food from Whole Foods or organic aisles in terms of price. I do not shop at those places often due to price.\n\nI will come back earlier next time and see what the other stands have.\n\nMy 2 year old son had fun because he could run around in open grassland.\n\nParking is actual asphalt since they probably use New Trier high school's parking lot? I thought I may have to park on grass or something originally but nope.",
            "author": "Amy L."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2006-08-21",
            "description": "I went very early in the summer and at the time was not all that impressed.  This is definitely open to be re-reviewed.  At the time they had no produce.  What farmers market doesn't have produce.  Canned goods selling BBQ Sauce and Marinara were there, Pizzas made to order, fresh flowers, popcorn and mushrooms.  I would like to go back to give it a second chance. I can't imagine a farmers market not having fresh produce. \r\n\r\nI wanted to leave in what I wrote earlier.  I returned to the Northfield Farmer's market Labor Day weekend and it was a big improvement.  Earlier in the summer, they only had about six or seven booths and none had produce.  Upon further review we have a reversal. One of the stands was about the size of three and had a great selection.  veggies, fruit (including melons), hot peppers, and even homegrown popcorn.  Definitely an upgrade over earlier in the summer. \r\n\r\nDate:\r\n Every Saturday rain or shine\r\n \r\nMonths:\r\n June 3 through October 28, 2006",
            "author": "Alan R."
        }
    ],
    "priceRange": "$$",
    "name": "Northfield Farmers Market",
    "address": {
        "addressLocality": "Northfield",
        "addressRegion": "MN",
        "streetAddress": "419 8th St W",
        "postalCode": "55057",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/2b_BFuCrbQDo-9fLXqIGTw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18474411848"
}