{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2010-07-10",
            "description": "So I decided to wake up early and try something different in north St. Louis city.  It was 17 miles away but I figured the Crown Candy Kitchen neighborhood is up and coming and I wanted to see for myself the Farmer's Market that has emerged there.\n\nThe market runs every Saturday June 5th through October 16th, from 9am to 12pm.\n\nThe offerings are anemic compared to mega farmer's markets elsewhere but the movement is very grass roots.  Gotta hand it to these guys for setting this up.  In 5 years, I think this will be a much more robust market.  Interesting, is its also an avenue for their 13th street community garden that started 2 years ago.  You buy from them, and in essence you support literally the community around them.  This market is still in its infancy stage.\n\nI heard they have cooking demonstrations.  I also saw   organic home made detergent.  There are local farmers supported here too.  The vegetables can be ordered by \"box\" with an assortment packaged and ready to go.  They include examples and recipes how to prepare the vegetables to offer enlightenment.\n\nThe Crown Square main street was a pedestrian walkway formerly closed off roads in the back.  It has just been repaved.  When it reopens after 20+ years of being closed off, my guess is the traffic will help rejuvenate this area of St. Louis city over time and the Farmer's Market will grow with it.  But anyhow, check out the North City Farmer's Market when you have a chance.  It's off the beaten track and a good excuse to head out there.\n\nI stopped here first then went for Chicken & Waffles at Goody Goody diner on way home since it was so early in the morning.\n\nFYI:  Crown Candy Kitchen doesn't open until 1030am on Saturday if you are looking for breakfast.",
            "author": "Jimmy R."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2011-06-26",
            "description": "I really wanted to like this Farmer's Market. Unfortunately, there were just a handful of vendors selling fresh fruit, and they all just a few options. \n\nOne of the vendors told me that they had a CSA share from a nearby farm, and that was what they were selling. I know that the majority of food at the other Farmer's Markets isn't actually locally grown, but the reality is that when you go shopping you wan to be able to pick up everything...and not have to make another trip to the grocery store just to get carrots or mushrooms. Someone needs to load up with some food from produce row if they want to build a following. \n\nI was meeting a group for a tour of the area and then lunch at Crown Candy, and had planned to get there a few minutes early to hit the Farmer's Market. I'm glad I didn't make a special trip...I would have been very disappointed. I almost felt bad for the vendors for the thin crowds, and bought some dill just to be supportive. \n\nI will say that no one should fear their safety shopping at the market. The owner of a nearby coffee shop told me that the owner of Crown Candy said his customers seem afraid to cross the street (it is directly across the street from the market). The block used for the market is blocked off from traffic and has been completely redone.  Everything is brand new and all of the people are very friendly.",
            "author": "Karen G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-26",
            "description": "A quaint little excursion. It has only a handful of vendors but with La Mancha Cafe and Crown Candy it makes for a nice Saturday morning excursion.",
            "author": "Rashied A."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-09-07",
            "description": "While the selection is slim, the patrons and vendors at this farmers' market make it worth a visit.  Locals sell their home grown produce and craft items.  There are some unusual wares like painted gourds.  There was a also a couple playing guitars and singing which was a great addition.",
            "author": "Sarah S."
        }
    ],
    "priceRange": "$",
    "name": "North City Farmers’ Market",
    "address": {
        "addressLocality": "Saint Louis",
        "addressRegion": "MO",
        "streetAddress": "St Louis Ave & N 14th St",
        "postalCode": "63106",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/YBCOdOCXM4fqEgbUJTb3eA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13142415031"
}