{
    "aggregateRating": {
        "reviewCount": 16,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-17",
            "description": "The Park Ridge Farmers Market is wonderful!  I try to make it out weekly to see what's going on and get some great food.  It is a bit expensive in my experience, but the whole thing is a fun family event.  The customers have a great vibe and ambiance is full of energy. \nHighlights include:\n-tons of fresh fruits and veggies\n- awesome cheeses from Wisconsin\n- the pickle guy for giardianara and pickles \n- hot tamales (not the candy)\n- delicious pies \n- varieties of hot sauce and spices\n- flowers\n- kettle corn\n- random vendors from around the area \nGive the Farmers Market a shot - you won't be disappointed!",
            "author": "Jim J."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-07-15",
            "description": "Good selection now, much better than 3 weeks ago. 1 bad experience, 6 Generation Farms had a teenage daughter calculating costs when we tried to pay, would not say out loud how much each item was as she weighed them, then gave me a price of $28. I knew it couldn't be that much so we started over and I had her say the price each time, this time it was $16.50! She never smiled or seemed to even care how wrong she was, no apology, and the older man there with her said nothing.\nJust a reminder to keep track yourself of what it should cost. Don't know if it was intentional, just throw out a price & see if it will get paid or just can't add in her head, either way they have lost our business for this season, other vendors to choose from.\nRest of the market was nice, great blueberries out now.",
            "author": "Chris C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-21",
            "description": "It's a good quality market, maybe a little small for the size of Park Ridge, but quite welcome.  In July and August, there are at least half a dozen produce vendors offering pretty much every fruit and vegetable that you could possibly want.  Prices are expectedly high, but quality is tremendous across the board.  \n\nI would like to see more prepared-food vendors; the only option is tamales.  There are also two bakeries, one specializing in bread and one in sweets.  KILLER kettle corn from a dude named (I mean, nick-named, presumably) Kernel Dan.  Another standout is That Pickle Guy:  their garlic crunchers are some of the best pickles in the Midwest (the regular and the hot are A- and B+ respectively).  Flowers, cheese, olive oil, brown eggs.\n\nThen you have some of the typical outdoor-market niche products, such as homemade dog treats and goat soap.  Or was it vice versa?  Anyway, that kind of stuff.  Birdhouses with license-plate roofs.  A municipal booth with police officers and local government officials.\n\nFree street parking nearby, usually as close as right across the street.",
            "author": "David R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-08",
            "description": "This is probably the best Farmer's Market that I have been to this summer. Great vendors, quality produce, fair pricing. Easy to find parking. I'd like to see more children's activities or maybe a small live music trio, even some elementary students playing their instruments would be great.",
            "author": "Tanya K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-20",
            "description": "A lively and fun market. First time visitor today. Easy parking, friendly vendors.",
            "author": "Renee R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-10-12",
            "description": "Always a great way to begin a Saturday. Lots of wonderful vendors! My favorite is definitely Wright Way Farms who are the only USDA Certified Organic farm & vendor there. They provide a low cost CSA that you can pick up weekly at the market. They also sell fantastic organic produce in season at their booth. \nhttp://www.thewrightwayfarm.com\n\nI love being able to go weekly and pick up gorgeous fresh flowers, cheese, essential oils, natural meats, pickles, plants...you name it! In the beginning of the season, you can grab planters filled with dill, basil, cilantro, mint, lavender, etc... to take home and transplant into your garden or sit on your window sill. \n\nThis market also has guest vendors every week, if you get hungry by the wonderful smells surrounding you...a great little hot dog stand, plenty of parking in the lot or street and is completely family and dog friendly. Supporting locally sourced items has a significant positive impact. Stop getting items from other countries and get your arse to your farmer's markets to buy local and organic! You may even meet some friendly faces and have a great time doing something good. \n\n#Foodie #PassionForLocal&Organic",
            "author": "Samantha G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-06-21",
            "description": "My MIL (who lives in Park Ridge) and I came here at about 9:30 am on a Saturday morning in June. I was impressed with how neatly organized everything was and it didn't seem obnoxiously overcrowded like some markets can be. 4/5 stars because I really thought the variety of vendors could have been better (although I realize this isn't entirely the organizers faults). Veggies, fruits, baked goods, jams, pasta, bread, pickles, cheeses, olive oils and kettle corn on the day I was here. I typically always see someone selling homemade dogs treats at markets such as these, but nothing like that here. I guarantee this type of booth would go over very well because there were quite a few pets in attendance. I left with two loaves if bread from 'The Bread Man,' a lemon poppyseed loaf from Allegretti's Bakery, some cheese curds, peas and cherry tomatoes; all of which were very tasty. Overall, a good haul. Maybe every Saturday is different? There was a vendor selling different kinds of olive oils and I'm not sure here's there all of the time. There was also entertainment; a musician on guitar and a balloon artist. The kids really seemed to like the balloon maker as his wait was 15-20 people deep. A good stop if you're in the area on a Saturday morning, but if you've been to one farmer's market you've seen them all.",
            "author": "Rachel W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-23",
            "description": "What a fun way to spend part of a Saturday morning.\n\nI stopped in for the first time a couple weekends ago. There is a ton of fresh produce - more booths than i can count, a couple bakeries, a cheese booth (one of my favorites), and even fresh flowers set up everywhere.\n\nI did think some of the produce prices were a little high, but other items, like the cheese and flowers, were very reasonably priced. I left with some apricot-nut brie cheese ($7), and a huge bunch of fresh eucalyptus ($5). I've gotten quite a few complements on how the eucalyptus looks really pretty in the house, and it's a calming scent you notice when you walk in the door.\n\nI've only gone early (between 8-9), and it isn't too crowded yet. Not sure how it would be in the later morning or early afternoon.\n\nThis is definitely a market I'll visit again.",
            "author": "Christina G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-08-25",
            "description": "The main reason I go to farmers' markets is to buy fresh, local fruit, veggies, and herbs.  Many other markets seem to focus on prepared foods, crafts, etc., which is fine, but I'm all about the produce.  So, for me, this market doesn't disappoint!  It's small and intimate, with more of a small-town feel than a festival vibe.\n\nLast week, I was able to fill my tote with  beautiful carrots, zucchini, the most fragrant basil ever, oregano, string beans, onions, and adorable purple bell peppers for under $9. (Beat that, Jewel!) I passed on the succulent-looking berries and juicy peaches this time, but they'll be there every Saturday until October 27th, so I think I have time to enjoy a greater variety of things.\n\nAlso worth noting is that the market is dog friendly.  I don't have a dog, but I love being bonked by a wagging tail while I'm picking out my tomatoes, or stopping to pet them as I work my way from one end of the market to the next.  If you hate dogs (and I can't imagine ANYONE does), that's fine, too--most of the pooches seem to be regulars, and are very well-behaved and acclimated to the crowds.",
            "author": "Elisa S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-05",
            "description": "Okay I have a confession...I played hooky from work today...\n\nReason #1...all the kids were out of town and I wanted quality couple time with the husband.\nReason #2...it was GORGEOUS outside, sunny, in the 70's...perfect.\nReason #3...I had an intense Farmer's Market craving to fill!\nMission accomplished at the Park Ridge Farmer's Market!\n\nMy suggestion...give it a once-over-walk-around.\nSome vendors are a little overpriced and not the best in the personality department. \nThe ones that are fairly-priced have personalities to makeup for the charm-deprived vendors, in addition to having gorgeous fresh produce.\n\nHonorable Mentions go to...\n*Tidey Farms...wonderful folks, fresh & vibrant veggies, great prices\n*The Cheese People...self-explanatory, really, they'll give you little samples and turn you onto some fantastic and unusual cheeses (see photos)\n*That Pickle Guy...I dare you to try his Garlic Crunch Dills and not fall in love, plus his Spicy Olive Muffalata Mix is outstanding!\n*The Salsa Guy...but in this case it was the Salsa Guy's wife...huge selection of salsas and sauces. She was a sweetheart and encouraged us to try all the different varieties. We ended up getting \"El Gringo Loco\" Natural Buffalo Wing sauce. Mrs. Salsa Guy even gave me a printed recipe for an additional uses for the sauce.\n\nAdditionally there are other vendors with baked goods, fresh flowers, gourmet dog goodies, fresh honey, etc.\n\nThis was the perfect way to start off a \"hooky-day!\"",
            "author": "Liz M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-06-24",
            "description": "super cute little farmer's market. I went here becuas of the crossfit gym that I was dropping in at. They have a variety of goodies - veggies, honey, coffee, popcorn, and cheese. They also have a couple of flower vendors that sell soem of the biggest roses that I have seen. Parking is easy as well.",
            "author": "Tao Tao W."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2014-07-10",
            "description": "Only one organic vendor.  I've given up our farmers market in PR and make a trip to Logan Square for our produce. I do like the honey and the live music though.",
            "author": "Amy B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-19",
            "description": "If you live anywhere close to the Park Ridge Farmer's Market and have been purchasing frozen corn from the grocery store, cease and desist! Immediately! The PRFM has what may be the best corn I've ever tasted. We bought some on Saturday morning to grill for dinner that night. I didn't even need to put anything on it, because it was so moist and flavorful.\n\nI also bought some blueberries, which beat the pants off any grocery store berries I've had, including Trader Joe's and Whole Foods (let's not talk about Jewel and Dominick's produce here--that's bush league stuff). Why? Because they aren't pre-packed and left to sit on a shelf all week. The berries I bought were picked on Friday, then put by hand into an unwrapped container on Saturday, the same day I bought them. You know those gross, mushy berries that hang out in the middle of the carton and sometimes mold, spoiling the whole carton before you can eat it all? I didn't have any of those in my carton from the PRFM. Why? Because somebody had *just put the berries in the carton,* and if they saw a gross berry, they didn't put it in there. Only today, three days after purchase, do I detect any signs of mush, and that doesn't really matter because I finished off the carton with breakfast. I *never* get to finish cartons of berries, because some mushy-to-moldy stowaways always ruin the carton before I can get through it. I guess I've just been buying them from the wrong place.\n\nAnother perk: many of the people working here can answer questions about the produce and other products. They know because they grew/packed/baked the stuff. They can also make recommendations for you if you tell them how you're going to use the item. For example, when I told the mushroom lady that I planned to grill the portobello mushrooms, she dug around her mushroom treasure chest and found me some mushrooms of what she considers the ideal size and thickness for grilling.  She also recommended herbs for the preparation (also available at the PRFM).\n\nA lot of people seem to think farmer's markets are pricey, but I don't think it's that bad. The prices ranged from a little less than what I would pay at Jewel to about what I'd pay at Whole Foods, depending on the item. There were also some booths selling the same items from different farmers and at different prices, so you could shop around to find the best prices on many items. Plus, they have items here that you just don't see at the store, like currants. I don't even know if the currants were priced well, because I've simply never found them in a store. Plus, most of it is organic, and I am comparing the prices to the non-organic produce at Jewel or Dominick's. \n\nThere are, of course, a few ways the PRFM could improve. First, the parking is confusing. There's a lot nearby that says, \"AT&T parking only! All others will be towed!\" We therefore parked in a metered space next to the lot. On the way back to the car, I saw a ton of people who had not been towed loading veggies into their vehicles. I think maybe a sign or two letting people know they can park in that lot and don't have to do laps waiting for a metered space to open up would be nice. Also, I know it's not as big, but in my head I compare it to the farmer's market in Daley Plaza. To me, it is the holy grail of farmer's markets. Since Park Ridge is of course much smaller than Chicago, it isn't really fair for me to compare the two, but I can't help it. Of course, since I live so close to the PRFM but not close to Daley Plaza, my greens wouldn't wilt on the trip home (if the PRFM has greens sometime I go, that is). Somewhat balancing that is the amount of dogs at the PRFM that aren't at the DPFM. Sooo many cute dogs!\n\nAlso of note: there's an old guy hand-sharpening knives and scissors in a lot just next to the market. I don't know how often he's there or if he's officially part of the market, but it's pretty cool watching him sit at his old-school contraption and do it. I might bring my dull pruning shears next time and see if he does gardening implements, too.",
            "author": "Elizabeth W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-09-12",
            "description": "Once a year, and always in the late summer/early fall, there's a guy who sets up a stand selling bare-root cuttings of daylilies and irises. Not just any daylilies and irises. These are award-winning hybrids he develops himself and grows in his own Park Ridge backyard! And he's got the ribbons and trophies on display to prove it. He also brought along a personal photo album of his daylilies. Large blossoms of red, orange, yellow, pink and magenta with multi-colored centers, rich in color of their own.\n\nHe sells them for $5 each or 3 for $10, which is a ridiculous bargain. The same single bulbs or tubers would sell for $10 or $20 each, or a developed clump could go for as much as $150 in a catalog. He sells these hybrids to growers who in turn propagate them and sell them to the public 10-15 years down the road.\n\nCool thing is, you can get them right here, right now, but only on this particular day. I had a long talk with him about raising daylilies and I bought 2 lilies + 1 iris. The idea is to plant them together. The iris blooms in late spring while the daylilies take longer. Once the iris is done, the lilies come up behind it and the blooms keep coming all summer long. While you can't pick the particular color of bulb you're getting from his collection, you know it will look awesome when it blooms.\n\nHis hybrid dayliles can also be seen growing around Uptown Park Ridge, local PR fire stations and many people's backyards all over town. By the end of the day, he's all sold out till he returns next year. You can't miss that!",
            "author": "Mike O."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2008-06-02",
            "description": "A  farmers market is one of the little joys in life, and Park Ridge seems to have a good one. It's located in a parking lot at Prairie Avenue and Garden, just south of the Metra train tracks and east of Cumberland.  (they put up signs, for directionally challenged people like me). It runs every Saturday, from May 24 - Oct. 25, from 7 am-1 pm.\n\nThe usual offerings are here: fresh fruits, veggies, herbs, flowers and baked goods.  Last Saturday, we picked up rhubarb, cherry tomatoes,  onions, and sugar snap peas.  How fresh were they?  The peas actually *snapped* when we cracked them open.  Million times better than, say, Dominick's. \n\nThere wasn't any corn on the cob yet (maybe it's too soon yet), but - if like my husband - you refuse to eat anything other than just-picked corn, there are no other options besides a farmers market.  If we buy it, we're gonna buy it here.\n\nWe (okay, it was me) bought some double chocolate chip cookies from Baked by Betsy; I have to agree with Mike O., in that it didn't taste as great as I'd hoped.  Our final purchase, however, was a hit: a bag of El Rey spicy red Hot Tostaditas Chips (lime & chili flavored) from some vendor in Milwaukee.  They had samples of various salsas out, as well; a couple jars are bound to find their way into our pantry next week.\n\nAs Mike mentioned, it's a very pleasant way to spend a Saturday morning outside. (A notice in the paper related that they also host the Listening Post, where residents can talk to elected officials and Coffee with the Cops, where police officers will be on hand to chat and answer questions.  Frankly, I'd rather sample salsas, but that's me).\n\nGo if you're in the area.",
            "author": "Kathy R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-09-20",
            "description": "Great Farmers Market!  It is close to home and has all the fresh veggies and fruit that you can get at the bigger farmers markets.  Prices are good and I love the cheese stand.",
            "author": "Bari L."
        }
    ],
    "priceRange": "$$",
    "name": "Park Ridge Farmers Market",
    "address": {
        "addressLocality": "Park Ridge",
        "addressRegion": "IL",
        "streetAddress": "15 Prairie Ave",
        "postalCode": "60068",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/xBwXRDoj5lOPzy31soEMgA/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}