{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-09-19",
            "description": "There is nothing that makes me happier than having a Farmers Market about 100 yards from my front door. I recently moved to Printer's Row and when I found out that this was part of the deal every Saturday, I was over the moon. \n\nAlthough this is not a huge Farmers Market, it still meets all your needs. There are about 4-5 produce tables, 1 for flowers, 1 for cheese, 2 bakeries, and 1 for dog treats (which is kind of random but I am also not a pooch owner so I'm not their target audience and the rest of my neighbors love it). \n\nAll of the farmers are so incredibly nice and always give me helpful tips on how to keep everything fresh and delicious. The only bad side? It is only open for a few months of the year and I am dreading the first Saturday I wake up and there are no farmers to go visit and I have to start giving more of my money to grocery stores. \n\nLove, love, love it!!",
            "author": "Melissa R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-08-03",
            "description": "I wish this market was a little larger and had more variety.  In addition, the veggies are not organic which is a disappointment.  While I'm all for supporting local farmers, I don't think the prices are that great for non-organic produce.  Nonetheless it ads charm to the neighborhood.",
            "author": "Local G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-07-30",
            "description": "I like the park, because I live few blocks away from it. But when I realized that on the week-end there's also a farmers market there, I was really happy. We don't have a lot of grocery stores around our building: it takes around 15 minutes to go to Jewel or Whole Foods, and it's usually hard to do it with the crib, when the weather is way too hot. And this farmers market just saves my time. On the way to our playground in Roosevelt park I buy some fresh fruits and vegetables - not very expensive, by the way.",
            "author": "Polly P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-12",
            "description": "The farmers market in Printer's Row is small, but good.  The vendors are all really friendly and the produce is great.  Plus, the market is in a cute little park right in the heart of Printer's Row with plenty of spaces to sit and relax to the soothing sounds of the fountain.",
            "author": "Amy H."
        }
    ],
    "priceRange": "$$",
    "name": "Printer’s Row Park Farmers Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "Dearborn & Polk",
        "postalCode": "60605",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/8xzQvt1MGP5wx1ehC5ryVw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}