{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-10-28",
            "description": "Pumpkins Galore offered fun and entertainment for the whole family! My husband enjoyed listening to the live band while sipping on a homemade root beer. My 18 month old daughter loved the roller slide, \"train\" ride and soy bean pool. It was a busy Sunday afternoon but we never had to wait in line for more than a couple minutes and there were tons of activates going on. We went the weekend before Halloween so all the pumpkins had been picked so be sure to go early if you want to pick your own.",
            "author": "Alyssa G."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2015-10-03",
            "description": "This place was okay. I went on a trip with my kids school. They have a couple swing sets. A plastic playground for toddlers that's pretty outdated. They have a huge sand box and a pool filled with corn. There were chickens and you can feed goats. That also have a hay ride. I would recommend this place for very early aged kids, not for bigger kids. The store they have sells honey, jam, bread and stuff like that. I think I saw some decorating things to buy. They also have a couple dogs and cats running around just an FYI!",
            "author": "Kayetta C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-01-27",
            "description": "So much to do here with your family. Many of the activities are free of charge and they do not charge admission like some of the big name pumpkin patches. The food is sooo good. Come hungry. Try the fried pickles or deep fried Oreos. They also sell some great homemade canned items. I love their jams. Shooting the pumpkins out of the cannon is a must. Weekends they have live music that is wonderful.",
            "author": "Adrienne F."
        }
    ],
    "priceRange": "$",
    "name": "Pumpkin’s Galore",
    "address": {
        "addressLocality": "Wright City",
        "addressRegion": "MO",
        "streetAddress": "26415 S Stringtown Rd",
        "postalCode": "63390",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+16367453927"
}