{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-26",
            "description": "Rendleman Orchard's Farm Market is one of my favorite places to visit when I'm in Southern Illinois. Their fresh produce is absolutely delicious and their staff are helpful and very friendly. \n\nDuring peach season they have yummy fresh peach smoothies. If you like peaches, these are a must-try. However, my favorite season to visit is autumn when they have fresh apple cider slushies and homemade apple cider donuts. I will drive miles out of my way to get one of those slushies; they are that good. \n\nI enjoy browsing their store. In addition to fresh produce you can find salsas, jams, syrups, sauces and specialty treats. They have unique food items that make wonderful gifts. Their Limited Edition flavored honey butters have impressed many of my guests, and their sugar free apple butter syrup was also a big hit at my house. \n\nI highly recommend this place!",
            "author": "Jennifer C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-09-21",
            "description": "No fall in Carbondale is complete without a visit to the orchard.\n\nRendleman is a cute little store that has a wide variety of offerings. Of course, they have apples and peaches, depending on the season with cut samples out for you to try the different varieties. They also have cider, available in gallons, half-gallons, or adorable little sippy cups. They also have apple cider slushies available for $1.99- definitely get one. They're refreshing and super delicious. They have more flavors than apple cider available, including peach, blackberry, and blueberry. \n\nThey have a small refrigerated section that has cold ciders and pops, as well as meat sticks, bacon, and cheese curds. I wish they carried more inventory though. Last time we went, they were sold out of cheese curds. This trip, there was only one bag left and they were cajun flavored. Curds are hard to find out here, so I was bummed that there once again weren't any. \n\nThere's also a wide variety of sauces, dips, syrups, spreads, and candies. There's a cute, rustic feel to the place, and it's charming. There's also a display of treats for your pets.\n\nThe one thing I always get when I visit here is the apple cider donuts. They come in your choice of a full dozen, a half dozen ($5.29) or by the each for $.89. They have a really good apple flavor, and they definitely symbolize the coming of fall.\n\nI do think a lot of the stuff here (not including the actual fresh fruit) is overpriced. More than once I looked at a jar of something and put it back. College budgets can't allow for $12 spreads. Everything looks and sounds delicious though, so it would probably be worth it.",
            "author": "Jill O."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-09-10",
            "description": "We expected the market/storefront at Rendleman's to have a large selection of items made at the orchard, or at least in the local area.  The shelves were stocked with things like jams, salsas, and pasta sauces, but they appeared to be made at a factory somewhere and labeled with a Rendleman sticker.  There were no baked goods using orchard grown fruits either, which we were hoping for.  It would be quicker to go to the grocery store in your home town.",
            "author": "E G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-11-05",
            "description": "Dropped in here for a little family treat....and it was just that, a treat!   Great goodies, beautiful produce from their orchard. We bought some apple butter, cider and cider donuts. Haven't tried the apple butter but the cider and donuts are delicious! We wanted to try a cider slushy but found out they only have it on the weekend....maybe incentive to come back in a couple days?",
            "author": "Hollan B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-17",
            "description": "I'm a big fan of Rendleman's and have always gotten delicious fruits and products from here practically year round! We just stopped there on our way to Carbondale from Memphis to pick up 2 pecks of free stone peaches. I also got their no sugar added applesauce which is my favorite applesauce. Today I also tried the apple butter and their lemon cheesecake fruit dip. They have cold bottled soda as well!",
            "author": "Julie S."
        }
    ],
    "priceRange": "$$",
    "name": "Rendleman Orchard",
    "address": {
        "addressLocality": "Alto Pass",
        "addressRegion": "IL",
        "streetAddress": "9680 State Route 127 N",
        "postalCode": "62905",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/d1czAdreC_I-9wuo1cTywQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16188932771"
}