{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-02-25",
            "description": "After noticing my interest in his strangely beautiful mushroom display at a Waukesha county farmer's market Rick welcomed me to his booth and told me about River Valley Kitchens. He empathized with my fear of unknown fungi and walked me through their production based on organic tenets.\n\nThe portabellas I took home resulted in such a delicious soup and omelette I took home twice as many the next weekend. I  eagerly await morels and other wild mushrooms in spring.",
            "author": "Ben K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-02-19",
            "description": "River Valley is a premium grower (\"using organic tenets, but not organic certified\") of portabella, crimini (aka baby bella), white button, shiitake and oyster mushrooms.  They are at the Milwaukee County Winter Farmer's Market every Saturday.  Not only do they have the fresh mushrooms, but they have preserved (dried, pickled) mushrooms as well as portabella chili, mushroom stock, granola, and other preserves.  The mushrooms are superb, and they have lots of good recipes to go with these as well.  The only reason I give them four stars rather than five is the fact they don't take charge cards at the MCWFM.  The price can get fairly high with some of these items, and this is a lot of cash to carry.",
            "author": "Pete J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-25",
            "description": "i've never been to the river valley kitchens location in burlington, but i see them every wednesday at the andersonville farmers' market in chicago.  this is a decently-sized market, but i would come just for river valley kitchens' granola any day.  it's absolutely hands down the best granola i've ever had.  5 stars because all the flavors are delicious, the price is right, the ingredients are above average, they're always available, and the staff running the booth have without fail been cheery and helpful.  \n\nso, river valley kitchens, if you ever read this, please pleeeeeease list your granola on the website store....winter is a very long, dark time to wait for the market. :)\n\noh right, they also have amazing mushrooms, sauces and whatnot, but it takes me about 30 seconds to blow through $30 at andersonville, and by the time i get visions of cheeses, fruits, nice cream, bread, corn, and granola out of my head and into my bag, i've spent it all.",
            "author": "Sarah M."
        }
    ],
    "priceRange": "$$$",
    "name": "River Valley Kitchens",
    "address": {
        "addressLocality": "Burlington",
        "addressRegion": "WI",
        "streetAddress": "39900 60th St",
        "postalCode": "53105",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+18887117476"
}