{
    "aggregateRating": {
        "reviewCount": 11,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2019-01-02",
            "description": "I really love this grocery store! They have a variety of everything. The staff is super friendly and helpful. They certainly have the best prices that I have ever seen!",
            "author": "Josie Z."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2019-02-19",
            "description": "Shocking experience.. I found in the cooler smoked Turkey legs and wings which were molded. I informed friendly store associates which works at the meat and seafood section (even worries me more now) . I gave him one and kept on looking .. and found several more .. so I went to hom again to let him know , they better look through this .. after a while me standing their and him , he put back the molded Turkey leg and said I dont care I just leave it the I give a s... I was done and left quite and shocked about that behavior and unsafely food handling. I decided to email an complain .. not because of the food no because of that non caring behavior of the sales association.  But I didnt even received an email back. I doubt I will be back because if the store associates are acting already infront of customers like this I dont want to know what happens behind doors .. uuurrgghh",
            "author": "Daniela S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-02-05",
            "description": "Hey, so yeah they opened up what...last\nspring? They were a little hit or miss, some areas were lacking and the pricing was a bit off. Now? Let\nme count the blessings: FREE COFFEE- POPCORN SAMPLES- DELICIOUS SAMPLES GALORE-PIZZA SAMPLES- SUSHI SAMPLES!!!!!! Cheap, properly cooked rigatoni ala vodka that you just reheat in the microwave at home. Ice cream,\n$1 Espresso... crazy!!!!\n(on the weekend)They've got Jorge from Caputo's, and he's gotta be the best butcher around. I think they got Angela too... the lady who\nmakes the cheese (need to verify)? They've got some gentleman manning the seafood who appears to have grown up on a fishing boat. Super fresh exotic stuff last weekend, and the guy couldn't have been nicer or more enthusiastic. This place is winning me over with every visit.",
            "author": "PJ J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-09-17",
            "description": "One of the new, smaller grocers in our area. The place seemed good. Prices for big name goods were about what other stores would charge, but there were a few deals which made the trip worth while. One thing is in-house made popcorn! Nowhere near as good as the now closed Popolicious in Des Plaines, but very good for a low price! Great for parties.\n\nThe people were fairly friendly, and other foods seemed fresh. A great place near our home.",
            "author": "Eric E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2019-01-02",
            "description": "Love this store! Everything from the fresh sushi to the pizza! And their prices can't be beat. This place is definitely my go to grocery store!",
            "author": "DANIELA F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-08",
            "description": "I love this store. Sam is there to welcome us. George in the meat dept is fantastic. I've gotten the best meat ever there. Deli is great..best Italian beef around. Kielbasa is super and a great price. Homemade tortillas! I won't use anything else now. They are by far the best. Amish honey is another great item..really good. Produce is good too. It's now my go to place to shop!",
            "author": "Ann P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-11-11",
            "description": "Is a small store and the quality of many items with the price is iffy. However the meat department and having the butcher  Jorge (former Joe Caputos) I'm really happy. He knows my cut of meat and I can always phone ahead like before. Go Jorge!!",
            "author": "Mariana C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-03-27",
            "description": "Phenomenal selection at this market! Overall a very clean store with organic offerings, local products and a gluten free section. The bakery has amazing offerings with great prices on by weight Italian cookies. Very happy I stopped in for a quick shop after dinner!",
            "author": "Kortney M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-04-29",
            "description": "The only store near by that has Amish eggs from a small local Amish farm, delicious! I've tried their pizza and some baked goods which were all tasty. Clean store, organized.",
            "author": "Paulina P."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2018-02-27",
            "description": "expired food on the shelves every visit.Rude deli personnel.Rotten produce.How gross to pick up a potato and have your fingers squish through the rottenness? Gave them a number of tries,but have given up.Thin they will go the way of Caputos soon.Wonder what they will put in the building when they are gone.",
            "author": "Larry M."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-10-28",
            "description": "I had high hopes for this store since Caputo's closed but alas not so!  Two Saturday's in a row I went shopping at my normal 9:30 am time for their Barese Sausage and they had none.  Yesterday I went in to get ham lunch meat that they had advertised and they had none.  I bought their half salt pickles two weeks in a row and they were horrible. I spoke with the manager and he made some lame excuses.  Rather than make excuses learn from your customers comments and improve. I will be making the trek to Valli in Arlington Heights now. I have given this store too many chances. :(",
            "author": "MaryBeth C."
        }
    ],
    "priceRange": "$",
    "name": "Sam’s Farmers Market",
    "address": {
        "addressLocality": "Des Plaines",
        "addressRegion": "IL",
        "streetAddress": "1045 E Oakton St",
        "postalCode": "60018",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/QMXwsV95sJxz2Ipx6tA9UQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18477951100"
}