{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-20",
            "description": "After discovering this market recently, I've made an effort the past couple of weekends to stop in and stock up on fresh produce. The prices are VERY reasonable and the fruits and veggies are all good quality. The cherries and strawberries tasted exceptionally good. Also their bunches of flowers were 3 for $10 and each bunch was so generous!! $10 is a bargain for what you get. Also I nabbed a big pack of hand peeled garlic cloves for 99 cents, which was great since I'm always cooking with garlic and loathe peeling them. \n\nIn addition to fruits, vegetables and flowers.. They also have an assortment of jarred goods, donuts and breads from Breadsmith.\n\nI will continue coming to this market on the weekends when I'm in the area! Check it out!!",
            "author": "Natalie K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-20",
            "description": "Wow, this place sure turned out to be a random gem of a find. The GF was in the same shopping center at Victoria's Secret and I decided to take a rain check. I am a pretty shameless kinda guy, but it is a tad early in our relationship for me to be giving feedback on her choice of undergarments. Let me get another couple months under my belt and it will be on like Donkey Kong though.  \n\nThis place is really just a large tent erected smack dab in the middle of a parking lot. This is not something you would expect to find at the Arboretum of South Barrington shopping center, which is one of the nicer places in the area to blow though disposable income. Since I was approaching from the back of it while I was walking, I was thinking it was just some sidewalk or tent sale from one of the merchants. \n\nMy mind switched gears pretty quick after I got to the front. The fresh produce they had on display was awesome. Since everything looked so great, I grabbed a hand basket and went a little nuts. I ended up picking up fresh corn, raspberries, onions, shallots, garlic and some very impressive looking fresh tomatoes. The tomatoes were frggin HUGE too. They were larger than a softball and looked like a genetic engineering experiment. I made myself a BLT sandwhich with one of them earlier and they were sensational. Other offerings were fresh bread, maple syrup, pasta, sauces and marinades, melons and assorted citrus fruits. \n\nI was chatting up the checkout girl and she informed me that they set up shop there every weekend in roughly the same location. Specifically on my visit they were located in front of Arhaus Furniture and adjacent to Victoria's Secret. Look at the bright side, you can have your GF pick up a Baby Doll or Teddy and still knock out some stir fry ingredients all in one fell swoop. Everybody wins! \n\nLastly, and not surprisingly, they do not take cards so you will have to have some cash on you. However, stuff was very reasonably priced. My total was a little over 10 bucks and I got a haul.",
            "author": "Robby W."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2015-07-26",
            "description": "Went here yesterday morning because I wanted to check out a farmer's market & buy some fresh produce. Plus, I heard this one was great.\n\nI wasn't impressed. All the produce was old & not very good. \n\nMaybe it was an off day, though. I'll have to check it out again some other day",
            "author": "Sandra Y."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-29",
            "description": "The fruits and veggies are always good and fresh. Convenient hours, and they take credit cards. Also, they have some of the best prices around when it comes to farmer's markets. Definitely worth the money to go. We love stocking up every week! I especially like the fact that they don't have a lot of vendors to distract from why I'm there. It's fruits, veggies and breads.",
            "author": "Rose R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-09-27",
            "description": "My mom never tells me about shopping, she's not a \"shopper\" exactly, but when she finds a good place to find food that is reasonably priced, she makes a point to let me know about it. \n\nI love to cook and we eat a lot of fruits and veggies at our house so a good, local farmer's market---right up my alley. \n\nWe went this past weekend to check it out and it was even better than what I had expected. 6 romaine hearts for $1.99, 4 peppers (mixed colors- yellow, red, green) for $1.50, Cucumbers 5/$1, fresh pineapple $.99 ea, need I go on? \n\nFor about $15, we got all of our fresh produce for the week. I was thrilled!! We will be going back- and soon. Probably next weekend! I recommend you stop by too!",
            "author": "Catherine P."
        }
    ],
    "priceRange": "$",
    "name": "Seasons Produce & Specialty Market",
    "address": {
        "addressLocality": "Hoffman Estates",
        "addressRegion": "IL",
        "streetAddress": "100 W Higgins Rd\nSte Q-60\nArboretum of South Barrington",
        "postalCode": "60010",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/IdHcrQp6dcC3UABSrt1i7A/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18474266200"
}