{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-10-04",
            "description": "It is a great place. I was heading home when I saw the place and they had a good selection of produce. It was all fresh and they were very nice I would recommend this place to anybody in the area",
            "author": "Madelyn S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-14",
            "description": "Full disclosure...I am related to the Smiths, however I manage to make a trip over a couple of times during the harvest season to enjoy some homegrown tomatoes and deep red and juicy watermelon. They work hard and trust their customers.",
            "author": "Lois B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-10-25",
            "description": "In season produce, just north of  I-70 at exit 21. Sometimes you'll find an attendant, but often it's just self-serve. There's a scale to weigh your produce, and a box to drop your cash. Currently, there's pumpkin and squash, with a few  tomatoes before the frost. If you're looking for a deal based on price, then you probably won't find it. But the quality is usually there.",
            "author": "John H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-27",
            "description": "I love this place! I pass it twice a year while visiting family near Route 4 and always look forward to stopping. I've never seen the Smiths, but their stand is always stocked with fresh produce in the summer, and pumpkins and mums in the fall. They have a scale and everything is self-serve, which is nice that they trust their customers. I've gotten the best tomatoes of my life from this stand and wish I could visit more often!",
            "author": "Amanda C."
        }
    ],
    "priceRange": null,
    "name": "Smith’s Farm Products & Trailers",
    "address": {
        "addressLocality": "Marine",
        "addressRegion": "IL",
        "streetAddress": "3175 State Route 4",
        "postalCode": "62061",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/oComNLVk561FRppSkSbVig/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16188874317"
}