{
    "aggregateRating": {
        "reviewCount": 170,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-12-23",
            "description": "Something I've been coming to for years. Very interesting. Old school open market open year round. How many places can you buy raccoon or a whole hogs head. Lots of places to have a bite to eat or  get some vegetables. Must see.",
            "author": "David W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-10-22",
            "description": "Cool place. We came around lunch time on a Friday, and it wasn't very busy. A handful of the booths were empty. This was a cool place to walk around though, and they had a lot of offerings, meat, produce, and specialty items.\n\nWe picked up some lunch at Norton's, and I got a coffee and cronut from the bakery caddy-corner to that. There should be a sitting area near that so people can hang out and eat. We had to stand at a small, wobbly table. Plenty of places for a quick bite or a drink. This is a nice year-round farmers' market. I wish something similar existed where I live.",
            "author": "Ashley P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-07-06",
            "description": "Came on a Friday at 9am. Vendors were still setting up, but lots of choices still! We would have purchased more if we weren't leaving STL by car that day. We loved the handmade soap area and the Soulard (Sue-lard) Spice Company--we purchased fresh/customized coffee blends and their top selling Soulard Spice Rub! \n\nThey also sell bloodys, cajun food, and there's a bakery too! I'd recommend a visit if you've got spare time.",
            "author": "Felice C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-11-24",
            "description": "Best the farmers market in STL with a wide variety selection of produce and meat.  Can't beat the prices for the amount of food obtained and from local farmers.",
            "author": "Lauren S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-21",
            "description": "This is definitely worth a visit and there are a lot of vendors, things to see and things to buy. Produce options are plentiful and affordable. There is also cooked food for snacks, and a lot of random trinkets such as soaps. \n\nInsider tip: get a bloody mary or a margarita first and then journey around. \n\nIf you're not from the area, get bread from the area and get the gooey butter cake - man it is diabetes waiting to happen and oh so delicious.",
            "author": "Vanessa K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-30",
            "description": "The Soulard farmers market will always hold a very special place in my heart.  For 5 years this is where I did the majority of my grocery shopping on Saturday mornings.  I would wake up and head to the market.  The market is open year round and you can always find the best produce, and so much other fun stuff here.  \n\nI would generally get my veggies and my fruits here.  They have a lot of places that take just cash, but some take credit cards and event some take EBT.  Most things only coast about a dollar or two for sometimes over a pound of a product.  I used to get a half pound of sprouts each week and never pay more than a dollar.  When things are in season like corn, strawberries,  and other fruits and veggies you can normally find them cheaper here than anywhere else.  \n\nYou can also get meats, eggs, clothing, baked goods, cider, and many other things.  They even have a spot that sells bloody marrys in the morning.  \n\nSoulard Farmers Market is the best and more people need to check them out!!",
            "author": "Matthew L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-11",
            "description": "We love this place! \nWe are not from St. Louis but come every time we need bacon!! Harr Family Farms has the best bacon hands down I have EVER had! We are from Texas and can't find anything close to it. \n\nThe fruits and vegetables look great!! There is an amazing bread place but we didn't see them this time. I'll have to update if I see it next time. \n\nThere is a space that serves egg rolls, spring rolls, crab ragoons, and some other items and oh my goodness it is yummy!!!!!\n\nWe will return.",
            "author": "Lindsey R."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-07",
            "description": "Great way to spend a Saturday morning.  \nIndoor and outdoor vendors.  TONS of produce.  Breads, meats, cheese, and more.  Need a live chicken?  They've got that too.\n\nFood vendors such as tamales, beignets, popcorn, pretzels, gumbo.....just to name a few.\n\nOn this trip we enjoyed smoothies, mini donuts, and pretzels.\n\nMany of the produce vendors had really great deals on their beautiful produce.  Much cheaper than the grocery stores with much more variety.",
            "author": "April B."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-10-06",
            "description": "This feels more swap meet than farmers market and it works!  Great neighborhood and every veg you can find. Prices are great. In addition to fresh, there is prepared food, spices, jewelry, and so on. Unlike an open air market, this is not dog friendly. I am new to St. Louis and consider this a great find!",
            "author": "Viktor H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-24",
            "description": "Awesome variety of everything. Fresh fruits and veggies are so good. I live in San Antonio but when I come to visit I make sure to visit the farmers market. I bought some peaches yesterday and they were delicious. \n\nI wish we had something like this at home. Prices are very reasonable.",
            "author": "Liz R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-10-14",
            "description": "Stopped by Soulard Market today to visit the spice shop and of course a Bloody Mary or two while listening to live music.  If you haven't been to the market you should go.  Cheap cheap cheap cheap cheap everything... fruits and vegetables to spices to $4 Bloody Marys.  \n\nHonestly the spice shop can save you BIG money.  Example; Dierbergs charges about $6 for 1.5 ounces of Cayenne Pepper.  Spice shop is $4 for 8 ounces!  All of their spices are super cheap.\n\nDon't forget to like my pics!",
            "author": "Jason J."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-09-26",
            "description": "Do not come here on Wednesday, 90%of vendors not here.  Maybe they should mention that on the website .  The building is unique and the few vendors that are open are very friendly",
            "author": "Sho T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-07",
            "description": "This is the prototypical urban farmers market what gives up the awesome. \n\nThere is a fair amount of parking right close by, but be warned on saturdays-which is the main market day-they will be quite busy. Odds are that you'll find a spot somewhere but there will be lots of distracted drivers mishandling vehicles of all kinds all over the place. Take care and don't assume that the car/van/truck/mass of rust and bailing wire backing up in front of you sees and will stop before it runs over a curb/wall/you. \n\nThis is one of the oldest markets in the country being more or less in continual operation since 1779 or so. While it's not what it used to be-some of the local specialty butchers  in particular have faded away-it's still one of the best places to shop for cuisine or foodstuffs of any kind in the area. In addition to numerous food stalls that have tasty tasty meals/snacks/bloody mary's there are a lot of local produce/meat/cheese/pasts/baked goods/smoked meats/whatever can fit into your mouth stalls. This is a large space with five separate inside sections, and a separate semi outdoor area.  If you are with children keep an eye on them as they can disappear into the crowd in a heartbeat. Once separated it's difficult to find one another again, but if it's a husband or mother that you are trying to relocate sooner or later they seem to turn up at the bloody mary booth.  While there are some stalls what sell gifts, trinkets or clothing 90% of everything in here will be selling grocery type stuff for home or prepared meals/snacks of some kind.\n\nDue to the sheer size of the place it can take several hours to wend your way through and retrieve your car. I recommend planning on eating on site-because it's awesome and you'll be here a few hours anyway at least on Saturdays. Weekdays tend to be less crowded as not everything is open. Some places are cash only, some take cards and cash, and most spots are EBT friendly. Pricing is on the lower side of things-especially considering the very high quality and craft of the items sold here.\n\n I'd recommend leaving your four legged friends at home as most pets do not do well with all the strange smells, noises and masses of people. There is a small playground outside for children, unfortunately there tend to be some not so savory adult street type folks around the perimeter. Children won't pick up on this so much-all they will see is the playground -but as an adult take care out there. \n\nOverall this is one of the best-if not the best-markets of it's type in the country, and is a perfect spot for anyone that likes food. Perfect for holiday meal shopping, and food type gifts-jams, gourmet items, soaps and suchlike.",
            "author": "Steven W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-03",
            "description": "Really interesting farmer's market around the around. Very fresh vegetables, fruits, wild animal meats for a relative inexpensive price. Must try the Jambalaya rice at the store near the entrance and stop by for their famous ooey gooey cake! It's about a 30 walk in a sketchy part of town from city center but definitely a place to visit.",
            "author": "Win C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-05-04",
            "description": "Go on a miserable weather day in the afternoon and GET YO DEAL ON. Especially if you like freezing fresh produce and/or canning. Super nice vendors. Get the special Bloody Mary at the outdoor patio area, if you like deliciousness.",
            "author": "Victoria V."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-02-29",
            "description": "It has taken me forever to write this review, b/c I didn't know where to start. With a personal love for farmer markets from Boston, San Franciso, New York to Dayton, Cleveland, and Detroit. I have very high expectations, but this place stacks up to the rest. \n\nThings to Note:\n1) Relative large farmer's market, but the best day to go is on Saturday from 7am-11am. \n2) Some stalls are closed in the winter.\n3) Not all the produce is local from MO/IL, etc. - so I would ask or look. This is just a personal preference.\n4) Spices, Meat, Bakery Items and other goodies sold inside\n5) ATM on stand-by but do yourself some favor and bring cash & your own bags.\n6) Grab a bloody-mary before you start\n7) Find the Vietnamese Egg-Roll Stand outside. I always do this. \n8) Find the Asian lady with homemade mini-donuts!\n9) Grab some local balsamic vinegar and foccacia bread\n\nVery inexpensive, non-pretentious with all types of goodies. There are always some serious dollar store items, so pass on that unless you are in need of useless gadgets.",
            "author": "Virginia C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-15",
            "description": "My happy place!  Where else can you go and drink a Rajun Cajun bloody Mary and shop for fresh produce at your leisure. The spice shop remains a favorite of mine and I always look forward to cramming in there and waiting my turn to try new and old spices. I also tried the popcorn this time and it was also good. There are so many great things about Soulard including its history that you just have to come and see for yourself. The kiddos love it too. If it's cold outside just bundle them up and put them in their stroller or wagon and have a great time. I can't wait to get my fresh duck for thanksgiving!",
            "author": "Jacqui P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-03-22",
            "description": "I have to say if you know your way around vegetables and fruits, this is a great place to be.  I love coming here to buy from local farmers and support them and in return I get some real wholesome food.  \n\nI believe they have a little something here for everyone and they have a nice variety of fresh dairy, breads and meats.  Some foods that are hard to find, you just may find it here, from your local farmer.\n\nIt don't stop there, excellent street food, it is very hard not to buy a sandwich or pastry while strolling through here.\n\nSoulard does have a metered lot that you can park at, or along the streets there are meters as well.  This is a farmers market so don't look for nothing fancy, the farmers I encountered were all nice and customer friendly and tool the time to answer any question I may have had about their products.  Even which peppers might be the sweetest and the best way to cook them or utilize them, I like that.\n\nYou will even find pies and cakes here, herbs and seasoning and flowers...unique drinks and of course a great hot dog stand with beef hot dogs or pork hot dogs and more.\n\nBring your own bags, I saw people with their own miniature grocery carts and backpack to haul their food and purchases in, unless you got a lot of people in your crew or want to make a lot of trips back to your car, be prepared with bags and carts for the load.\n\nSoulard is a large farmers market and it looks as though there are more than 50 vendors in there alone and I probably wouldn't be to far off to say well over 75 with street food and cooked foods and butchers and florist too.\n\nBring lots of cash, even though most take credit cards and EBT, sometimes the machines are not working, just have the cash for backup and you know that Samsung Pay works at most of these old card terminals too, so if you are techy like me and want to pay with your phone or watch do it.",
            "author": "Lloyd C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-06-24",
            "description": "Wonderful way to get great fresh produce at very affordable prices! Loved the huddle and bustle! Not thrilled that it isn't open on Sundays. Very easy to find parking and vendors are very helpful. Very diverse produce options, loved the live band!",
            "author": "Katrina K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-10-09",
            "description": "Honestly, we just stumbled on this place because it's right by Bogart's, and I needed some ribs. And while ribs are more important than everything else, the everything else that you can find here at the Farmers Market makes me reconsider [but not retract] that statement.\n\nBefore we get into all that, you should know that there's a definite New Orleans vibe happening here (and all over St. Louis); maybe it migrated up the Mississippi...all I know is that you can get a legit bloody mary from Julia's for only $4 (and beignets if you'd like). It's got pickled asparagus and a spicy bean, and sipping on that thing as you peruse the rest of the market is the move.\n\nWhat else can you peruse? \n\nPimped out pickles. Pecan pie in a jar. Any kind of meat you'd ever want, including pig ears. Fruit Loops kettlecorn. NFL jerseys, mugs, t-shirts, hats, etc. Goose Poop. Seafood. Every kind of fresh produce you can think of. Pork rinds. Mini-doughnuts. Spices. Flowers. Roasted nuts. SO MUCH SOAP. Pastries, oils, salsas...I can't even remember it all.\n\nAnd that's just the tip of the iceberg. Get over here already.",
            "author": "Peter D."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-02-09",
                "description": "Value - 5\nPeople - 5\nAtmosphere - 5\nGreat Time - 5\n\nI live in Dallas, TX and I heard about the Soulard market watching Andrew Zimmerman on the Travel Channel. The following week, myself and a few friends of mine flew out there to experience ourselves... OMG!!! It's like Walt Disney, Julia Child and a baby and named it Soulard!!! It's that Happiest place on earth for Foodies... The produce is extremely fresh and sources back to the farm as well as the meats. I found the BEST Bacon ever there as well as the BEST bread ever too.\n\nI now fly from Dallas to St. Louis ever 3 months just for bacon, rabbit, bread and produce. My usual order consist of 20lbs of bacon (people at work love it too) and bread.\n\nIf you are looking to walk around and want to enjoy a morning with the family or be by yourself, this is the place. I look forward to it every quarter. If I lived in St. Louis, I'd probably go every week.",
                "author": "Tony R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-09-17",
                "description": "Nothin' like a spicy and strong $4 bloody mary to jumpstart your saturday afternoon!\n\nWe got here pretty late in the afternoon and some of the stands were already shut down. The rest were trying to move their product though, offering cases of tomatoes for $6, among other great deals. For the most part, those stands that were leftover all had similar products. Maybe the special stuff were all gone in the morning, idk. \n\nI'm excited to come back though! Prices are reasonable, the atmosphere is lively. If I'm ever up early on a Saturday...",
                "author": "Tian Y."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-02-10",
                "description": "There is no doubt in my mind that Soulard Farmer's Market is a treasure in the city of St. Louis! \n\nFirst Star: I can always find fresh produce. It's a combination of local and shipped in products sold by local vendors, and it's typically decently priced (bring cash, because not all vendors are set up for cards). There aren't as many organic producers as I would like, but you can find them. There are also meats, baked goods, and other fun non-food items. I love browsing the aisles and being inspired by my shopping finds. So I always bring a bag and fill 'er up!\n\nSecond Star: Nestled close to the Mississippi River, the market is rooted in St. Louis history. It can trace its beginnings back to the 18th century. Structurally built like old European \"H style\" markets (central core with four legs or wings for vendors), its origin was an open air field for farmers to sell produce, livestock, and dairy. Why shop in a new brick box store when you can wander the historical paths of Soulard?!?\n\nThird Star: Speaking of wandering, enjoy as you walk. Purchase a baked good from the several bakery spots, or grab a fresh made tamale. Imbibe with the hair of the dog that bit ya with a Bloody Mary, or sample a tasty bite if one of the vendors is offering. Grab a hot fresh mini-donut, or locally made pork rinds. They say you eat with your eyes first, and at Soulard you'll have the chance to see it and actually eat it while you shop!\n\nFourth Star: I love that you'll hear live music from the banjo players who seem to have a permanent residence at the end of one of the halls. You'll also be entertained by street performers from time to time and characters galore. It can get crowded on event weekends. So whether your vibe is to partake or avoid the crowds, you can check their website for updates. \n\nhttp://www.soulardmarket.com/soulard_market_002.htm\n\nWhich leads me to the Fifth Star:  It's a melting pot of fun people watching and interaction. You never know who (or what) you'll see! To me a visit to the market is like feeling the heartbeat of The Lou. So whether you're a local or a visitor, Soulard Farmer's Market has a lot to offer and is definitely worth the visit!",
                "author": "Fran M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-06-12",
                "description": "Classic staple market in the Lou. We always get us a margarita then shop around for our produce.",
                "author": "Pash W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2018-04-29",
                "description": "Cool spot. Lots of great prepared food options! Also, not a bad place to pick up fresh produce.",
                "author": "Damon L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-05-27",
                "description": "Everything you'll need one of the largest markets I've ever been too. Food vendors......... Veggie vendors.......clothing vendors............ Essential oils......... Artwork...... Fruit vendors.........",
                "author": "Jrod B."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2014-09-05",
                "description": "Bummer dude. I fancy myself a bit of a market connoisseur (meaning that you name a city I've been to and I've probably visited at least one of their local markets) and given Soulard's historic narrative, I was bummed to find Dole strawberries and knock off purses for sale. I imagined this market staying true to it's roots with 100% local products and vendors with an earthy \"I grew this in my back lot\" feel. \n\nThe market is quite expansive with two separate covered spaces offering shoppers everything from incense and soaps to mini doughnuts and overgrown zucchini. Next time, I'll probably wind up at another farmers market to find more of those MO-only products I was hoping for at Soulard. Worth a visit if you're visiting for history's sake.",
                "author": "Brittany S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-08-25",
                "description": "There's an amazing selection of fresh vegetables. I didn't look for meat or fruit here so I can't speak to those but there is a huge variety of veggies to choose from! Definitely check out the local, home grown produce at each stand. We came in on a Friday morning so there was plenty of street parking next to the market. Also, there's a fairly big and clean family restroom near the entrance - important for those with little ones :)",
                "author": "Mary F."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-09-13",
                "description": "The Soulard farmer's market is not incredible or amazing, but it's a very decent place to get some fresh produce. I'm very happy to find a solid farmer's market in St. Louis! \n\nPros: \n- Produce quality: Generally speaking, the quality is on par with what you would find in a grocery store. However, akin to choosing produce in the store, you have to know what to look for and be picky (in a good way)! Don't assume you'll automatically end up with good produce just because it's a farmer's market. \n- Vendors: If they're not in a hurry, I like to chat a little with the vendors to find out more about their business and to get to know the faces and stories behind the stalls. \n- Prices: Cheaper than a grocery store! \n\nRandom: You might want to walk through the whole thing first (it doesn't take too long) so you can make mental notes about the prices and quality of things you're thinking about buying in order to compare and get the best deal (money and quality-wise). \n\nCons: \n- Crowds: Depending on what time of day you go (the earlier the better), it can get pretty crowded pretty fast, especially with strollers, slow walkers (not the zombie kind), and inattentive kids who don't realize they're blocking the main path. \n- Parking: You might have to search a little, but it's not too bad. \n\nIn addition to the fruits and veggies available, there's an awesome looking spice store (I've never wanted to suck it up and wait in the long line/crowded store to actually buy something, though), several meat vendors, pastries, cheese, and even soaps. I would avoid the knock-off sunglasses and purses, though... those flea market feeling stalls aren't anything special. \n\nAll in all, a great experience! Make sure you bring cash and a reusable grocery bag!",
                "author": "Christine W."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-10-27",
                "description": "The instant I walked into the Farmers Market off Carroll Street, my senses came to life! The chatter and noise of this busy place, the sight of people of all types carrying food, drink, animals and other things, and of course, the smell of a ton of different delicious smelling foods just waiting to be tried.\n\nUnfortunately, I was only a visitor in St. Louis on my trip to this Farmers market, but if I visit again, I'll definitely stay a while to check it out.\n\nI've rated this Farmers Market four stars based on sight, sound and smell alone.  That's how awesome this place seemed to me.",
                "author": "Rafael A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-02-11",
                "description": "A Soulard landmark. Great and varied selection of top quality produce and meat at very prices.  Also there is a bit of a wide variety of things from unique craft soap to spices and clothing.",
                "author": "Ken K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-06-25",
                "description": "The soulard farmers market is by far the best farmers market I have ever been to. It is huge and they have everything from produce and farm fresh eggs to bread and meats. It gets pretty crowded on saturdays especially in the summer. I love grabbing an extra spicy Cajun Bloody Mary from Nortons (my favorite) before doing some shopping. I'd recommend bringing some cash or coins since many vendors are cash only. The prices are hard to beat though. There are so many great family owned vendors. It is a must-do in St Louis.",
                "author": "Erica R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-11-22",
                "description": "If this weren't so far from me, I'd love to do all my grocery shopping here. It's such a wonderful spot and you can get the best finds here. I highly recommend coming here early in the morning before the crowds get fired up. Also, if you're feeling like a special treat, forget to eat breakfast at home and grab something while you're here.\n\nThe produce is incredibly fresh and you can't find it cheaper else where. Yes, often even cheaper than Walmart or Trader Joe's, but so much fresher!  It's just a blast to be able to walk around while shopping. Also, it's so worth it to come out here to see the Mardi Gras Parade each year.",
                "author": "Richa T."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2016-11-25",
                "description": "1st time visiting. Seemed like a cool place to pick up some groceries  but not as many onsite eat options as i thought there would be. We stopped in to check it out and hopefully grab some lunch. There was a cajun place that looked promising but the kids would never go for that. The bakery had some yummy looking treats but I was looking for nourishment. We were visiting from out of town so no need for groceries. This was lunch time on a Wednesday so maybe better on the weekends?",
                "author": "michael w."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-05-31",
                "description": "My girlfriend and I came May 21 to do a little produce shopping after lunch at Tucker's Place.\n\nThis time of year, the market is not full. Yet, there were plenty of merchants selling a good variety of produce.\n\nWe snatched a parking place near the front door without a parking meter . . . where the yellow no-parking line was so faded and obscure, I could have disputed, should I have gotten a parking ticket, which would be expensive in St. Louis.\n\nAll the merchants were so friendly. She got cherries, tomatoes, potatoes, grapes, avocados and probably four other things I don't remember.\n\nI didn't get anything. I was just watching. BUT I have to be careful of how much I get of anything, otherwise it will be wasted.\n\nI've been here a lot over the years, and we've always had fabulous experiences. We came here a lot more when we lived in the city.",
                "author": "Patt C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-10-12",
                "description": "My favorite place in St. Louis and a mandatory stop when I'm downtown.  Summers offer a packed market with the freshest fruit and veggies in the city.  Also offers additional flea-market type finds (someone always sells Avon, incense, hats, earrings, T-Shirts, Sunglasses, etc).\n\nMake sure you hit Julia's first to get a Bloody Mary so you can sip through the market.  Inside, the spice shop is probably my favorite spot and it's open all year.  I never walk away without a new spice and a new recipe to try.  The staff has a plethora of suggestions and are more than willing to let you taste their mixes.  \n\nBring your own bag and cash - Some of the vendors take credit, but cash is easier and you don't want to take a chance.  Also, don't walk away without a STL  Bratwurst.  It's tradition!",
                "author": "Lacey U."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-10-19",
                "description": "I still love this market, my favorite Sat morning tradition when I lived here, prices are on par with grocery stores, but sometimes really good deals as well. Hopping around 930-1030, great people watching, grab an irish coffee or two, hit the mini donuts stand, now get your grocery groove on. Nice selection of fruits, breads, live animals off of produce row, food products and all kinds of knock off sunglasses, hats, etc. Greens go bad within a day or two, so plan accordingly.  Good Sat morning fun.",
                "author": "Jason A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-02-16",
                "description": "My visit was unplanned, and Mid-February but the selection was great and the place was bustling. Scored some free samples, saw some nice looking cocktails floating around, and I'll definitely be back to do some serious shopping.",
                "author": "Kerry C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-06-12",
                "description": "An ideal Saturday morning starts off by waking up early and heading down to the Soulard Farmers Market to get some quality produce. Skip breakfast because starting off early here will give you the best chance to get some of the best produce before its picked over, however don't worry there are many options for breakfast snacking from mini donuts, to pastries, and even Bloody Marys that will help you enjoy the overall experience even more. \n\nThe more often you frequent the market you start to learn the insider tips, from which vendors offer the best deals. There really is no need to haggle here, because the prices are very fare however the market can get crowded, so be prepared. Be sure to bring cash, while some vendors take debit/credit many do not. Inside the market there is a spice shop and butcher shop, the butcher shop sells the usual items, however you can often find more exotic items, I noticed one trip that they were selling \"coon\", No thanks.\n\nBefore leaving Soulard I highly recommend making it a experience by stopping by Globe Drug and browse their selection of a little of everything, and no trip would be completed without finishing off your trip with Bogart's for some quality BBQ.Such a great experience, surprised 0t has taken me so long to write a review.",
                "author": "Brian M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-05-08",
                "description": "My favorite farmer's market in the STL!!!! It's an experience in and of its self. I love the various venders with all their wide variety of goods. Of course parking is sometimes a challenge, depending on arrival times and events down in the area. \n\nSome of my favorites are the mini doughnut stand with their hot out the fryer cinnamon/sugar doughnuts. The newest fave is the nut man with the coated pecans, almonds and cashews. The cinnamon pecans are delicious!!! I can't wait to try his other flavors once I get past the pecans. We enjoy the beef sticks from the lady in the second aisle slightly down the way and across from the homemade pasta stand, along with the pig ears for our 4 legged baby. The spice shop is a bustling wonder if you can get in. I love  seeing the regular vendors but get excited to see what the newbees  are offering.",
                "author": "Stacie W."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-06-18",
                "description": "Love coming here. \n\nI love the fresh produce and usually the prices are great too. But seems to vary wildly from vendor to vendor. \n\nI usually grab some bacon from Harr Farms in the Northeast wing. For something different try the jowl bacon. \n\nIn the Grand Hall (center-inside) Soulard Spice Shop is amazing. And the prices are incredible. Beats Penzeys by a mile.  \n\nBut on the weekend the Pièce de résistance is just people watching. Entertaining and free to boot.",
                "author": "Gregory P."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-12-06",
                "description": "This place really brings out my true colors. I enter with the intent of buying fruits, veggies, and lean meats for a nice, well-rounded diet. I exit with beer, mini donuts, chili dogs, and cinnamon encrusted almonds in my stomach.\n\nMy biggest regret in life is that I haven't done enough day drinking at the Soulard Farmers Market.  First off, the people watching is first rate. Second, a 16 oz beer at the concession stand by the main entrance is only $2!  Really everything is cheap there.  My go-to food is the $1.25 hot dog with a giant ladling of chili for $1. \n\nOne interesting aspect of this market is how they don't really sell much locally grown food. Unless the Dole and Red Delicious family's live around STL and have several stalls setup here. Then there's nothing but homegrown produce. \nI'm not sure how the logistics of farm to market work but I figured I would see an old man dressed in overalls with a strand of wheat sticking out of his mouth selling his own batch of apples. \n\nMy favorite booth(not booze/sweets/chili dog related) is absolutely the meat booth with the high quality sliced turkey for $5.99 a pound. Schnucks sells comparably tasting Boar's Head turkey for $10.99 a pound. Boom...deals!\n\n\"Go for the produce, stay because you're getting buzzed\".  That's my Soulard Farmers Market motto.",
                "author": "Scott S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-04-28",
                "description": "I love coming here just to eat all the ready-made hot stuff available Juan Hot Tamales, Gus's pretzels, gumbo, donuts, Mung Bean balls, meat on a stick! All over it while I take in the produce and local vendor items for sale! Yum lychees!",
                "author": "Stephanie K."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-09-08",
                "description": "I have not been here for years and it is not as exotic or interesting as I remember.\n\nWe got some good prices on fruits & veggies after searching around (some of the inventory is not the freshests so be careful).  Some places, I thought, had great prices then a few stalls down I would find a better deal so shop around.\n\nThe indoor butcher took FOREVER to be waited on & cut the porter house steaks, but I lucked out & got put on babysitter duty for a friends 5 year old girl.\n\nIs it nice to buy from individuals in stalls with competition right next door? yes\n\nHowever the \"flea market\" items seem to have taken over some areas & I do not think the selection is as wide as I would like.  I want to return & stock up on seasonal produce & not expect much more.",
                "author": "Dave F."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-02-28",
                "description": "During the winter months, parking is a dream. It takes all of 2 minutes. Unfortunately, during those dreary, cold months, the vendors are not as abundant as the warmer months. Regardless, I will come here when I can for my new juicing addiction. When I started, I went to the commissary, Walmart & Target and never saw the true appeal of juicing. It was expensive and frankly, the fruit/veggies weren't that tasty. My co-worker mentioned going to the Farmer's Market and I figured it was worth a shot. After the first venture out there, I was hooked. Everything was so cheap, fresh, delicious and LOCAL! \n\nI have my personal favorite vendors, but really, they're all amazing. They're more than willing to tell you all about their produce or just chit chat for a few minutes. I've yet to meet an unfriendly vendor.\n\nWhat sets this apart from normal grocery shopping? You can make a stop at their drink stand, order your beverage of choice (I do love a good bloody mary on Saturday morning) and make your rounds. Getting your groceries is so much more enjoyable with a delicious, cheap drink in your hand. \n\nI could go on and on about how phenomenal the Soulard Farmer's Market is, but you really have to experience it firsthand. They have meats, spices, chocolate and produce galore. You'll find things you never knew you needed here. Just go.",
                "author": "Anastasia T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-01-21",
                "description": "From dreading going here with my parents for fresh produce as a child to being able to tolerate going with my girlfriend to now excitedly waiting for Spring and Summer for the peak market browsing seasons, Soulard Farmer's Market has been an acquired taste for me. \n \nI recommend coming here early in the morning on the weekends for the full effect of the hustle and bustle of a market at work. Sure, it will be more crowded, but the aura of the place and the unique people will make it more than worth it. \n\nThis is your typical farmer's market, with fresh produce, herbs, meat, and some various other \"household\" items like soaps and candles.\n\nYou will hear vendors trying to get your attention and yelling \"TOMATOES!,\" or \"STRAWBERRIES!\" louder than you've ever heard anyone yell the name of a vegetable or fruit before. \n\nBesides produce, you will run across a stall with livestock and animals like chickens, turkeys, and even bunnies all in the middle of the city. \n\nBefore long you will be trying to bargain with the vendors for the cheapest prices. Even later, you you will become a professional and do a complete walk through just to check out which vendor has the freshest produce with the best prices before buying. \n\nIf you get hungry while perusing, you can check out the multiple tiny food vendors that offer a delicious burst of energy. If you're craving something more sweet,  you can indulge in some of the pastries from the bakery in the middle of the market called \"Pekara.\"  Or if you're more in the mood for doughnuts, there's a tiny doughnut vendor where you will find yourself staring in amazement at the ingenuity of the machine that makes those tiny, cute doughnuts.  \n\nIf all of this doesn't convince you to come here, there's also alcohol. Get a freshly squeezed bloody mary or a margarita and you'll be forced to fall in love with this place.",
                "author": "Armin Z."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-04-26",
                "description": "Soulard is one of my favorite places to get produce. I don't look forward to shopping for food at a grocery store. I think I spend less when I go to farmers' markets. Perhaps it's paying at so many different stands that discourages me from selecting everything that catches my eye. Moisturizing orange lotion, an herb, some fruit, and romaine lettuce filled my reusable bag. \n\nI was hungry when I arrived at Soulard this morning. This hunger plus a barking vendor led me to a slice of warm Dogtown cheese pizza (the first such purchase of the season, quoth barking vendor), an apricot and custard pastry, and lots of samples. You know what happens when I go to the grocery store while hungry? I buy three frozen pizzas and a bunch of other stuff I eat while the pizza heats up. Soulard inspires me to buy and eat healthy. \n\nThe downside to Soulard is how busy it is on pleasant days at mid-morning. At times, it's difficult to walk. You'll bump into people, and people will bump into you. I prefer earlier in the morning or later in the afternoon when some vendors drop prices.",
                "author": "Maggie H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-02-18",
                "description": "Love , love , love it ... the Bloody Mary's you're referring to are at Julia's ...... Definitely all walks of life . Outsides sometimes say it looks a bit \"hard\" but it's a very safe place . Best time to visit is spring and fall if u don't like the heat . I personally love the summer time there is always some sort of Festival going on . Christmas time can be magical , it's truly beautiful . I remember going as a child and my mother wld always go to the spice shop , I hated it the strong smells . Now those same smells bring me comfort and welcome memories of my childhood .... Ask a local about globe . It's a store that's watches generations of local kids grow up . A great place for souvenirs and super duper inexpensive . They make their own candy and sweets unbelievable prices ...  Bring everyone home some delicious treats from the world famous Globe drug ...",
                "author": "Cheroity C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-10-22",
                "description": "I am no expert in this place and have only visited a couple times. But both times I've had the opportunity to walk through, I've fallen completely in love! This place has everything!! Produce, meat, fancy confections, wood chips for smoking meat, hand-knit gloves and hats, fresh baked bread, fresh doughnuts and the list goes on and on! I look forward to going back sometime soon and really spending time there and treating myself to some goodies!",
                "author": "Katie H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-05-10",
                "description": "Love this place. I try and go early on Saturday mornings. Saturday is the best day to visit this market although it is open Wednesdays through Saturdays. \n\nIt's great for people watching, listening to street musicians, fruits/veg, plants, flowers, bloody Marys,  meats, spices, hot donuts, and much more. \n\nSome vendors sell produce that's isnt top notch but as a regular, I know to avoid these sellers. \n\nVery friendly people here.",
                "author": "Peter B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-09-29",
                "description": "This was my first trip to the Farmers Market and boy was it an adventure?!\n\nI wasn't sure what to think when I first walked in.  The smell of produce and meats filled the air, and for the most part made me hungry as we walked thru the market.  I was immediately upset that we didn't pack more than six dollars in cash for the stop, but it was unplanned to say the least.  We were in the area to look at bikes, but when the bike shop was unexpectedly closed, my wife convinced me that a walk through the market could be fun.\n\nSo, with no cash to really spend, we were destined to just be window shoppers, right?  Not necessarily.  Thanks to iphones and the Square app, several vendors were able to take our debit card and we were able to bring home a few little goodies.  A friend of ours found out we were there and he came by as well, and we got to see him in action as he bought a weeks worth of produce, including several dozen apples for a dessert he was making for a party he was attending later that day, all on a $20 bill.  (he even splurged to buy a gooey butter cake from the bakery just so we could try it)  \n\nAll in all, the Soulard Farmers Market left quite an impression.  Grocery shopping is such a drag no matter where I go, and the SFM is more than a 30 minute drive for us, however, between the prices at Whole Foods and the lines at Shop N Save, the experience and the savings (not to mention the healthier alternatives to canned cooking) I think the SFM might be the best option for the wife and I.  It is a day out, time well spent, etc.  \n\nI look forward to our next trip, and hope to make it a regular one to boot!",
                "author": "Dennis S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-10-30",
                "description": "Always a great place to pick up some produce. Prices are beyond reasonable and most of the vendors have very high quality produce. You can grab snacks and drinks (even alcoholic) to fill you up while you shop! You really can't beat this place anywhere else in St. Louis. Make sure to bring cash, it makes everything easier! Some vendors take cards and there is an ATM but it charges you to withdraw.",
                "author": "Joanna S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2017-09-03",
                "description": "Love coming here! Such a big variety of produce! People are so friendly. Just wish it was easier to tell what's locally grown and what isn't.",
                "author": "Amy And Bryan J."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2015-09-12",
                "description": "This is NOT a farmers market.  End of discussion.  This is a knock-off food flea market where you by the SAME EXACT food sold in a grocery store at a slightly lower price.  I am sorry but a farmers market in the middle of the USA should not be selling pineapples and coconuts.\n\nThat being said the Spice Shop located inside the market is one of the best places to shop in Saint Louis hands down.  I will walk in, go directly to the Spice Shop, get what I want, and then walk straight out.\n\nBe a tourist for a day and go just for the sake of saying you have been. But if you are looking for homegrown local food, try one of the other community farmers markets around Saint Louis.",
                "author": "Stefani W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-07-25",
                "description": "I haven't been to many famers markets in my day but out of the few I've been to, I must say this one tops them all. they're super affordable which is a huge plus! their produce has never disappointed me! I love walking through and going to the best stand in terms of quality and price. they also have a donut stand that makes fresh donuts as you stand there!! they have stores that sell flowers, spices, sweets, etc. \n\nbring cash and a cart! you won't regret it!",
                "author": "Christine C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-04-22",
                "description": "This market is still my favorite in the city! I may be biased since I live within walking distance, but I don't really think that matters. The market has everything I could ever want when visiting a farmer's market. I love how I can go here with a $20 and come out with 2 giant tote bags filled with produce, bread, and sometimes pasta! \n\nThe more I go visit the better I get at knowing which vendor to buy from. I also found my new favorite vendor-the potato guy! He literally sells potatoes and that's it. I purchased a few sweet potatoes from him (he even offered a white sweet potato). I think he grows them in his own personal garden or something because they were dirty and roots were still attached, but whoa, they were the best tasting potatoes I have ever had. No lie. \n\nI am thankful to have such a great farmer's market in the area and I will continue to support it as long as I live here.",
                "author": "Mandie B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-07-18",
                "description": "THE BEST FARMER'S MARKET I'VE BEEN TO!!! There's a wide variety of produce and other goods, such as bread, spices, and soaps. Multiple farms set up their own booths and display their goods, and their prices are so much better than any store! I would recommend looking at multiple booths before buying because their prices may be slightly differently, usually only by about 5-10 cents. I've gotten half a pound of mushrooms for a dollar, 5 red bell peppers for $2,  4 bananas for 40 cents, a zucchini for 55 cents, and potatoes for 85 cents per pound. I've been here twice, and both times, I didn't spend over $20. I normally would spend at least $30 for a week's worth of groceries at a grocery store. There's also a booth that sells hand made pasta, which are infused with different flavors, and it's $5 for a bunch, which was about 4 servings for me after adding other toppings. The greatest part about their pasta is that you just don't have to add sauce because there's already so much flavor in the pasta. You can just cook it and add some butter or olive oil and some toppings. \n\nI definitely recommend coming here if you have to go grocery shopping in St. Louis!!",
                "author": "Sharon C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-12-18",
                "description": "Unfortunately we came to the market right they were shutting down so a lot of vendors were packing and were already gone.\n\nBut it was a blessing in disguise, because a lot of the fruit vendors were offering all sorts of incentives to rid of their stock so they don't have to bring that much back!  Apples are usually $1/lb but they were offering $1 for 2lbs and they were selling boxes of berries for really low price too.  Even heard a vendor trying to get rid of their vegetables by offering them in bunches.  Awesome.\n\nThere's also a butcher shop selling the usual, along with items a little more odd to me.  Wild game like biso and 'coon, as well as shark steaks and alligator.  Yes, racoons.  Wonder how that taste...?\n\nThere's a spice market inside and it smells amazing.  Saw a bunch of hipsters there buying cinnamon sticks. \n\nThere's also vendors selling items like clothing, incense, and soap.  We stopped by a vendor that sold soap and got two bars just to support to local vendors.  Didn't hurt that the soap had really unique combination of fragrances haha.\n\nCloses fairly late for a farmers market and they don't open on Sundays.",
                "author": "Duke C."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2016-11-16",
                "description": "A bit of a disappointment, maybe it was because we didn't go on a weekend?  We went on a Friday morning, only about 1/3 of the place was open.  The produce didn't look that fresh, nothing seemed to be locally grown.\n\nGetting there was a bit of an adventure ... \n\nI did manage to get a pretty good Bloody Mary though ... nice, and strong.",
                "author": "Jill B."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2012-07-23",
                "description": "To basically repeat what Kat V. wrote...\n\nYou can't get local produce from our \"local\" farmer's market. It frustrates me that vendors will buy their produce from one single whole saler and then resell it to you. They just purchase the food to sell at a higher price to the public. It's a complete sham and bullshit! I think if you're going to be local, then sell your local items. \n\nI went home last weekend to TN and got real LOCAL produce. The farmers themselves were selling what they grew. Their own crops, their own meat, their own breads that they made. I hate the \"fall off the back of the truck\" type sales. You can see the difference in the quality of food versus what was home grown. Plus if you don't eat what you purchase immediately, it will go bad. Think shelf life of 2 days max. Soulard Market has a lot of that.\n\nI like the historical significance of the market itself and the fact that it has such a vast selection of items. However, why I would I make a special trip here to get \"local\" produce when it's not their food and it is upcharged. If I want organic, I will go to Whole Foods or even Schnuck's. \n\nIt really does disappoint me. It doesn't meet my expectations, and I didn't think my expectations were that high to want quality grown food from a farmer's market.",
                "author": "Mary Kate A."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-09-02",
                "description": "Day 353: St. Louis Road Trip: Soulard Farmers Market: I must be spoiled from Cleveland's West Side Market, though honestly this place only suffers by comparison. Of course, I've yet to find a stand selling bottles mysteriously labeled \"Ghetto Sauce\" in Cleveland, so that alone is worth an extra star.",
                "author": "Patrick A."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-02-08",
                "description": "Our first stop was a Julia's for a Bloody Mary. It was nice to walk around the market sipping on it while I shopped. I made a mistake of not bringing a reusable bag to carry my purchases. I had $20  in my pocket. I got a Bloody Mary $4. Some asparagus for $2. Some grapes for $2. Some strawberries for $2 and an eggplant for $1. Yes all of these bargains for $11, I had money left in my pocket. I guess I should have gotten myself some flowers.... Next time.",
                "author": "Tina S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-11-19",
                "description": "Forget about your \"neighborhood\" pricey farmers markets...ie Kirkwood etc...Soulard Market is worth gettting out of the comfy confines of the suburbs.  As City as it gets...and for a reason.  This is the original. I have been going here for geez...45 years (with my dad when I was little).  \nAlways pick your own produce...and ask to see what is high up in the stand...not what is right in front of you  (a tip from my Dad from years ago)\n\nThis is the true deal.  Don't hesitate to barter here...on anything.  Don't buy the first thing you see produce wise.  There are tons of options.  We love it for the produce, seafood and flower prices are great You can get STL touristy stuff as well\n\nIt is just a great place to go and visit...wether you are buying for th week or just going for the experience.  We love the kettle corn for sure.  Usually get a bloody Mary when we walk in...how much better can it get than a cocktail while you shop.  Last week we got some great Andouille sausage for some gumbo!\n\nIn the day...my dad would take me to Soulard first and then to Missouri Bakery on the hill for the bread for the week.  Some many great things to see and its all so close\n\nAnd you are supporting local farmers.  Don't forget to hit Bogarts for some great BBQ when you leave or hit one of the great other restaurants in the area.",
                "author": "Mallarry D."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-01-12",
                "description": "You don't know what you've got til it's gone!\n\nSoulard Market was always our favorite -- we visited at least once a week, if not more. We loved all of the vendors, and knew it was a gem... but didn't realize HOW much of a gem it was until we moved out of state.\n\nMoving to \"farm land\" in the southwest, we weren't worried. We just knew there'd be markets ALL over that would be just as great as Soulard.\n\nWe were wrong. While the area is a bit shady at night, during the day it's fine and the parking situation is pretty cool because there are always tons of spots (bring change or a debit card, as it's rarely free parking).\n\nThe food vendors are super sweet and the goods are all reasonably priced. Try some hot chocolate if it's cold out, or a snow cone if it's summer time. Don't forget to try the mini donuts... they're delish.",
                "author": "Sadie L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-03-25",
                "description": "My favorite place to get all my fresh fruit and veggies for the week.  You can go in with $20 - $25 and get almost more fresh food than you can carry back to your car!  The prices are great for someone on a tight budget.  Get there early bc it gets REALLY crowded.\n\nAlso, I love the mini donuts that you can watch as they are being made!  I cant pass these up, must get them every time I go!",
                "author": "Samantha W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-06-14",
                "description": "Oh my gosh I LOVE this place!!! To me this is one of the best parts of St. Louis! This farmers market is amazing! Plenty of parking available and you can always find something new! The produce is very reasonably priced and you can find some of the best quality harder to find items. It's awesome that you can get a drink or two while browsing the market makes it even more enjoyable. The inside meat market is awesome and again reasonably priced. We lived in the south before and love that we can get some harder to find meats and seafoods here. The spice shop is also great, I can't imagine not being able to find what i want In here. There's also a lot of ready to eat foods like tamales and a bakery that has lots of delicious treats. Obviously you can tell I love this place and rumor is they might start opening on Sunday's which would be awesome!",
                "author": "Kate F."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2016-06-05",
                "description": "Soulard Farmers Market has a lot of things going for it.  Most of the produce that is sold there is excellent quality but they do have some vendors selling things where the quality is poor.  Strawberries are the most hit or miss.  I would be especially wary wth berries, citrus, pit fruits and some root vegetables.  There are some good bread places, Bateje Farms Cheese and you can get farm cured bacon, farm fresh eggs, ducks and rabbits for a very good price.  The northern facing stalls seem to have better quality than the stalls on the southern side.",
                "author": "Ryan B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-05-26",
                "description": "I had heard mixed reviews of this farmer's market and admittedly, when I first heard of it, it was about 2~3 years ago and I had vowed to one day go there. As my interest in cooking my own meals fluctuated with the months during my college years, I finally opted to check the place out. But I never did. WHY?! WHY DID I NOT GO? \n\nFast forward to today. I am leaving the Yelp gathering in Clayton when I suddenly recall as I am driving back toward I-170S ramp that I had seen white tents being set up and remember seeing a sign about Clayton farmer's market which opened at 8:30am. After a brief stop there, I was feeling a little unfulfilled. That's when I decided to plug into my GPS thing the Soulard Farmer's Market address. I crossed my fingers, and then proceeded toward highway 44E. When I finally got off the ramp at 7th street, I was little nervous. Saturday almost-afternoon at Soulard Farmer's market? Parking is going to be a f**king NIGHTMARE!\n\nUgggh.\n\nSo I made a snap decision to make a right on Lafayette and I am SO glad I did. Literally 3 cars were leaving their metered spots at once. I waited patiently with my signal on until I scored the spot. AND the meter even had over 1.45 hours on it! Holy crap. The Powers That Be hath smiled upon me today!\n\nWalked over to the market with my reusable grocery tote in hand and determination. Realized how effing big the place was. Started to freak out a little because the high today was supposed to go up to 99 degrees and all they had was a fan going. Luckily it was still morning-ish and not too hot. \n\nSaw Cherie O's review about $5 bouquets of roses so I immediately made a beeline for the florist. I thought maybe there might be more than one florist here...so maybe I shouldn't buy anything right away if I see it. Went inside florist and realized the bouquets were actually $8 or $9 which still isn't bad but I don't think it was a dozen roses either. EDIT: they are sold by \"Pat\" near the petshop.\n\nI didn't really *need* roses but they smell and look nice and when you're done you can use them for other things like dropping them in a warm bucket of water for a foot soak (the natural oils in the petals will soothe your feet!)\n\nDecided it was time to check out the produce. Noticed an amazing-looking spice shop but it was PACKED wall to wall with people. Jesus Christ. I decided to avoid.\n\nHeaded down first aisle, and realized this place reminds me of the Daytona Beach Flea Market (not a compliment, BTW.) Saw a HUGE looking carrot for only about 50 cents at one stand, so I bought it along with a HUGE squash. This stuff can't be naturally grown...can it? Only genetic altering can yield such a massive vegetable! Also I suspected a lot was not grown here as some things were clearly marked with labels stating \"grown in California!\"\n\nKept walking down the aisle and found a booth with fresh cherries. 1lb for $3. The cherries ended up not tasting as sweet as I'd hoped but still not too bad of a deal. \nAlso found some peaches that looked really gorgeous at another for $1.50. Wow! A buck fitty for about 6 delicious looking peaches? Count me in.\n\nI kept on moving until I got to a place selling seafood. Looked uber sketchy and the shrimp smelled rancid every time the guy opened the cooler but I noticed a frozen lobster tail for $7.99 and it looked sizable. So I opted for that. I cooked it tonight and ate it with fresh drawn butter and lemon juice. Soooo tasty and very very easy to prepare. But the amount of meat was still really too small to make a meal of it. Damn lobster being so expensive. But it was okay. I wouldn't have touched the other fish that guy was selling. If it was frozen, maybe.\n\nThere was also a pet shop with cute looking animals but it looked really grungy and the smell was about enough to send me into a sneezing oblivion. Somehow I feel like this would be a place to incite anger in uber-crazy-animal-loving-people. You know the kind who work at shelters who so much as snap at you if you look at a dog or cat with the evil eye. LOL yeah. You know what I'm trying to say here.\n\nMoving along, I wanted to buy an avocado but no one seemed to be selling. I asked a random stand just to see if they had any, and he paused for a moment and said, \"well, yeah....we have some...in crates in the truck...let me get a couple for you.\" I told him I only needed to buy one, but he returned with two avocados and gave them to me for free. FOR FREE. Cheap as free! But I didn't notice until I got home that they were rotten. EW. WTF?! Why would he even do that? I guess maybe he thought they still might be salvageable? \n\nAnyway I think I would return to get cheap produce but that's about it. Nothing else seemed to be screaming \"bargain\" unless maybe the prices are reduced everywhere on Sunday. I didn't even go down the aisles with clothing.\n\nAlso does anyone find it disturbingly hilarious that the meat/butcher shop has a sign saying \"LOOK FOR PET SHOP IN AISLE X\" ?! I mean, really..WTF",
                "author": "Kate B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-10-21",
                "description": "We really enjoyed the market.  We found the fruits and vegetables to be cheap and fresh.  We even picked up some kale to try for the first time!  \nI did think it would be a bit bigger with more meat and fish selections.  We went on Saturday afternoon and didn't see too much else other than produce but that was not a big deal for us.\nI agree with others, bring your own bags and have your dollar bills ready when purchasing to save time.  Oh, and leave the animals at home!  \nWill choose the market over the big grocery store any time even if the produce isn't from local farmers.",
                "author": "Daryl H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-03-05",
                "description": "Went on a Saturday afternoon for the first time in 30 years.  What an amazing place it has everything you could want from a farmers market.  The vendors are great and prices are unbelievable.  You will not be disappointed come here as often as you can and support a St. Louis treasure!!!!!",
                "author": "Paul T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-08-04",
                "description": "I love this place! \n\nAs someone new to the Stl area it's hard to find good grocery shopping. This farmers market has everything at a fraction of the price you'd pay at the big stores.  \n\nI'll never buy groceries at the store again.  \n\nAll the vendors are great and you can find practically anything from veggies to bread to soap. Going at the end of the day on Saturday is great cause you can get deals on unsold items but they might also have sold out by then so it's a risk.",
                "author": "Brandon A."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-09-01",
                "description": "Went on a Friday morning, very little crowd. Lots of colors and scents, plus you feel good getting fresh veggies at a decent price. Some good eats and other local things too. Just wish I lived closer so I could come here more.",
                "author": "Amber K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-04-21",
                "description": "Different people and different foods!  Each stand has a personality and flavor all its own.  There are many farmer's markets in St. Louis. There is only one Soulard Market.  Stop at the pet shop and look at the rabbits then walk down the lane and order rabbit for dinner!",
                "author": "Anthony A."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2017-09-30",
                "description": "Be careful if you have a service dog. We encountered a National Park guard today, an older man with white hair, and he questioned us about our medical seizure dog to the point of harassment. Besides clearly violating federal law in his questions and statement in front of a group of people that he was certain this was not a service dog. Our service dog wears a red vest and has clear patches on the vest indicating he is a medical alert dog. This is not required by Federal law, but I do so to educate others about service animals. I asked the guard if he would like to see his paperwork I keep in the zipper pocket of his vest, he ignored me and kept saying he wasn't a service dog. People in the crowd started saying things to the guard and he finally walked away. We had made multiple purchases, we were carrying bags, I was trying to purchase more produce when he approached us, and instead of continuing, I asked my husband to leave. I know it is not the vendors fault, but this man needs to retire, and I will not return after shopping in this market for over 20 years.",
                "author": "Susan H."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2015-09-26",
                "description": "This service is really going downhill the only vendor I like is the Korean guy with the fish his name is Tim.. you get two and a half pounds of ahi tuna steak and snapper for 40 bucks in the salmon is $5 a pound with skin.. almost all the produce here is horrible and or the prices are outrageous.. I like this place two years ago but as of last year I started with all Aldi's and shop and save.. The Spice Shop is outrageous in price on some spices but they are great on others I talk to somebody today in the Gal said 10 years ago they started going downhill @ Soulard market",
                "author": "A D."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-09-27",
                "description": "Soulard Market has not changed very much over the years as far as what's available. I used to come here as a kid with my mother, and we always bought produce here if my grandmother didn't bring us anything from her garden on the farm in Illinois. \n\nAfter I spent time at the Hispanic Festival, I decided to check it out since it's been so long since I was there. I am planning on going more often. It was crowded since it was in the afternoon, but I had fun going up and down the different sections of the market looking at what they have to offer. \n\nI bought a pound of raw Brazil nuts from one of the vendors there; it surprised me that they had them since I have not seen them for a long. long time. I bought a pound of Brussels sprouts and a head of Romaine lettuce which I needed. \n\nIt's a good place to watch people and buy produce that is less expensive than the grocery stores for the most part. \n\nI think that I am going to go more often but earlier on a Saturday or on a Friday when it's not so crowded like it was today. \n\nParking today was horrifically bad, but the market was open and the Hispanic Festival was today, so that's probably why.",
                "author": "Derik E."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2015-09-15",
                "description": "Not much of an actual farmers market. I noticed a lot of the same produce that you would see at a grocery store. Bought some stuff from a stall that said they had a farm in Illinois. Once home, I saw the organic kale had a lot of dead bugs hiding in the ridges and the asparagus started dying within a day. The small hot peppers were delicious though. Given the inconsistency of the produce from an actual local vendor and how most of the other stalls carry the same stuff as grocery stores (or cheap pursues and sunglasses?) but likely older and more expensive I am unlikely to be back.",
                "author": "Adam D."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-10-06",
                "description": "I come here every Saturday when I am in town to pick up groceries for my return to Chicago. The pricing is truly incredible and the freshness up there. I think an under rated part of the market is the meat store. They have some excellent cuts of meat and great variety. The spice store is great. Raven the Wolf jazz singe is always a must.",
                "author": "John B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-02-23",
                "description": "Just wonderful! I do my marketing here every week, and this place gives me a terrific supply of fruits, veggies, spices, meats, eggs, and more!!!! Friendly vendors, terrific layout, and awesome prices!",
                "author": "Jenn Adele K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-02-04",
                "description": "Called Soulard Florist this morning and the most beautiful flowers were delivered to my daughter downtown within a couple of hours. We live out of state so I asked to send flowers with lots of color.  My daughter said she smiled all day looking at their beauty and they smell good!  She also said the paper the flowers were wrapped in was gorgeous too.  Highly recommend this florist.  Oh and when I asked how much to deliver she said no extra charge since it was only a couple blocks away.  What service!!",
                "author": "Kim C."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-07-02",
                "description": "Soulard market is a staple of life. I go here every week and basically buy all the food I need for the entire week for 2 vegans for around $40. \n\nI also take visiting friends here for a real St. Louis experience. \n\nThe produce is farm fresh, and reasonably priced. The place gets super crowded and is mostly cash only. There is an ATM. A few places also accept EBT. In addition to produce there are some stands with trinkets and gifts including an 'only in St. Louis' one. \n\nI love it!",
                "author": "Rebecca B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-03-04",
                "description": "One of my favorite spots in St Louis.  \n\nYeah, it's crowded, but I consider that part of the market going experience.  All the more reason to get there early (especially on Saturdays).\n\nEvery once in a while I like to treat myself to some of those mini donuts they fry right in front of you.  I am also having a torrid love affair with Baetje Farms goat cheese (http://baetjefarms.com/).  Seriously, if you haven't tried their garlic and chive coeur de creme yet, cough up the $8 next time you're at the market and try it.  You'll love it.  \n\nFinally, I've noticed certain sellers are starting to advertise the fact that their food is locally produced (I can't remember the name of their booth, but one family has a giant \"Locavores Welcome\" banner above their stand.  Their fresh asparagus in late May is the best I've ever had).  If you pay attention to the details, it becomes more obvious which booths are selling wholesale produce and which are local farmers.  \n\nSo yeah, set your Saturday alarm clock for early, pack your reusable bags and get going to the market!",
                "author": "Jessica C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-06-07",
                "description": "This was our first trip to Soulard's Farmers Market and I really liked it.  We went on a Saturday afternoon and most vendors were there.  The fresh produce was great and the prices were even better! Great veriaty - we boght some fruit, veggies, fresh pasta and bread. We live across ye river but I'm sure we will stop by at least one a month to stock up.",
                "author": "Mor W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-10-20",
                "description": "Very cool! Nice people and good products! The nearby area is also interesting. Gourmet and bohemian atmosphere.",
                "author": "Janiene S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-12-14",
                "description": "When I used to get up early on Saturday mornings, this would be one of my favorite places to go food shopping. By later in the morning or even afternoon, some of my favorite places have shut down and left. There are so many booths with great local products. Most things are cheaper than you can find in schnucks or even sam's club. Sometimes things are a bit pricey, but I love the act of walking through this area. \n\nThere are lots of people and a few booths have a great variety of mints and herbs. I'll definitely come back here!",
                "author": "Hao X."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-07-23",
                "description": "As Tim G. mentioned in his review, this is not the place to go on a Saturday if you want to have fewer than ten murderous thoughts about your fellow man before noon. It's crowded. It's narrow. The produce ain't that cheap. And just because you CAN bring your dog to Soulard Market doesn't mean you SHOULD bring your dog to Soulard Market. Unless you're waltzing him by the pet shop to show him what life could be like if he craps on the rug one more time, leave Fido at home. \n\nSo why 4 stars? Because it's Soulard Market. And you can appreciate it for all it's worth three other days of the week without entering into the granola/tourist/dog-toting hipster hell that is Saturday morning at the market.\n\nIf you want a satisfying shopping experience that doesn't require a battle plan, pick a Wednesday, Thursday or Friday. Hell, take the morning off. Get there early. Get the good stuff. Have some friendly conversations with the vendors. Maybe even haggle a little. But not too much. Don't be that guy. If the mini-donut place is open, spring for the dozen. Buy a few spices you've never heard of and make something with all of your fancy new produce. And don't forget the flowers. Or the cash. You're gonna need it.",
                "author": "Angela S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-09-12",
                "description": "Go to the Soulard Spice shop inside the market. I got 7 spices for less than 10 dollars! The folks behind the counter are knowledgeable and they had a wide variety of spices, many hard to find in regular grocery stores.",
                "author": "Jessica N."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-09-20",
                "description": "The only hipster bone I have in my body is my LOVE for going to Farmer's Markets and buying all fresh veggies, bakery items, pasta, etc.\nI wish they were open 24/7 for my every whim and craving.\n\nThis place gets me.\nFresh pasta, the greenest green beans, the reddest tomatoes and the SPACE. Yeah it gets crowded but it's pretty open and accessible.\n\nThe spice shop- oh my. I could just stand in there and smell up all the smells.\nI wish I my coffee cabinet looked like theirs- beans in every shape, size and flavor.\n\nHello, heaven!",
                "author": "Lindsey S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-12-18",
                "description": "I was blown away when I went to the farmer's market---it is huge!!!!!!!!  I loved all the different things they offered and the loose tea area was exciting and then they have very cheap bully sticks for your pets....for those non-pet owners (it is a dehydrated bull penis) When I was there it was really wild as they had a ton of what I would consider road-kill for sale ---beaver, possum, squirrel, just frozen on ice....apparently this is a good seller round these parts...I just had a fabulous time walking around taking it all in and seeing the people....would recommend as something to do at least once for the experience....",
                "author": "Lorraine N."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-06-19",
                "description": "If a fish had whizzed by my face, or there had been a few more people with giant SLR cameras glued to their faces, I would have sworn I was at Pike Market. More than just a farmer's market, Soulard Market caters to people wanting an experience. Music, food on a stick, and even booze await you as you wander through an open-air building full of vendors, some hawking produce (which may or may not be local), and some selling \"homemade\" crafts or other food items. Flavored pasta? Check. Loose tea? Check. Spices? Check. Ridiculously cheap flowers? Check. Native American dream catchers that were made in Vietnam? Check.\n\nWe went relatively early on a Sunday (10ish). We easily found parking within a block of the market, and I didn't think it was that crowded. You just gotta go with the flow and know what you want. You can't stand there for ten minutes debating if you want to buy a 3 cent apple or not. Also, have your cash ready, and bring your own bags. \n\nIf you need an entire case of tomatoes, this is the place for you. Take that, dollar menu.",
                "author": "T. M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-11-01",
                "description": "So, when can I move back to St. Louis because the Soulard Farmers Market makes me homesick! I would be here every week if I lived in STL. My car was full of all sorts of great produce and other unique food as I journeyed back home. I love seeing all the different meats that the butchers offer as well as the coffee/tea shop. We made the mistake of eating before we went. Don't do that, because you will inevitably find all sorts of stuff that you want to devour (or tastefully munch on as you shop). You can even buy pasta, local BBQs and other sauces, popcorn, and more. You must go once.",
                "author": "B C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-05-30",
                "description": "Everything about this place is great.  Lots of everything, well displayed and nicely priced.  (Tower Grove has some nicer boutique vendors, but their veg prices are out of sight).  Do both on a Saturday.  Soulard can get crowded, but that makes it more fun.\n\nYou need to have this on your list if you are buying your vittles or just a tourist.  Go to the Budweiser tour and then come here.",
                "author": "Michael G."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-07-04",
                "description": "Bought huge bunches of basil for on the cheap. More than one stall had available rabbits and duck so if you're looking for unique meats its a good place to check out. Also great to support local businesses.",
                "author": "Aimee W."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-09-29",
                "description": "This is an awesome farmers market. I go here every Saturday and stock up on produce for the week. It's is a lot cheaper than buying from a grocery store. $20 gets me all the fruit and veggies I need. The meat market is highly recommended as well. There is an ATM but bring cash since there's usually a line. Parking can be a nightmare so I recommend getting there early in the day. My only complain is that sometimes there are panhandlers and solicitors in the parking lots and it takes away from the quaint nature of the farmers market.",
                "author": "Sheldon M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-05-20",
                "description": "Awesome-sauce. Very crowded. Customers are rude. That does not reflect the market. What can't you buy here?! The food is amazing and we enjoyed ourselves. Prices were reasonable. You can buy food to clothes here and find a little bit for everyone even the hard to buy people. We will be back once things slow down a bit.",
                "author": "Why Lie .."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-06-09",
                "description": "I. Love. Markets. Open Air, fresh foods, lots of bustling people. Totally my thing. Soulard's market is terrific; the vendors are incredibly nice--one man gave my an extra pepper that was bigger than my hand, just because I talked food with him. The venue is clean and the stands are set up nicely; bringing your own bags is a great idea and make sure your arms are ready for a little bit of a work out if you're not shopping for just a few key items. \n  I enjoy coming here because it really does make a difference eating fresh, organic foods (and helps the farmers as well!) I got amazing honey on my most recent visit along with delicious, ripe, ginormous granny smith apples. Each time I come here I am more and more impressed with the quality and quantity that these vendors present for us. \n      Their small shops at the hub section of the venue are so unique (love walking through here and smelling all the diverse blends!) From ice cream to spices, they have a row of little shops to fit your needs, and I could sit around and people watch with a waffle cone in hand for hours! \n        I can't thumbs up this place enough--but really--so wonderful.",
                "author": "Briana S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-04-24",
                "description": "Best market in town by far.  You do have to walk the entire market to see who has the best deals and watch for the vendors that just resell grocery store items.  The local farmers are my favorite vendors!",
                "author": "Carrie D."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2010-02-23",
                "description": "SOULARD FARMER'S MARKET is a landmark in St. Louis. It somehow reminds me of an earlier time. I enjoy the vitality of the crowd and the variety of produce found here.\n\nHaving said that - I must say there is a recurring problem with produce bought here, and it doesn't matter the vendor.  It is not always fresh. Things like berries, bananas, green peppers, all went bad in like two days.   Apples and pears seemed to last longer.  I can only assume they buy the excess time sensitive produce that grocers are not willing to buy. \n\nI prefer to buy my produce from a farmer's roadside stand, where it is both fresh and ripe. Lesson learned.",
                "author": "Don V."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-04-26",
                "description": "A St. Louis institution for good reason.  We went down Sat morning and couldn't resist the prices - $1 for a bunch of asparagus? $3.50 for a pulled pork sandwich?  OK, I won't guarantee the quality, but it's cheap, and in most cases, you can look over the veggies carefully before you buy.  Keep an eye out for a reputable vendor - they are definitely there, anbd for me, they're kind of easy to spot.  \n\nIf you are looking for a place that's vibrant, this is the answer.   The poeple watching is tremendous and just checking out the different items for sale is worth the effort.  I love the way this market has pretty much avoided gentrification.  It hasn't changed much since I was a kid.   I saw another reviewer describe it as \"pretty nice\" but I wouldn't use those words...it's a little gritty.\n\nTips:  avoid it on warm and muggy days - too crowded and the veggies don't like it.  Also don't go if you're afraid of navigating crowds.   Beware of vendors trying to slip you a bag of lesser product from behind the booth.",
                "author": "Tom J."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-02-04",
                "description": "I love this place! There are things available here that you can't find at the local grocery store. (Plus fresh produce is a bonus!) My favorite things:\nFruit and Veggies: Super Cheap (if you don't like the price keep walking the prices vary and fresh green tomatoes to make my famous fried green tomatoes \nFlowers: They have Orchids and Calla Lilies which are few and far between\nHomemade Porkrinds: And you can taste them to see before you buy a bag\nFresh Meats: Some harder to find cuts\nAmish stuff: Bonus when I am shopping for mom\nVendors from hats, jewelry, rugs, clothes, etc. \n\nFridays are best for me since it is less crowded. In the winter this place is bare and has too many vagrants for my taste to even visit the few that are there. \nI knocked a star off for the discusting animal shop. Something about the smell of animal feces just turns my stomach while shopping for food.",
                "author": "Lesley S."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-05-21",
                "description": "My cousin loves this place so we went to check it out.\n\nLots of great veggies, fruit and yummy treats. A must if you are visiting!",
                "author": "Megan L."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-05-22",
                "description": "St. Louis Soulards Farmers Market is great for fresh produce and meat. I love it here every time I come to St. Louis I stop by.",
                "author": "B F."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-07-21",
                "description": "If you love fresh food...head to Soulard Farmers Market. You will be surrounded by freshness! Fruits, vegetables, spices. It's a busy place, but worth the effort to bring home amazing summer produce! \n\nTIP: Get to know the suppliers (farmers) for suggestions on different kinds of produce and seasonal buys.",
                "author": "Keith D."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2014-08-02",
                "description": "Amazing sites and sounds.  Fresh produce eggs cheeses. Parking is tight but people come and go so quickly it's not that big of an issue.  Extremely hectic and packed and I do mean packed with people.  Lots to see taste and smell.  Neat area",
                "author": "Beth P."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-09-06",
                "description": "I really like this place to get my produce, it is always fresh and ready to eat!  I enjoy walking the market and seeing all the affordable prices to eat healthy.  the weekend is pretty crowded so if you can its best to go down during the week.  you might have to feed a meter being a weekday but so worth the not so crowded shopping and quicker service.  even when they are packed they are extremely fast at helping you with what you need.\n\ni would highly recommend going here before a grocery store!!",
                "author": "Michael M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-11-07",
                "description": "I'm ashamed to say that I've lived in St. Louis for 26 years, and I haven't visited Soulard Farmer's Market until this year. I know! \n\nKaren G. and I visited a few months ago, mostly to wander the stands and snap pictures like tourists. But until this past weekend, I hadn't actually purchased anything from the market (unless that $1 jello shot counts? YES, they have jello shots at the market! Crazy, right?). \n\nAnyway, I arrived around 2pm on Saturday. Enough time for the major crowds to dissipate, but not so late that everything was picked over. And late enough in the afternoon to haggle! I recommend coming at this time to score some sweet deals. \n\nWhat kind of sweet deals, you ask? How about 7 pounds of Gala apples for 5 bucks? Or three HUGE bunches of kale for $3? 5 pounds of sweet potatoes for $3? Or maybe the five HUGE cucumbers I purchased for only one buck? \n\nI was like a kid in a candy store. It was quite amazing, and I'm super thrilled with the quality of the produce I picked up. If I had more hands (or one of those nifty carts I saw the regulars pushing around) I would have stocked up on more. \n\nThis was my first experience at Soulard, but it most definitely won't be the last.",
                "author": "Stephanie S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-10-30",
                "description": "Wish I could make it by here more often. One of the best farmers markets I have ever been to. Several different vendors with huge variety of fresh fruits and vegetables. Or if you wanted fresh meat, you can get fresh chicken , goat, lamb, rabbit. Or even live chickens and ducks if that's your thing. I love the butcher that is located there. As well as the coffee and tea shop. You can just feel the history of the place . To know the people have traded goods there for over 100 years.",
                "author": "Jason H."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-06-14",
                "description": "I have always had a love for open air markets, even when the weather is bad. This day, it happened to be the case. It was our first weekend back in town (I should state my first time period). I have always been drawn to these types of markets since I visited Pikes Place Market. \n\nThis was a nifty little market, even though we managed to get there pretty late in the day and it was the day of the big bad storm of the season. You know the one that everyone is still talking about, the caused a lot of hail damage. Yeah that's the one! So I probably did not see it at it's best. \n\nHowever, with that being said, when you walked into it, in the center. All I could smell was curry. Yummmm. I did love the prices and some of the vendors. We did not pick up anything to take because we had a few places to go. I like it and cannot wait to see it really bustling in better weather.",
                "author": "Becky M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-07-12",
                "description": "Ok. So here's the deal. I like people. I mean... I really, really like people. I really, really hate crowds though. So I avoid anytime after 9 on Saturday at Soulard. Some things you should know about the market:\n\n*The earlier you go, the better the produce (duh)\n*About half of these marketers are reselling grocery-store produce. Look around at everyone's merchandise before you buy. \n*Some vendors accept credit cards. Most don't. Bring cash.\n*I find the best merchants on the lower right leg of the H. \n*Do NOT bring your small children here. It can be a long walk, and there can be spontaneously thick crowds. \n*You will save a ton of money on your produce, and it is far better quality.\n*You will save a ton of money on meat, and it is far better quality.\n*You will NOT save money on bread or pasta, but again, yummy.\n*You will break about even with cheeses/eggs, and some of them are waaay better than store bought. \n*This is a great spot for tourist shopping if you like open air markets.\n\nI think that actually may sum it up for me. \n\nI get distracted in Soulard with all the yummies and shineys, and always wish I had brought a much bigger backpack with me. My favorite deal this Saturday had to be 4 huge, beautiful yellow squash for a buck. I practically squealed with delight.\n\nOther random tips:\nBring something to haul produce in. I bring a backpack, but people bring totes and little carts. Strollers work, too.\nPlease bring reusable cloth bags. C'mon. It isn't that hard, or that big of  deal. \nPark across the street in the bank parking lot. Otherwise you're going to be walking.\nPlan extra time to listen to awesome music.",
                "author": "Sarah D."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-02-08",
                "description": "I have been going here every Sat for the past 2 months now and love it. I always have to grab a bloody marry or a $2 16oz draft to get my shopping going. The produce here as far as I have seen is always fresh and the prices are amazing. I would suggest bringing cash because a lot of the vendors do not accept cards. There are multiple booths that sell food for you to eat while shopping and all of them have really good food. The hours here are pretty great but I would suggest going pretty early in the morning to beat out the crowds for the best produce OR a little before they close to get some deals on items. I always buy my bread later in the day because the guy that sells the bread always marks it down in price at the end of the day by a couple of dollars. The meat here in the butcher shop is pretty well priced as well and the quality is outstanding. This is a great place to people watch as well. All kinds of people show up to this market. They do quite a few events here on the weekends as well so you can check out their Facebook page to see what they have going on. This is a really great place. I will continue to go back.",
                "author": "Emily R."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2011-09-07",
                "description": "We happened to be in the neighborhood on a Sat afternoon and had yet to check out Soulard Farmers Market.  Being a \"Farmers' Market Afficionado,\" I saw it as my mission to check it out.  I should have read the reviews.\nWe showed up around 1:30pm and the place was PACKED.  And it wasn't packed with your typical hippie-clothed, broad brim hat-wearing crowd.  It was packed with tourists enjoying the numerous knick-knacks, hot dogs, and Egyptian cotton sheets that you'd not see at my kind of farmers' market.\nSure, call me a farmers' market snob.  I'll own that.  And it'd take a lot to get me back to Soulard Farmers Market.",
                "author": "Sarah S."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2010-02-12",
                "description": "This farmer's market is average, but it makes a good trip. It's crowded on Saturday which is when I typically have time to go. Lots of fruits and vegetables, and a mixing of arts & crafts, spices, meats and a couple of concession stands inside. \n\nIt still is fun going to Soulard, saving some money on produce and then spend the savings on a good meal in Soulard somewhere.",
                "author": "Christopher Z."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-01-03",
                "description": "My memories into even young adulthood are excellent of Soulard Farmer's Market.  As a child growing up in the 1960's many watermelon vendor's would give me jobs helping pitch watermelon's off the delivery truck onto the stand.  Good spending money.  The fresh produce and the meat and butcher shops were to die for at this fabulous historic site.",
                "author": "Bill I."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-04-07",
                "description": "Holy hell, they sell boiled peanuts in various flavors. I bought a pound in each flavor. \n\nAN awesome farmers' market. They sell a whole lot of produce, meats, and other stuff. We went here on a Saturday morning while visiting STL. It was a fun experience. \n\nThere is a real nice spice store inside and various meat vendors. There are also flower vendors and people selling baked goods. They even have someone selling freshly made mini-donuts on site. \n\nThe one odd thing about this place was a pet store. As Julia W mentions, it was filthy smelling. Lots of bunnies and birds crammed in to little cages. Poor things looked sad and painful. I called the city services and complained about the conditions in the store. There was bird and bunny poop everywhere. Not cool.",
                "author": "Krsna V."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-06-15",
                "description": "Hands down my favorite farmer's market. I love strolling through and checking out everything before finally deciding on what I am going to take home. The vendors let you sample some foods and are usually pretty happy to talk about their product. I like to grab a bloody mary when i go and other times pick up the made-on-the-spot mini donuts. They are so cute!! Overall, this place has everything and more, veggies, meats, spices, clothing & even rugs! If you live in St. Louis and haven't been here...YOU NEED TO GO!!",
                "author": "Sara R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-10-19",
                "description": "My wife and I had a good time. There are lots of different vendors and a good variety. Prices seemed pretty cheap.",
                "author": "Corey M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-08-22",
                "description": "One of the  best farmers market ! Only on Fridays n Saturdays ! I had one of the best iced Carmel coffee ! All their staff are friendly   And helpful !:)",
                "author": "Yanet M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-03-15",
                "description": "Cheap produce!  \n\nThat is really all that needs to be said.",
                "author": "David Y."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2009-03-17",
                "description": "If you want to get a true whiff of St. Louis, follow your nose to the historic Soulard Farmers Market.  Gosh, and while you're at it, hunt out the freshly roasted nuts located in the southwest branch of the market place (well that's at least where it was located when I was there).  Their toasty caramelized pecans were delectable and the best I've ever had!  Truly addicting!\n\nNot only that, but there's a HUGE variety of fresh fruits, meats, apparel, sweets, incense, soaps, jewelry and more!  It's not very crowded (and especially not so with tourists) and the quality/prices are better than you could find in any Schnucks or other grocery store.\n\nNow I just have to work on Chicago getting a year-round market!!  And I'm not speaking about Chicago's unique Maxwell Street Market...\n\nCheck out the Soulard Market for yourself: Wednesday thru Friday 8:00 a.m. - 5:00 p.m. & Saturdays 6:00 a.m. - 5:00 p.m.",
                "author": "Richie D."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-04-15",
                "description": "I love waking up early on spring and summer Saturday mornings and heading down to the Soulard Farmer's Market. There's not a whole lot to this open air market; it's basically an awning with vendors underneath it, but I get a great sense of community every time I head to the farmer's market. I like seeing familiar and new faces week after week; happy with their fresh vegetables, fruit, and flowers, thinking of what they're going to do with it all.\n\nI've been coming to the Soulard Farmer's Market for about three years now and I've never had a bad experience with a vendor (sure some are more talkative and friendly than others), bought a bad piece of fruit/vegetation (I'm fairly certain these vendors are meticulous about what they set out), or felt bad when I left. This is a great, leisurely way to spend a Saturday morning, and if you venture out, I'm sure I'll see you there.",
                "author": "Jennifer H."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-11-08",
                "description": "$5 dozen roses\n50 cent cilantro bunches\n20 cent avocados\n50 cent romaine lettuce heads\n50 cents for a pound of you-pick-them button mushrooms\n4/$1 bunches of green onion\n$1 cherry tomatoes\n$1/pound green beans\n$1/bunch asparagus\n$1 for a 5 lb bag of potatoes\n$1 for an eggplant\n$1 for 8 green peppers\n$1 for 5 zucchini\n$1 for 5 mineolas\n$2 for a seedless watermelon\n50 cents/lb roma tomatoes\n$1/bag baby radishes\n95 cents strawberries\n\nAmazing deals are to be found here. It's a place that everyone needs to visit at least once...just to see the atmosphere and people. And it's where a savvy shopper can get a lot of fresh produce for almost next to nothing. Definitely stroll around first and get a feel for what is available before you buy. Some produce is fresher than others so be sure to double check before you purchase. And sometimes, as it gets closer to the end of the day, the vendors will go down on the price. Definitely check out the meat market...the weisswurst is pretty good...and the spice shop, which probably has every spice known to man for relatively cheap prices, along with flavorful coffees. And don't forget to get your mini-donuts with your Bloody Mary!",
                "author": "Cherie O."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-06-15",
                "description": "What can you say about the Soulard Farmer's Market? Of course they have delicious fruit, food and good things to buy. That isn't why you go to this place. You go to the Soulard Market because of the history of the area and the building. A place that basically anyone should go to at least once a year to get some fresh fruit which is very inexpensive.",
                "author": "Nick V."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-06-23",
                "description": "A great place for a budget minded shopper who enjoys fresh food! You can get anything from gus` pretzels to fresh loose tea to a live chicken. I love going to the market to help support our local farmers and to get a healthier option of food. It's a lot of fun to go but I suggest get there early on Saturdays because it can get crowded.",
                "author": "Marie R."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2012-11-13",
                "description": "After going there for years I stopped going for a number of reasons:\n\n- I discovered most of the produce vendors there are not farmers, they buy their stuff from wholesalers at Produce Row. Not only that, but they buy the produce that's past its prime and that would otherwise end up in Dumpsters.\n\n- I can get fresher, cheaper produce at Aldi's without the crowds, the parking headaches, the bad smells, the drive, and the heat.\n\n- I discovered one of the vendors I trusted routinely added up my order wrong, always in her favor.\n\n- Unlike at stores, you can't choose your produce. The vendors almost always slip a few rotten pieces in the bottom of the bag.\n\n- Even if you've been their customer for years, some vendors are just plain rude and unpleasant. One particularly bad offender is George Simon. Even though he is a sub-deacon at St. Raymond's, he's profane and treats his customers like dirt.",
                "author": "John E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-09-22",
                "description": "Such a great spot to check out on a weekend. Tons of great seasonal produce and local items from Saint Louis. Best part is the butcher shop. It's one of the best places for pork shoulder and other meats in large quantities in town. Fresh meat, and they cut it right there for you.",
                "author": "Chip M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-09-18",
                "description": "A must if you live in the St. Louis area. Farm Fresh veggies, meat, pets and cocktails.",
                "author": "Tony S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-12-05",
                "description": "My husband and I visited to Soulard Farmers market last weekend for the first time, and were blown away. We got there around 10am and had to fight the crowds. Parking was difficult and vendors were really busy. We heard that if you can get there earlier it's much less crowded. We purchased delicious fresh pasta, avocados for $1.00, watermelons for $2.50, HUGE bags of broccoli for $2.50 and more. We will definitely be going back.",
                "author": "Sarah J."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-10-06",
                "description": "I am such a huge fan of this place.  I was deterred for a while due to some of the low-star reviews some people have given it.  After visiting a few times, I do see why some of the cons were listed, but it still doesn't make me stop yearning to go every weekend! \n\nIt does get crowded, but this doesn't bother me - I actually really enjoy the hustle and bustle.  Adds a nice vibe to the experience.  I agree that it is hard to distinguish local produce from wholesale produce.  But you can always just ask.  I've never had an issue with parking and I've always gone on a Saturday morning...I just park a couple blocks away, south of the market, and walk.\n\nI do have a complaint that some of the produce doesn't look very fresh.  But, there are so many vendors, that I can just walk to another vendor and find the same thing at better quality. \n\nThe produce is SO cheap that sometimes I feel like I should throw in an extra buck or two as to not rip anyone off. \n\nDairy and meat vendors are there too, but I haven't tried them.  I'm really not a dairy and meat type of gal, so I probably never will.  But a couple of my friends are really into buying stuff from those vendors because you can find some craaaaazy stuff: rabbit, raccoon, quail, goat, etc.  No thanks...but I hope someone else enjoys them!\n\nOne of my favorite vendors sells packaged food, such as wild rice, couscous, steel cut oats, quick oats, dried fruits, etc.  The wild rice is absolutely delicious and has such a great flavor!  I also tried the couscous with cranberries.  It's good too, but has a pretty intense, salty taste.  \n\nI enjoy seeing the random items that are being sold...Cardinal's memorabilia, sunglasses, purses, beautiful flowers, pets, bamboo (I bought some!!), etc.  \n\nYou can even buy food to eat while walking around - I have sworn to myself that I will go to the market hungry next time in order to partake in these delicious looking items!  Oh and alcoholic beverages are there too! \n\nGive this place a chance - even if you don't like it, you're sure to remember it.  There's a reason it's famous!",
                "author": "Trisha P."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2012-06-25",
                "description": "After several years living here, I decided to get my butt up one early Saturday morning to experience this market.  Boy was I disappointed.  Like previous reviews stated, there was a lack thereof of local produce.  When I think of farmer's market, I think of local produce & not produce from other states &/or countries.  I get that somethings just doesn't grow well here.  As other people have said, get up early to beat the crowds & get the fresh er fresher produce.  This market isn't that big.  There are some good deals (like $17.89 (methinks) a pound on rack of New Zealand lamb from the meat market).  Look closely at the produce or you can get ripped off.  That was my mistake.  Sometimes, it is much better to get some produce at the grocery store or at either Sam's Club or Costco.  Would I come back here, maybe but only for the rack of lamb, maybe a couple of plants &  maybe some dried locally made pasta & some bread.",
                "author": "Kat V."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-08-26",
                "description": "Man I miss this place.\nIf the cheap produce isn't enough to draw you in, the people watching will. It's a show. Always has been. \nThe crowds don't bother me as much now that I live in New York City (neither does the smell.......) and it is probably the best bang for your buck as far as fresh foods go. Parking is always a nightmare, but seriously, it's worth it. I walked around with my jaw agape at some of the deals. Seriously.",
                "author": "Lauren L."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2010-05-29",
                "description": "What a disappointment.\n\nI was all geared up to be in fresh fruit/veggie heaven this a.m. during my family's outing to the Soulard Farmers Market, and came away instead feeling like I just wasted an hour of my day.\n\nWhy, you ask? Because it seemed the majority of vendors weren't offering homegrown goods but stuff shipped in from elsewhere. Well, wtf? Okay, I get that it's early in the season, but that's no excuse for such low quality products. I couldn't believe some of the produce they were trying to get people to buy - the garbage can was the only place some of their goods belonged.\n\nIn addition, the setup of the market is far from conducive to any sort of crowd - because it's so small it's difficult to walk through and absolutely no air is ventilated through the long hallways. On an 85 degree day, that is NOT the way I want to spend my time.\n\nThe one highlight of the trip was our purchase from Baetje Farms - their sign announces fresh goat cheese made weekly, and based on the taste test of their offerings, it was obvious that they know what they're doing. It was some of the best cheese I've ever tasted. We ended up with the cranberry and cinnamon concoction as well as the garlic and chive version. With crackers, it made for a fabulous evening snack. I highly recommend seeking them out if you opt to visit this market - may just be the only highlight of your visit too.",
                "author": "cassie r."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-07-29",
                "description": "The market is just amazing. Makes you realize the quality you are not getting at a big box store.",
                "author": "John A."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-05-19",
                "description": "We went on an overcast Thursday, so it was the opposite of what it might be on a busy Saturday.  It was quiet, abandoned, with only half of the vendors present that would normally be there.  But the smell of fresh fruit and exotic spices filled the air - and the super cheap prices!  Yeah, you should make it out here.",
                "author": "Stephen H."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2010-02-23",
                "description": "I struggle writing this review.  I've been here a ton of times and it has so many wonderful things (the meat market and spice shop merit their own reviews).  But, as for the rest of the market...ehhh...\n\nFirst the pros:\n\n1) Bloody Marys available at multiple locations.  Win.\n\n2) There's another meat vendor that has wicked awesome Canadian bacon.  Seriously, it's incredible.  Next time we go, I'll verify the vendor's name.\n\n3) Pet store - yeah, it stinks at times, but when they have kittens or bunnies in the window, it's nice to stop and see some cute meat, er, animals.\n\n4) Flowers - there's an awesome flower place in there too which a great selection\n\n5) Prices - you will definitely save money on your produce...but....\n\nCons:\n\n1) Produce - we apparently have the worse luck in the world.  Basically any produce we buy, if not used within two days, ends up going bad.  This includes things from locals and wholesalers.  It has gotten to the level that we buy the meats and spices only here.  Sort of defeats the purpose of a farmers market.\n\n2) Fellow human beings - this is not the place to go if you have in innate hatred of those that have no concept there are others in the world.  Groups of 3-4 people standing in the middle of the aisle chatting and slowing down foot traffic?  Check.  Parents with their uber babymobile clipping your heel?  Check.\n\n3) Counterfeit/knockoff items - I don't give two craps that your purses or sunglasses have the disclaimer that they are \"inspired by\" a certain designer.  They're effing knockoffs.  Seriously, get this crap out of here.  I would rather have stalls filled with tropical items in February than see one more \"Goach\" bag.  (And no, my wife didn't make me write this part, I just can't stand seeing it)\n\nThere's a bunch of other good things here, but there are enough disappointments that I can't overlook.",
                "author": "Timothy G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-11-01",
                "description": "Three-and-a-half pounds of peaches, 4 ears of corn, 1 head of cabbage, 5 lemons, 4 large cucumbers, 3 plums, 1 celery bunch, 2 lbs. sweet potatoes, and 1 lb. carrots = $ 8.50.  Why do I feel like I just \"ripped off\" some people for their fresh produce with the amount I paid for all of it or did someone just under-price what I got?  I have now fallen in-love with visiting my local ATM and grabbing my reusable bags for produce \"bargain\" shopping at Soulard!\n\nCame here this past Friday (rather early, might I add) and 50/50 of the stalls were open/closed.  Everyone we encountered was patient enough with my constant changing of mind and insistence of them using my recyclable shopping bags.  I hear shopping is best early in the morning (they publicize opening at 7am) and I suggest going the furthest from your car and working your way back so you're not overwhelmed with all the great deals you got!  I plan to make this a frequent venue for most of my fresh produce needs!",
                "author": "Liz Z."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-08-05",
                "description": "A St. Louis landmark and historic institution that everyone should patronize for fresh fruits and vegetables!",
                "author": "Amanda H."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-06-25",
                "description": "First time here was a rainy, hot Saturday afternoon. It was a few hours before closing and a lot of vendors had packed up, but overall there was still a good crowd. The $4 Bloody Mary's are a must. The selection of produce was ok, I'll be anxious to see what it is like later in the season. I was looking for a good selection of local farmers/vendors and didn't really find it. There were too many people selling fruit and vegetables from California or Mexico. They looked pretty fresh, but I came for local food. The florist in the center had a great selection of boquets and overall the deals on produce were extremely reasonable, so I will definitely be back.",
                "author": "Mollie N."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-07-20",
                "description": "This market is amazing! I went in the afternoon and it was so hot and busy, but it was worth it. I got quite a bit of produce and other local goods. It was all really reasonably priced too. I got the mini donuts and they did not last long at all. There was also a gelato stand and a few local meat markets. I got some bacon and it was thick and flavorful, probably the best bacon I've ever had. I definitely want to go back!",
                "author": "Jacklyn M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-06-30",
                "description": "Fresh fruits and veggies... supporting small biz. What's not to love?!",
                "author": "Ann T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-03-19",
                "description": "Bloody Marys and Beignets, couldn't be better!",
                "author": "Allison C."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2008-04-16",
                "description": "I've gone here ever since I was a child so I have a bit of nostalgia for the place.  Inside the market there is this really great spice store that sells all sorts of spices, dry mixes, coffees and teas etc....smells wonderful too!\nThere is also a newer little stand that has jambalaya, red beans and rice chicory coffee, and beignets....yummy!",
                "author": "Crystal R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-08-06",
                "description": "I love this place. As far as farmer's markets go, it's huge! Plus, it has booze and baby animals - I mean how good can it possibly get?! Go here for the food, the people, and the experience. Parking is available in a lot across the street, but I always nab very close street parking.",
                "author": "Kylie S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-04-30",
                "description": "Bob's Seafood sells frozen Boudin... apparently some place out in Fenton makes it but I have yet to confirm...",
                "author": "Allan C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-06-16",
                "description": "I love the soulard market! We wake up at the crack of dawn everyday so to come here around 7:15am on a sat is usually best! Soulard is just cheap produce, i usually do not get anything on ice bc thats the produce that will go bad in 2 days. Each vendor has their own prices but dont be fooled by how cheap it is!!! Inspect it all! This is bargain hunting veggies!!! We only take $20 cash and make it stretch for some fruit but mainly romaine, carrots, fresh cilantro, ginger, etc. Add in $4 bouquet of lillies and a loaf of asiago bread (perfect for grilling bruschetta) my $20 goes pretty far here :) the meats ur not really getting a deal on...nor the fish...yeah just stick to produce here. Do know as the day goes by almost every vendor jacks up their prices so be warned! Otherwise stay out the way and bargain ur veggies!",
                "author": "Saucy G."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-06-17",
                "description": "Saturday morning....\n The crowds congregate, blend, form... here in St Louis... 9th and Vincent... Soulard. The spawn of the Farmer's market... a convergence, a flickering sepia-past, the holler of old immigrants, the merchants. I stand before the deluge of the crowd passing through tired entrance markers. The day is hot, and the whistle of the open air market hollows through the rows of stands. Her French roots have awoken, alive for the morning, a return to history... glistening... forming. The spice shops echo of the French Quarter... New Orleans... Americana. The colors vivid, penetrating, fruits, vegetables, red, green, yellow, orange, and the low dim of the overhead light flickering in the shade of canopies. The swinging of weight scales all working together like clockwork, feeding the rhythm. Spoken are the languages of merchants, channeling the old roar of immigrants...here they assemble; history is united. \nThe crowd pulsates, moving to an urban rhythm, flowing through the aisles like the Big Muddy. Alive are the blues, eminent, I see it in the eyes of the musicians. Ragged they situate, their stories alive again in old rags. \n I venture to the pasta stands, greeted by an Italian vendor. Her smile a pearly white, her hair, a contrasting onyx. Sweat softly streams about her face, the exchange is made. A flickering memory of old Italia. Her accent, a thick St Louisian. Her story is revealed. The chapters continue, her story, their story...our story.....assemble.... The chattering of old walkers, canes, and baby carriages, navigating their way through the confusion, the energy. \nLost in the fold I succumb to the end of the route, met by the familiar mold of the current. The arch is visible again. Defiant and silent in the distance it appears in my eyes. The concrete city, jagged, etched by the mammoth highway, and slowly the holler of the farmer's market whispers away. Fading...the energy concludes; dissipating into the soft hours of the afternoon.  And the now the agora is barren till next Saturday, ready to spring fresh...anew........again.",
                "author": "George N."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-11-16",
                "description": "Perfect farmers market..everything u need from livestock to fresh flowers..a stale of St. Louis history",
                "author": "Osunlade O."
            },
            {
                "reviewRating": {
                    "ratingValue": 1
                },
                "datePublished": "2007-10-06",
                "description": "WOW. what a massive, massive dissappointment. We were expecting fresh, locally grown produce. But, instead, we found nothing more than a supermarket without air conditioning. Just stall after stall of produce vendors. I'd rather go to Schnucks, at least I can catch up on Britney's latest exploits while I'm waiting in line.\n\nThe Wife was even more dissappointed - she pointed out the fruit stickers at every stall we passed. \"there's no way pineapple is grown locally. there's no way MANGOS ARE GROWN LOCALLY!\" she started to get pretty loud. \n\nIf you're like us, and looking for locally produced produce, meet us at  the Tower Grove Park Farmer's Market.",
                "author": "mike l."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-04-25",
                "description": "I love markets in general, and this is a pretty nice one.\nThe bf and I like to step in here to buy a few produce and fruits. You do have to look carefully at the stuff because not all of it is fresh. Also if you're going to buy fruits or veggies from here, you have to consume it fairly quickly since it doesn't last too long.\nThe prices are great though!\n\nWe tried the Tibetan bbq beef skewers they were selling and they were soooo good. We also got the mini donuts, that we watched them make. They were crunchy and perfect! My boyfriend ate 2 polish sausage hot dogs... yes, two.\n\nI just want to go back and eat in the little shops! My only con for this place is the amounts of people always standing in the way of everything. But I guess that's just my misanthropic alter ego talking...",
                "author": "Amrita R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-05-16",
                "description": "My budget is seriously thanking me since I started doing the majority of my grocery shopping at Soulard Farmers Market. It's been around a year since I first came to Soulards and I don't see myself stopping anytime soon. Usually Saturdays are my only options to go so my boyfriend and I get some cash, our reusable shopping bags and head over. The parking lot is very useful because although it's not free, you can pay by the hour and they accept credit cards which is pretty sweet. The only time I have ever had a difficult time finding a spot is around 12pm on the Saturdays that it's super nice and everyone is flocking to the farmers market. Once parked we usually hit up the concession stand for a bud light....shopping for veggies while drinking a beer? You got it right  \n\nIt gets super busy on Saturdays but I always go in generally knowing what I'm looking for which seems to help calm some of the sense of chaos in the atmosphere and allow me to enjoy perusing to find the best deal and highest quality items. You will find a wide range of prices and quality so you will be the happiest if you are able to take the time to browse and the more I go the more I remember specific stands that provide the highest quality. My favorite farmers market moment was when I got 5 pounds of potatoes for $1. I LOVE potatoes...potato salad, mashed potatoes, baked potatoes, potato soup...you name it and I couldn't believe I got such a good deal. I almost felt like I was robbing them of their product. I am also usually able to find a good deal on romaine lettuce, strawberries, onions, bananas, etc. Besides those basics, I always have to visit the mushroom man. He sells the best, most flavorful organic shitake mushrooms I have ever had. I am seriously addicted. My visit is never complete without visiting the meat stand, their meat prices are outstanding and the bacon is probably some of the best I have ever had in my life. Best advice I would have is to not buy from the first stand you see but instead take a little bit of time and find the best products...also if you take the time to go out there, do yourself a favor and walk over to Bogarts afterwards for some lunch after shopping. Makes for an awesome afternoon.",
                "author": "Becca L."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-06-19",
                "description": "I moved to St. Louis a few weeks ago and this place has quickly become one of my favorite parts of the city. The produce, while questionable on occasion, is CHEAP. There's a great selection of fruits, vegetables, meats, bread, cheese, herbs, and even some random bananas and mangoes that clearly weren't grown anywhere near Missouri.\n\nPros:\n-cheap\n-friendly vendors\n-fun to shop around\n-fantastic people watching\n-great place to pick up lunch (and beers, what?)\n\nCons:\n-hot as HADES. Go early. \n-I wish it was a little easier to pick out the homegrown vendors.",
                "author": "Lisa D."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-06-19",
                "description": "Great place to stroll around. I have been going here all my life, now i can take my kids.  If you park in the main parking lot and walk in the front door the little concession place is great!  Great food, clean and pretty cheap!",
                "author": "Cory S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-07-23",
                "description": "Good amount of fresh produce selection. Seafood, meat, and poultry are a little bit cheaper than your local grocery stores. The experience is fun especially if you go there in the morning. Good snack food here and there while you're browsing around. Try those little donuts inside the market (forgot what it's called)  and it is really delicious. I am not sure because we haven't tried but I'm pretty sure you can negotiate the prices on just about any meat and vegetables they offer especially if you buy in bulk. Hope this helps. Bring cash as their ATM sometimes does not work plus it gives you more bargaining power. Overall fun experience.",
                "author": "Elgene C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-05-18",
                "description": "Man, this place is old.  As in, it's been around since the mid-1800s.  History alone makes Soulard Farmers Market a very cool place indeed (not to mention that the land on which it sits was donated by a woman named Julia, and we ALL know how cool Julias are).\n\nI visited the market on a Friday morning and am reserving further judgment for a weekend visit when the stalls are apparently all full.  That's not to say there weren't plenty of options on a weekday--fresh produce, herbs and flowers abound in the outdoor stalls, while the indoor portion of the market houses a lovely spice shop (it also sells artisanal cheeses and some meats), a bakery, a few butchers (some even had boudin, which I rarely see outside of Louisiana) and a fish stall that I hear is totally phenomenal.  I'm looking forward to visiting the fish guy the next time we're in town.\n\nAll the produce we bought for dinner that night was wonderful and I liked the old-school feel to the market.  One thing grossed me out, though--there's this one stall that's pretty out of the way (thank goodness) and I guess it's a pet store.  It has loads of bunnies that I think were crammed a bit too close together and pigeons for sale for $5.50.  I thought I'd see what else they had, but it smelled so strongly of dirty zoo that I had to pass it by quickly.  Yucko.  Skip the weirdo pet store and stick with the spice shop.  It smells MUCH better.",
                "author": "Julia W."
            },
            {
                "reviewRating": {
                    "ratingValue": 2
                },
                "datePublished": "2012-08-13",
                "description": "I went on a Friday for less of a crowd, no shops were open except for meats and spices. The produce was looking like a lot of overpriced second quality buys. Walk the whole line looking at the price and quality of any goods that you want to buy. If I lived next door I don't think that I would buy much produce here. The spice shop was a five star shop. I made several well priced buys here. Meat market shop enclosed looked and smelled like a very good butcher shop. This place could use a fresh fish market. It is really hard to find fresh fish in the St. Louis area and I think a Market here with fresh fish would do well. Don't get your hopes up when you come here and make sure that your parked LEGAL.",
                "author": "Gary K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-10-04",
                "description": "I wish CAlifornia had a farmer's market like this! Too cool. ;)",
                "author": "Justin K."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2010-07-06",
                "description": "We're going to go ahead and chalk this up as a 3.5 star review (I round up). There's much to love at Soulard Market...be warned though, if you hate crowds and noise, just don't go. \nI've read a few of the other reviews and while I agree with some of the comments regarding local produce, I do have some things to say to that. My wife and I did notice this past Saturday that there are quite a few vendors selling wholesale-bought produce, yes...BUT, there are those farmers in the rough who actually bring you their goods straight from the farm and sell it to you cheap, you just have to be on the look-out. That one point makes things hard though, I wish the farmers that are local and grow their own stuff would advertise that a little better...there was only one stall that actually had a huge banner saying 'locavores welcome!' and they backed it up with awesome produce. Otherwise, you have to just use some common sense. Usually, if there's a sticker on the fruit, it's not local. Also, there's always the tried and true method of just ASKING where they get their produce. What? Talk to people? Oh man...what a concept. Another note...we live in the midwest. Shocker, I know...but we do. With that, that means that we have certain produce that is local, and some that just cannot be. Pineapple? Not grown here. Neither is mango. And nope...cherries aren't either. So I say, while you're there buying the locally grown stuff...go ahead and pick up the stuff that you will NEVER find grown locally...and don't complain about it, because it's one stop shopping. Be smart...some things you have to buy shipped in, it's just where we live. \nWe were able to buy locally and for the whole week for just under $20...which is amazing. Soulard also sells a ton of meat, eggs, dairy, cheese...but we didn't really hit that up so I can't comment. Though, we had the mini-doughnuts which were like tiny funnel cakes (and made in a tiny fryer!!). We've also enjoyed the bloody mary/beignet combo on the west side of the market...that was a great day. :) \nThe market is a vibrant part of St. Louis...both for shopping and culture. Music playing, food cooking, people buying their groceries for the week. We need Soulard...ST. Louis needs Soulard...go to Soulard even if it's just to buy some mini doughnuts.",
                "author": "Steve O."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-04-20",
                "description": "A unique experience in St. Louis, and a great place to find locally-produced goods.\n\nAlso, though, a great place to experience obnoxious crowds and find a lot of produce and merchandise that's no different than anywhere else; I don't find the myriad of fruits and vegetables from around the world that were purchased at Produce Row that morning to be any more tasty purchased here than from a big box retailer.  And how many mass-produced baseball caps does one need?\n\nBut there's a guy that trades only in mushrooms, many local.  And locally-produced cheese and bakes goods.  A must-see for locals, but not for tourists from other cities.",
                "author": "Hans G."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2013-07-02",
                "description": "The Farmers market is obviously one of our favorite places to (people watch) get produce! There is always a wide variety of vendors, produce, and prices! The one thing that they do not have on the KC farmers market is a spice stand. They do however have some great garlic that is already peeled and ready for cooking! What we can get at the grocery store for $30 doesn't even amount to what we can get at the Farmers Market. Because these veggies are not treated with anything I do notice that they do go bad sooner than normal veggies from the store would but thankfully we go through them very fast. This is a great place to wheel and deal for some good food. Make sure you go early on Saturday before all of the good stuff is gone but be ready for a large crowd by 10:30 or sooner! There are also stands that offer a snack along the way... Mini donuts, toated ravs, bloody marys, pastrys, and even beef jerkey!",
                "author": "Amanda C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-05-03",
                "description": "The Soulard Farmer's Market is a staple of St. Louis. Every single time that I have been there, it is always a fun experience. Not only is the being there pleasurable with the sites, sounds, and texture of everything in the market.\n\nAt the Soulard Farmer's Market you can find just about anything that you would think of. They have different kinds of meats, from opossum; yes opossum, to your normal cuts of chicken and beef. Then there is what I usually go for which would be the fresh vegetables that they have there.\n\nThe nice thing about going to Soulard Farmer's Market is the fact that you help support local farmers, so it is good to give back to the community.",
                "author": "Aaron J."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2007-11-09",
                "description": "In St. Louis, budweiser flows like tap water.  Bud is served everywhere, even at this farmer's market.  The beer cost only $2 and definitely altered the way I look at produce.  Eggplants look really strange when you're wearing bear goggles.\n\nI don't go to farmers' markets that much, but I noticed that this place had a lot of homegrown products.  I bought some amish applebutter (taken from me at the airport - more than 3 oz. bottle) and some amish cookies.  Who knew there were amish people in St. Louis.  I didn't until I went to this market.  \n\nAlso, we went on a Saturday morning and the place wasn't that crowded.  That's a good thing.  Fewer people fighting over those $2 beers.\n\nI wish the SF farmer's market was a little more like this place.",
                "author": "Robson S."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-05-15",
                "description": "Strawberries, people - Scharf's has lovely fresh strawberries right now.  Get over there next weekend and get yourself a flat.  :-)",
                "author": "Rozebud S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-04-26",
                "description": "Bigger than the farmer's market in my hometown in Phoenix, but may actually have less number of farmers.  Reminds me more of open air public markets I've been to in Asia.  More of a bunch of mom and pop type grocers rather than farmers.\n\nI'd return for the tastiest pork rinds ever... a clean, non greasy crunch ...more crispy than potato chips...lighter than pop corn... and came in great flavors like mustard and salt &",
                "author": "Helen Y."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-08-24",
                "description": "The first thing I do when I go to the Farmer's Market is hit up the bakery for an \"elephant ear\" pastry. That gets me started.\n\nIt's a haven for a St. Louis foodie: fresh produce at a low cost, good cheeses at the Amish stand, a decent spice stand, and a meat/fish stand that's good (but a little pricey). I try to get my bacon here, though.\n\nOh yeah, I bought a goldfish here once, and it lasted for quite a bit. Speaking of that, you can get really lost in buying and buying more food, since it's so cheap. I suggest bringing a canvas bag or something to carry it all. Those plastic bags the stands offer just don't cut it. \n\nI just realized you can haggle at some kiosks. That gives me a whole new reason to visit the Farmer's Market over and over.",
                "author": "Nowell G."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-07-08",
                "description": "You just never know what you will find here. You can get produce dirt cheap here, but the key is walking thru the whole place a couple times before you start buying things. You can usually find it cheaper somewhere else. First and foremost don't let the vendors pick your stuff. Often they put their best stuff out on display and when they lure you in then they throw in their old stuff when they bag it. Also the cheap thing is good, but when I take the time to cook, its a lot of effort so I go for QUALITY. That is what makes this place so great. Go early, go early, go early. Especially on Saturday. Take a cart, or a box, and maybe a cooler with ice if you're really stocking up.  I got a Gus' pretzel with a bratwurst inside of it. Very tasty. I also really like the bloody Mary's at the northeast wing comes with a green bean, celery, lime, olive, and some cajun spice thats right on. I saw a child there horrified by the sight of a fish being chopped. That poor kid. There is also a\"petstore\" there. And the people that just sell chicken and eggs have the best poultry anywhere.",
                "author": "Chris K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-02-19",
                "description": "Few things make me hotter than fresh fruit and produce. When we arrived at the market the first stop was for a hot pretzel and an Irish coffee, which turned out to be more Irish than coffee, and I am really good with that. As we walked around the market there were a few things that kept coming up, the fruit and vegetables were outstanding and the fresh made mini donuts are to die for...I'm serious they are high in sugar and made in boiling fat so they will kill you, but they are worth it. All of the vendors are really nice and you can find everything from plums to collard greens. There are so many little shops and stands scattered throughout the market that every time you go it is an adventure. The hot links and the Andouille sausage from the shop that had Coon We also grabbed a  german garlic dog on the way out and holy cow it was good, a little brown mustard a little ketchup it was like a mothers kiss.....if your mother was a spicy German collection of ground meats.",
                "author": "Travis B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-01-31",
                "description": "Peoples' reviews show they're more knowledgeable about farmers' markets, but sometimes they're not paying attention at Soulard.  There are definitely local farmers  - who offer wonderfully fresh produce and herbs, including more unusual ones like bay leaves, fennel, and Japanese spinach (tatsoi?) in season - also the local goat cheesemaker (the Provencal variety is fabulous!); poultry, egg and butter sellers; the mushroom man, who arranges his offerings like still lifes; pastas in a great variety of flavors, with tasty recipes attached to the bag; Kaldi's coffees; Black Bear Bakery, a local coop.  \n\nOf course some distributors sell produce they got at the wholesale market, especially when local produce is not in season.  Take advantage of what's there.",
                "author": "Linda E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2006-05-01",
                "description": "fresh pasta, fresh meat, fresh produce, fresh fresh fresh--  its the only thing that gets me out of bed on a saturday morning (except maybe cartoons!)",
                "author": "Paul D."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-05-15",
                "description": "My first experience here was when I was 6yrs old. It was a weekly trip I took with my grandparents. Amazing how we lose connections with the things of our past as we grow old. I went here Sat. morning for the 1st time in many years. Not much has changed...brought back many memories. I would suggest getting there about 7am-8am to get really good stuff but don't buy from the first vendor you meet...walk through and look at all the produce because sometimes you might find it a little cheaper down the line. There is an awesome spice house on the inside that is open year round, they also sell a variety of flavored coffee beans you can have ground for that fresh coffee smell. :) ....there is also a meat market on the inside as well. They even sell beef ribs! Only downside I have with this place....they are not open on Sundays.....so get up early on Sat. and take a trip to Soulard. If you are a fan of pork rinds,,, there is a vendor setup in the front of the market making fresh, fried pork rinds with a variety of flavors...$3.00 a bag for you fans of this snack food. Hey guys..... or gals....you can buy fresh flowers really cheap here also....$5 for a bouquet of roses!",
                "author": "Lisa M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-08-10",
                "description": "place is awsome, tips: for produce deals go after 330 on saturday, always choose your own produce, farmer with live game in NE hallway has best pork products in Mo., if you are into exotic meats you'll have a number of option",
                "author": "Adam M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2007-10-17",
                "description": "I give it all the stars I can for the memories. My father loved to take us shopping there -- that was a long time ago. He really enjoyed talking to the vendors, who were small businessmen who bought and sold produce. I don't think it was ever a true farmers' market where the producers sold their own goods. Some day maybe I'll get back and visit it.",
                "author": "Mae S."
            }
        ]
    ],
    "priceRange": "$",
    "name": "Soulard Farmers Market",
    "address": {
        "addressLocality": "Saint Louis",
        "addressRegion": "MO",
        "streetAddress": "730 Carroll St",
        "postalCode": "63104",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ggKHPiWNZRsyUAHE_L4L_g/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13146224180"
}