{
    "aggregateRating": {
        "reviewCount": 3,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-04-13",
            "description": "The guy and I stopped by this market and I could not believe how fantastic the prices were! We got there late (around 2:30pm) and they were starting to wrap up, but we managed to pick up a huge box of strawberries (about 12 one pint containers), a huge box of ripe vine tomatoes and a box of green seedless grapes. We had enough fruit for about a month, and we got the whole thing for $20. \n\nThe best part is that this farmer's market is right in front of the new Whole Foods. \n\nSee you next week!",
            "author": "Caroline A."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-06-17",
            "description": "I'm gong to go ahead and echo the reviewer below who said this is \"barely a farmer's market.\"\nIt's more accurately about 8-10 booths set up in a church parking lot, and only half of them have food (produce, baked goods, and the other staples you would expect at a farmer's market).\nI was definitely disappointed. I wasn't expecting the same size as Lincoln Park's, but this was a bit pathetic to be frank. I'd save my time if I were you, but if you insist on trying it out, it takes place on Thursdays from 4-8pm.",
            "author": "Valerie B."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2008-08-10",
            "description": "Uhh......this is hardly a \"farmers\" market. It's mostly people selling a bunch of junk.  There is some fruit and vegetables, but not much.",
            "author": "Kay K."
        }
    ],
    "priceRange": "$",
    "name": "South Loop Farmer’s Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "430 W Roosevelt Rd",
        "postalCode": "60607",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": ""
}