{
    "aggregateRating": {
        "reviewCount": 1,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-25",
            "description": "Let me just say that I am into honey like \"whoa\". I like it on pizza (the whole thing... not just the crust), on peanut butter toast, in tea, with fried chicken, as a dipping sauce for fries, the list could go on-and-on. Thanks to Blood and Sand, I also realized that honey could be an insanely good addition to a cheese pasta dish with a little truffle and toasted walnuts.\n\nStinger honey is a unique experience and awesome departure from the typical store bought kind. My friend, Blake F received a jar for a Christmas gift from his employer, and couldn't figure out when or how he'd use it. Being the friend I am, I offered to take it off his hands. As the jar was nearing it's end #sadface, I knew I had to get in touch with Ms. Joy Stinger (yup, that's her real surname) to get some more. I called to make sure she'd be at the Clayton Farmer's Market on the Saturday that I was going, and she was, so off I went. \n\nShe is a sweet, sweet lady, who got into bee keeping about 25 years ago, and produces a killer product (no pun intended). The honey I sampled at the market was so unique and flavorful. I can do nothing but rave about it... and rave, I have! If you know me, you've probably heard me at least mention it. I love honey, and this is the best I've tasted. She explained how the time of year, and the flowers blooming really make a difference in the flavors. She had three varieties for me to try, and all were so different. The darkest was a little much for me, but really tasted like fall. The spring (light) honey tasted like the plants in her yard that the bees had pollinated. There was also a creamed honey that was so interesting, I couldn't resist it. I am not sure how to use this yet, but I will find a way and enjoy it thoroughly. I ended up spending over $40, but wouldn't ever regret it.\n\nA cool thing to mention is that she loves to re-purpose glass jars for the honey so that she's not wasting. This means that when you take a look at her collection, you're selecting a unique jar as well. Some are big and some are small, but all make it unique and fun. \n\nGo visit her at the Clayton Farmer's Market from 8am - noon on Saturday's from late May through September or at her home at the address listed for this business. Also, there are some more interesting facts and places to buy at the link from Feast Magazine. http://www.feaststl.com/this-months-feast/feature-articles/article_17691e10-5592-11e0-9b20-0017a4a78c22.html\n\nHappy Honey-ing!",
            "author": "Mallory F."
        }
    ],
    "priceRange": null,
    "name": "Stingers Honey & Beeswax",
    "address": {
        "addressLocality": "Clayton",
        "addressRegion": "MO",
        "streetAddress": "7639 Westmoreland Ave",
        "postalCode": "63130",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/7TV4mqEeht3ZpIlmgmJxUQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13148620509"
}