{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-06-06",
            "description": "Admission: Green City Market overwhelms me a bit. Indeed, it's superior in many ways...but the smaller markets give one a sense of leisure. We were able to park right across the street from Starr Park (Oakley & Washington) walk right in to the small circle of vendors, pick out our (incredible) items, and be on our way with very little trouble or fanfare. It just felt...convenient. And, summery. And...sweet. And, supportive. \n\nTogether we fetched coffee from the greeter stand...$1 suggested donation quickly dropped for each cup, then...that's where the coupledom fell to the wayside....ha!\n\nMy salad maestro split straight for the farmstand....while I of course made a beeline for the baked goods. C'est la vie...and yes, they are French  ;) \n\nSisters of Notre Dame (a local church at 1335 W Harrison): Beautiful baguettes, loaves of raspberry bundt bread, slices of lemon/blueberry bread, bags of carefully constructed madelines, tempting tarts (chocolate, lemon, blueberry, mixed fruit), apple turnovers. All fresh-baked by the sisters themselves...for $5 I snagged a baguette, apple turnover and slice of that insane lemon/blueberry bread to share for breakfast. \n\n\nKAP Farms: the sole fruit 'n veggie vendor packs a produce punch with some delightful offerings: pearl onions, beets, radishes, heirloom tomatoes, squash, cukes, lettuces of many varieties, peaches, apples, cherries, berries...you name it, it's likely here. All fresh and EXTREMELY well priced and displayed. We walked away with an entire box for $45, easily half of what we'd have paid at a mediocre grocery store. \n\nTomato Mountain from Brooklyn, WI: (http://www.tomatomountain.com/)\nAn entire line of organic salsas, jams and spreads. I didn't spend quite enough time at this booth, but did grab some info on their CSA (Community Supported Agriculture) program, which sounds very tempting indeed...a sample of their raspberry jam was heaven, and had I thunk a bit clearer (more coffee!) it would've been the perfect complement to the lemon/blueberry bread. How do you say sugar coma in organic French? \n\nIn short: This is a great little market in a newly spiffed up park to stop by (even if you do not live in the 'hood) with easy parking, friendly (and well stocked!) vendors, and a great mission...bringing fresh produce to the Near West Side, an area that is blighted by abysmal offerings in this regard. \n\nSalad Man and I give it a stamp of a approval, and even Tillie enjoyed lolling in the grass and sneaking a bite of baguette...look for this to get even bigger and better with community support. \n\n*Presented by the Neighbor's Development Network, focused on the revitalization of Chicago's Near West Side: http://www.ndncdc.org/\n\n**2010 dates: Sunday, May 30, 2010-Sunday, September 26, 2010",
            "author": "Colleen C."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-10-03",
            "description": "The market was a lot smaller (5-6 active vendors) than I expected, but this could have also been due to the fact that it was the very last one of the season (and I think that this was an added-on date from the original schedule?)... also I showed up near the end, when some of the tables seemed to be emptied out.  \nI was still impressed though by the stands and selections that were there.  It's a much needed event for the Near West Side.\n\nI'll just copy & paste this email that listed the day's itinerary:\n\n-  Come to the market early, there will be free Starbucks coffee . . .\n- At 9:30 am do some Yoga with Alicia Messenger - all ages all abilities welcome!\n- Enjoy live harp music while you shop.\n- At 11:00 am watch a cooking demonstration by Chef Chris Reed, owner of The Rice Table who specializes in Indonesian Cuisine.\n- From 11am-1pm enjoy some Indonesian food for lunch, prepared by Chef Chris Reed.\n- For this last market only, the Sisters of Notre Dame return with French tarts, pastries and breads.\n- Pick up some fresh apples, pumpkins, garlic, squash, and other vegetables from KAP farms.\n- Tomato Mountain Farms will have organic salsas, sauces, and soup. \n- Leila Manoochehri from LEILALOVE will again bring her POMOLIVE, pomegranate & olive spread and cookies to the market.  \n\nDefinitely bring cash, although I saw a sign at the Tomato Mountain Farms booth that said they accepted credit card.",
            "author": "Jeanne L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-08-02",
            "description": "Great Farmers Market. There are just a few venders, but they all have a ton of stuff. The vegetables alone are enough to make me give up all meat. There were a good number of people and dogs. Everyone was friendly and dog friendly. Met really nice people. I plan to go back every Sunday.",
            "author": "Renae S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-07-20",
            "description": "The Sunday Market is a new and exciting farmers' market located at the corner of Oakley & Washington. It is the only farmers' market on the near west side just west of the United Center. Fresh produce grown locally is available from a farm in southern Illinois. French nuns from France sell delicious homemade French pastries, baguettes and croissants while speaking beautiful french. Sip coffee house on Grand ave. sells its wonderful coffee and iced teas. An organic tomato farm sells wonderful salsas and sauces. There is a vendor who sells eco-friendly baby accessories as well as a local florist selling beautiful cut flowers. The park is a lovely setting for this wonderful market. It is great to see so much activity in this area and finally a place for people in this emerging neighborhood to gather and shop for fresh food.",
            "author": "Andre P."
        }
    ],
    "priceRange": "$",
    "name": "The Sunday Market",
    "address": {
        "addressLocality": "Chicago",
        "addressRegion": "IL",
        "streetAddress": "Ellen Gates Starr Park\nCorner of Oakley & Washington",
        "postalCode": "60612",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UFOH1jnj6DUcxa8jGr5nTw/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13129273817"
}