{
    "aggregateRating": {
        "reviewCount": 19,
        "@type": "AggregateRating",
        "ratingValue": 5.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-02",
            "description": "I came here with my family for the first time to pick the last of the strawberries before the season officially ends on July 4th. This farm is so simple and modest, nothing but fields of fruit (no cafes, shops, farm animals, etc). \n\nThe strawberries taste sweet and are very reasonably priced - it was $8 for a 4 quart basket (mind you these baskets are actually quite large). While the strawberries are small in comparison to what you find at the grocery store, I feel comfortable knowing that these probably haven't been treated with GMOs and are the real deal. \n\nParking is free and you literally start picking right away after you park and get baskets. You pay on the way out after you finish picking (note: it's cash only). Will definitely be coming back again for raspberries in the fall and strawberries next year!",
            "author": "Roserry Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-07-01",
            "description": "Today was my first time at a local strawberry farm. I loved it!! The weather was perfect and the view of the acres of greenery with splashes of red strawberries throughout the field. Parking was free which was nice. You can pickup a box and just walk throughout all the fields to pick the ripest strawberries yourself. You pay at the end by how many boxes were filled ($9/box) it's avoidable, great time with family/friends, wonderful way to enjoy the weather, and great way to support a local farmer. We picked a mass amount of strawberries!! The strawberries were the size of raspberries this year but were as sweet as ever (size expected due to mass amounts of heat and sun this year). Hoping for a 5 star next year with increase strawberry amounts/sizes. We had so much fun and i be returning!!",
            "author": "Tessa J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-07-03",
            "description": "Every year we come here at least once for strawberries, because they are delicious, its a lot of them, easy to pick and price is reasonable. I always freeze some and also make strawberry rhubarb jam. My kids love this farm:)",
            "author": "Gloria J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-29",
            "description": "Strawberry season is winding down but that didn't stop my me and my son from trying to get some u-pick-em action this week. Our go-to (Stade's) was almost picked over per a phone call I made to them. Another farm was completely done for the season per their FB status. So a phone call to Thompson's confirmed they still had berries for the season...they were small, she said, but still lots of berries left. \n\nThompson's is just a short ride away from the Brat Stop, so getting there from Chicago was a quick breeze. My son and I arrived about 1 hour after opening and there was a small crowd picking.  But by the time we left (11am) the crowd size had doubled.  I wouldn't be surprised if they were done with the season in the next couple days. \n\nThompson's is much smaller than Stade's but it's a plain old pick-your-own type farm.\nAnd I LOVE that. No playgrounds, no petting zoos.  Just a family run orchard that provides a great product and fun experience for folks who love berries. \n\nYou're given baskets and given free reign to pick strawberries in fields designated for you.  They also had a stand where you can buy fresh strawberries, already in the baskets.  But the weather was perfect so we spent a few hours picking. The strawberries were on the smaller, but they were so sweet and juicy. We paid 24 bucks for 3 baskets (roughly 12 quarts). \nCash only.\n\nThe folks running the place were really nice. Family friendly fun with a great reward.  Dirty shoes, strawberry stained hands and mild body aches from the stooping and bending.  But we're excited for home made jam, home made strawberry sauce, strawberry milk shakes and strawberry vodka (ok I'm excited about that last one).   \n\nWe are sure to visit again.  Raspberries are next at Thompson's in the fall! Then the pumpkins!",
            "author": "Aimee M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-19",
            "description": "Awesome, awesome, awesome fresh strawberries!!! Super friendly and helpful staff! We stopped when they opened on Saturday morning and the farm was busy!!! Thankfully they had plenty of just picked fresh strawberries to purchase. If you feel like picking your own that's an option as well. Strawberries are tasty and sweet!",
            "author": "Amy M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-12",
            "description": "We had a lot of fun. First time visiting this farm and we liked it. Great location!!! \n\nDefinitely will visit again.",
            "author": "Dina M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-07",
            "description": "This is such a cute little farm! Thanks to Aimee M. for coming here and writing a great review. My friends and I stopped here right before the cut-off date for strawberries (which is July 4th). The strawberries are small, but they are packed full of flavor. The fields smell of strawberries, that's how good they are. It's $8 for a huge basket, which isn't bad considering they are organic. It didn't take us long to browse the fields and fill up a basket. There are porter potties, and fields. That's about it! They also have pumpkins and raspberries later in the year. And don't forget, it is cash only. I would definitely come back!",
            "author": "Danielle S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-18",
            "description": "It's the peak of strawberry season and our family had a great time picking a box. It was moderately busy when we went, but there was still plenty of strawberries for the picking. Parking is free, and there's a central truck with young people folding boxes for anyone to grab and fill with goodies. For strawberries it was 8 dollars for a full box (4 quarts I think). The fields are loaded, and you can  munch on as many as you want as a \"sample.\"\n\nThompson's is also open for raspberries and pumpkins around fall. I come all the time and you should too. \n\nBTW. If you don't want to pick your own, you can buy a box of fruit already picked for you so you can go home and make up a story for all your friends on how you're one with the earth.",
            "author": "Barry J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-24",
            "description": "Prices are reasonable, if you buy 5, you get 1 free. Can be tiring buts it's worth t to get fresh strawberries. The employees were nice and helpful. The strawberries were delicious. Parking was easy and the area was clean. Only place I have been to pick strawberries but I'd definitely come back.",
            "author": "Ryan H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-09-19",
            "description": "We have passed this place many times and finally decided to stop.  They didn't have any strawberries though which was a little disappointing but they did have raspberries which was fine because my son and husband like raspberries.  They give you a nice sized basket for $8 and you can fill it up.  We filled ours to the top since it was the same price no matter how much it is filled.  There were quite a few people there picking.  I would definitely want to come back here when they have strawberry picking.  I am not sure when that is.  I wish they g a d a sign in front saying what they had growing.  Other than that, I am glad we stopped for a 20 minute detour.",
            "author": "Nichole F."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-28",
            "description": "So I'm a little behind on my Yelping. Its October and I'm reviewing a place I was at in June. The season lasts about four weeks and this year the picking season was delayed as it was for most crops.\n\nThe process is simple. You get a basket and you pick. You pay on your way out. Picking was easy because the berries were abundant. They also have pre-picked berries.\n\nAnd if you're coming from Chicago, don't forget to stop by the mall in Pleasant Prairie.",
            "author": "Dan E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-02",
            "description": "I found this place en route to Lake Geneva today, and my mom happened to catch the farm and wanted to check it out after we came back from the lake. The farm was wide and spacious. I was expecting to pick up pre=picked strawberries at the farm stand, but instead there was an opportunity to pick out strawberries which was an awesome opportunity to take on. We came at the tail end of the strawberry season. There were many mini strawberries to pick from and came home with maybe 3 quarts which I paid $5 for. Certainly worth a return trip.",
            "author": "Randy K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-18",
            "description": "My friend and I checked their website status before going. We went to pick raspberries in September. It was $8.00/quart. The farm was cute and busy. I wish they have a small shop or restaurant. We were a little hungry and thirsty at one point. It was a fun fruit picking experience. I'll come back for strawberry picking next year",
            "author": "Jessica N."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-28",
            "description": "So even on the day before the last day of the season, the berries were adorable and Super sweet !! The staff was so nice and cheerful. My family and I are definitely going back in a couple of months for raspberry season !!",
            "author": "Monica J."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-29",
            "description": "Such a great way to spend a morning! The berries were tiny but very sweet and the whole place had a very laid back vibe. I would definitely recommend taking a family trip here. Now if only they sold their cute t-shirts....",
            "author": "Catie F."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-07-17",
            "description": "We've been here twice now (got rained out the second time, so maybe technically just once), and it's really a great experience. We have so many strawberries from last July that we are still taking them from the freezer a year later! The people here are very friendly and helpful (even offering advice on where to pick and what strawberries are good for pies or jams), and the prices are great. We haven't come for raspberries yet, but we're planning a return trip to do that. It's pretty kind friendly too, and a trip here would make for a nice day outside for the whole family without question.",
            "author": "Jared W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-19",
            "description": "We went for U-pick raspberries the weekend of September 14th and there were tons on the bushes! They were very friendly and laid back there-the rows in between the bushes are well kept and the plants aren't that thorny. $3.50 for a pint and you can fit a ton of berries in the pint (and also in your mouth-I ate way too many). There is only a Port-o-potty for the toilet, so go before you go! Will go in June for strawberry picking and return next year for Raspberries again!",
            "author": "Annette U."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2012-06-20",
            "description": "Had a wonderful time and the process was easy to get in and out. The strawberries were good and it was a good way to spend time with the family...ok a good way to compete with members of the family.",
            "author": "Katrina L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-06-22",
            "description": "Drove past this place on the way to Lake Geneva from Chicago and made a note to stop on the way back.  My little 5 year old had been strawberry picking when he was 3 in California and loved it, and this experience was just as wonderful... if not better!  The farm is darling... very clean and cute, and the staff working (mostly teenagers?) were all so sweet.  You pick up your cardboard basket (which is equivalent to three little baskets at the farmers' market) and go fill it up... and then pay $8 per basket on the way out.  Such a great deal!  The farm is spacious and there are rows upon rows of wonderful strawberries.  They line each row with straw so you don't have to walk on mud, which is really nice.  Overall... a wonderful experience!  BTW... I was told by the farmers in California to pick the red ones (versus the ones nearly red) since, once picked, strawberries will not continue to ripen/sweeten.",
            "author": "Pearl T."
        }
    ],
    "priceRange": "$",
    "name": "Thompson Strawberry Farm",
    "address": {
        "addressLocality": "Bristol",
        "addressRegion": "WI",
        "streetAddress": "14000 75th St",
        "postalCode": "53104",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/cgNAh3220GLKVYOW8WjAng/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+12628572351"
}