{
    "aggregateRating": {
        "reviewCount": 64,
        "@type": "AggregateRating",
        "ratingValue": 4.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-29",
            "description": "Love this farmers market. Lots of kind vendors that care about their products. If you're in STL and like a good farmers market this is a must stop. I have too many favorites to list. Parking can be a bit annoying but it's well worth it.",
            "author": "Cian D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-09-11",
            "description": "The weekend market has a wide variety of before, and everyone sets up in sections so the artisans are all together and the food vendors are all together. \n\nThe vendor assortment is well-curated too. There are local farms with organic and non-organic fruits and veggies, grass-fed meats, baked goods, honey, even handmade sausages. If you go, make sure to pick up a sausage from the sausage guy (I don't remember his business' name - sorry!)\n\nMake sure to take cash! I was disappointed that more vendors didn't have Square as a payment option. The market was basically cash-only, and there wasn't an ATM on-site. This info wasn't advertised on the website or social media, and other weekly farmers markets I've been to of similar size have these options. First-world problems, I know. We just moved here and made a truly rookie mistake.",
            "author": "Caitlin K."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-29",
            "description": "I typically work on Saturdays, so I never get a chance to attend TGFM. Then I discovered, they do a smaller version on Tuesday nights as well. It may not be as massive as the Saturday market, but it is still a great opportunity to pick up some fresh veggies and meats, too. \n\nIn addition to the variety of farmers selling their produce, you'll also find a variety of other vendors promoting their wares. As I browsed the booths, I munched on freshly made pretzels and sipped a 4 Hands Beer. Now that is shopping in comfort. My best find of the evening was, fresh corn on the cob. \n\nAnother big bonus of TGFM is the food trucks. Before you shop or after you've completed your shopping you can enjoy a quick dinner from one of the many food trucks. I had meet a group of friends and we all took our blankets and had dinner picnic style. In addition, to the food trucks, there was a mobil comic book truck, which sent one of my friends over the top with excitement. \n\nOh, before I forget - they also have free yoga class on Tuesday night.  \n\nI can only wish my work schedule changes, so I can experience TGFM on the grander scale on Saturdays. \n\nI'll be back? - Yes, I'll take my cooler to buy some grass-feed beef. \n\nWhen: August 21, 2018\nWhy: It was a CYE (Community Yelp Event)",
            "author": "Steven B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-08-07",
            "description": "Fresh produce, beautiful flowers, community yoga, hot coffee... all of this mere blocks from my home? You really cannot beat a Saturday morning at the Tower Grove Farmer's Market. The vibes are just right. \n\nThe community and inclusivity at the Farmers' Market is amazing, as well. You'll see parents with their kids in strollers, couples on date, individuals coming to grab their weekly market necessities - all of it. Not to mention the Market takes place rain or shine... a few weeks ago, my wife and I went and it started POURING down rain, so everyone went under one of the large gazebos and the band kept playing! It was such a cool and unexpected morning.\n\nIt goes without saying that it's an uber-local experience. They often bring in new vendors, so even if you've been going for years, you can always learn about a new farm/ business or Saint Louis sustainability program or food truck or chicken-coop-building technique...you get the idea. \n\nIf you haven't come out you need to. Where is Saint Louis on Saturday mornings? #TGFM.",
            "author": "Max R."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-21",
            "description": "I love the farmers market in TG. Today was my first Tuesday going and it's more laid back and chill. They set up drink holders and blankets which is a nice touch . They also have yoga from 6 to 7. It's much smaller so there were about 4 food trucks and maybe 6 vendors but it's nice sitting out on a blanket and just enjoying friends and people watching.",
            "author": "Kimberly B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-05-27",
            "description": "This year I started shopping more at the Tower Grove Farmers' Market. It's become part of my routine. I get up, drink water, show up here. \n\nI am obsessed with the gazpacho soup at Kitchen Kulture. It's bright and flavorful and spicy! I dip veggies in it during lunch at work so I can try to eat healthier! \n\nSo far there are two stands that sell rhubarb. I'm trying to make a decent rhubarb jam. It's a good place to go and get things to try stuff with. \n\nAnd then there's Whisk. The popsicles and baked goods can't be beat. I like grabbing popsicles just before i leave, go home, and save them in the freezer for later.",
            "author": "Hao X."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-09-18",
            "description": "I have only been here 2x bc it's not close to my house and let's face it sometimes it is nice to hangout in pjs on Saturday morning. But I knew I wanted to get back there so we did past Saturday. Nice that they had a live band. Vendors selling everything from ready to eat foods or plants to take home and grow. Also crafters there. It's a nice size market but smaller and higher prices than soulard market. We have been pleased with all purchases we made.",
            "author": "Renee I."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-07-18",
            "description": "Loved my first time at this farmers market in tower Grove\n Foundation a shady parking spot close.  It gets crowded.  Kids Water splash area, green lawn tennis, music played by local bands, jewelry by local artists, clothing, creams, complimentary massages and more.\n\nTried a blackberry juice, OMG totally worth $3...add a splash of vodka and wowing!\n\nThe veggies made me want to buy everything and cook.  \n\nThe new Double Food Stamps program booth and double bucks atmosphere was there. Super cool!!\n\nThis farmers market is a must see!",
            "author": "Cynthia M."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2018-03-20",
            "description": "Tower Grove Farmers' Market is pricey, overcrowded, and not worth a special trip. It was kind of like being at an outdoor Whole Foods, except more limited of selection. I did like quite a few of the things there. But this market is heavier on fancy juices and alcoholic beverages. Guess my heart belongs to Soulard, where there is an adequate selection of non-organic produce with which to feed my face.",
            "author": "Maggie H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-06-02",
            "description": "Honestly, the Tower Grove Farmers' Market is my favorite place and favorite thing to do in St. Louis. \n\nLet me start off by saying that I freaking love me some horticulture. I'm obsessed with growing my own plants and scoping out what other people are doing. If you're into locally grown produce, this is your heaven. \n\nI like to get to the market on the earlier side; usually around 8 or 9. It gets crazy after ten, especially after yoga lets out (they have yoga outside in the park in the morning if that's something you're into.) Parking it usually alright if you go early, but buckle up and prepare to spend a few minutes trying to find something close. \n\nThe first thing I do when I get there is head straight for the Kuva tent. Their drip coffees are all great, but if you're in the mood for iced, ask them to give you the Tower Grove version - it's made with a few different pumps of flavor and is so great. After I'm armed with coffee I usually make my way over to whatever food truck is on hand. Holy Crepe is there a lot, and if they are, you should get anything that includes bacon and goat cheese. \n\nBring a bag with you, but if you forget one, you can snag one for five bucks. From there, just start making your way down the rows and prepare to be starry-eyed. Live Springs is where I get all of my meat as well as my eggs. I would get to them earlier rather than later, because they can run out of eggs. Their meat selection is huge and you're going to have a hard time choosing. Baetje Farms is usually my next stop to grab some goat cheese. From there, I usually head to the Whisk tent to grab whatever yummy pastries/baked goods they have on hand. Afterwards, I make the rounds and end up getting so much produce that I am fully stocked for the week.\n\nThis place is magical. Sit and enjoy the live music, watch the kiddos play in the water fountain, pet some cute pups, and enjoy. The TGFM is one of the things that makes St. Louis as great as it is.",
            "author": "Aimee K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-06-20",
            "description": "I love this farmers' market for the variety and the location. There is always a nice selection of produce, but there are also artisan breads and cheeses, herbs and sprouts, and plenty of homemade goodies. Prices are what you'd expect (you get what you pay for), and people are always friendly. I love their expanded hours, and Tower Grove Park is a beautiful spot to spend a couple of hours!",
            "author": "Amanda C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-19",
            "description": "Small but mighty this little farmer's market!\n\nEverything from massages, chickens for sale, organic herbs, fruit, veggies, perfumes, oils, scrubs, black walnuts, fresh baked goods, Clementine's ice cream, Companion Bakery, Vincent, Whisk, Van Doughnut's amazing truck, pet supplies, clothing, coffee, teas, crepes, live music and me!\n\nLocated between Tower Grove Park's playground area and tennis courts you can't miss the festivities. \n\nAdd this to your weekend To-Do List.\n\n~Christy said so.",
            "author": "Christy A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-05-06",
            "description": "Nothing better than after-the-deluge farmer's maker. Spring is so lovely in tower Grover park and this market is just the right size. On a beautiful sunny day come and refill your larders with the fruits of the Earth. My favorite vendors include the microgreens lady, salume bedu, and kavu coffee. If you love salads grab some micro chard to spice up your greens. Salume Bedu is local artisan charcuterie with an amazing range of finely cured meats. I would also recommend getting a breakfast sandwich from the guys that own Kounter Kulture under the tent named Kitchen Kulture. Have nice sunny day!",
            "author": "Pat J."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-04-29",
            "description": "the concept is awesome.  the energy is very much alive.  the market does fit well with the area.  The issues - the prices are way out of whack for the amount of product, quality and over all presentation.  It's like an airport, they have a captive audience, no other options close by, so they gouge you on price.  the only difference, there are a lot of places to buy natural food in a fun atmosphere at much lower cost's.  we'll continue to walk around, socialize, but were're not buying until prices are equalized.",
            "author": "I Know W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-08-15",
            "description": "Go early to get the best stuff! Talk to the vendors, especially those giving out samples. They usually aren't trying to make you purchase anything and genuinely take an interest in what you're interested in. A nice thing to do on a Saturday morning and parking isn't too bad. They also have yoga!",
            "author": "Daryl S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-08",
            "description": "BY FAR the best Farmer's Market in the area. Love it! This is my Saturday morning ritual. There is a little of everything here. You can find ANY type of produce that is even close to being in season, meat, eggs, honey, plants, flowers, prepared food, canned food, baked goods, tea, coffee and more. \n\nThere are usually a few food trucks here, as well as some booths that make food. Every morning I get my favorite - the grilled cheese. Not just any grilled cheese - this is THE BEST IN TOWN. Literally. The Big Cheese makes them to order, and always has the traditional grilled cheese and a special. The special varies based on the local produce available. Some that I've had have been cheese with strawberries, honey and mint; tomatoes and basil and mozzarella, and recently mozzarella and fig jam. It varies every week and is always delicious. Right next door is Kuva coffee roasters, which is my fave coffee. As a non-coffee drinker (most of the time), their iced blondie is to die for. \n\nMy ritual is: place order for grilled cheese, get coffee, sit and listen to the amazing live music and talk with friends, and then go grab some produce on my way out. I've gotten awesome produce here, with some favorites being white nectarines and purple cauliflower. \n\nParking tip: Don't enter the park at all! Park on Magnolia, right in front of the horse stables. Walk through the grass, by the tennis courts and you're there. Much easier than getting stuck in the winding park roads that are crowded and one-way.",
            "author": "Sarah S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-07-12",
            "description": "This was my first time at the Tower Grove Farmer's Market despite having lived in south city many years. I enjoyed it immensely and was a bit impressed with it. There are lots of vendors for fresh fruits and veggies as well as for fresh meats, honey, and bread. Along another side, they have food trucks of all sorts and tastes. I had my lunch from a crepe truck. The Farmers Market is a great place to walk around on a Sat morning.",
            "author": "Mindi A."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2017-05-06",
            "description": "I was disappointed. Loved the food trucks...but not near as many fruits and vegetable stands as I had hoped. And, the fruit and Veges they did have were quite pricey. We did buy some tomato plants and it was a really good crowd and environment. Lots of dogs. We are dog people so it didn't bother us, but there were enough dogs there that if you were not a dog person it would probably bother you.",
            "author": "Chonita K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-01-10",
            "description": "This farmer's market is my favorite because there is so much to do! They have live music, a big fountain and two playgrounds for the kids to play, plenty of picnic area around and a large variety of local vendors with quality seasonal offerings. Flowers, breads, cheeses, honey, microgreens, breakfast, lunch, tea, salsa, meats, and SO much more!",
            "author": "Maria J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-06-14",
            "description": "This is another great farmers market in St. Louis! There are lots of unique vendors selling soap, lotions, jewelry, and also your typical vendors selling delicious food. There are usually a couple food trucks out there as well. It's about medium\nSized but you get the added convienece of having a major playground right next to it for the kids. There are some great coffee and tea vendors so you can enjoy a beverage while walking through the market. One of my favorite vendors is kitchen Kulture which shows up I think nearly every week. They have ready made dishes that are out of this world. This park is great to begin with and has a ton of parking so it's a great option!",
            "author": "Kate F."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2017-04-23",
                "description": "This is by far the best farmers market that Saint louis has - PERIOD- everyone here is happy to help and answer any questions you have ! Happy it has started again-prepared for an awesome 2017 year thanks to everyone that makes that possible",
                "author": "Donnie S."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2015-08-01",
                "description": "been here on two separate occasions. I really enjoy the ambiance and the vibe of the market. it's on the smaller side so it feels more cozy. however, they don't carry any fruits which is a disappointment. they are also on the pricier side of the spectrum for a farmers market. although it seems more hip & cool, I prefer soulard farmers market for their produce and price.\n\nI do appreciate the live music on location. it definitely adds to the cool vibe. the shaded area is the perfect spot to cool off, with an arnold palmer in hand!",
                "author": "Christine C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-05-24",
                "description": "I personally love Tower Grove Farmers Market. I used to frequent it all the time when I lived in the area. It has tons of fresh produce from around the St Louis metro area, and even some people would come as far as Springfield to sell their stuff.  It was always fun to also watch performers in the pavilion perform while you shopped around. \n\nI prefer this over the Soulard Market. Granted Soulard is bigger, but I find Tower Grove's is more localized and not the people who buy their stuff whole sale then resale it at an upsale expense. \n\nTower Grove will always have my heart, and the farmer's market too.",
                "author": "Mary Kate A."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2015-06-25",
                "description": "Holy expensive, well, EVERYTHING! I was so excited to finally make it over to the Tower Grove Farmers' Market after hearing good things for years. This is no Soulard Farmers Market, my friends. This is more of a $7-bunches-of-carrots farmers market.\n\nI'm all for buying local and all, but I think I'll stick to Soulard to get more bang for my farmers market buck. I'll leave this place for the rich hippies.",
                "author": "Christie T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-06-11",
                "description": "I am in love with this farmers market. I love the diversity and the atmosphere and livelihood every Saturday morning. \n\nThis is a much bigger farmers market than the one in U-City that I go to. I really enjoy meeting the local farmers, the small business's and the independent owners.\n\nIts dog and child friendly and they offer free yoga for anyone that is interested.\n\nI was lucky enough to stumble across GLOW candles and purchased the Half and Half scented soy candle. All i can say is that I can not live with out it and need my house to smell like Half and Half all the time. The candle is seriously the best thing ever. Show that stand some love guys.\n\nI look forward to actually waking up really early on Saturdays and adding this farmers market to my daily routine!",
                "author": "Simone N."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2015-12-30",
                "description": "This quaint little farmers' market offers a mini weekend oasis in the heart of south city. It's located in Tower Grove Park, closer to the Arsenal side than it is to Magnolia. My mom and I enjoyed several Saturday mornings here last summer. I love grabbing a bite to eat here and watching all the kids and dogs splash around in the shallow fountains while live music plays in the nearby make-shift amphitheater. \n         On a practical note - the produce is much pricier than I've seen at other farmers markets. I would recommend Soulard's market over this one in terms of both price and selection. Produce prices aside, everything else about this market is superb! There are all sorts of shopping options: you can find anything from soap to jewelry to artisan cheese. The market gets a little crowded once the yoga group lets out and parking can be a nightmare as well - so if you're not a crowd person, get there as soon as they open (which I believe is 8:30).",
                "author": "Erin M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-08-03",
                "description": "Quite honestly, I love this farmers market.  Soooo many vendors.  Lots of many things to see & try.  They have a couple of food trucks.  Parking can be a nightmare if you don't go early.  Some vendors don't take credit cards, so bring cash.",
                "author": "Kat V."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-04-23",
                "description": "I personally don't get too excited about farmers markets. They feel unnatural to me. I literally can't stand them now that everyone has this douchey fantasy of themselves strolling around one of these things buying artisanal cheeses and pickled organic beets. Farmers markets were bad enough when they were just farmers markets. But, like most things, they have been made exponentially worse by hipsters. \n\nI did find some fondness in my heart for this one because it wasn't as crowded as the other STL markets I've been to. They had a lot less farm and a lot more other crap than I was expecting. Soap. Cheese. Beef. Stuff like that.  I actually don't recall seeing any actual fruits or vegetables.  Hmmmm. Maybe my brain is automatically blocking those out now. Somebody alert Michelle. \n\nAnyway, if we're comparing this to other farmer markets, it's good because it is small, laid back, and not very crowded. Fountains. Kids playing. Hipsters. Meh. 10 minutes was enough for me before retreating back to my couch to binge-watch TV shows I've already seen and eat food that would make a farmer weep.",
                "author": "T. M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-10-02",
                "description": "My favorite Farmer's Market!\n\nAmazing vendors - Baetje Farms (superb goat cheese), Salume Beddu, Whisk (their popsicles are both interesting/refreshing/delish), Double Star Farm, MO Grass Fed Beef, Companion....etc. \n\nFood Trucks! - A big fat Holy Crepe or I love love love The Big Cheese - making grilled sandies utilizing all the local ingredients, found at the market - how perfect is that?!\n\nFree Yoga! - It's at 9 a.m., and the instructor is f-ing hilarious.\n\nThis place is just full of activities - yogis, foodies, kiddies, and in summer, usually some live music and/or a wedding happening at Piper Palm House. \n\nBest in St. Louis! -  says the yogi who loves fresh foods (is there any other way to get tomatoes and lettuces?)",
                "author": "Sal E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-05-15",
                "description": "Small but full of dun finds! Fresh and local veggies, fruit, bread, cheese...whatever you may need.\n\nWhile shopping it is a bonus that there is food and coffee stands...The major plus!!! The fact that the fountain is opened for the kids and there is music playing to entertain...All in all a fun family afternoon event.",
                "author": "Sara B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-06-29",
                "description": "Tower Grove Farmers market is definitely my favorite farmers market in St. Louis. Every Saturday morning the wife and I drive down to Tower Grove. It has always been such an uplifting experience talking with the farmers, picking out our own vegetables and/or meat, and then coming home and figuring out what to make. It's also fulfilling to see how the options change across the seasons and to alter our menu. The tomatoes often are so incredible that we don't even put anything on them. We get cage free chicken and eggs, and can never say no to shiitake mushrooms from the Ozark folks. Companion baguettes (with pretzel croissants as a snack) are highly recommended. Folk music playing around 10 just adds to the experience. \n\nOur biggest complaint? Becoming a little too popular where now there are lines. There is a free yoga from 9-10 and once it lets out there's a flood on the market. I am really happy for the small local businesses there as business must be great! But it has dampened the experience slightly. We just need to go earlier...",
                "author": "Jeff Z."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2014-09-20",
                "description": "I moved to St.Louis a year a go, and have just started checking out the farmers markets. I was very disappointed by Soulard's farmers market (despite the hype), because half the stalls just sold mass-purchased produce at a markup (I mean really, where did they get kiwis and pineapple in the midwest? They certainly didn't grow them).\n\nCue the Tower Grove farmers market. This market has real local produce!!! All the produce was farm grown, and there are homemade products here as well, and other products like bread and pastries and coffee. It is also dog-friendly, and I love walking around seeing all happy canines. If it gets too hot out, the market is right next to a pavilion, so you can get some shade.\n\nOne tip, there is NOT an ATM here, despite what the website implies. The \"ATM\" is an iphone credit card app where they charge your card (plus a $2 fee) to get \"market bucks\" in $10 increments that you can then spend there. So be warned, bring cash! Only a few of the booths take credit/debit directly.",
                "author": "Jill H."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-06-08",
                "description": "Really great farmer's market. Pretty big and great location, next to a water feature in the park that kids can splash around in after you shop. There was a good mix of veggie/ fruit offerings as well as eggs, meats, and cheeses so that was nice! Even fresh flowers grown on an urban farm in the city. What not to love about that?",
                "author": "Wanda '."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-05-20",
                "description": "This was fun. We really enjoyed LuLu's food truck as well as the fact that they had things that catered to animals and support their well beings. They also had a place where you can sign up to volunteer to help animals and as a animal lover I enjoyed that the most!",
                "author": "Why Lie .."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2016-10-31",
                "description": "My favorite farmers market in the St Louis area! People say arrive early for the best selection, but I was there closer to closing time and was still able to find everything I wanted, from freshly cut flowers from Urban Buds to artisan cheese at Baetje farms. The coffee from Kuva Coffee was some of the best I've ever had. And oh man the food selection!!! We had some homemade tamales that knocked my socks off and a crepe that was delicious. There were also some other trucks as well (although we were already full) so come hungry!! The live music adds such a nice vibe and sitting on the steps listening and eating while watching the market buzz was very relaxing. Soulard market is ok but it's more spread out and I think since most of it is enclosed I feel like the vibe is not as fresh bright and happy as Tower Grove. The vendors at Tower Grove also seem happier. Coming back for the free yoga soon and of course more browsing shopping and eating!",
                "author": "Christina M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-09-30",
                "description": "I visited this farmers market with my sister on a Saturday morning.  We arrived strategically as yoga was starting in the clearing nearby, in hopes that we'd make it out before to aspiring yogis (there were dozens) descended upon the small market.  There were some great purveyors here.  This isn't your average garden based market, but more of an artisan market:\nChocolates\nThree or Four Cheese places\nNaked Bacon\nThree places with a variety of pasture raised and non-GMO meats and poultry.\nFlowers\nIvan the Fig Man\nHomemade Butter\nAwesome Bread\nAmish Farmers\nI'm sorry I don't have all the names of the specific vendors but there were many tasty wares to try.  If you can only make one stop, though, stop at Ivan's for the figs!!",
                "author": "Katie S."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2015-08-08",
                "description": "This is definitely not my favorite farmers market. A lot of the stuff is pretty expensive. I got served lemonade from a supermarket brand for $3, I think that really tops my experience here. I can understand products being expensive because of the trouble the producers go through, but that's not really the case with a lot of the items that I saw.\nI really enjoy Tower Grove park and hanging out by the water fountain outside so I have a good time anyways but I'm not a huge fan of this farmers market in particular. As a consolation, the crepes that they sell in the food truck is pretty good!",
                "author": "Avinash R."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-06-08",
                "description": "This is hands-down the best Farmer's Market I've been to in St. Louis. The other one's I've check out have either been really tiny (not bad, but often hard to find what you're looking for), or not true \"farmer's\" markets (Soulard, I'm looking at you and your pineapples.)\n\nTrue confessions: I came to the Tower Grover market initially because I heard Chipotle would be giving away 2 for 1 burrito chits. I walked out with the chit, AND a free Chipotle bag made from an old banner AND a grow-your-own cilantro mini-kit. And that's just from the Chipotle stand.\n\nAnything you could want to get at a farmer's market is here. There's meat of all types, cheese (one goat cheese booth was particularly great), baked goods, coffee and tea, and of course loads of fresh produce. I saw scallions with bulbs bigger than my thumb and enormous bunches of mint leaves and cucumbers hefty enough to use as a warclub (if you really wanted to).\n\nI was a little alarmed when I noticed a field full of people lying down next to the market, but was reassured that this was the yoga offered weekly here, not some sort of cult ritual. \n\nUpon leaving we were offered plates piled with two different kinds of salsa made by girls at a local school. It was a delicious and heart-warming end to a fantastic morning at the market. I'm excited to go back again and try more of everything!",
                "author": "Catherine W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-04-18",
                "description": "Maybe it's because it's my neighborhood, but I prefer this farmer's market over any other I've been too in STL. Yoga on the green, fresh goods, everything organic, pet goods, a few food trucks... You will find almost anything you need. Seems to be growing each year, and note that it grows through the season as well, being a little more sparse in April and late Fall. Pets always welcome along with in Tower Grove!",
                "author": "Rachel W."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-08-03",
                "description": "I love this Farmer's Market, mostly because I love Companion bakery (especially their brioche, perfect for bread pudding, french toast, sandwiches, etc)!\nI also love Bittersweet Bakery that is always there... And Tower Grove Park in general is such a lovely setting for a farmer's market...\n\nI generally don't buy any of the fruits and veggies, just because they're a bit out of my price range, but it's a fun place to check out and take photos at.\n\nAlso, there's a fountain nearby with tons of kids running through it which just makes the place cuter.\n\nI like bringing visiting foodie friends here and they always love it too.... We always grab a snack and/or coffee... it's a pleasant atmosphere with lots of crisp white stalls with bright colored fresh fruits and veggies!",
                "author": "Amrita R."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-08-29",
                "description": "This farmers' market packs a lot of stuff into a relatively small area. And it's a popular place on Saturday mornings. So be prepared to be a little squished, bumped, elbowed, etc. But, I still like going. I'm not a weekly patron, but they have enough good stuff to lure me there early in the morning a few times each summer.\n\nThe fresh produce is a given, but some of my other faves include:\n- Farm Fresh Cupcakes\n- The Big Cheese\n- Companion Bakery\n- Queen's Cuisine\n- Black Bear Bakery\n\nObviously, I gravitate towards the baked goods. :)\n\nThey also have grass-fed beef (a couple different vendors, I think). I usually get there around 9:00 and nothing seems picked over. But I would still recommend getting there kind of early.",
                "author": "Marjie T."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-11-15",
                "description": "This is a great market. The beat I've been to in the city. \n\nThe mixture of stalls is wonderful, between fresh vegetables, meat, eggs, as well as farm produce like cheese, honey, and cider, and baked goods, fresh teas and coffees (available iced for those summer days). \n\nThe Big Cheese is great -- there's always a line of people hungry for possibly the beat grilled cheese I've ever tasted. I also enjoyed scones and shortbread from Queen's Cuisine. Bread from Companion Bakery is a must, as are popsicles from Whisk. \n\nThere's a great atmosphere here on a Saturday morning. I also can recommend the free yoga (with a donation). A great teacher and good atmosphere.",
                "author": "Caoimhe N."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-09-01",
                "description": "This is probably the most \"complete\" farmer's market in the area.  The collection of vendors tucked in the middle of Tower Grove is really great way to start a morning with plenty of awesome lunch / picnic options in the area.  \n\nWith that said, I've come here quite often only to leave with nothing.\n\nI'd like to point out that we have some pretty lame mushroom vendors in St. Louis.  The one at Soulard is definitely superior, but combination of price and variety and severely lacking.  All too often I end up going to Whole Foods after yet another disappointing round of trying to support the local guys.\n\nTower Grove farmer's market also suffers from stands serving the same stuff... after many years of trying practically every farmer's market in the area, I just overall disappointed that few compare to the one at Urbana, IL.  \n\nOk with all this bitching I'm going to have to say that this place is worth driving out of the way for, as they DO have a selection of cheeses, mushrooms, produce, and meat (Salume Beddu has a stand there!)",
                "author": "Allan C."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-09-16",
                "description": "I've always liked the idea of farmers markets. But getting someone to go with me, getting cash to pay and getting up that early on the weekend.... that's a different story.\n\nSaturday, I actually dragged my butt up and made it down the street for the Tower Grove Farmers Market and it changed.my.life. I'll be getting up every Saturday possible from now one.\n\nReasons why it is awesome:\n- Lots of local food. Not just fruits and veggies. And nothing with stickers posing as the real thing. There were the typical fruits, veggies, spreads, jarred goodies but also chocolate, coffee, tea, even meat! \n- Live music brought to you by KDHX\n- wading pools/fountains for kids (and adults?) to play in\n- a playground (with swings!)\n- lots of food to buy and eat on the spot, including, but not limited to tacos and crepes! Umm, breakfast and lunch plans? Check!\n\nWhile I love (and am always in awe of) the Soulard Market, TG is smaller, quieter, and less intimidating. You can pick up your produce, cheese, pasta, coffee, and even lunch (despite Southwest Diner closing their booth for a brick and mortar restaurant, there are still a couple sandwich options and other snacks available). They've usually got music playing and kids on the playground. It's just.... perfect. \n\nWe picked up some late season peaches and butternut and acorn squashes. And of course, stopped at the Holy Crepe truck for a frozen banana nutella pop.",
                "author": "Danielle H."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2014-07-27",
                "description": "This is a very nice farmers market but, and it's a big but for me a small one. Sure, I understand the ability to have multiple markets around the city to offer more for those whom live close to them but I just didn't get the true magical experience that some seem to get from this particular market. I did like the different tents that were there like the tea and chocolate vendors but the variety of the fruits and veggies was lacking to me. I'll probably just stick to Soulard in the future because they have such a variety of things that appeal to me.",
                "author": "Meg M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-09-17",
                "description": "I have been enjoying this market more than the Soulard market lately. Tower Grove is much more manageable for a 20 minute stop instead of a 2 hour stop. They have everything we need from eggs and cheese to bread and vegetables. They even sell ice cream and cupcakes for kids or adults like me. \n\nRight next to the tennis courts, so you can play a match before your shopping.",
                "author": "Greg L."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-09-23",
                "description": "This might be the best famers market in the area.  I don't want to throw that out there without noting that I haven't been to all of them, but it's the best of the half dozen or so close by.  \nMy visit last Saturday was helped by the fact that it was a gorgeous early fall morning and the whole park was bustling with happy folks attending numerous events.  I walked and immediately beelined to two of my favorite stops, Baetje Farms Dairy and Marcoot Creamery.  Got herbs de provence goat cheese at the former and habanero jack at the latter...YUM!  These were gobbled up in short order at a little shindig we hosted last night.  Moving along, I see the Mills family stand with apples and cider.  Cider is a must for fall, so got a half gallon that's already almost gone!  It's not quite time for hot cider, but it's right around the corner and one of my favorite hot drinks.  Other great picks- locally made spicy pickles, amazing fresh produce, huge bunches of fresh herbs for a couple of dollars, organic soaps, and lots of local meat.  I saw 4-5 stands with hormone, antibiotic free range pork, chicken, beef, and lamb.  It does get pricey, but is well worth at least the occasional splurge.  This time I just got a couple of pork chops, very reasonably priced.  \nThis is not a market that you go to and expect to find every type of produce under the sun. Soulard Market caters to that demographic, but a lot of their selection is not actually from farmers or local. Some comes from produce brokers, and it can be hard to know which stalls are really local, organic, or fresh.  Not that I don't love me some Soulard Market for certain needs, but Tower Grove is a true local farmers market with fresh, in season offerings.",
                "author": "Anita K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-07-13",
                "description": "Tower Grove Farmers Market is a mecca for fresh local food in St. Louis.  You can get just about anything you could ever want at a Farmers Market! The food is always local and sold by the farmers who grew it. No grocery store produce here!\n\nUnlike some farmers markets, you don't have to be there by 8 a.m. to score peaches, tomatoes or sweet corn. There always seems to be plenty to go around.  I don't get there until 9 or 9:30 most Saturdays and I am always able to get everything I want. \n\nThey also have delicious breakfast options to enjoy while you are there.  My favorite is grilled cheese booth. The breakfast taco booth usually has agua fresca too, which is a must on a hot summer day.\n\nIt can get quite crowded, but it only seems really bad after 9:30 a.m. Anyone who wants to avoid a crowd should definitely get there early. It's never bad enough to keep me away.\n\nThey have free yoga at 9 a.m. and live music every Saturday.  I can't think of a better place to spend a Saturday morning in St. Louis.",
                "author": "Erika F."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2008-04-26",
                "description": "It's a lovely market in a lovely part of the city. You couldn't ask for anything better, really. There is a big stage with live music, lots of stands with everything from lamb and pork to handmade beeswax items. \n\nThe last time I was there a man was selling fresh figs from a tree in his backyard. They weren't cheap, but hey, fresh, LOCAL figs in St. Louis. That's amazing!\n\nI've seen people carrying gourds as big as their heads, and there's a happy truck made to look like a circus caravan, selling ice cream and pretzels. The market has really grown from what it used to be and I'm so happy to see people taking advantage of this wonderful, locally supported market.",
                "author": "Stefanie E."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-11-15",
                "description": "We have been attending the Farmers' Market for four years.  It is a great weekly family outing.  The kids love the playground and fountain.  When the pool is in operation, it is like a toddler rave.\n\nThere is a nice mix of vendors, though I wish there was a bit more.  Also, it would be nice to see some vendors oriented towards families dealing with food allergies.  It is hard to say no cupcakes to the wee ones.",
                "author": "Morgan H."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2010-05-09",
                "description": "Since moving here in December I've been looking forward to the Farmer's Market scene. Everyone has something to say about them and while I'm not the \"locally grown or die\" hippy chick, I like to support my local growers and expand my culinary visions. Oh the ideas that develop while walking from stand to stand. Which I could have done yesterday morning, if only I had far far more cold hard cash. $6 for a small basket of strawberries? $12 for a tub of homemade pesto? $7 for a scone?! Are you mad? \n\nSo, yes, my delight was soon replaced with confusion and self doubt. Clearly my neighbors make more than I thought they did, yet they still can't seem to afford to mow their lawns... hmm, a point for another day perhaps. So I settled on some spinach pasta, chicken, a less expensive pesto, asparagus, and some delicious bagels. I have a plan to slowly eat my way through the market, one vendor at a time. The crepe stand appeared to be a big hit, or so I judge from the 10 people long line. The grilled cheese sandwich galore gentleman also had his hands full with 8 hungry customers. I'll have to return for those treats. \n\nI plan to come early with my wallet and bag in hand next week, but I plan on steering clear of those expensive impostor farmers.",
                "author": "Stephanie B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-05-27",
                "description": "The Tower Grove Farmers Market is quite possibly the best in the area.  Live music, a lot of vendors (30+ usually), free yoga (not my thing, but lot's of people like it), such an eclectic gathering of people, and you just gotta love Tower Grove Park.\n\nI am a bit disappointed to see people complaining about it being expensive.  Yes, it actually costs a lot of money to produce things, much less make a living off of it.  And you pay more for quality.  If you can't tell the difference between produce here and the produce at the grocery store, then please have your taste buds checked. [communist] I have zero problem paying more to support small farmers and small business over a faceless conglomerate that primarly profits from being cheap and from exploitation [/communist].\n\nAnyway, I love the atmosphere here and it just a great community gathering spot.  Sometimes it's more fun to people watch than actually shop.  If you have kids, there is a nearby wading pool and playground, and there are always tons of kids around.\n\nTo top it off, the owners update their website and facebook every week to let you know what will be fresh and for sale the upcoming weekend.  And they also have recently started a farmers market downtown, which shows a major commitment to the community.  If you need a reason to get your ass out of bed before noon on Saturday, this is it.",
                "author": "Joseph P."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-10-25",
                "description": "I finally got to check out this farmers' market. Every vegetable, meat, cheese, or bread I could have wanted was available. I liked being able to look at some artsy stuff, as well. I was also pretty stoked to find that they had a number of different places serving vegan things, including desserts. Eating a brownie on the way to the car really improved my overall shopping experience.",
                "author": "Tiffany N."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-12-16",
                "description": "The market runs once a month on Saturday mornings from October to April: In 2010 it will be on Jan. 9, Feb. 13, Mar. 13 and Apr. 10 from 9 to 1 in St John's Episcopal Church on Arsenal, just west of Grand.\n\nMost people don't realize that this market continues right through the winter, and this morning, as I was scrambling some local eggs with sunflower-yellow yolks and pouring a glass of fresh apple cider, I though what a shame that is. Of course, the selection is more limited than in summer.\n\nBut picture this: last Saturday, I'm buying a farm-fresh chicken and as it's being wrapped up, I'm told that I can get a great bargain on homemade sausage. Well, it seemed too good to be true. \"Where's that pork from?\" I asked. In reply I got a shocked look, \"These are our own pigs!\" she said, holding out two pounds of sausage, \"This is Charlotte and Wilbur!\" My heart and my appetite were touched. I bought the sausage. Now that's not going to happen to you at Trader Joe's.\n\nOf course, the guys from Salume Beddu, with their homemade sausage, caponata, and guanciale are there, too. So is the lady with the vast assortment of teas. And the farmers with their winter vegetables and herbs. And the couple who sell their own granola and pecans. And the chocolate-maker. And it's all fresh and local! Have I convinced you yet? Just go and feel glad you live in Missouri.",
                "author": "Maria S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-08-03",
                "description": "I remember when this farmer's market started. I was new to the neighborhood, they were new to the neighborhood, it was love at first sight, yaddayaddyadda...I COULD NOT GET ENOUGH OF THE STRAWBERRIES.\n\nWe've both evolved. I moved to the West Coast and did some soul-searching, and this farmer's market tripled while I was away!\n\nIt's still great, though. They offer free yoga in the early morning. They have that awesome fountain going off for the kiddos. You can shop for top-notch produce AND grab some iced coffee and a fresh crepe (or pastry or yummy bread from any one of many bakeries present...I also saw some 25-cent lemonade!). There's a mushroom booth with some of the most mouth-watering mushrooms I've ever set eyes on (I walked away with Truffle Mushroom Butter....oh, so good....). A lot of the booths carry similar items, but they all offer something unique, as well. \n\nLast time I went, I walked away with a container of organic peaches, another of fingerling potatoes that I simply couldn't turn down, and a bag of heirloom tomatoes. One of the older farmers that I purchased the peaches from snuck a fresh plum into my hand and shooed me away before his wife noticed. It made me chuckle, but that was a damn fine plum. (Maybe next week I'll buy some plums from him!) Another booth insisted on giving me complimentary ice, as all of the ice in my coffee had melted. \n\nThis is truly a neighborhood thing. Be prepared for the strong armies of strollers and some slightly inflated pricing, in comparison to Soulard and all-a that. BUT, the produce (and I assume the meats - I don't know in regards to that) is worth it. It's quality stuff and better than the majority of the option at local grocers. \n\nIt's also a really cutesy date for a couple that's been together awhile - you know, a couple that would spend Saturday morning together, anyhow. Take a walk to the park and grab some yummy breakfast, then buy the ingredients for a kick-ass dinner. It's worth the extra few bucks. Trust.",
                "author": "Danyell K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-08-04",
                "description": "My favorite farmers' market in the St. Louis area.  They have a great variety of vendors, all with great food/produce.   The selection includes produce, cheese, chocolate, tea, eggs, multiple meat stands, crafts, gelato, breads, baked goods, and even grilled cheese sandwiches.  We tend to purchase all of our stuff, grab some grilled cheeses, and sit by the kids' fountain and eat.  That way our children get to play while we can enjoy our Saturday morning.",
                "author": "William O."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2014-06-15",
                "description": "Went to yoga today at the farmer's market. Enjoyed the class. It was a slow flow class with a lot of warm up for a stiff Sunday morning body. Today's instructor was a substitute.",
                "author": "Erica F."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2012-05-19",
                "description": "I LOVE LOVE LOVE going to tower grove on Saturday morning!  Try the The Big Cheese and you gotta have a Holy Crepe too!  My boyfriend has been raving about the amazing bacon on his crepe for over a week now.  The produce is fresh and the people are friendly.  There is always tons of fresh fruits and veggies to choose from and several vendors with grass fed beef and other meats.  I've never been disappointed.  There's also live music, yoga, and craft vendors.  It's a great place to hang out, even if your not buying veggies.",
                "author": "Sarah W."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-06-11",
                "description": "Looking for something fun, unique, and healthy to do on a Saturday morning?  Come to the Tower Grove Farmers Market.  I went a few weeks ago, for the first time this year and it was great.  They have a great selection of locally grown produce, which are typically grown with less pesticides and chemicals, plus you're supporting local farmers.  \n\nThe market also has great music and a nearby water sculpture that kids and adults alike love to play in.  They have community out reach efforts, when I was there they were promoting helmet wearing for bike riders.  You'll also see many of your local government officials.  This is a true example of a place that helps promote community in St. Louis, so come check it out.  Also, don't forget to try the  North St. Louis Farmers Market too.",
                "author": "Howard M."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-05-26",
                "description": "Love the market. Love the atmosphere. It's dog friendly. There is some unbelievable produce and the fresh figs are amazing. It's also pretty darned expensive. Bring lots of cash.",
                "author": "Kathy H."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-05-07",
                "description": "I have not lived close to a Farmer's Market in a long time, so I love that there is one right in my neighborhood! They had so much things to choose from. The Art Vendors had a lot of interesting items and enjoyed looking through the trove of treasurers that had for sale. I definitely will head out earlier next time, since what produce they had were dwindling by the time I got out there. Overall a fantastic experience and looking forward to more Saturday mornings out in Tower Grove at the Farmer's Market & Bazaar!",
                "author": "Amanda S."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2008-06-18",
                "description": "Tower Grove Farmers Market and Bazaar has to be seen to be believed.  You know those fabled community areas where everyone gets along and there is much fun to be had?  This is that sort of place.  You can come here for community outreach groceries, free yoga and a whole lot more.  The people here are very friendly, and some are even eccentric.  Still, this is a safe and lovely place to bring the family.  There is a fountain that the kids like to play in, and there are sometimes talks that adults can listen to.  I was able to find some veggies here that I can't find in normal grocery stores, such as red oak leaf lettuce.  Prices can sometimes be high, but usually only on the rarer items.",
                "author": "Jennifer B."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2009-04-30",
                "description": "I cannot wait for the Market to start up again next week. We went there three days after we moved here last June and barely missed a Saturday between then and the fall closing. It is the best part of our week. I have never been disappointed with the selection or quality there!",
                "author": "Melissa P."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2008-07-01",
                "description": "Got to see this on my way to Pride this weekend just by chance.  Compared to most of the farmer's markets I shop in Chicago this one was really high surprisingly!!  Although cute...I felt that it might be purely locals since the two of us got odd looks walking around...like a 'we don't know you' curiosity look.  It was a bit uncomfortable.  A couple of people had yoga mats which if there's group yoga that's really neat!  I loved the fountain it's by!!  I was hoping to catch something different being in a different city and instead just got another market that seemingly jacks up the prices.  But cute - can't discredit that!!",
                "author": "Lindsay S."
            }
        ]
    ],
    "priceRange": "$$",
    "name": "Tower Grove Farmers’ Market",
    "address": {
        "addressLocality": "Saint Louis",
        "addressRegion": "MO",
        "streetAddress": "4256 Magnolia Ave",
        "postalCode": "63110",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/wPqc1lzFABySHdsraqMzIg/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}