{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2013-09-28",
            "description": "I know I'm in the minority 'round these parts but I actually prefer the Villa Park French Market (not sure why it says Farmers here) over Lombard's slightly bigger market held on Saturdays. Slightly less variety, sure, but a lot less hipsters and snooty upper middle-class types with way more charm and live music! \n\nThe selection is best if you go in the early morning around 8:30 or 9am but if you go later - usually after 11:30 - they start discounting off items or offering buy one, get one free in order to sell off all items before the market ends. In my experience, almost everything that Hahn's Bakery tends to sell (usually, as mentioned, B1G1 later in the morning) freezes beautifully so it makes it easy to stock up on freshly baked breads and muffins. There is another vendor from Michigan that always has the best apples in several varieties including the much revered Honeycrisp later in the season. \n\nIt is located right off the Prairie Path at Ardmore and Park and there are several bike racks nearby and parking is available at the lot across the street. The market is also dog-friendly and there are usually several leashed pups walking around at any given time so if you're allergic or (GASP!) just not a fan, keep that in mind.",
            "author": "Krystina S."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2017-08-20",
            "description": "CLOSED.\nWent there this morning and no one was there. No signage, no vendors - nothing. Checked  their website when I got back home and found this posted...\n\"Due to a lack of vendor interest, the French Market is canceled until further notice.*",
            "author": "C J."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2011-09-02",
            "description": "This Farmer's Market is TINY, but has the important staples the folks visit farmer's market for. Every Sunday 8am to 1pm from April to October you can visit this small little market. It's right off the Prairie Path so it's a nice stop before or after a morning workout or walk along the Path. \n\nThe vendors are friendly and chatty; I've never met a surly vendor here. They vendors are usually from Illinois, Wisconsin or Michigan. As I mentioned, it has the staples--Sweet Corn (Mirai corn, the BEST sweet corn I have ever tasted), berries, veggies (whatever is in season), fresh bread, pretty flowers, antiobiotic/hormone free meat, cheeses, pickles, salsa, doggie treats. It's a nice little stop during Farmers Market season.",
            "author": "Aimee M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-06-22",
            "description": "Lovely little market. The only reason it gets 4 stars instead of 5 is that it is just that - little. However, since it is smaller than others (Wheaton), it's not nearly as overwhelming and crowded.  The merchants who are there are very kind and friendly. They'll give you baking ideas, storage tips, and just in general provide great customer service. There's live music and you can find local fruits, veggies, crafts, honey, bread, fresh drinks, etc.  It's also open to dogs and right along the prairie path so it's easy to reach by walking.",
            "author": "Sandra K."
        }
    ],
    "priceRange": "$$",
    "name": "Villa Park French Market",
    "address": {
        "addressLocality": "Villa Park",
        "addressRegion": "IL",
        "streetAddress": "S Ardmore Ave",
        "postalCode": "60181",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": null,
    "@type": "LocalBusiness",
    "telephone": "+13125750286"
}