{
    "aggregateRating": {
        "reviewCount": 11,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-14",
            "description": "What a great find along route 59!  I religiously hit the farmers market every Saturday morning, but last Saturday I couldn't get up in time, and I assumed I was SOL for the week.  My son was playing in a football game @ Commissioner's Park down on 111th, so I found myself in this neck of the woods in the afternoon.  I was pretty psyched to see this place, so I drove in and found some amazing produce sold by really nice people!\n\nMost of the stuff they sell is locally grown, and what isn't local is clearly labeled. I'm not a \"locavore\" and I think the whole concept is kind of silly, but I do love the freshness of the farmers markets and farmstands. These folks tell you exactly where you are getting your produce from, so if that's important to you, they've got you covered.\n\nTheir carrots here are amazing.  For years we used to buy the baby carrots at the grocery store.  Let me tell you, the real carrots that you have to peel and cut are 100x tastier than baby carrots, and the carrots here are the best I've ever seen (or tasted).  I also picked up some beautiful arugula (just barely bitter and delicious), celery, 6 ears of corn, and a few other items.  They also have a really beautiful selection of pastas and honey.  \n\nPrices were VERY reasonable.  For the quality I would have honestly paid more, but I got out for less than $25 for over a week's worth of produce.  They are really nice people, and they even take credit cards (which is great).\n\nOverall an excellent farmstand!  I will be back the next time my kids have games out this way.  I might even make a special trip or two just to get more of those carrots, too.",
            "author": "Matt G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-07-26",
            "description": "Really cute little farmstand/nursery. All the produce looked really fantastic and fresh. There were all sorts of homemade items in jars. Jams and jellies. Fresh honey and maple syrup as well. \n\nThe only reason I'm giving them a 4 star review is the fact that unless you had a landscaper you could not purchase items out in the fields. I get it that many people are fine with hiring a landscaper, but my husband and I prefer to do our own landscaping. I am not sure why this was a requirement and I hope in the future they will rethink this as it deters probably many more customers.",
            "author": "Melodie M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-11-08",
            "description": "One of the best farmstand I have been.  Very clean and fun to go around.  Lots of fresh veggies.  Love the onion and the eggs that they sell are the best.  Love the hot peppers, fresh spinach..... I can go on and on about this place.  The ladies are wonderful and wish them the best.",
            "author": "Yogi M."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-08-13",
            "description": "I have been a fan of this farm stand since we discovered it. And my latest experience there has left much to be desired. One of the clerks, a blonde woman with a practical bob was very rude to me and my daughter. And when we moved from the tomato area she took away every tomato I and my daughter touched. She accused my daughter if squeezing them when she hadn't. And for her to talk to a 4 year old and not me directly seemed wrong. I have no idea what that was about but I will not pay money to be insulted. There are quite a few farm stands in the area. And a French market nearby. I'll take my business elsewhere.",
            "author": "Vi B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-07-24",
            "description": "Awesome people and great variety of local (when possible) fruits and veggies. We come here almost every weekend.",
            "author": "Eric P."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2012-07-30",
            "description": "Very disappointing produce and even worse customer service. \n\nStaff was too busy flirting with customers to take a question, and when finally talking to a manager they were condescending and abrupt. \n\nProduce left MUCH to be desired being dry and bitter when expected to be luscious and vibrant.",
            "author": "Christopher K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-08-16",
            "description": "Fresh local produce and friendly, helpful service.  Took a ride out to the \"country\" to get tomatoes and fixin's so hubby could can a batch of his delicious chili sauce.  Great variety and lots of other items too such as jellys, popcorn kernel varieties and pickles.  Definitely will return.",
            "author": "Suzanne D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-08-09",
            "description": "This is a nice produce stand housed in a little barn structure, the rural nature of which is oddly juxtaposed against the screaming traffic of Route 59 beyond. Beyond carrying a variety of fruits and veggies -- potatoes, onions, pattypan squash, eggplant, zuchinni, green onion, radishes, apples, peaches, plums, blueberries, among other things -- they also have a number of jams and jellies, sauces, salsas, pickles, and pie fillings ready-made for sale. \n\nI bought a half-dozen ears of bi-color corn for $2.50 I believe (they were pre-bundled and I prefer to choose my own from open stock, but the one I pulled out and had a look at looked good, and all the tassels were still golden and sticky, a sign of fresh ears). I also got a little bunch of purple radishes, and the lady ringing us up threw in the last remaining bunch of radishes they had for free (it was nearing the end of the day, and \"they just looked so sad by themselves!\") I also nabbed a peach and a Jersey Mac apple -- easy breakfasts, and they looked so much better than the grocery store versions, particularly the apple! \n\nThere is also a small selection of potted plants outside for sale. The bigger selection of plants off to the side are apparently sold only to landscapers. \n\nThey are open daily from 9-6 through Halloween. So the next time you're fitful for a forkful of the farm but you're cruising by in your convertible on 59, make a pit stop at Wagners and grab some greens. You should eat more roughage anyway.",
            "author": "Shannon M."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2011-08-14",
            "description": "This farm stand has what I need and I frequent this establishment every two days!  \n\nArugula, cilantro, basil (italian, lemon, thai), cucumbers, white and red potatoes.  White corn and bi-color sweet corn.  Rainier cherries.\n\nI buy the hot corn salsa and pour it over the arugula for extra spiciness.\n\nI also bought an Endless Summer Hydrangea from their flower collection.  It's very large and healthy!",
            "author": "Cathaleya C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-09-30",
            "description": "We love, love, love this farm stand! The corn is picked fresh every day and all the produce is fresh and good. And they sell a sauerkraut that is the best ever as well as great pickles. \n\nHighly recommended.",
            "author": "Jeanne H."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-10-18",
            "description": "I enjoy going to this small friendly farm stand every week from July all the way thru October! The corn never disappoints! And the nectarines, grapes, tomatoes, potatoes, apples,(including honey crisp) pumpkins, and melons are so tasty!  I am always so sad when it closes for the season.",
            "author": "Jane J."
        }
    ],
    "priceRange": "$$",
    "name": "Wagner’s Farmstand",
    "address": {
        "addressLocality": "Naperville",
        "addressRegion": "IL",
        "streetAddress": "9937 S Rte 59",
        "postalCode": "60564",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/JP64dA4yHwlv6_maFmw3ew/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16309040016"
}