{
    "aggregateRating": {
        "reviewCount": 5,
        "@type": "AggregateRating",
        "ratingValue": 3.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-10-08",
            "description": "This is a great little place! I usually try to come as much as I can to support the local businesses. They have a good selection, fair prices and helpful staff. \n\nI know they have tons of pumpkins right now too for Halloween approaching :)",
            "author": "Chrissie C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2010-06-03",
            "description": "I have found a new love: Webster Groves Farmer's Market!!!! I felt like a kid in a candy store there. It just opened today in the Old Orchard area. Why do I love it so? Well, besides the fact that it's in my hometown (score), it has amazingly diverse sellers that make it high caliber. It goes way beyond produce! Here are just a sampling of things being sold other than produce:\n- Soap\n- Wine\n- Eggs\n- Plants & Herbs\n- WATER PLANTS!!! I bought some for my pond\n- Fish - tilapia and koi - live - you have to pick up at their farm\n- Soap \n- Sugar scrubs\n- Lip Balm\n- Sauces\n- Maple syrup (and they sell syrup suckers!)\n- Produce baskets\n- Cheese\n- Nuts\n- Homemade pasta\n\nI'm sure I'm forgetting things considering that a couple of the booths had already sold out when I was there towards the end of the market. It was very busy. I will DEFINITELY be back!!!!",
            "author": "Sarah S."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2012-09-04",
            "description": "Cute little farmers market.  I picked up a few items, ones I could eat immediately and those that would last a few days since we had a few days left in St. Louis, plus the drive back to Chicago.  I love farmers markets...I wish I could have bought some of the cheeses, they looked yummy - but they didn't fall in either category - not like I could shove a brick of cheese in my mouth - well I COULD, but that would have put a real damper on the rest of my trip.\n\nGotta look out for more local farmers markets.  So cute and such a great way to support the local businesses.",
            "author": "Lupe D."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2010-08-13",
            "description": "I have to strongly disagree with Sarah A.  I'm not sure if I happened to pick a Thursday when no vendors decided to show up or what, but it was a pretty sorry excuse for a farmers market.  I got there about 4:30 and there was exactly one stand selling produce.  And it was small, skinny, sorry looking veggies that cost exactly the same price as they do at Schnucks.  I was so disappointed.  In addition to that booth, the other handful of booths included peaches, homemade soap, meat, breads, empanadas, fresh pasta, and t-shirts.\n\nI'm very willing to upgrade my review if I happen to go back and it's improved, but as of now I have to stick to one star.",
            "author": "Marjie T."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2013-09-12",
            "description": "Like Marjie who wrote \"...I'm not sure if I happened to pick a Thursday...\" I also went on a Thursday. Regardless, my main complaint was the attitude of the cashier. Maybe it's my long hair (I'm a guy), or my deodorant wasn't strong enough (or too strong), or maybe she was in a hurry to get to lunch (it was noon-ish). Who knows, right? Fortunately I don't live in the area, I just happened to be passing by. I live in U. City where the folks at that Farmers' Market have never failed me with their civility nor their produce nor their prices. In fact, on at least one occasion, they gave me some of their offering free because it looked kinda lame.",
            "author": "Keith R."
        }
    ],
    "priceRange": "$$",
    "name": "Webster Groves Farmers Market",
    "address": {
        "addressLocality": "Webster Groves",
        "addressRegion": "MO",
        "streetAddress": "Big Bend Blvd",
        "postalCode": "63119",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y5dmkgrtXAkRaDSgPFs5TQ/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13149635696"
}