{
    "aggregateRating": {
        "reviewCount": 2,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-07-01",
            "description": "We love Wellhausen.  We just started our second year with them.  Farmer Jim is very honest in his newsletters about what is happening on the farm, both good and bad.  The produce is great!  You get fruit and vegetables!  We ended up with three large pumpkins last year that my daughter is still talking about.   I love that it gets delivered to my door.  The first few weeks we weren't sure what time it would be dropped off, but once Farmer Jim gets his route figured out, the delivery is about the same time every week.  \nHe doesn't always respond to email quickly, but that's because he's a farmer.  He works on a farm, not in an office.  He's very friendly and really cares about the food he grows.  We have been very happy!!",
            "author": "Raymond D."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-09-08",
            "description": "I am well into my third year with Wellhausen Farms.  Each of the years has been very different.\n\nPros:\nFresh veggies delivered to my door every Sunday between late June and into late October.\nVariety of stuff that I wouldn't always think to purchase at the store.  Forces me to try new things.\nSupporting a small farmer that grows food naturally.\n\nCons:\nExpensive - For $19 a week I just don't feel like I am getting very much, but there is a delivery charge basically included in the cost.  \nThe variety comes over the course of a season.  But due to the way that veggies grow, you are likely to get a lot of something for a couple of weeks when it is in season.  I am often overwhelmed with too many onions, cabbages, greens, etc. in any given week or consecutive weeks.\nActual farm is in Wisconsin, not IL.  Not really as local as I had hoped.  But what did I expect since I live in the Chicago suburbs.\nTomatoes are delivered green.  It just isn't the same.\n\n\nI have also purchased the bulk  beef and pork from Wellhausen.  I was interested in getting a variety of farm raised meat wrapped in old fashioned butcher paper.  My first disappointment was when I received the meat and it was only wrapped in a single sheet of paper that ripped easily was the frozen beef poked through it.  I gave this feedback to Farmer Jim and he said he would pass it on the the butcher.  Then the next year I ordered a half of a pig.  The wrapping has the same shortcomings.\nOne observation about naturally raised cows... the meat is very lean.  What I learned is that I actually like a little fat in my beef.  For instance, the ribeye was so lean that it was too tough and dry for my taste.\n\nI am really torn about how I feel about doing business with Wellhausen Farms.  Each year I have reasons why I say that I am going to cancel, but then I keep doing signing up and hoping that things will get better.  I really like the idea, but I am not fully satisfied with the execution.  I just can't use this many onions!\n\nI am giving a 3 star rating because they are good, but not great.  Perhaps my expectations are not in line with what Wellhausen has to offer.  Perhaps someone else will love them.  I don't discourage anyone from giving this a try, I just cannot heartily recommend it.  Maybe next year will be better...",
            "author": "Don Z."
        }
    ],
    "priceRange": "$$$",
    "name": "Wellhausen Farms",
    "address": {
        "addressLocality": "Wheaton",
        "addressRegion": "IL",
        "streetAddress": "",
        "postalCode": "60187",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media1.fl.yelpcdn.com/bphoto/nQUNmV9IeXBb_cxq6M7V7g/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+16302312350"
}