{
    "aggregateRating": {
        "reviewCount": 7,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2011-08-17",
            "description": "LOVE me a Farmer's Market. I have a bulls eye on my back that says SUCKER FOR FARMER'S MARKETS!!  I am quite the sucker for fresh produce from a Farmer's Market even though prices can be more expensive than Whole Foods!!  Just the idea of the array of fresh veggies and fruits makes me tingly and excited and my hairs stand up on my arms!!  \n\nAnyway, this farmer's market is pretty small, but that had a fantastic variety of veggies.  Everything was fresh and hard, not soft and ready to rot.  They also have several vendors there, like a gourmet popcorn stand and a bakery.  WAIT did I tell you that I also am a HUGE HUGE sucker for fresh baked bread!!  HA, so I bought  a loaf of freshly made bread which tasted fantastic for sandwiches.  If they had more vendors this would degi  \n\nThey are open for business on Thursday afternoons and parking is easily accessible and close to the market just across from the train tracks.  \n\nThis double sucker for the word fresh will definitely be back!!  :P",
            "author": "Robyn C."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2015-06-12",
            "description": "Wow, what a disappointing farmer's market. Kettle corn ($4 and $6), some veggies, strawberries ($6 pint!), cheese, zzz... very very small, expensive, and frankly, not worth traveling more than 4 blocks to get to.",
            "author": "rachel w."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-12",
            "description": "Not a bad market overall. It's a little small, especially if you're used to something like the Oak Park Market or Green City Market.  \n\nThey have various items - cheese, veggies, scarves, jewelry, baked goods, blueberries, meats, etc, etc. I'm sure it varies. I was a little disappointed today that the tomato sauce lady wasn't there, but c'est la vie.  Some of the green produce (lettuce, herbs) at at least one vendor was a bit wilted today, maybe it wasn't super fresh, or maybe it's because it's 96 degrees out.\n\nAnyway, it's worth checking out.",
            "author": "Karen Anne B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2013-06-25",
            "description": "This farmers' market is pretty small.  They have a small selection of fruits and veggies, meats, Lake Michigan caught fish, bread, pastries and popcorn.  Some were selling jams/jellies, jewelry and there even was wine tasting!  Overall, it is cute, set in downtown Western Springs, a very lovely neighborhood.  It is pretty small; I don't think we will be back, unless we are in the area on Thursdays between 2pm-7pm.",
            "author": "Amelie and Dan B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2009-06-19",
            "description": "After visiting the running shoe store that did not carry my size in a motion control shoe, I wandered over to the market. \n\nSome of the produce looked good. Some was already spoiling or pretty beat up. So, like Stanley's in the burbs but outdoors. Prices ranged from regular farmer's market high prices to seeming values. There is a cheesemonger, someone selling popcorn, several bakeries, people selling preserves, jewelry vendors. If I missed anything, read the other review/ad. \n\nIt is convenient to the train and downtown Western Springs. Parking was easy. \nI got a smiley face cookie.",
            "author": "Anpan W."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2012-02-26",
            "description": "I love the people  who sell the Mirai corn.  That stuff is addictive and always delicious.  I have everyone hooked on it.  I usually frequent the Pampered Chef booth too.  I like to check out their new stuff without having to go to a show.  \n\nSome booths are just okay which is why I gave a four star instead of five. I also like that I can get to it after work.  Many of the farmers markets are during the day or take away from my weekend plans.  This one is until 7:00 on Thursdays.",
            "author": "Ruth B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2008-06-17",
            "description": "Western Springs French Market is part of the Bensidoun Company, which began doing markets in France in the 1940's.  The Bensidoun Company now hosts 10-12 markets weekly- each one offering something unique to it's community.  Organic eggs, produce, pastries, and perennials as well as local talent- one-of-a-kind jewelry, photography, and paintings.  The Western Springs French Market is proud to have Jake's Meats- mentioned by Steve Dahl, local radio personality and resident of WS. The town has gone wild for their pork products and we had the smoked pork shops last night everyone is raving about and I agree! They're really yummy.   The great benefit to this market is that it takes place weekly from 2-7pm so it gives people an opportunity to catch it after work- directly from the train as the market is located just steps from the train station in Western Springs, \nHighly recommend this little gem of a market.",
            "author": "holly r."
        }
    ],
    "priceRange": "$$$",
    "name": "Western Springs French Market",
    "address": {
        "addressLocality": "Western Springs",
        "addressRegion": "IL",
        "streetAddress": "Hillgrove Ave And Grand Ave",
        "postalCode": "60558",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media4.fl.yelpcdn.com/bphoto/RW7C-HOt_zwVwFiz8VAS2w/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+13125750286"
}