{
    "aggregateRating": {
        "reviewCount": 42,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-09-30",
            "description": "Yesterday the market was busy!  People frantically moving from stand to stand searching for the best deals. It was alive. \n\nFall is also a fun time to come. The heirloom tomatoes are at the end of their season to make way for a variety of squash, pumpkins, apples and Indian corn. Oh and those swan gourds definitely were named appropriately. \n\nWe came in search of multicolored carrots in a variety of sizes to make up a batch of canned Mexican spiced carrots.  We did not leave empty handed. \n\nMarket goes through November so you still have time to check it out.",
            "author": "Amy M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2017-07-23",
            "description": "Dam it here I go again passing the farmers market at around 2 ish and it's still open, what the hell is going on here because so I said just stop and check it out. Today is going to be the last time that I drive by and not stop and I don't know why it's still open at this time because I don't remember it having afternoon hours. \n\nOk I will be honest I really wanted to see if there was a cool food truck that I have never been to and there was but it was Thai tacos picture on it and I'm really getting so tired of 95% of the trucks that I find are taco trucks so I passed even though it was Thai tacos.\n\nThe place was crawling with people but I had no problem with parking at all. There was a lot of vendors selling the same produce and there was a couple things that caught my eye, peaches 3-$5 seemed kind of expensive so they better be the best peaches I ever bought. Apple holler had some fresh baked pies so the strawberry rhubarb sounded good and it was a mini pie so I grabbed one, still exploring the sweet tooth thing.\n\nThere was plants, cactus plants, veggies which some that I don't even have an idea what to do with, Mexican sweets etc, pies, breads, jams, honeys, fruits, meats etc I noticed while walking around. There was a ice cream truck that had hot dogs and pop corn etc.\n\nAfter finding a couple things and with I imagined the venders and food trucks changing and offering different items at different times I can see my self stopping back again and checking them out again.",
            "author": "Steven T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2018-05-12",
            "description": "Love this place.  The wind was pretty bitty today but a lot of vendors still made it out even though it's early in the season.  We bought 2 gorgeous hanging baskets.  I'll buy some more perennials in a few weeks after We see what made it through he winter.",
            "author": "Brad P."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-09-05",
            "description": "Who doesn't love a farmer's market! I have been coming to this market for years. I absolutely love all the produce that the farmers bring. This time of year the Apple cider is fresh and the vegetables are perfectly ripe. There are always many farmers to choose from a long with delicious bakery and beautiful flowers and plants. They're open three days a week which is convenient for anyone's busy schedule. If you love the outdoors and love fresh produce definitely stop by this farmers market. It's a classic market with the friendliest farmers.  By the way the Dutch apple pie is amazing from the bakery at the market!!!",
            "author": "Sarah I."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2015-09-29",
            "description": "It's the oldest farmers market in the area. It's a few minutes from my house, and I never went. I finally made it on Saturday and was impressed. One thing I like is that on Saturdays, it opens at 1:00 and stays open until 6:00. No more 9:00AM to Noon or 1:00 stuff, which is fine if you're a morning person, but I'm not.\n\nI like sleeping in on Saturdays and the other 6 days too, but mostly Saturdays.\n\nThe market is huge and covered. Food trucks also make appearances so you can buy lunch before the market opens, and that might help prevent you from shopping while hungry, which is dangerous.\n\nI bought pink pearl apples and farm fresh eggs on my visit. I'm glad I finally made it and I'll be back again!",
            "author": "Rick R."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2018-08-29",
            "description": "Visited in mid August this year and when I got home my wife was so disappointed as she said the peppers and tomatoes I bought were definitely not farm fresh as they had little flavor.....more like large grocery chain you could buy in January and have little flavor. People were pleasant otherwise this is 1star.",
            "author": "Tom K."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-07-29",
            "description": "Very disappointed after hearing from friends to come visit The West Allis Farmers Market.  There was tons of vendors to pick from but 90 % of them carried the same items \" produce .\"     But they did have 3 food trucks that I have. Plus a few vendors that were on the street selling mainly produce from what I saw.    Having a bigger farmers market isn't always better.  I'd rather do to a smaller market that has a good mix of vendors to pick from.",
            "author": "Audrey G."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-10-05",
            "description": "I've been coming here since I was very small and I'm happy to say that it hasn't changed a bit. My good griend and I make it a point to visit every Tuesday to buy fresh vegetables and herbs. Better yet, I live 2 blocks away. Local, fresh, tasty produce and a chance to support our farmers. How can you go wrong?",
            "author": "Gabrielle B."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-12-31",
            "description": "My family is from Europe, so we like fresh food. Fresh is best, right? Of course. \n\nMy family has been coming here for probably 50 years. There's no place like it. Farmers who actually grow their own produce, harvest it and bring it to market place. \n\nThose who shop in the regular food store should know that beautiful sign you see hanging of fresh eggs or dairy with the pretty little farm is far from the truth. Today's mass producing farms look nothing like the small local farms, which is why I love and gladly support these farmers. What is surprising is that these folks charge lower prices too. \n\nAnother thing I like about this farmers market is being able to support the local community, keep jobs and trades alive and of course, being able to ask farmers questions. This place is totally cool when I come up to Wisconsin in the summer I always bring a big cooler so I can take food back from these farmers.",
            "author": "Janos J."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2015-06-25",
            "description": "I love this farmers market, mostly because it's the only one I can ever go to, but also because it's really easy to access and the vendors are pretty cool. \n\nIt can appear confusing to access at first, but there is plenty of street parking nearby and a gravel lot across the street that tends to fill up quickly. I don't mind walking so I will park closer to the Pick 'n Save down towards 70th. This is the easiest but offers a slight uphill walk to the market. But hey, you're shopping for fresh produce to eat healthy, embrace the tiny bit of exercise!  Oh, and bring a caddy or some shopping bags to carry everything back to the car.\n\nI have a tendency to walk around the entire market before making my purchases. Since there are so many vendors, you will notice that several will be selling the same items. It's really a buyers market. Shop for the freshest and best priced produce and don't just buy what you need at the first stall, unless you want to, or if they are selling pastries. Buy pastries at the first stop. They will sell out and you'll be sad!\n\nI mentioned the hours - this is the best part. I work every Saturday morning so I miss out on 95 percent of all the farmers markets. Since this one opens at one, I still have plenty of time to drive here and look at items before the vendors start packing up for the day. They also have weekday hours on Tuesday and Thursday which is a major selling feature of this market. Can't make it on the weekend? Come down on Tuesday! I love it. Much like any market it's generally better to arrive earlier than later to avoid large crowds and score plenty of goodies.\n\nAnother reason why I like this market so much is that the vendor areas are covered. When it's all hot and sunny, you are shaded and comfortable. The same goes for light rain. It's a pleasant shopping experience at times when the weather could ruin your day(and the produce). \n\nDogs are not really allowed here but I'm not sure how well that's enforced. It's a stressful place for a pup with so many people and new smells. Please leave them at home if at all possible. Last summer I saw one almost bite a child - it's just not worth the risk of losing your pet or harming them or someone else.",
            "author": "Melanie L."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-09-13",
            "description": "One of the best local farmers markets around.  You can find everything fresh and locally grown here.  Flowers,  fruits,  Veggies,  herbs,  and meat/eggs. When it first opens it's very packed,  also remember to bring a large bag or basket if you plan to buy a lot. Most transactions are cash only.  Vendors are always nice and informative about their produce.  Best deal on organically grown produce anywhere",
            "author": "Tamara S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2017-08-12",
            "description": "This is an okay farmers market. I was impressed by the size but disappointed by the quality and lack of sustainable practices. Very little organic produce, most farmers here spray pesticide and fungicide. Be sure to ask EACH booth if you care about that. The \"fer-li meat & sausage farm\" team was rude and unhelpful. Don't shop there if you don't like being disrespected. After paying $11 for ground beef, the man went in the truck and brought me out a tube of frozen meat in an opaque bag. I felt it and noticed it was hard as a rock, frozen completely solid, like it was in the back of a deep freeze for months. When i complained that their advertised fresh meat is frozen, and I find unacceptable., the wife asked me snappily, \"what on earth would make you think that?!\" I replied, \"well, that's how you were advertising it two minutes ago.\" She went on to babble about how all her chickens are grass fed and free range, and she works the farm everyday. While that may be true, it has nothing to do with the matter at hand. She offered to slice the tube of meat open for me if that would make me happy. I explained that I had a variety of chef's knives at home, and didn't need somebody to slice open the package, and no, that would not make me happy. What would make me happy is you returning my money to me, or you  producing the product as advertised. Lost that battle unfortunately, but would never return to their booth EVER again. Also disappointing was the peach booth where peaches were either moldy or rock hard.",
            "author": "Rachel A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-08-16",
            "description": "WOW!! Took our first visit to the farmers market today and I am amazed! The prices were such bargains and the produce was too notch! Only took $20 but came home with a full weeks worth of veggies! I cannot wait to go back Tuesday! Next time I will purchase some of the beautiful flowers that were displayed throughout the market. There was also a honey stand. Mushroom stand and duh a wife variety of fruits and veggies. More veggies that fruits this time around. \nWe arrived right at open and parking was getting difficult to find. Luckily we managed to parallel park just across the street and had no problems getting in or out of the spot. Plan accordingly due to parking.",
            "author": "Krysta K."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-05-22",
            "description": "I've always enjoyed this market for the most part.   The afternoon operating hours on Tuesdays, Thursday and Saturdays make it more accessible many days.  \n\nAt the height of the season Saturday afternoons can get pretty darn crowded in all four aisles as well as the surrounding area as many vendors with trucks for setups t large for the stalls park on the perimeter. I personally prefer Tuesday or Thursday right after work for a quicker stop.\n\nThe variety is always great.  In season just picked produce is always in abundance.  In spring flowers and garden plants along with plenty of herbs are numerous.\n\nSprinkled in between all this bounty is pure honey and maple syrup, pickled mushrooms, and plenty of buffalo, cow, chicken and other meats fresh from the farm.\n\nOn my last trip a vendor from the market explained that not all vendors are there every week, some are every other and a few once a month.\n\nSo wear comfortable shoes, bring a big sturdy bag and be ready to be impressed with the selection no matter the season!",
            "author": "Carrie G."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-08-25",
            "description": "I stopped by the West Allis Farmers Market with my husband because it's been years since I've gone.\n\nWe were able to find street parking fairly close with no problem.\n\nWow - there were a lot of different vendors with a lot of variety of vegetables among other things. I was glad to see a couple vendors that were selling various types of meats (although I didn't buy any).\n\nNext time I go, I need to bring a cooler with wheels & more cash :-)",
            "author": "Jennifer C."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-05-30",
            "description": "This is totally the best market in town. Get your fix three days a week and you don't miss out if you sleep in on Saturday! Tons of vendors with anything you desire. Parking is pretty painless as there are a few small lots and plenty of street areas.",
            "author": "Andy K."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2016-09-29",
            "description": "Fantastic organized clean large FARMERS  MARKET !!!!! I go their all the time good quality reasonable market !!.",
            "author": "Leona S."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-09-07",
            "description": "Been here a couple times now, and will definitely be back. \n\nThe lanes are stacked with produce and the vendors are so friendly! Something that amazed me was that the selection seemed to be about 95% produce and only about 5% canned goods (jams/honey/syrup) or frozen meats. Which was fine-but a heads up to anyone looking for those items, they're not there (or at least they weren't this weekend). \n\nParking is pretty accessible with many side streets to park down, without a need to walk very far. \n\nThe pavilion is a great feature-allows shoppers to get out of the sun/elements. \n\nAnother bonus is that it is at 1pm, so you don't have to rush the morning to get the best stuff!",
            "author": "Jake E."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-05-27",
            "description": "I moved within walking distance of the West Allis border a few years back and I expected to find guys in trucks, plenty sports bars playing NASCAR races, dive bars everywhere and chains, chains, chains.\n\nWhat I didn't expect to find is the best farmers market in a 50 mile radius.\n\nThis is my absolute favorite part of anything West Allis. I count the days until that first Saturday of May, and loath the end of October when the market closes for Winter.\n\nYou can find absolutely anything here. Veggies, fruit, honey, baked goods, potted plants, meat, cheese, etc. I can literally come here at noon on a Tuesday, buy everything I would need for a dinner, and have it on the table by five. Nothing is more enjoyable than a dinner with fresh picked vegetables.\n\nSo many vendors are here that you can usually shop around and find the lowest price on certain items, especially when they are in season.\n\nI love the little trailer that sells the fresh meat. I also love that Apple Holler brings a crapload of bakery here everyday.\n\nI tend to avoid Saturdays here in the mid Summer to Fall. It gets pretty crowded, I've seen both lots fill up and I had to park a couple blocks away. I'm glad they are open 12-5 PM on Tuesdays and Thursdays.\n\nIf you come hungry, don't worry. The street is lined with food trucks making food, anything from pulled pork, tamales, ice cream, Italian sausage, soup, burgers, even Greek food sometimes.\n\nThis is too awesome not to support. I hope to enjoy this farmer's market for years to come.",
            "author": "Joseph W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2013-08-10",
            "description": "A shining star of West Allis.  \n(silly, yes, but true :) )\n\nDefinitely check out the super fresh and tasty produce from all of the different vendors - I have certain favorites I'll sometimes get hooked on (the singing sweet corn guy, for instance, is too cute for words), but they all have great stuff, and I do like to change it up sometimes.  \n\nLoads of options, in case you do find some veggies or fruits you aren't as fond of... \nOverall, more veggies than fruits, but there are some tasty fruits to be found.\n\nAdditionally offers some baked goods from apple holler, as well as different vendors along the edge with soups, cookies, bubble tea, ice cream, and more!\n\nI also really like that they are open Tuesday, Thursday, and Saturday, to give more options to shop.  \n\nMan I love that singing corn guy.",
            "author": "Karrie M."
        },
        [
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2010-10-21",
                "description": "Another thing I miss about Milwaukee and the old neighborhood. \n\nThis was right down the road from our old place. It was so easy and convenient to get to with a great variety of fresh vegetables, flowers, plants and other great items.\n\nParking was easy or we would just walk since it was only a few blocks away.\n\nNot sure whether or not they still have the trash and treasures event that shared the spot when the farmers market wasn't going on, but what a scene. Aisles and tables full of old junk, toys, tapes etc. A big flea market of one man's junk, another man's treasure. Couple guys walking around with snakes wrapped around their necks.\n\nEnergetic bunch of shoppers and sellers. Whew....Defintely worth a visit to both the farmers market and the trash and treasures if it's still going on.",
                "author": "Amy R."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-07-24",
                "description": "Love this market.  Great flower selection! All the vendors are great and it's a great place to try new things.  Don't know a recipe for that new vegetable / fruit find?  Ask the people around you - everyone is happy to give recipe tips!  Have fun!",
                "author": "Jennifer S."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2012-10-03",
                "description": "Pros:\nGood size, close neighborhood parking, fresh produce, seasonal treats. Close enough to bike to as well -- just don't forget your backpack. I enjoy the afternoon hours on Saturday -- I can usually swing through here in about 20 minutes and grab what I need or what I forgot/didn't want to purchase at another area market. You can get everything from fruits and veggies to flowers, pastries, and meat, or stop for a walking taco or brat.\n\nCons:\nCan get very crowded when they first open. If you're looking for a particular vendor's goods, sometimes the more popular ones sell out of stock quickly. I'd love to see local/semi-local breweries (Lakefront, Milwaukee, etc.) here but I am not sure of the legal issues or logistics to that -- but it would be great to see!\n\nI feel most of the stereotypes of Milwaukee-ans / Wisconsinites are unfounded as we're not all brat vacuuming, beer chugging, lazy, unconscious Packers fans. People in Milwaukee care just as much about being healthy, eating fresh produce, and buying local. Take that, dirty big cities!\n\nPeople rave all the time about the Madison farmer's market. I've been - it sure is a sight to behold. But why drive 75 minutes when you have this gem in Milwaukee's back yard?",
                "author": "Colin A."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-07-02",
                "description": "I think the best farmers market anywhere is the Dane Co market on Capitol Square in Madison. West Allis Farmers market is not quite that, but it's the biggest and one of the best in the Milwaukee area.\n\nToday, we scored strawberries, baby red potatoes, radishes, peas, lettuce and broccoli. Plus, tamales and the best hot salsa from Lopez Bakery. Prices are very reasonable and vary from vendor to vendor, so walk around to find the best offerings. If you've been here a few times, you'll no doubt have favorite purveyors already. Mine is an older man who, for a very limited time, has black raspberries. I'm not sharing who that is or when he has them 'cause I'm selfish about black raspberries. \n\nI do like that the market doesn't open until 1pm since getting up at the ass-crack of dawn is not my idea of fun on a Saturday morning. There several free parking lots close by plus plenty of street parking. You should go here, but stay off my black raspberry guy....",
                "author": "Joanna T."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-09-23",
                "description": "If you are looking for fresh vegetables, fruits, flowers and some baked goods, check out the West Allis Farmers Market.  I love coming here.  Something about just walking through the isles and checking out all of the fresh home grown produce puts you in touch with a simpler time.  I remember coming here when I was a child and mom would buy up a bunch of veggies for canning.  They have everything you can think of from potatoes to winter melon, squash to radishes, etc.  They sell beautiful flowers and even some meat.  Nice wide isles to get through with your bags of heavy produce.  Great for kids too.  There was a school field trip of little ones there and they just thought it was great and most of the vendors were happy to see them as well, to teach and show them things.\nCheck it out - great place, you will not leave empty handed.",
                "author": "Gina B."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-08-07",
                "description": "Really  - this is hands down the best farmers market in the Milwaukee Metro area - IMO.\n\nA nice shaded area, many vendors, and reasonable prices.",
                "author": "Tony K."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-10-26",
                "description": "My favorite farmers market - sad to say, I'm all about wauwatosa, but west allis definitely has a better farmer's market. It is a covered but outdoor market, usually bustling, people actually come here to buy things! Everything is very well priced, a very good seasonal selection. The market actually feels a lot bigger than it seems from the outside. Friendly vendors. When we went in the spring, there were a decent amount of vendors selling seedlings and plants, and now in the fall, everyone is selling apples, squash, root veggies, yummy! Had a brisket sandwich that was incredible! I love that there are beautiful flower arrangements for ridiculous prices. Parking is kind of a pain around this area, especially on a saturday, but just as much people are coming in to the farmers market, people are leaving so you just have to sort of hover until you see someone leaving. Also FYI it does seem like the market starts wrapping up about 1-2 hours before closing time, so get there early if you plan on going.",
                "author": "Lei L."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-08-23",
                "description": "I'm so sick of people telling me about the market in Madison.  drive there or move there, but shut up about it.  blah blah blah.  \n\nWest Allis Farmers Market is a must visit for anyone in the area, and guarantee you'll find time on a saturday afternoon to come back again...and again.\n\nI love bringing friends here for the first time.  This single establishment changes people's impression of \"Stallis\" (of which i'm a proud resident).  It is such a great experience, and I LOVE that it is in the early afternoon.  \n\nI buy a bean and jalapeño tamale each time i'm there from the tent on the corner of the street.  this year, more than in the past, there are more selections for food to purchase and eat while you are walking around the vendors, which i really appreciate.  The selection is the best in milwaukee.  \n\nI'm a member of the JenEhr CSA which has a stand there and delivers CSA boxes there.  They are great!",
                "author": "Steve W."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-08-05",
                "description": "I really liked this farmer's market! There are a lot of vendors to choose from which made it easy to compare pricing. The vendor owners were very knowledgeable and had passion for their work. I bought fresh vegetables, fruit, and eggs. All were great. I didn't try the hot foods you could buy for lunch. My mistake I had breakfast for I went. The hot sandwiches and pastries looked amazing. I'm definitely going to make another trip. I'm in love with the farmer's market in Madison but that's a far drive to make every Saturday. The West Allis Farmer's Market is the next best thing.",
                "author": "Lisa E."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-09-02",
                "description": "An ancient farmers market with over 100 years of supplying restaurants, bars and civilians.  A hidden gem.",
                "author": "Otto V."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2015-08-05",
                "description": "My favorite farmers market because there's a ton of produce and lots of vendors. There is a lot of neighborhood parking as well.",
                "author": "Amanda Y."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-10-20",
                "description": "There isn't much else I can say to add to what reviewers before me have posted.  Great vendors, great produce, great prices.  It's nice to see such a variety that changes with the seasons.  Easy to navigate, with lots of parking options in the area. Friendly vendors and cheery shoppers.  And, as a non-morning person, it's awesome that they don't open until 1pm on Saturday so I can sleep in and still get fresh treats.",
                "author": "Kelsey S."
            },
            {
                "reviewRating": {
                    "ratingValue": 3
                },
                "datePublished": "2013-08-11",
                "description": "Went on a Tuesday and it was in the 90s. This probably affected the quantity of vendors.. the quality of my produce was definitely lacking. My mistake for not being more diligent checking to make sure my carrots were crisp and not flaccid I guess...",
                "author": "Meli S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-07-17",
                "description": "Top reason I love this market: it opens late and I'm lazy.  Also, it's pretty cheap and the people are nice.  It'd be nice to maybe have a little live music or something, and maybe more meats.  And parking sucks.  But it's pretty easy to maneuver around, the people are always friendly, and you really can't get much fresher.",
                "author": "Erin J."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2011-04-13",
                "description": "Here's a little known secret about me. I am a connoisseur of Farmer's Markets. \n\nThe West Allis Farmer's market is my \"go to\" Farmer's Market for a number of reasons.\n\n1) It's within walking distance of my house. That reason may be cheating but convenience is next to godliness in my book.\n2) I've been going there since I was a little girl and have wonderful memories associated with it. \n3) West Allis recently renovated and updated it. It still retains the old fashioned charm it always did but with a nice facelift that also expanded the vendor space.\n4) Parking is a cinch if you aren't blessed by proximity like I am. There are two parking lots as well as plenty of street parking.\n5) Lots of variety.\n\nEvery Saturday from May to I believe October is GAME ON! They are also open Wednesday afternoons. I only go on Saturdays. \n\nDig if you will a picture (yes that is a gratuitous Prince reference):\n\nSaturday afternoon about 12:30ish, I arrive, bags in hand to scope out all the market has to pillage. I am at the top of my game here, a true Farmer's Market Pirate, swashbuckling my way down the aisles.  The goods line the tables like gems;  emerald jalapenos, ruby red radishes, amethyst beets and padaparasha tomatoes begging to be taken home. You aren't allowed to buy ANYTHING until 1pm. But here's a savvy tip from a grizzled old Farmer's Market Salt. You can pick out what you want ahead of time and ask them to set it aside for you. Ahhhh, tricky tricky. As the 1pm hour approaches the tension in the air is palpable, the silence settles like the calm before a tornado as the early birds wait to grasp their purchases in their prehensile clutches. Then at 1 o'clock on the dot the buzzer rings out and the market is alit in energy akin to a beehive. You can FEEL the energy. Money and produce exchange hands rapidly, patron hasten from vendor to vendor claiming the spoils of their early reconnaissance mission. Hauling your treasure by the bagful and gleefully discovering even more treasure is all part of the experience. You will find the aforementioned vegetables as well as, flowers, fruits, honey, plants, fresh chicken and eggs, herbs, grass fed beef, Artisian pasta, Amish Bakery and more. \n\nSo you landlubbers, grab a few bags and head over to the West Allis Farmer's Market. Yo ho ho a Farmer's Market Pirate Life for me!",
                "author": "Jessica O."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2013-08-19",
                "description": "Have been going on Saturdays for years, always great yet very crowded.  Went last Thursday with some coworkers.  Only about half the vendor areas were filled yet I found everything I was looking for and more.  Freshest produce at great prices and beautiful fragrant flowers. Love this market!",
                "author": "Robin M."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2010-11-14",
                "description": "This is the biggest and best market I've been to in the Milw. area.  Tons of produce, local meats, cheeses, eggs, etc. All you could ask for",
                "author": "Elizabeth R."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2011-06-02",
                "description": "If I was going to write a review about the first time I went, I would not have very much positive to say.  However, while there, after walking a few aisles, I quickly found out that I had gone during the Flea Market and not the Farmer's Market. Have not made that mistake again!!\nThis is my second favorite Farmer's Market next to the South Shore Market. Simply because South Shore has a crepe stand.  \nThere is always a great selection of produce, flowers, and even Tamales from Lopez Bakery!  (only place I have found bean and jalepeno tamales)  \nThe aisles can get pretty crowded, but it is totally worth it!!",
                "author": "H C."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2013-10-23",
                "description": "A wonderful, warm, friendly gathering of farmers and their products!   These hard-working folks offer their growings for reasonable prices to us 3 times weekly in the growing months.  They grow tasty / FRESH produce from the Midwest \"menu\" and show care in bringing them to market!  The marketplace itself is a well-kept facility that is welcoming and warm with \"good karma\"......",
                "author": "James S."
            },
            {
                "reviewRating": {
                    "ratingValue": 4
                },
                "datePublished": "2012-08-18",
                "description": "The concept and the offerings are just great. All it needs is a fish market and it will give rue Clair a run for it. Of course, it competes with the grocery stones and some of them have great produce. But there is something nice about giving the farmers who work so hard a direct contact with the public. Besides, I learn a lot about gardening from talking to these guys. I'm a fan and a regular.",
                "author": "David Z."
            }
        ],
        [
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2006-05-28",
                "description": "As soon as April hits I start getting excited about Farmer's Markets. West Allis is the closest one to my house and conveniently one of the best if not the largest in the Milwaukee area. At some point in the last century, West Allis built a special covered area in the middle of the neighborhood adjacent to the National/Greenfield Avenue Six Points area. Not only does this special Farmer's Market area provide a cool, comfortable area in which to wander, smell and shop, but also proves how serious West Allis is about it's Farmer's Market. The Market is being remodeled this year, with new landscaping, roofs and a improved facilities, so before it reopens in July, the farmers are setting up stands across the street to sell the usual spring fare of hanging plants, tomato and pepper starter plants and flowering bed plants. This particular market is open Tuesdays and Saturdays from 1:00 pm until approximately 5:00 pm. To enjoy the most lively atmosphere of the market, arrive just before 1:00 pm on a Saturday, and watch how people already hold bags of fresh tomatoes and peppers, waiting until the bell to ring so they can pay. I'm not sure why there is a very strict 1:00 pm start for sales, but it's interesting how there is a sort of rush to arrive early and get the bery best products available. If you own a home and need bedding plants or want to grow some herbs for the kitchen, get to West Allis in May for an impressive variety of gorgeous plants. Later in the summer, they have all the fruits and veggies in season in Wiscsonsin as well as a few stands that sell local honey, herbs and flowering plants throughout summer. The vendors are exptremely helpful and knowledgeable and you feel confident you are getting the freshest local produce, not the often tasteless imported or transported items you buy at Pick 'N Save.",
                "author": "Laura F."
            },
            {
                "reviewRating": {
                    "ratingValue": 5
                },
                "datePublished": "2006-08-26",
                "description": "I wish I'd seen Laura's really helpful review BEFORE I went to this today... somehow both my sister-in-law and I figured all farmers' markets begin early in the morning and are done by noon... Since I'm a night owl... it's nice to know there is an alternative. The one draw-back for this particular market is that parking is dicey, because (at least on a Saturday afternoon) EVERYONE is there. Even so, we found a spot after only 5 minutes of driving around, and thoroughly enjoyed the super-fresh scents of produce harvested locally this morning. And went nutty buying fresh produce. As far as I can see, this is now going to become a weekly event, since, despite the afternoon's rains, we stayed dry and came home with dinner ideas for the next few days... including brussels sprouts sold on the stalk!",
                "author": "Tonya C."
            }
        ]
    ],
    "priceRange": "$",
    "name": "West Allis Farmers Market",
    "address": {
        "addressLocality": "Milwaukee",
        "addressRegion": "WI",
        "streetAddress": "6501 W National Ave",
        "postalCode": "53214",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/9-O0SnET3_XH78BftYvG8A/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+14143028600"
}