{
    "aggregateRating": {
        "reviewCount": 4,
        "@type": "AggregateRating",
        "ratingValue": 4.0
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-06-17",
            "description": "Where can you get an official French \"pain au chocolat\" (French chocolate-filled croissant type pastry) from an official French nun?  The Winfield Farmer's market, yeah, that's where!\n\nI went here on a whim one Wednesday morning (it's open from 7am to 1pm on Wed. from June to October), because I'd seen the sign on the road every day as I drove to work.  \n\nThey have sustainable, pastured meat and eggs and dairy.  They have sustainable veggies.  They have random other stuff that doesn't really fit in anywhere, but , hey, it's fun to look at.\n\nReally, it was my happy little transplanted foreigner's dream.  Not only did I get to speak French to a nun while asking for a pastry that was much more delicious than its preformed Panera Bread red-headed step-child relative, but I also walked out with pork heart and giant purple aspargus.  \n\nWait... you ask yourself.... why is this woman taking home a pig heart?  Does she participate in some sort of ritualistic, Indiana Jones-style sacrifice?  Worry not, my friend.  Some people actually eat this stuff.  Cooked, diced, and sauteed.  Not like, raw and whole or something.\n\nBack to the Farmer's Market.  I liked it except for the fact that it was fairly small.  I suppose that it IS Winfield, and farmers in the direct area are few and far between, but I was hoping for a little more.  \n\nAlso, the sustainable and pastured meat was delivered through a meat broker (sounds shady, eh?  It's really not).  Basically, they get meat, eggs, etc. from various farms within a 200 mile radius or something.  They sell it at farmers markets.  So, it's more expensive than if the farmers themselves were to sell it.  My pig heart, for example was $6.  Pig hearts are fairly small.  If you are taking notes on this for any reason other than culinary ones, please stop, as you are making me nervous.\n\nI'll go back several times this summer, I'm sure.  I need to get more chocolate pastries....",
            "author": "Mo D."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-08-19",
            "description": "This is where I go since I've sworn off the Wheaton French Market. There's actually more vegetables here than 'stuff' and pastries, and it's not crowded to the point of being a hazard to walk through it. There's no organic farms though, unlike the Wheaton market which had one organic farmer, so I have to cut a star for that. \nBut, if you want fresh local produce without the hyper-consumerism and crowds of the Wheaton market, this is the place to go!",
            "author": "Me Y."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2014-08-12",
            "description": "A great little market at the corner of County Farm Road and Geneva in Winflield. Several produce vendors fresh from Michigan, a fresh donut maker, kettle popcorn vendor, That Pickle Guy, and Twin Farms that has the best corn around. A few jewelry vendors and other miscellaneous items--but this is a farmers market! Ample parking and lower prices than most markets around! Wednesday only.",
            "author": "Ron P."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2010-08-11",
            "description": "What a great variety of fruits, veggies and other home-made yumminess. This is right by my house and I try to go every week! People are super friendly and helpful!",
            "author": "Sara B."
        }
    ],
    "priceRange": "$$",
    "name": "WInfield Farmer’s Market",
    "address": {
        "addressLocality": "Winfield",
        "addressRegion": "IL",
        "streetAddress": "County Farm Rd Geneva Rd",
        "postalCode": "60190",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media2.fl.yelpcdn.com/bphoto/WSg7Ctu_He89sCB8vKIK_A/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": ""
}