{
    "aggregateRating": {
        "reviewCount": 16,
        "@type": "AggregateRating",
        "ratingValue": 3.5
    },
    "review": [
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2018-10-13",
            "description": "THIS BUSINESS HAS CLOSED, I just called them and there is a recording saying they have completely closed down and retired",
            "author": "Kelly T."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2016-10-08",
            "description": "Met up with friends today to pick apples at Ziegler's! It was as reviews stated a \"no frills\" apple orchard.\" Free parking and admission and apple picking. When we entered we were welcomed and instructed on how to determine if the apples are ready for picking and notified of the 3 pound minimum per person. This was not a problem as we walked through the wide assortment of apples within the orchard! The apple varieties were not well labeled, but we were encouraged to try the apples and determine what we liked! Overall we had a good time picking apples  and snapping a few pics; the staff was also very friendly and appreciative!",
            "author": "Heather W."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2016-11-03",
            "description": "We went on the absolute last day that the orchard was open for the season and had a picking spree!! Banana apples were the favorite of our group, all the varieties were abundant and so perfect.  We ended up picking 26 pounds of colorful and delicious produce and made apple pies as well as crisps and tarts.  We still are enjoying apples 2 weeks later.  This place was serene and a newly found favorite place for my family.",
            "author": "Vishal B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-10-01",
            "description": "One of my fondest memories growing up in the New England area is going apple picking with my family. However, I was definitely disappointed after my friends and I made a trip out to Ziegler's last Saturday. \n\nThe orchard looks fairly small on the outside, but  hidden inside are a lot more trees. However, there weren't a lot of varieties of apples. We saw mostly Jonathans. In addition, the trees weren't marked well, so it was hard to tell what types of apples since none of us knew much about apples.\n\nThere's no admission fee, and you can try every type of apple in the orchard, however the minimum per person is 3 lbs at $1.50 per pound. The staff gives you a plastic bag when you walk in to pick the apples. If you want the traditional apple paper bags, they cost extra.",
            "author": "Christine H."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2017-06-24",
            "description": "I've known the Zinglers through my Childhood life.  This Apple Orchard brings me memories.  If you are looking for a decent apple orchard with decent prices come check this place out.",
            "author": "Samuel K."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-21",
            "description": "No goats in a habitat, \"hay\" rides on farm machinery, restaurant, \"homemade\" in China pot holders, or playland. There are trees, and on the trees are apples. They tell you how to pick, show you a map, give you a plastic bag, and away you go. \n\nThe price is now $1.50 per pound, 3 pound minimum, which is $4.50 before taxes (it is Illinois, after all). If you have older children, you can have your fall and winter apples in a flash! Tasting each tree before picking is encouraged. \n\nI could have done without some of the mud, and parking was different, but I didn't have to spend the day and buy a buffet lunch I couldn't eat.\n\nAll in all, a good place to pick apples and get back on the road!",
            "author": "Lori T."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2015-10-11",
            "description": "We went there yesterday (Oct 10) only to find them closing because they were out of apples. I had call in the morning and there was no mention that there'd be closing soon. \n\nWe lingered outside the parking lot while checking on the phone where to go next and the lady from Ziegler was very unfriendly to us, she even sent somebody to close the gate as to make sure we wouldn't go in. \n\nWe ended up going to Didier farms and having a good time there with the kids. I won't be coming back to Ziegler next year.",
            "author": "S A."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-09-27",
            "description": "We were able to pick apples, there was still a reasonable amount on the trees, and we came away with a decent haul. It would seem not much has changed since Julie H.'s review in 2007: there are still plenty of Golden Delicious trees that seem to outnumber all other varieties. \n\nFor what it is, Ziegler's is fine. I witnessed the owner (the smiling lady in the picture) being verbally abusive to the parking attendant, though. If that's indicative of how she treats her employees, then that makes me not want to come back.",
            "author": "David S."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-21",
            "description": "Apple picking at it's best!  Other places force you to spend tons for small bags of apples and a maze and some other stuff that I can do without.  I love the apple picking experience and this is what you get. Family owned and soooo many apples to choose from, and it's quiet and friendly and parking is easy.   I found my apple picking place for years to come!  If you want to pick apples, and avoid the crowds of people and you don't want to pay a lot for all the random frills this is your place to pick your apples!",
            "author": "Bibi L."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2014-09-28",
            "description": "I understand that we had a tough winter, but all they had was Golden Delicious and Jonathan and you are forced to pick 3 pounds of apples per person. I guess that I expected an APPLE ORCHARD to have at least as many varieties of apples as a supermarket. On our way to Woodstock to get some real apples....",
            "author": "Anthony A."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2014-09-03",
            "description": "I have been coming to this apple orchard ever since I was little.  If you want basic apple picking with out all of the frills \"ahem, Apple Holler in Wisconsin\" then you go here. It is quiet, peaceful, and they have TONS of trees and varieties to pick from. A family run business, you definitely feel like you are supporting local farmers. Also, you can sign up for their postcards which they mail out in August with all of their picking dates, times, and varieties that are available.",
            "author": "Julia M."
        },
        {
            "reviewRating": {
                "ratingValue": 4
            },
            "datePublished": "2009-10-04",
            "description": "We went here today -- $1 to pick apple and all-you-can-eat when in the orchard. The trees were packed with apples, and we were more than happy with the selection and quality of the apples. It's was a nice, relaxing Sunday activity. \n\nThe gift store leaves a little to be desired, but overall, it's a lovely orchard.",
            "author": "Robert B."
        },
        {
            "reviewRating": {
                "ratingValue": 3
            },
            "datePublished": "2014-09-28",
            "description": "This place is clean and easy to venture through, but the selection is slim. $1.50 per lb is a good deal, and 3lb minimum, but there arent any apples left! Bunch of green apples, but hardly any reds.",
            "author": "E S."
        },
        {
            "reviewRating": {
                "ratingValue": 2
            },
            "datePublished": "2007-10-02",
            "description": "Considering that apple picking is one of my favorite fall pastimes, I was seriously underwhelmed by my experience at Ziegler's last weekend.  I was most disappointed by the overall selection: for late September, there were hardly any apples left.  The ones that did remain were rotten, wormy, and small - golf ball sized!  I probably shouldn't blame the Ziegler's because that has a lot to do with the weather over the last few weeks, but it was still a major let-down.  \n\nHow about variety?  Well, if you like Golden Delicious, you're in luck.  Do you like Golden Delicious?  Because they've got plenty.  Have I mentioned Golden Delicious yet?!?!  Ziegler's = Golden Delicious.  It was actually a challenge to find a single red apple.  The orchard is very small, only a couple of acres at most, so it didn't take much time to navigate the whole place.  You don't even need a tractor to get around because the place is so tiny.  And while I did see signs for the tractor boarding, I never saw an actual tractor.  \n\nThe country store is the only redeeming quality, unfortunately the people that work there are so grouchy!  Seriously, a grumpus behind each register.  Rather the store was redeeming because the cider donuts are awesome.  And there's a nice selection of jams/preserves, along with pumpkins, squash, and gourds.  \n\nWhile I did come home with 10 pounds of apples (a pie is on the way), I probably won't go back to Ziegler's.",
            "author": "Julie H."
        },
        {
            "reviewRating": {
                "ratingValue": 1
            },
            "datePublished": "2008-10-03",
            "description": "I visited on Sunday 9-28-08. My fiance and I were welcomed in (paying our little $1 entry fee) and told there was a lot already picked, but that there were plenty of apples to find. This was a lie. There were no apples on the trees at all except for bug infested rotten ones. We left behind an empty handed family only to see more and more groups being let in under the same false pretenses. It was sad to drive all the way to the suburbs only to be so disappointed. I would have been likely to give them another try next year had they been honest when we arrived.",
            "author": "Mrs. T."
        },
        {
            "reviewRating": {
                "ratingValue": 5
            },
            "datePublished": "2009-10-26",
            "description": "I went to the orchard this weekend and thought it was just great! It's late October and there were plenty of apples left on the trees. There is a $1 entry fee and they give you a bag and a map of the layout so you can find your way around the orchard.  Choose from Macintosh, Red Delicious, Golden Delicious, Fuji and a few more. The staff was very friendly as well. Bring cash as they do not accept credit cards, I was able to buy 13 lbs of apples for about $17.",
            "author": "Anton S."
        }
    ],
    "priceRange": "$",
    "name": "Ziegler’s Apple Orchard",
    "address": {
        "addressLocality": "Grayslake",
        "addressRegion": "IL",
        "streetAddress": "32363 N Bacon Rd",
        "postalCode": "60030",
        "addressCountry": "US"
    },
    "@context": "http://schema.org/",
    "image": "https://s3-media3.fl.yelpcdn.com/bphoto/zl8ZV4Bh8WwTNkJ-xAAw9w/ls.jpg",
    "@type": "LocalBusiness",
    "telephone": "+18475461228"
}